{
    "Teens who are “addicted” to TikTok experience worse depression and anxiety, and in turn, reduced working memory capacity\n": [
        {
            "id": "hu5nce4",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.4164013",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hu5w0fr",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu6vi41",
            "score": -2,
            "text": "The whistleblowers have literally said china created tiktok to purposely lower the attention span of people in the western world who would download it and use it without any limitation.\n\nit is made to be incredibility addictive and uses properties that a slot machine would use (like giving you 'losses' ... bad videos that you don't like on purpose to make the ones you DO like hit harder).\n\nIn china tiktok shows their children state propaganda and people acting normally or even teaching things. In the US, tiktok shows morons doing pranks or acting like idiots, or hedonistic quick hits.\n\nAll of it equals chinese world dominance in 20 years.",
            "title_similarity": "0.5734749",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hu61flf",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu6ishv",
            "score": 1,
            "text": "Teens who are addicted to TikTok are less intellectually functional in general",
            "title_similarity": "0.83556294",
            "sentiment_compound": 0.2748
        },
        {
            "id": "hu6c0zz",
            "score": 0,
            "text": "wouldn't this mean that trump was right when he talked about tiktok?? Obviously it wasn't just him, but The Guardian and others aswell. I can't find the source of trump speaking on it directly anymore, the google results are insanely biased with no results of what im trying to find, I just vaguely remember him speaking on it.  BUT! I did find some results of some particular interest speaking around the topic.\n\n&#x200B;\n\n[https://www.vox.com/open-sourced/2019/12/16/21013048/tiktok-china-national-security-investigation](https://www.vox.com/open-sourced/2019/12/16/21013048/tiktok-china-national-security-investigation)  \n\n\n[https://www.theguardian.com/technology/2019/sep/25/revealed-how-tiktok-censors-videos-that-do-not-please-beijing](https://www.theguardian.com/technology/2019/sep/25/revealed-how-tiktok-censors-videos-that-do-not-please-beijing)",
            "title_similarity": "0.4385605",
            "sentiment_compound": -0.2737
        },
        {
            "id": "hu5q1c1",
            "score": 16,
            "text": "this is the same thing as the teen magazines from the 80's and 90's. all of those were fake as well with photo editing and whatever. TikTok and IG is nothing different. They all present a fake reality posing as some ideal and kids get depressed they can't meet it",
            "title_similarity": "0.6731756",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hu5ryyq",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu6iize",
            "score": 0,
            "text": "This just means advertising has a strong grip on teens.",
            "title_similarity": "0.4371274",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hu6o960",
            "score": 0,
            "text": "The tech bros made hella money with that app, congrats",
            "title_similarity": "0.3574615",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hu6ovap",
            "score": 3,
            "text": "they are much better off than teens addicted to reddit trust me",
            "title_similarity": "0.6016196",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hu6o7r9",
            "score": -2,
            "text": "Internet Regulation Now!\n\nHow does no one see how harmful this garbage is?",
            "title_similarity": "0.3664447",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hu6q1os",
            "score": 2,
            "text": "I'm not a teen but reddit is definitely destroying my attention span.",
            "title_similarity": "0.6091423",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hu6r10p",
            "score": 2,
            "text": "We really needed a science article to tell us this?",
            "title_similarity": "0.26263285",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu71gxg",
            "score": 1,
            "text": "I attended a music, science, and technology talk at NYAS a decade ago in NYC which mentioned that in an MRI scanner PET, listening to music with gaps in it, your brain actively filled in the gaps…\n\nSomehow they found that neurons became “open” to reinforcement if you finished listening or susceptible to losing connectivity if you didn’t finish listening. The takeaway message was that we should finish thinking through the whole song, thought, etc and not just a snippet of it…\n\nI’ve since seen it in my dad and girlfriend where they watch news on TV and pay partial attention and seem to lose memory of events…\n\nFinish studying something! Be mindful… this frenetic 10 second stuff is bad. \n\nStop jumping around Reddit too.  I’ve felt scatterbrained after an hour session bouncing around Reddit… read an article in more than a minute… spend some tome on it and think about it. \n\nI love that Reddit has way higher quality commentary and threads than Facebook.",
            "title_similarity": "0.4809257",
            "sentiment_compound": -0.636
        },
        {
            "id": "hu7aluq",
            "score": 1,
            "text": "It’s their individual choice to use social media so...They can get off social media anytime if they so choose. No one is forcing a gun to these teens heads. You just have to have priorities and self control. Parents should be teaching this. Social media is unhealthy",
            "title_similarity": "0.35849172",
            "sentiment_compound": -0.8062
        },
        {
            "id": "hu6cn1t",
            "score": 5,
            "text": "Or,\n\nKids with ADHD enjoy TikTok.",
            "title_similarity": "0.54551196",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hu66r61",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu6jzak",
            "score": 4,
            "text": "I wonder if it's the same for people addicted to reddit",
            "title_similarity": "0.50846136",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu5ol2z",
            "score": 61,
            "text": "Depression has a significant impact on your memory. Just as a general effect of the illness.\n\nProbably a bit quick to blame it on the social network as trash as tiktok is.\n\nIt's more accurate to blame tiktok for the depression and then blame the depression for the memory loss.",
            "title_similarity": "0.75342166",
            "sentiment_compound": -0.9673
        },
        {
            "id": "hu69eon",
            "score": 8,
            "text": "Ahhh. Good thing I already had that from smoking copious amounts of marijuana.",
            "title_similarity": "0.33418697",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hu6v3cr",
            "score": 0,
            "text": "So you're telling me hours of 7 second clips of people enjoying their lives would cause me to self harm internally and lose the ability to focus?\n\nThis is revolutionary.",
            "title_similarity": "0.6108525",
            "sentiment_compound": -0.128
        },
        {
            "id": "hu7f2tk",
            "score": 0,
            "text": "Why only Tiktok not SNS in general?",
            "title_similarity": "0.20530543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7piif",
            "score": 0,
            "text": "Im this close to cutting off all social media, i dont have tim tok but theres tik tok on youtube and fb and im tired of the normalized toxicity. Normalizing sidechicks or side dudes and sneaky links. Tired of only seeing the best side of people. Tired of fake ass content. If i didn't have distant family id like to keep in touch with id  delete it all.",
            "title_similarity": "0.6171006",
            "sentiment_compound": -0.9325
        },
        {
            "id": "hu8s52u",
            "score": 0,
            "text": "Wow almost like this stuff should regulated",
            "title_similarity": "0.23059723",
            "sentiment_compound": 0.719
        },
        {
            "id": "hu9hj96",
            "score": 0,
            "text": "Used to happen on Facebook but that was taken over by right wing nonsense so they left",
            "title_similarity": "0.56102586",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hu63eoe",
            "score": 8,
            "text": "Please do a similar study on Reddit",
            "title_similarity": "0.17116407",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hu5qedo",
            "score": 15,
            "text": "It's not surprising, if you are addicted to something that is going to impact you negatively no matter what it is.",
            "title_similarity": "0.52413094",
            "sentiment_compound": -0.2235
        },
        {
            "id": "hu5yjyx",
            "score": 1,
            "text": "Wasn’t there another study like this but tiktok was replaced with celebrities",
            "title_similarity": "0.30511257",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hu6mfvv",
            "score": 1,
            "text": "I read about another study showing that cartoons where every scene is shown only for a few seconds (fast-paced..) is bad for toddler's ability to learn. Or something down those lines.. So only Postman Pat and similarly slow cartoon for my youngest children!",
            "title_similarity": "0.57971454",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hu6ryx0",
            "score": 1,
            "text": "This is what happens if someone is addicted to anything",
            "title_similarity": "0.45780852",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6yd29",
            "score": -1,
            "text": "They want teens addicted to cigarettes and alcohol,  get off the tiktok",
            "title_similarity": "0.60447574",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hu7pvyr",
            "score": 1,
            "text": "CCPs tactics of dumbing down the west seems to be working.",
            "title_similarity": "0.3823284",
            "sentiment_compound": -0.128
        },
        {
            "id": "hu7q69q",
            "score": 1,
            "text": "Why are they trying to insinuate tiktok causes depression. Maybe tiktok and depression are different symptoms for the same condition- loneliness.",
            "title_similarity": "0.69700074",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hu7ruk8",
            "score": 1,
            "text": "Media consumption can be an abuse disorder like any other. This doesn't mean \"TikTok bad\" like the probably reddit addicted folk IIT love to assert. Moderating digital media is a hygeine.",
            "title_similarity": "0.5314207",
            "sentiment_compound": 0.631
        },
        {
            "id": "hu7uas1",
            "score": 1,
            "text": "So watching short, fake clips for hours on end is killing their brain cells and declining their mental health? Got it.",
            "title_similarity": "0.7494632",
            "sentiment_compound": -0.83
        },
        {
            "id": "hu82qmw",
            "score": 1,
            "text": "She pisses when she farts",
            "title_similarity": "0.5801003",
            "sentiment_compound": -0.34
        },
        {
            "id": "hu8yu25",
            "score": 1,
            "text": "Isn’t TikTok just Chinese spyware?",
            "title_similarity": "0.38372904",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu61yj3",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu5vgs7",
            "score": 39,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu60ngl",
            "score": -2,
            "text": "I mean I don't wanna say I told u so but f. I told u so.\nPrinciple f-ing myself reddit is the same.",
            "title_similarity": "0.23566246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu68f22",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu6nrko",
            "score": 2,
            "text": "I know they’re focusing on TikTok but in general the addiction to social media is overall extremely detrimental to mental health.  For everyone, kids will have it worse bc their brains are still developing and learning ‘the ways of the world.’  Not to mention they don’t know any better and parents do less and less to help them.  Just an opinion here.  Makes me sad",
            "title_similarity": "0.8017274",
            "sentiment_compound": -0.3221
        },
        {
            "id": "hu6rox8",
            "score": -2,
            "text": "Now this is science I come to reddit for 🙏 who cares about biology when you have studies about mf tik tok 😏",
            "title_similarity": "0.27086776",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hu70s7t",
            "score": 2,
            "text": "We should add a correlation does not prove causation sticky to the top of all comment threads since that’s what’s most of them are on this subreddit.",
            "title_similarity": "0.32734615",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hu71gny",
            "score": 2,
            "text": "Why is addicted in air quotes? It's literally desingned to be addictive. (not just tiktok, Instagram and Co aswell)",
            "title_similarity": "0.64461213",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu77lo3",
            "score": 19,
            "text": "Hot take: \n\nUnder 18 should be banned from being on social media. It is far too toxic and dangerous on all SM platforms to be underage on there. For society as a whole and each individual.\n\nWhatever is required to make that a reality, be it law(s), requiring proof of ID and age to sign up, etc. Then so be it. Obv it won't be 100% effective at preventing minors from getting on but it would make a HUGE difference. \n\nIf lawmakers really feel the need to \"protect the children!\" From nipples, swearing and other things of that nature showing up on TV and YouTube then they can care enough to protect minors from toxic and dangerous platforms that do little good and lots of harm.",
            "title_similarity": "0.5595876",
            "sentiment_compound": 0.6783
        },
        {
            "id": "hu5xa79",
            "score": -11,
            "text": "Screen addiction is such a joke.",
            "title_similarity": "0.4899813",
            "sentiment_compound": 0.296
        },
        {
            "id": "hu6aoe0",
            "score": 30,
            "text": "Could it be that teens with ADHD are more addicted to TikTok’s quick flashy medium? People with ADHD have higher rates of depression and anxiety, and lower working memory.",
            "title_similarity": "0.8365156",
            "sentiment_compound": -0.765
        },
        {
            "id": "hu6458e",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu6cesi",
            "score": -3,
            "text": "Isn’t this the same with any social media platform? YouTube, Reddit, Facebook?",
            "title_similarity": "0.07574084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6fo5o",
            "score": -3,
            "text": "But Reddit is cool right?",
            "title_similarity": "0.17749065",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hu6l1f8",
            "score": -3,
            "text": "Could be said for every platform",
            "title_similarity": "0.018883936",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6l4hp",
            "score": -3,
            "text": "We’re all fooling ourselves if we don’t believe the infinite Reddit scroll is any less harmful and addictive.",
            "title_similarity": "0.6078061",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hu6lbjs",
            "score": -4,
            "text": "Like any platform there is some gold on Tiktok.  Historically teens just don’t have very good taste unfortunately.",
            "title_similarity": "0.61498994",
            "sentiment_compound": 0.4641
        },
        {
            "id": "hu6mr95",
            "score": -3,
            "text": "I wonder what would be produced if the same study parameters were applied to 50+ year old facebook users.",
            "title_similarity": "0.37020162",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6navl",
            "score": 2,
            "text": "I got two younger coworkers, and they are tired every day at work. Every single day, is a story about how tired they are. I finally got one to be honest. He said he lays down in bed, but stays on his phone for hours watching tik tok. I would hate to work every day feeling exhausted and tired, definitely some kind of addiction.",
            "title_similarity": "0.58465916",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hu6qx74",
            "score": -3,
            "text": "Am pretty sure this applies to all social media not just TikTok",
            "title_similarity": "0.059667557",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hu7r13r",
            "score": 3,
            "text": "I mean, this is OP's 9th post on Reddit in the last 24 hours...",
            "title_similarity": "0.23397091",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7wpnk",
            "score": 4,
            "text": "\"Anxiety is the dizziness of freedom\" - Søren Kierkegaard\n\nFew attempt to understand their dizziness. And so they try and escape from it - and this leads to the issue - a kind of cognitive dissonance - not the anxiety itself.",
            "title_similarity": "0.6212185",
            "sentiment_compound": 0.6925
        },
        {
            "id": "hu66xst",
            "score": 13,
            "text": "Not only is their algorithm advanced enough to show depressed people content from more depressed people, it also sends people who are or are becoming prone to obsessing over other people's success down that path of self loathing by showing them content they'll keep watching; videos from more successful/beautiful people they want to be.\n\nThere's also a big cyber bullying problem on TikTok that is possibly worse, but less known than the issues on any other platforms in the past. Anyone who comments on videos they hate, or watches videos they hate all the way through, are going to be shown more content that they hate which leads to more toxic commenting. The victims of this effect end up having their videos shown only to haters instead of people who enjoy their content, while users who are less toxic and don't spend all their time watching and commenting on videos they dislike are never shown the same videos as the toxic users, so both groups are mostly unaware of each other's existences on the platform.",
            "title_similarity": "0.73714674",
            "sentiment_compound": -0.9867
        },
        {
            "id": "hu5v5bi",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu5qsg9",
            "score": 372,
            "text": "[deleted]",
            "title_similarity": "0.33106214"
        },
        {
            "id": "hu6hkhd",
            "score": 20,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu5tiog",
            "score": 67,
            "text": "Are depressed kids first then tik-tok or did tik-tok come then the kids were struck with depression?\nIts human nature to mix up causation with correlation. I remember when I was growing up there was this constant cruisade to prove that heavy metal music was leading to depression and suicide in kids when in the end the music was actually helping kids with those problems in the first place.",
            "title_similarity": "0.7695136",
            "sentiment_compound": -0.9517
        },
        {
            "id": "hu6m5mk",
            "score": 23,
            "text": "I am truly concerned for young children with parents dumb enough to hand them a phone. \n\nMy daughter has told us her friends do not have the attention span to even watch a movie. They can't sit long enough for something to become interesting. She also gets made fun of for *reading books*. \n\nI'm curious to see where all this goes one day.",
            "title_similarity": "0.6045259",
            "sentiment_compound": 0.9217
        },
        {
            "id": "hu6j8p7",
            "score": 9,
            "text": "The same could be said for reddit or any other social media someone spends too much time on.",
            "title_similarity": "0.3463684",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu5r0v1",
            "score": 115,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu5z5pk",
            "score": 31,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu70uar",
            "score": 10,
            "text": "I teach teenagers and yeah.... It's noticeable. Tiktok and IG too, I feel like they train people's attention spans to get used to smaller and smaller bits of content.",
            "title_similarity": "0.47002557",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hu689zj",
            "score": 11,
            "text": "It’s probably not tik tok making them depressed and stupid. More likely that kids with depression and short attention spans are prone to seeking out the instant gratification of an app like tik tok.",
            "title_similarity": "0.6447004",
            "sentiment_compound": -0.743
        },
        {
            "id": "hu698cf",
            "score": 162,
            "text": "Conclusion of the actual paper for the lazy:  \n>TikTok use disorder (TTUD) is positively linked to memory loss, and it is also positively linked to depression, anxiety, and stress. Depression, anxiety, and stress are positively linked to memory loss. Furthermore, depression, anxiety, and stress have a mediating effect between TTUD and memory loss.  \n\nIn simple terms:  \n1) If you have TTUD, you are more likely than average to experience depression+anxiety+stress.  \n2) If you have depression+anxiety+stress, you are more likely than average to experience reduced working memory.  \n\nThus, the authors propose that depression+anxiety+stress are mediating the effect of TTUD on working memory (i.e. TTUD correlates with depression+anxiety+stress which in turn cause the reduction in working memory).  \n\nNote that this doesn't prove a causal relationship between the variables - the title is misleading, this paper didn't prove that \"TikTok causes depression/anxiety/stress\", it could very well be the other way around or a third way entirely.  \n\nAlso keep in mind that this study was done only on Chinese high school students so the knowledge is not necessarily transferrable to other demographics.  \n\np.s. TTUD was \"diagnosed\" via a 10 question questionnaire, an official one used for identifying Smartphone addiction (they just replaced Smartphone with TikTok).  \n\np.p.s. My personal opinion is that TikTok is harmful crap but this paper isn't proof of that - it does point to the need for more research, though.",
            "title_similarity": "0.79017806",
            "sentiment_compound": -0.9136
        },
        {
            "id": "hu5twtp",
            "score": 1771,
            "text": "Are they depressed because they're addicted to TikTok, or are they addicted to TikTok because they're depressed? Maybe both?",
            "title_similarity": "0.8338618",
            "sentiment_compound": -0.7882
        },
        {
            "id": "hu5vjvp",
            "score": 476,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu61oad",
            "score": 40,
            "text": "It'll be interesting to see what happens to the generation raised by this type of culture. What kind of mental illnesses will be prevalent?",
            "title_similarity": "0.50376916",
            "sentiment_compound": -0.128
        },
        {
            "id": "hu6imxi",
            "score": 257,
            "text": "What does it say about 35 year olds",
            "title_similarity": "0.3089174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu5yn6n",
            "score": 1071,
            "text": "Wait. Depression and anxiety reduce working memory capacity?",
            "title_similarity": "0.79722893",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hu5tj9c",
            "score": 68,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu60czk",
            "score": 6266,
            "text": "I was really hoping the article would explain why tik tok in particular but it doesn’t. I feel like we have seen this many, many times over the last few years. It’s no revelation that obsessive use of social media is not good for your mental health.",
            "title_similarity": "0.5792812",
            "sentiment_compound": -0.452
        },
        {
            "id": "hu67ray",
            "score": 2,
            "text": "It doesn't appear that the study took baseline measurements. It only compares memory and anxiety between heavy and light tiktok users, but that doesn't tell us if tiktok is responsible for worsening memory of if people with poor memory use tiktok more.",
            "title_similarity": "0.6265943",
            "sentiment_compound": -0.7615
        },
        {
            "id": "hu6b8ls",
            "score": 1,
            "text": "wasn't the same true years ago with facebook? or any social media?",
            "title_similarity": "0.15885168",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hu6d8wa",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu6ela1",
            "score": 1,
            "text": "Anxiety and depression leads to reduced memory? That explains some things",
            "title_similarity": "0.7851664",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hu6eyqj",
            "score": 1,
            "text": "Wait how much does depression affect memory?",
            "title_similarity": "0.72935516",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hu6frbq",
            "score": 1,
            "text": "Extended screen time use-especially use with social media-isn't good for anyone. \n\nI think we're about to start seeing some interesting statistical phenomenon now that the first generations brought up with smartphones from a young age are coming into adolescence.",
            "title_similarity": "0.58290935",
            "sentiment_compound": 0.0757
        },
        {
            "id": "hu6g47q",
            "score": 1,
            "text": "This is cross sectional. \n\nI really can see a depressed person having strength for nothing but tiktok",
            "title_similarity": "0.63886946",
            "sentiment_compound": -0.0129
        },
        {
            "id": "hu6h7za",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu6icbl",
            "score": 1,
            "text": "It's just like that film Johnny Mnemonic with Keanu Reeves and Henry Rollins is bitching that the computers and tech are giving people N.A.S. (Neural Attenuation Syndrome)",
            "title_similarity": "0.5367583",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hu6jgiy",
            "score": 5,
            "text": "Better title would have been maybe \"Teens who are addicted to X are also experiencing Y\" otherwise it's hella confusing and targeting",
            "title_similarity": "0.7007935",
            "sentiment_compound": 0.1796
        },
        {
            "id": "hu6jii4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu6jw3k",
            "score": 1,
            "text": "Damn I was really hoping tik tok addicts would have a decrease in depression and anxiety I really wonder why sitting in your bed for hours scrolling doesn’t fulfill you",
            "title_similarity": "0.7074297",
            "sentiment_compound": -0.2748
        },
        {
            "id": "hu6komd",
            "score": 1,
            "text": "Yes... most social media is poison, especially for young minds.  This isn't your Daddy's \"university email only\" Facebook anymore.",
            "title_similarity": "0.5821748",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hu6o5ck",
            "score": 1,
            "text": "Wonder if that applies to adults as well.",
            "title_similarity": "0.2954947",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hu6olg8",
            "score": 1,
            "text": "I used to be “addicted” to tik tok a couple months ago, and since then I’ve gone cold turkey. So much improvement in my day-to-day life. It’s such a cancerous app and it is detrimental to the human brain. We’re not built to have a constant flood of information like that",
            "title_similarity": "0.7333559",
            "sentiment_compound": 0.6983
        },
        {
            "id": "hu6opd3",
            "score": 1,
            "text": "Scrolling through TikTok for me is pimple popping videos but every now and then I’ll pass one where it’s some super insecure girl wearing nothing and it says like “if you had 24-hours with me what would you do?”\n\nIt’s like pleaseee pay attention to me. If Al you have to offer is your body that’s lame. Some people like relationships and you beauty fades.. I hope these men and women addicted to the negative attention can break free and not worry what others think of them and do what they think is fun. You don’t wanna find yourself going on 40 and not knowing who you are.",
            "title_similarity": "0.6045412",
            "sentiment_compound": 0.9753
        },
        {
            "id": "hu6oqzy",
            "score": 1,
            "text": "Interesting, all the people i know addicted to tik tok are early to mid 20’s",
            "title_similarity": "0.3681803",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hu6p29r",
            "score": 1,
            "text": "Facebook, Twitter, Snapchat, Whatsapp, & instagram would all like a word with you..",
            "title_similarity": "0.17267977",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hu6pivf",
            "score": 1,
            "text": "What is the point of Tik Tocking? What does this program provide that Vines didn't?",
            "title_similarity": "0.3579083",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6pmwj",
            "score": 1,
            "text": "Probably the same with Reddit and every other social media site.",
            "title_similarity": "0.096751556",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6pvmu",
            "score": 1,
            "text": "Shocking that China would distribute an app that would harm teens abroad.",
            "title_similarity": "0.53088963",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hu6q0d6",
            "score": 1,
            "text": "yeah that sounds about right\nsource: i use tik tok",
            "title_similarity": "0.16450351",
            "sentiment_compound": 0.296
        },
        {
            "id": "hu6qqsm",
            "score": 1,
            "text": "I remember an article several years ago saying the same thing about Facebook.\n\nBasically the gist is when you see people online, you're seeing their best, edited, filtered version of themselves and comparing it to your daily life, and you don't feel like you measure up.",
            "title_similarity": "0.4195907",
            "sentiment_compound": 0.4749
        },
        {
            "id": "hu6qyy6",
            "score": 1,
            "text": "I spent a lot of time on the app during the pandemic. It was great. Literal hours would disappear and I didn't even have to try. I stopped using anymore. I realized it'd be bad for me in the long run. My attention span isn't great already. I wouldn't say not using the app saved me or anything. But I think i'd be doing a lot worse if I had kept using it.",
            "title_similarity": "0.59102726",
            "sentiment_compound": -0.7182
        },
        {
            "id": "hu6r7ks",
            "score": 1,
            "text": "What about adult who are addicted to it? Does it not have the same affect? Asking for a….friend.",
            "title_similarity": "0.6323584",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6r87p",
            "score": 1,
            "text": "Why is it tiktok exactly? Isn’t this the same results from every other social media platform",
            "title_similarity": "0.16289237",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6rcby",
            "score": 1,
            "text": "\"Friends, please stop using Tiktok. Its not good for your mental health.\"\n\n\"But look at this 5sec dog video, 15 times in a row.\"",
            "title_similarity": "0.4998148",
            "sentiment_compound": 0.102
        },
        {
            "id": "hu6rgba",
            "score": 1,
            "text": "Probably not just teens.  I’m renting a room in a house with people who are going on 30 years old who literally watch tik toks on blast on their phone for 4-6 hours a day.  Literally can feel my brain rotting and I’m 50 feet and a wall away.",
            "title_similarity": "0.4490322",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6ryrs",
            "score": 1,
            "text": "I think you mean that when people are depressed nothing seems as interesting as it normally does so your brain simply doesn't try to remember the event or information, because it was deemed not necessary to remember. I don't think simply having depression or anxiety physically lowers your memory capacity, it just lowers the perceived importance of new information. Same thing with anxiety but in reverse, the brain is trying to figure out how to solve a perceived huge problem so any other information coming in isn't as important as the problem being solved, so your brain doesn't bother trying to remember it.",
            "title_similarity": "0.62206316",
            "sentiment_compound": -0.6385
        },
        {
            "id": "hu6st8p",
            "score": 1,
            "text": "First it was Myspace, then Facebook, then Twitter, and on and on.  Social media was a mistake.",
            "title_similarity": "0.61063904",
            "sentiment_compound": -0.34
        },
        {
            "id": "hu6swzf",
            "score": 1,
            "text": "That sucks. If I watch TikTok for longer than a minute, it bothers the hell out of me.",
            "title_similarity": "0.7003636",
            "sentiment_compound": -0.836
        },
        {
            "id": "hu6t2oy",
            "score": 1,
            "text": "I think Tiik Tok is the symptom, not the cause",
            "title_similarity": "0.29689503",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6th3y",
            "score": 1,
            "text": "Social Media keeps you from enjoying life\nIt's like a drug, Fun to use, deadly tp abuse",
            "title_similarity": "0.5380592",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hu6tl5y",
            "score": 1,
            "text": "They also experience a variety of fake disorders.",
            "title_similarity": "0.5391901",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hu6txar",
            "score": 1,
            "text": "I mean it's true, but it doesn't say anything novel. Yeah, not being able to control your social media habits is unhealthy. Cutting it out of your routine is a good step in the right direction, but it won't solve the underlying problem that caused the addiction in the first place. People need healthy social circles, friends they can trust and be trusted by. It's a harder problem to solve than just \"put the phone down\".",
            "title_similarity": "0.625312",
            "sentiment_compound": 0.8825
        },
        {
            "id": "hu6u7w4",
            "score": 1,
            "text": "hah like YouTube Shorts - teaching kids they only need to pay attention to things for short periods of time.\n\nWe need Trump to come back and shutdown TikTok - he was trying to save our future.",
            "title_similarity": "0.4347562",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hu6uei8",
            "score": 1,
            "text": "That’s… how addiction works.",
            "title_similarity": "0.35288644",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6un5a",
            "score": 1,
            "text": "Try being surrounded by dorks who use it and dont see how stupid and dangerous it is.",
            "title_similarity": "0.51318264",
            "sentiment_compound": -0.2081
        },
        {
            "id": "hu6uv5i",
            "score": 1,
            "text": "I wish this article contextualized how TikTok relates to Instagram. There has been a bunch of literature and reporting on the studied effects of Instagram on teens. My favorite coverage is from an old colleague at MIT Technology Review: https://www.technologyreview.com/2021/04/02/1021635/beauty-filters-young-girls-augmented-reality-social-media/",
            "title_similarity": "0.41830665",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hu6uz1b",
            "score": 1,
            "text": "Get off Tik Tok you damn little kids.",
            "title_similarity": "0.484663",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hu6v5yr",
            "score": 1,
            "text": "if they're smart they will avoid tiktok, otherwise it's just natural selection at work",
            "title_similarity": "0.4043004",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hu6v61d",
            "score": 1,
            "text": "Good thing I'm in my mid thirties",
            "title_similarity": "0.26485395",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hu6vox1",
            "score": 1,
            "text": "I used to watch Instagram reels... But ever since they introduced that hideous thing where if you look a reel more than 3 times it starts bouncing around forcing you to watch next one, I quit altogether. A lot of evil goes into designing modern social media and YouTube is getting there fast too.",
            "title_similarity": "0.5775684",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hu6wbek",
            "score": 1,
            "text": "Didn't they say this about facebook a year ago?",
            "title_similarity": "0.15491395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6wfh3",
            "score": 1,
            "text": "I think it is not only Tiktok it could be other social media sites too. What about Instagram ?",
            "title_similarity": "0.27134174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6wrsg",
            "score": 1,
            "text": "Commercials and ads destroy your ability to focus and pay attention, breaking up whatever flow of thought you might of had into garbage in hopes up take your money. \n\nTik Tok cranks this up and rots your brain.",
            "title_similarity": "0.6581839",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hu6x1lr",
            "score": 1,
            "text": "Oh really? I thought social media was to help people feel more connected?",
            "title_similarity": "0.30612105",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hu6x577",
            "score": 1,
            "text": "Sounds like the average reddit user.",
            "title_similarity": "0.26864153",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hu6xl67",
            "score": 1,
            "text": "I'm sure posts like\n\n\"IF YOU READ THIS AS YELLING IN YOUR HEAD THAN THAT IS 100% DEFINITIVE PROOF THAT YOU HAVE EXTREME ANXIETY\"\n\n&#x200B;\n\ndon't help.",
            "title_similarity": "0.45440304",
            "sentiment_compound": -0.2304
        },
        {
            "id": "hu6xmrk",
            "score": 1,
            "text": "I've always felt this the case and one of the reason I stay away from it. I've struggled with ADD all my life and I feel a platform like tok tok just makes it worst.",
            "title_similarity": "0.5403532",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hu6xnwp",
            "score": 1,
            "text": "It is digital opium. Surprising?",
            "title_similarity": "0.43815702",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hu6y1ib",
            "score": 1,
            "text": "As an adult with adhd, depression, and anxiety, my experience is I get addicted to tiktok as an outlet because I don't want to deal with the real world. Tiktok didn't CAUSE anything in me.",
            "title_similarity": "0.6878564",
            "sentiment_compound": -0.683
        },
        {
            "id": "hu6y20l",
            "score": 1,
            "text": "I feel like a more accurate interpretation would be that teens suffering from depression are more likely to have obsessive behavior with social media in a desperate attempt to get that serotonin kick their brain has been denying them.",
            "title_similarity": "0.7636702",
            "sentiment_compound": -0.872
        },
        {
            "id": "hu6y6z5",
            "score": 1,
            "text": "Could it be that the relationship is inverted?  That those who are depressed have a higher propensity to get addicted to TikTok as a means of escapism?  In my experience, when I've gone through periods of depression I tend to just lay around on my phone.",
            "title_similarity": "0.765546",
            "sentiment_compound": -0.8105
        },
        {
            "id": "hu6yi7b",
            "score": 1,
            "text": "Not a trumpeter by any means, but maybe her was in the right by banning in the USA?",
            "title_similarity": "0.31804883",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6ylxn",
            "score": 1,
            "text": "Well this is a depressing topic.",
            "title_similarity": "0.51568115",
            "sentiment_compound": -0.128
        },
        {
            "id": "hu6zgz0",
            "score": 1,
            "text": "not a tiktoker, but as a 30 somethingwho hasn't been in school formally and am going back to online classes, it feels like I can't focus at all(mostly falling asleep), and my brain is mush. Maybe I'm just getting old, though...",
            "title_similarity": "0.5999349",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hu6zmla",
            "score": 1,
            "text": "What about adults and Reddit?",
            "title_similarity": "0.19881383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu6znf7",
            "score": 1,
            "text": "Yes that’s the case for every similar social media service. Why is Reddit so vehemently opposed to Tik Tok? It’s no worse than Facebook or instagram.",
            "title_similarity": "0.44445294",
            "sentiment_compound": 0.6433
        },
        {
            "id": "hu6zspm",
            "score": 1,
            "text": "Good thing I'm an adult!\n\n...",
            "title_similarity": "0.20926347",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hu701lq",
            "score": 1,
            "text": "I'm mostly speaking out of my ass and throwing a broad idea out there... could it have anything to do with how quick content is generated, ie, linked to quick and constant endorphin, dopamine, and other \"brain chemical\" excretion? No idea how it would be linked to depression and/or anxiety -- it is my ass speaking :P",
            "title_similarity": "0.5600643",
            "sentiment_compound": -0.8972
        },
        {
            "id": "hu702eb",
            "score": 1,
            "text": "Yea but have y’all seen that new TikTok trend hahaha! It’s so funny check it out",
            "title_similarity": "0.2783842",
            "sentiment_compound": 0.8881
        },
        {
            "id": "hu703to",
            "score": 1,
            "text": "Parents that give their kids unfettered access to social media are honestly dumb fucks.",
            "title_similarity": "0.61026514",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hu709ou",
            "score": 1,
            "text": "Hi ya we already studied Facebook were just beating a dead horse",
            "title_similarity": "0.334851",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hu709tm",
            "score": 1,
            "text": "I have no doubt in my mind that Tik Tok (and social media at large) absolutely destroys a child's attention spam which in turn leads to depression and anxiety. Parents out there, you're the only ones that can help your child, so please be on the lookout of their social media consumption.",
            "title_similarity": "0.67746496",
            "sentiment_compound": -0.6113
        },
        {
            "id": "hu70dxx",
            "score": 1,
            "text": "Whenever i watch a video that turns out to be part 1 I get depressed",
            "title_similarity": "0.7207294",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hu712d1",
            "score": 1,
            "text": "So its like some type of the drugs?",
            "title_similarity": "0.32473606",
            "sentiment_compound": 0.4173
        },
        {
            "id": "hu7171e",
            "score": 1,
            "text": "I'm not going to say this should be common sense, but...... Anyone who is constantly comparing their lives to others, or even just constantly watching selective snippets of people's lives (only positive and interesting bits) will experience low self worth and depression. Hell even I watch the odd few people and think \"Wow they have it good\".",
            "title_similarity": "0.74241334",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hu71brn",
            "score": 1,
            "text": "But TikTok is making their screen time goals.",
            "title_similarity": "0.19618529",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu71r8h",
            "score": 1,
            "text": "Working memory capacity as in RAM or storage?",
            "title_similarity": "0.16604775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu71zdq",
            "score": 1,
            "text": "This sounds more like correlation than causation. Maybe teens with depression and anxiety are more likely to be addicted to TikTok (or any social media).",
            "title_similarity": "0.73270965",
            "sentiment_compound": -0.3832
        },
        {
            "id": "hu72d3a",
            "score": 1,
            "text": "I don’t need a science experiment to prove something so obvious",
            "title_similarity": "0.1478706",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu72egj",
            "score": 1,
            "text": "Me: But I didn’t have ADHD as a kid!\n\nThe Internet: Well you do now",
            "title_similarity": "0.298097",
            "sentiment_compound": 0.4482
        },
        {
            "id": "hu72jlv",
            "score": 1,
            "text": "Social media is the “high fructose corn syrup” of this generation",
            "title_similarity": "0.3714628",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu72yq4",
            "score": 1,
            "text": "I know plenty of adults who are addicted to it, too, along with instagram",
            "title_similarity": "0.2746788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu73b04",
            "score": 1,
            "text": "*mmmyesss..everything is going according to plan*",
            "title_similarity": "0.02834759",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu73d5i",
            "score": 1,
            "text": "Social media is the downfall of society.",
            "title_similarity": "0.61300135",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu73u4x",
            "score": 1,
            "text": "How is a TikTok addiction defined?",
            "title_similarity": "0.41831717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu73wvo",
            "score": 1,
            "text": "Tik Tok causes depression",
            "title_similarity": "0.733961",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hu745ee",
            "score": 1,
            "text": "You can probably apply this conclusion to all age groups",
            "title_similarity": "0.07011053",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu749d0",
            "score": 1,
            "text": "Misusing “addiction” on a pop-psychology site is disingenuous, and it’s bad journalism.",
            "title_similarity": "0.7009513",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hu74izu",
            "score": 1,
            "text": "Or maybe TikTok became famous during a time where mandates also hit this country; forcing kids to isolate from friends and peers. There are many studies now showing increased suicides and instances of self-harm amongst youth and young women. \n\nA lot of online media presents a swath of real life issues: student loans, violence, the chaos happening in politics, etc.\n\nAnd a blood app. is going to be a focal point? For many, it is likely an outlet or opportunity to turn off worries to enjoy some mind-numbing entertainment.",
            "title_similarity": "0.6552474",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hu74k7x",
            "score": 1,
            "text": "This just reminded me to hop on TikTok",
            "title_similarity": "0.15293062",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu74qoo",
            "score": 1,
            "text": "We’ve known this about social media for years by this point",
            "title_similarity": "0.1144393",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu74qs5",
            "score": 2,
            "text": "Feel like this is the situation for most if not all social media platforms.",
            "title_similarity": "0.28598812",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hu751l0",
            "score": 6,
            "text": "This is me (not a teen though) and I can definitely say I had all these problems to the same degree before TikTok",
            "title_similarity": "0.33472657",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu751py",
            "score": 1,
            "text": "I was gonna type something, but I forgot what I was gonna say. Made me sad and nervous though.",
            "title_similarity": "0.66577303",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hu755k3",
            "score": 1,
            "text": "So basically they’re a liability for society. Great!",
            "title_similarity": "0.4216871",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hu75948",
            "score": 1,
            "text": "It's almost like someone should've warned humanity about creating a society controlled by fear and constantly bombarded with instant but short lasting gratification used by consumerism. I believe they called it Babylon.",
            "title_similarity": "0.499886",
            "sentiment_compound": 0.4503
        },
        {
            "id": "hu75dr1",
            "score": 1,
            "text": "But corporations profit from it, so nothing will be done.",
            "title_similarity": "0.45688987",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hu75i8b",
            "score": 1,
            "text": "not a chinese psy op btw",
            "title_similarity": "0.20087726",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu75inh",
            "score": 1,
            "text": "I recently started scrolling through the tiktok videos that are now on IG. God damn, they're evil. Addictive. I hate them but....I love them.",
            "title_similarity": "0.5981233",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hu75koi",
            "score": 1,
            "text": "So you're saying maximum profitability is at the expense of the users mental health?  Whoda thunk?",
            "title_similarity": "0.48972905",
            "sentiment_compound": 0.3527
        },
        {
            "id": "hu75sia",
            "score": 1,
            "text": "Fuckin junkies... ffs",
            "title_similarity": "0.45116776",
            "sentiment_compound": -0.6222
        },
        {
            "id": "hu75vfv",
            "score": 1,
            "text": "Social media bad, NEXT!!",
            "title_similarity": "0.53899103",
            "sentiment_compound": -0.6229
        },
        {
            "id": "hu75wig",
            "score": 1,
            "text": "Absolutely makes sense.  I became depressed in my late teens/early 20s due to Lyme disease and my working memory dropped from literally having an eidetic memory  and being able to read a page and essentially remember everything on it... to scatterbrained and couldn't tell you what I ate for breakfast.  I'm more creative now but damn do I wish I had my old memory.  That was about the time Facebook started up too",
            "title_similarity": "0.6925247",
            "sentiment_compound": -0.0138
        },
        {
            "id": "hu75y9d",
            "score": 2,
            "text": "I was addicted to riding my mountain bike through mud puddles and jumping snow banks when I was that age.",
            "title_similarity": "0.3432814",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu75yzv",
            "score": 2,
            "text": "Think this applies to the internet in general.",
            "title_similarity": "0.061745718",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu764am",
            "score": 1,
            "text": "Is the implication that social media causes depression or do depressed people seek social media as a coping mechanism?",
            "title_similarity": "0.71773493",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hu76tgg",
            "score": 1,
            "text": "Good thing I’m on Reddit :)",
            "title_similarity": "0.15482841",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hu76uiq",
            "score": 3,
            "text": "So this is why everyone on that app thinks they have ADHD...",
            "title_similarity": "0.5036377",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu76uzf",
            "score": 1,
            "text": "^Facebook. Fixed your title.",
            "title_similarity": "0.121985696",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu772qr",
            "score": 1,
            "text": "Now do reddit.\n\n-addicted to r/publicfreakout",
            "title_similarity": "0.41640562",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu775he",
            "score": 5,
            "text": "My stepbrother threw away his relationship with his girlfriend, his job, his high level Karate skill, and his free education, all for World of Warcraft. Internet addiction is real, and it will ruin young people for decades to come.",
            "title_similarity": "0.57386565",
            "sentiment_compound": -0.128
        },
        {
            "id": "hu776sl",
            "score": 1,
            "text": "Well, yeah... There's only so many times you can give up on humanity before it gets to you and they've really streamlined the process!",
            "title_similarity": "0.3707054",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hu77axi",
            "score": 1,
            "text": "One thing I wish they would delve in depth about the effects of short length videos have in attention span on frequent users and effects on individuals who suffer from ADHD. Anecdotally, I’ve only installed the app once and uninstalled almost immediately as I felt it was exacerbating my ADHD tendencies. I’m an adult and have essentially zero peer pressure to partake, but can totally see wrecking havoc on pre-teens and teens’ attention span and ADHD.",
            "title_similarity": "0.6513554",
            "sentiment_compound": -0.8292
        },
        {
            "id": "hu77dyl",
            "score": 1,
            "text": "Good thing I'm not a teen",
            "title_similarity": "0.20018205",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hu77oyj",
            "score": 1,
            "text": "What about adults on Reddit? Am I going to get some depression, and where was I going with this?",
            "title_similarity": "0.6449523",
            "sentiment_compound": -0.6199
        },
        {
            "id": "hu77vqq",
            "score": 1,
            "text": "I tend to believe this title right off the bat. Always seemed like watching 10s videos one after the other kind of programs your brain to have terrible span attention. It also makes you have very little satisfaction because 10 seconds is sk short it will never satisfy you, and you'll always be searching for the next one. I dislike it so very, very much.",
            "title_similarity": "0.7189461",
            "sentiment_compound": -0.4204
        },
        {
            "id": "hu781im",
            "score": 1,
            "text": "I think this applies to all consumable media. Especially cable news and social media.",
            "title_similarity": "0.020643918",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu788do",
            "score": 2,
            "text": "Something to do with the repeated dopamine spikes I'm guessing?",
            "title_similarity": "0.48905754",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu78fne",
            "score": 2,
            "text": "I bet my ass you can swap \"tik tok\" with literally any addiction for this to be true",
            "title_similarity": "0.32677415",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hu78l5j",
            "score": 1,
            "text": "You could say that for spending too much time on just about any kind of social media, including places like reddit.",
            "title_similarity": "0.34460896",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hu78mok",
            "score": 2,
            "text": "So thankful that I didn’t have social media as a young adult.",
            "title_similarity": "0.43341988",
            "sentiment_compound": 0.6115
        },
        {
            "id": "hu78rl8",
            "score": 1,
            "text": "What the study DOESN’T say is whether addictive use of Tiktok causes the depression, anxiety, and lower working memory, OR that depression, anxiety, and lower working memory causes the addictive use of TikTok.",
            "title_similarity": "0.66116756",
            "sentiment_compound": -0.9217
        },
        {
            "id": "hu78wa4",
            "score": 1,
            "text": "I would argue that this is a bit misleading, there is no real way to show that the people who experience this things aren’t just more drawn/prone to using apps like tiktok",
            "title_similarity": "0.49258593",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hu78yfu",
            "score": 1,
            "text": "Well yeah. I don’t think our brains are meant to view something happy, then sad, then angry, then joyful then violent then dancing then happy then sad again in like 1 minute or less. It’s Asinine. Some of my friends aren’t even fun to hang out with anymore because their obsessed with this stupid app.",
            "title_similarity": "0.6959693",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hu791cl",
            "score": 1,
            "text": "I knew that tiktok would be bad for my mental health and would become my sole source of dopamine (I have ADHD so I am particularly susceptible to short bursts of dopamine like tiktok or vine) so I haven’t downloaded tiktok.",
            "title_similarity": "0.68242115",
            "sentiment_compound": -0.25
        },
        {
            "id": "hu7963l",
            "score": 1,
            "text": "These kids need to get a life",
            "title_similarity": "0.3110211",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu796fw",
            "score": 1,
            "text": "id say it depends what you watch and how long for.",
            "title_similarity": "0.17785549",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu796t1",
            "score": 1,
            "text": "I've said it before and I'll say it again. Tiktok is the fentanyl of social media.",
            "title_similarity": "0.1838024",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu79frw",
            "score": 1,
            "text": " to cause these sorts of issues more",
            "title_similarity": "0.2768525",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu79rbp",
            "score": 1,
            "text": "Teens making fun of Boomers, who did the same thing 50 years ago with the “clicker”.",
            "title_similarity": "0.46799463",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hu7a6p0",
            "score": 1,
            "text": "I work as a 991 dispatcher in Sweden. It is only gonna get worse in the next 10 yo 20 y once these kids grow up. Once the bubble bursts its gonna be a epidemic. I experience  already a significant  increase  of young kids calling 911",
            "title_similarity": "0.5452642",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7a9a2",
            "score": 1,
            "text": "Going on TikTok will be a regret of the future",
            "title_similarity": "0.5148927",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hu7acxe",
            "score": 1,
            "text": "So did they do anything to establish direction of causation, if any? The article is written assuming \"tiktok -> bad attention span\", but they don't explain any way the paper would've been able to establish causation one way or another. Which is especially bizarre since the opposite, poor working memory causing people to prefer short-form entertainment, seems way more natural an explanation.",
            "title_similarity": "0.61324954",
            "sentiment_compound": -0.34
        },
        {
            "id": "hu7atbc",
            "score": 1,
            "text": "anecdotally speaking, tik-tok is super super addictive. The very first time that I went on the app I ended up scrolling for like two hours straight, enjoying the content.\n\nIt just sucks you in then you close out the app and wonder where time went and how it was all pointless.",
            "title_similarity": "0.523293",
            "sentiment_compound": 0.9201
        },
        {
            "id": "hu7avdx",
            "score": 1,
            "text": "I would be suspicious of these kinds of weak behavioral science findings. They're the kinds of observations that are not all that strong anywhere, and  taken in the context of the Chinese regime's notable antipathy to youth and social media, this is in the domain of cranky old folks everywhere \"those kids, their music is crap, they're lazy and rude, they just want to dance and do nothing\".  As one unique musician and video innovator with an idiosyncratic dancing style sang a generation ago- \"same as it ever was\". . . people still remember that big suit . . .\n\nHere's your null hypothesis: \"Internet 'addiction' is a contemporary moral panic, not an 'addiction' in any meaningful sense of the term\", and denunciation of it has been part of the Chinese cultural-political landscape for some time. You'll note that people have been writing more or less the same story for fifteen years . . . on the scale of \"things that look depraved\" - does TikTok really rate?\n\nFor a skeptical look at Internet \"gaming addiction\" with no particular axe to grind\n\n>This important study suggests that video game addiction might be a real thing, but it is not the epidemic that some have made it out to be. Nor is it comparable to addiction to alcohol, methamphetamines, or even gambling. Although many people incorrectly blame video games for producing problems in people’s lives, this study suggests that having Internet gaming disorder, at least using the DSM’s current symptomology, is not related to having psychological, social, or physical health issues. For almost all kids and young adults, video games will be a normal part of their development. The overwhelming majority of people appear to be able to play video games while still balancing a productive work schedule and active social life.   \n\\[Markey & Ferguson 2017\\]\n\nSee:\n\nSzablewicz, Marcella. \"The ill effects of “opium for the spirit”: a critical cultural analysis of China's Internet addiction moral panic.\" Chinese Journal of Communication 3.4 (2010): 453-470.  \n[https://doi.org/10.1080/17544750.2010.516579](https://doi.org/10.1080/17544750.2010.516579)\n\nGolub, Alex, and Kate Lingley. \"“Just like the qing empire” internet addiction, MMOGs, and moral crisis in contemporary China.\" Games and Culture 3.1 (2008): 59-75.  \n[https://doi.org/10.1177/1555412007309526](https://doi.org/10.1177/1555412007309526)\n\nMarkey, Patrick M., and Christopher J. Ferguson. \"Internet gaming addiction: Disorder or moral panic?.\" American Journal of Psychiatry 174.3 (2017): 195-196.",
            "title_similarity": "0.64855826",
            "sentiment_compound": -0.9886
        },
        {
            "id": "hu7b0np",
            "score": 1,
            "text": "How does one undo damage to working memory capacity?",
            "title_similarity": "0.42552504",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hu7brlj",
            "score": 1,
            "text": "Reddit’s fine tho right?",
            "title_similarity": "0.13044824",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hu7c53n",
            "score": 1,
            "text": "It's not just with TikTok",
            "title_similarity": "0.10686092",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7cbiw",
            "score": 1,
            "text": "What ever happened to parenting?",
            "title_similarity": "0.19559054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7ceon",
            "score": 1,
            "text": "A much larger literature, by Amy Orben and Andrew Pryzbylski shows that social media have no reliable adverse effects on kids. See https://www.ox.ac.uk/news-and-events/find-an-expert/professor-andrew-przybylski",
            "title_similarity": "0.31496134",
            "sentiment_compound": -0.0232
        },
        {
            "id": "hu7cs61",
            "score": 1,
            "text": "Just looking ata few tiktop posts on Reddit got me hooked on crack.",
            "title_similarity": "0.4066711",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7cs6p",
            "score": 1,
            "text": "Tech companies who are watching society suffer and collapse: “We’re powerless here! Sorry. We are a simple people who just gotta make a dime like everyone else.”\n  \nIt’s so weird. I live in San Francisco. Been here over 20 years. I see the tech busses and my nerd tech neighbors on a daily basis. It’s incredible to think that these normal ass nerds walking past me, cause so much chaos and suffering in the world.",
            "title_similarity": "0.5028049",
            "sentiment_compound": -0.972
        },
        {
            "id": "hu7ctuj",
            "score": 1,
            "text": "so even worse than Facebook",
            "title_similarity": "0.58900756",
            "sentiment_compound": -0.5233
        },
        {
            "id": "hu7d0b7",
            "score": 1,
            "text": "It also applies to instagram and fb.",
            "title_similarity": "0.18855879",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7dcwd",
            "score": 1,
            "text": "Redditors: I don't have such weaknesses",
            "title_similarity": "0.21117908",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hu7de1q",
            "score": 1,
            "text": "Wait, does suffering from major depression as a teenager reduce your short or long-term memory capacity as an adult?",
            "title_similarity": "0.8296786",
            "sentiment_compound": -0.796
        },
        {
            "id": "hu7dgy3",
            "score": 1,
            "text": "Why do tiktok videos edit out breathing?",
            "title_similarity": "0.35021436",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7dmmh",
            "score": 1,
            "text": "Score! The one anxiety I won’t have to worry about!",
            "title_similarity": "0.217726",
            "sentiment_compound": -0.6351
        },
        {
            "id": "hu7emog",
            "score": 1,
            "text": "It’s all about the dopamine hits you get it rapidly from watching the short films, to reach symbiosis your body needs to suppress dopamines and you get depressed.\n\nJust like a junky.",
            "title_similarity": "0.772343",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hu7euuy",
            "score": 1,
            "text": "Wait wait I've seen this one before!! This is exactly what they said about Facebook addiction",
            "title_similarity": "0.27799022",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7fs75",
            "score": 1,
            "text": "They said this with My Space, Facebook. Several others.",
            "title_similarity": "0.121625684",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7g8hx",
            "score": 1,
            "text": "So, I’m not a scientist. But I have a good idea about why this may be, or why it may be more prevalent with TikTok than other social media platforms. \n\nTikTok is specifically designed to \n1. Catch and hold *your* attention with an endless stream of short, **highly personalized** content. It also uses a never-before-seen algorithm that uses all the data from your entire phone to make a profile that fits you perfectly. \n\n2. The app is designed from top to bottom in a way that makes it nearly impossible to stop watching. Everything down to the placement of the “Like” and “Share” buttons is intentional and makes the user experience more effortless.\n\nThese two factors combined make TikTok unique in its addictive quality. Combine all that with the high chance(also unique) to “blow up” and achieve fame out of almost nowhere: the most prevalent desire among young people these days. \n\nIt’s a perfect storm of endless personalized content that fits like a puzzle piece into the social media gap left behind by the fallen Vine, Facebook, Musical.ly, etc.",
            "title_similarity": "0.31844416",
            "sentiment_compound": 0.9748
        },
        {
            "id": "hu7gg5n",
            "score": 1,
            "text": "There is a major culture on tiktok of self-diagnosing mental illness. Someone who feels depressed or anxious will get that kind of content from the algorithm. But the algorithm also pushes the most popular content creators in your domain.\n\nSo now you're depressed, watching some 19 year old Instagram model discuss their bouts with depression. Not surprising that this makes the user feel more depressed since the average person isn't getting millions of views.\n\nAnother issue this causes is high-profile creators \"faking\" mental illness to get views. There are dozens of big tiktok accounts completely centered around just taking videos of someone displaying ticks from tourettes. Except its been verified that many of them don't even have tourettes.  \n\nThe whole platform glorifies some of the most toxic parts of the internet surrounding mental health.\n\nI know someone who is well-adjusted, works full time, I've spent years around them as friends and even roommates. She picked up tiktok in 2019 and now she thinks she has BPD, Autism, ADHD, and tourettes. She won't go to a therapist though, because in her mind tiktok has already proven she has all the symptoms.\n\nIts very frustrating, as a person who was diagnosed with autism as a pre-teen. Recognizing symptoms doesn't mean you have a diagnosis. \n\nYou can have a cough, fatigue, and headaches. That doesn't mean you have pancreatic cancer, even though these are all symptoms of pancreatic cancer. Go to a doctor and they will test you for pancreatic cancer. You don't get to guilt your entire social network into feeling bad about your health problems when you haven't even seen a health professional about them.",
            "title_similarity": "0.7106116",
            "sentiment_compound": -0.9941
        },
        {
            "id": "hu7grhf",
            "score": 1,
            "text": "Probably applies to anyone using it to a degree.",
            "title_similarity": "0.118796855",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7h34a",
            "score": 1,
            "text": "Correlation doesn’t mean causation.  \n\nI bet in the past the same could have been said about Books.  People with bad lives would read and get lost in books.  So if you measured their depression it would be higher than non book readers.  Social media and phones are often the way we all escape.",
            "title_similarity": "0.66242826",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hu7hf0o",
            "score": 1,
            "text": "As a parent with a pre-teen boy.  We are not allowing social media account or apps.  He can bookmark his favorite YouTube channels and he has a discord channel to hang out with his friends that we are able to monitor. \n\nWe just did a tour of the middle school he will be attending next year and they mentioned trying to avoid letting your kids get involved in social media due to the stress and bulling.  \n\nI am not a prude parent and gave both my kids full gaming rigs that they use in a Public area of the house.  But no phones yet.  Social media is so toxic.  I prefer they avoid it as much as possible.",
            "title_similarity": "0.4617343",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hu7hp34",
            "score": 2,
            "text": "There's no way this is correct. Memory isn't damaged when ending usage of TikTok and I doubt the validity of this study because there's no way this is correct. Memory isn't damaged when ending usage of TikTok and I doubt the validity of this study .",
            "title_similarity": "0.4924332",
            "sentiment_compound": -0.5556
        },
        {
            "id": "hu7iitw",
            "score": 1,
            "text": "Why did they put quotes around the word \"addiction\"? Just call it what it is.",
            "title_similarity": "0.43306208",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7iyh3",
            "score": 1,
            "text": "Poor working memory is a symptom of executive function disorder\n\nOther very common symptoms of executive function disorder are anxiety, depression and a tendency to become addicted to quick sources of serotonin.\n\nComorbid depression, anxiety as well as poor diet, inadequate exercise and sleep all exacerbate symptoms",
            "title_similarity": "0.8592034",
            "sentiment_compound": -0.9682
        },
        {
            "id": "hu7jp4e",
            "score": 1,
            "text": "I think you can say that for every social media app as well",
            "title_similarity": "0.059190795",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hu7js9p",
            "score": 1,
            "text": "\"Ha. Yeah, those weak ass TikTok junkies.\"\n\nNow, back to furiously scrolling Reddit.",
            "title_similarity": "0.5544252",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hu7ju9g",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.29815984"
        },
        {
            "id": "hu7kttw",
            "score": 1,
            "text": "That’s what happens when media/ information/ and entertainment get smashed into tiny time periods. Totally fucks up your attention span.",
            "title_similarity": "0.60109264",
            "sentiment_compound": -0.1513
        },
        {
            "id": "hu7lpmw",
            "score": 1,
            "text": "'\"Reddit totally okay though\", the scientists confirmed.'",
            "title_similarity": "0.19696149",
            "sentiment_compound": 0.2944
        },
        {
            "id": "hu7m7xv",
            "score": 1,
            "text": "China playing the long game.",
            "title_similarity": "0.21997875",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hu7mab7",
            "score": 1,
            "text": "Not surprised here at all.\n\nFor the last 20 years I’ve seen attention spans decrease. Definitely took off since the smart phone. Now in my day job, if talking to anyone under 30, I never write emails or reports longer than two paragraphs, as that is about the limit of attention. Some interns won’t even read beyond 2 sentences.\n\nCompletely understandable as we are training all of our youth through internet services to always look for the next dopamine hit.  Advertising and gaming have trained entire generations on a new method of information requisition, where nothing needs to be remembered, and if the answer isn’t available online it doesn’t exist, and any content or information that is boring doesn’t get read past about 5 secs consideration.\n\nWe are at odd point when the foundation of our sociological understanding was conceived pre internet, and doesn’t not apply correctly to contemporary post internet understanding.",
            "title_similarity": "0.42037553",
            "sentiment_compound": 0.0859
        },
        {
            "id": "hu7n3o7",
            "score": 1,
            "text": "This surprises no one .\n\nSocial media addicts in general have exceptionally high external generation of personal value. Add to that decreased time spent forming close in-person relationships (bonds) that help with biological resilience , and the fact that TikTok trains the brain to enjoy repeated cycles of multi-second activity .\n\nNot saying TikTok is evil, it’s a tool. and teens brains are still developing and need more than just an electronic babysitter .",
            "title_similarity": "0.59258795",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hu7nb3c",
            "score": 1,
            "text": "\"Teens who experience depression and anxiety are addicted to TikTok\"",
            "title_similarity": "0.84257454",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hu7neda",
            "score": 1,
            "text": "Social media should be banned for children under 18. No copromises allowed.",
            "title_similarity": "0.39149913",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hu7nnsp",
            "score": 1,
            "text": "Why does it affect memory though ?",
            "title_similarity": "0.40176845",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7rnzm",
            "score": 1,
            "text": "Why does the title imply causation? It would make just as much sense the other way round.\n\nPresumably when experiencing anxiety and depression, turning to tik tok for a sense of connection and humor is an easy escape. Taking tik tok away could just as easily *worsen* symptoms if it’s a soothing mechanism rather than the root cause.",
            "title_similarity": "0.6098415",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hu7rwzm",
            "score": 1,
            "text": "Let’s save some time. *Next big craze* will experience worse depression and anxiety and in turn reduced working memory capacity. Parents are worried etc etc",
            "title_similarity": "0.88243",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hu7ry05",
            "score": 2,
            "text": "Love how this title implies cause/effect when there's only correlation and it could just as easily be that depression and anxiety increase social media addiction rather than the other way around...",
            "title_similarity": "0.55099565",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hu7sj9y",
            "score": 1,
            "text": "Personally I think being addicted to something in general is not good for your mental health, and would have the effects listed in the title. Nothing to do with TikTok.",
            "title_similarity": "0.6587479",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hu7st51",
            "score": 1,
            "text": "I always wondered if I would turn into the old man who doesn't \"get\" new fads the kids are in to....and Tik Tok is just one of many things my mid 30s self finds extremely stupid. Although I'm still stubborn enough to maintain that it really is that stupid and it's not just a generational thing.",
            "title_similarity": "0.6677574",
            "sentiment_compound": -0.8766
        },
        {
            "id": "hu7tgps",
            "score": 2,
            "text": "Age requirements for cell phone 18",
            "title_similarity": "0.11289867",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7ur2e",
            "score": 1,
            "text": "But they never tell you ..\n\nAre the depressed because the are addicted to tiktok....\n\nOr are they addicted to tiktok because they are depressed? \n\nKnowing this would be actual useful information.",
            "title_similarity": "0.76545715",
            "sentiment_compound": -0.7227
        },
        {
            "id": "hu7v8gt",
            "score": 1,
            "text": "What about adults addicted to TikTok? It’s my tv.",
            "title_similarity": "0.3474177",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7xcsr",
            "score": 1,
            "text": "I don't think Reddit is much better",
            "title_similarity": "0.5196947",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hu7yhe2",
            "score": 2,
            "text": "it's a study conducted during a global pandemic y'all. I just feel like there are other factors at play here.",
            "title_similarity": "0.4818058",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hu7yrr4",
            "score": 2,
            "text": "How do I download more working memory capacity",
            "title_similarity": "0.28048238",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7ytwl",
            "score": 3,
            "text": "Wait when you are depressed and have anxiety your memory starts to fail?? I didn’t know this!",
            "title_similarity": "0.78828406",
            "sentiment_compound": -0.8463
        },
        {
            "id": "hu7zrx3",
            "score": 1,
            "text": "The pain of withdrawal... for kids",
            "title_similarity": "0.6012772",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hu7zu36",
            "score": 1,
            "text": "Teens? What about adults?",
            "title_similarity": "0.30378982",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu7zuv1",
            "score": 2,
            "text": "In the 50's:  \"We don't want that rock 'n' roll to warp our kids' minds -- that's OUR job!\"\n\nIn the 60's:  \"We don't want that acid rock to warp our kids' minds -- that's OUR job!\"\n\nIn the 70's:  \"We don't want that air hockey table/pinball machine to warp our kids' minds -- that's OUR job!\"\n\nIn the 80's:  \"We don't want that Pac-man/that heavy metal/those slasher movies to warp our kids' minds -- that's OUR job!'\n\nIn the 90's:  \"We don't want those raves to warp our kids' minds -- that's OUR job!\"\n\nin the 00's:  \"We don't want that internet to warp our kids' minds -- that's OUR job!\"\n\nIn the 10's:  \"We don't want those iPhones to warp our kids' minds -- that's OUR job!\"\n\nIn the 20's:  \"We don't want that TikTok to warp our kids' minds -- that's OUR job!\"\n\nInsert whatever scared your parents.",
            "title_similarity": "0.42796662",
            "sentiment_compound": -0.781
        },
        {
            "id": "hu7zwyc",
            "score": 1,
            "text": "Teens who are addicted to YouTube are safe?",
            "title_similarity": "0.40934592",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hu8003c",
            "score": 1,
            "text": "Mom was right, it was the fault of that damn phone",
            "title_similarity": "0.5161779",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hu804rw",
            "score": 1,
            "text": "Is it also possible that this popular way of meeting new people which is the only outlet for some during a global pandemic hang on I lost my train of thought I’ll get it back again is less the cause of that anxiety than the aforementioned pandemic?",
            "title_similarity": "0.5639647",
            "sentiment_compound": 0.0644
        },
        {
            "id": "hu80gmc",
            "score": 2,
            "text": "It’s not just teens. My manager at my last job was like this. Functionally immature as a woman in her mid-30s and if you couldn’t get what you were try to say to her out of your mouth in under 15 seconds she would just stop paying attention to you.",
            "title_similarity": "0.5896167",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hu80v82",
            "score": 1,
            "text": "When I look at this, don't think China need to initiate a tangible war to the western war. Tiktok or manipulating fb, Instagram or Google suffice to lame the western youngster",
            "title_similarity": "0.33442527",
            "sentiment_compound": -0.9201
        },
        {
            "id": "hu826yc",
            "score": 1,
            "text": "Sounds like all of social media to me.",
            "title_similarity": "0.07190526",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hu8273p",
            "score": 2,
            "text": "When I'm  in the train. All i see is people looking at pictures either on instagram or  videos of themselves. \n\nThat cannot be healthy",
            "title_similarity": "0.40207717",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hu849ve",
            "score": 1,
            "text": "It's the equivalent of trashy TV, so yes.",
            "title_similarity": "0.49923375",
            "sentiment_compound": 0.541
        },
        {
            "id": "hu84bei",
            "score": 3,
            "text": "So does that mean Tik Tok causes it, or are prone people drawn to social media?",
            "title_similarity": "0.39907756",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu84e64",
            "score": 1,
            "text": "shockedpikachuface.jpg",
            "title_similarity": "0.24845102",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu84g82",
            "score": 1,
            "text": "How does one get addicted to Tik Tok even?",
            "title_similarity": "0.49014544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu84qb4",
            "score": 1,
            "text": "Isn't TikTok for 12 year olds?",
            "title_similarity": "0.23468772",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu85ev0",
            "score": 1,
            "text": "Damn I need to smoke me some tiktok",
            "title_similarity": "0.36794198",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hu85mgy",
            "score": 1,
            "text": "I wonder if in part this could be that Tiktok us is less the causative factor and more so that teenagers with ADHD would be much more likely to get addicted to Tiktok in general.\nWorking memory deficits, depression and anxiety goes hand in hand with ADHD.",
            "title_similarity": "0.8375284",
            "sentiment_compound": 0.25
        },
        {
            "id": "hu85sti",
            "score": 1,
            "text": "Good thing I'm not a teenager, take that depression.",
            "title_similarity": "0.45509666",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hu8674a",
            "score": 1,
            "text": "As a high school teacher, I feel cell phones and social media are an absolute scourge in schools.\n\nI have kids that are putting over 100 hours into social media apps (according to their phone's records). It's insane. That's 2.5 full time jobs worth of time spent scrolling through... *nothing.*\n\nIt's absolute insanity.",
            "title_similarity": "0.53132355",
            "sentiment_compound": 0.2955
        },
        {
            "id": "hu869cm",
            "score": 1,
            "text": "Unobserved heterogeneity FTW",
            "title_similarity": "0.27655762",
            "sentiment_compound": 0.5766
        },
        {
            "id": "hu869dc",
            "score": 1,
            "text": "Which came first, the chicken or the egg?",
            "title_similarity": "0.15290305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu873vj",
            "score": 1,
            "text": "Good thing the same isn't true for reddit.\n\n*refreshes reddit*",
            "title_similarity": "0.5148188",
            "sentiment_compound": 0.1451
        },
        {
            "id": "hu87bfg",
            "score": 2,
            "text": "Me constantly Reddit scrolling.... yeah these ticktoc teens are f’d up man",
            "title_similarity": "0.39742917",
            "sentiment_compound": 0.296
        },
        {
            "id": "hu87qv3",
            "score": 1,
            "text": "So basically follows other studies about social platforms having a negative impact on mental health. Okay. Great.",
            "title_similarity": "0.6713258",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hu88xkk",
            "score": 1,
            "text": "I feel these are very important findings. I hope every aspect of the situation is studied extensively, over time.",
            "title_similarity": "0.23413284",
            "sentiment_compound": 0.6115
        },
        {
            "id": "hu88z3b",
            "score": 1,
            "text": "Not surprising that people who watch very short videos in large quantities would have short term memory. Get your kids off of social media",
            "title_similarity": "0.5232833",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hu89k2o",
            "score": 1,
            "text": "This title is seemingly blaming tik tok for reduce working memory capacity from depression but not representing depression as itself and working memory capacity reduction directly from depression",
            "title_similarity": "0.7704647",
            "sentiment_compound": -0.6708
        },
        {
            "id": "hu89tsb",
            "score": 1,
            "text": "After being on TikTok for a while, the algorithm was playing a variation of “stop being sad, how to cure depression, “ it made me crazy and no longer enjoyable. There is just too much crap on that platform.",
            "title_similarity": "0.75283325",
            "sentiment_compound": -0.9275
        },
        {
            "id": "hu8awc4",
            "score": 1,
            "text": "This generation is fucked. This stuff is bad for me, I can tell, can’t imagine how bad it is for kids. It’s a kind of drug",
            "title_similarity": "0.74734783",
            "sentiment_compound": -0.9081
        },
        {
            "id": "hu8d68i",
            "score": 1,
            "text": "Misleading title. Makes it sound like causation instead of correlation.",
            "title_similarity": "0.44052464",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hu8dlv9",
            "score": 1,
            "text": "Literally my personal experience exactly, and now research is saying it",
            "title_similarity": "0.14443387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu8dqu7",
            "score": 1,
            "text": "Tiktok also makes little shits into narcissists.",
            "title_similarity": "0.4963312",
            "sentiment_compound": -0.4228
        },
        {
            "id": "hu8drcw",
            "score": 1,
            "text": "You wanna talk about bio weapon, tictoc is closer to one than covid.",
            "title_similarity": "0.26514566",
            "sentiment_compound": -0.296
        },
        {
            "id": "hu8el4n",
            "score": 1,
            "text": "its alllll hoes anywayyy",
            "title_similarity": "0.1513027",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu8ewea",
            "score": 1,
            "text": "Due to lazy ass parents who’s not monitoring what their teenage sons or daughters are looking at",
            "title_similarity": "0.58676887",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hu8fod2",
            "score": 1,
            "text": "That's exactly how China wants it as TikTok is Chinese spyware.",
            "title_similarity": "0.2686001",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu8geu3",
            "score": 1,
            "text": "What ever happened to TikTok being a virus?",
            "title_similarity": "0.38663286",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu8ikj9",
            "score": 1,
            "text": "I wonder about the same study towards middle-age and elderly demographics with Facebook.",
            "title_similarity": "0.37142476",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu8j751",
            "score": 1,
            "text": "That is why I Do Not have this. Lots of useless content. people just showing yourselves",
            "title_similarity": "0.514444",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hu8j92o",
            "score": 1,
            "text": "it's obviously a data collection machine .... for who???\n\nand yes, as a psych, the subliminal suggestion , which is illegal on certain things, \n\nis obvisously being 'added' to post all over the place.  and posters seem to not realize this.\n\nbut if you make a post for example, look at the video from different angles and you may\n\nbe able to see some alterations.\n\ni agree, it probably is the most dangerous social interaction systen on the net i've seen\n\nyet.",
            "title_similarity": "0.6141062",
            "sentiment_compound": -0.4175
        },
        {
            "id": "hu8k312",
            "score": 1,
            "text": "Could it be simple correlation?  \n\n\nThat people who have existing reduced working memory capacity also have a more impaired executive functioning. Which, in turn through impaired self control, makes them significantly more prone to addiction and stimulation of this type of hyper short media.",
            "title_similarity": "0.8683339",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu8lsw1",
            "score": 1,
            "text": "I like that this is posted on Reddit, which is likely having a similar outcome on Adults.",
            "title_similarity": "0.3083183",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hu8lzdd",
            "score": 1,
            "text": "I’m starting to think this is going to be a pretty big problem down the line.",
            "title_similarity": "0.4807921",
            "sentiment_compound": 0.128
        },
        {
            "id": "hu8me57",
            "score": 1,
            "text": "Now imagine they did a study on redditors.",
            "title_similarity": "0.25566545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu8n4jg",
            "score": 1,
            "text": "Tik Tok is the devil incarnate for today's young people.",
            "title_similarity": "0.5199851",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hu8o0oz",
            "score": 1,
            "text": "I remember reading this about facespace not so long ago. War never changes.",
            "title_similarity": "0.1882808",
            "sentiment_compound": -0.6326
        },
        {
            "id": "hu8on8e",
            "score": 1,
            "text": "The ultimate dopamine trap.",
            "title_similarity": "0.364727",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hu8ot4t",
            "score": 1,
            "text": "A friend of mine isn't a teen but she literally just downloaded TikTok and is always miserable.",
            "title_similarity": "0.5939293",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hu8p0ss",
            "score": 1,
            "text": "Chinese spyware planted to make the west slower, stupider and less efficient. Everyone denies the truth. I am not ironic.",
            "title_similarity": "0.47430205",
            "sentiment_compound": -0.2166
        },
        {
            "id": "hu8pq5v",
            "score": 1,
            "text": "Or are they depressed because the world is fucked, and resorting to D grade social media to find some sense of good and normalcy in the world?",
            "title_similarity": "0.7001027",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hu8pvmi",
            "score": 1,
            "text": "How do I send this to my roommates without sending it to my roommates?",
            "title_similarity": "0.33294278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu8pyao",
            "score": 2,
            "text": "Anything you practice you'll get better at.\n\nPractice bad memory, you'll have bad memory.\n\nAnd practice short attention span, you'll have a short attention span.",
            "title_similarity": "0.66877806",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hu8qylx",
            "score": 1,
            "text": "Pssh! Losers! Unlike us well-adjusted Reddit scrollers",
            "title_similarity": "0.5152794",
            "sentiment_compound": -0.6103
        },
        {
            "id": "hu8r00t",
            "score": 1,
            "text": "Could you explain \"working memory capacity\" for me? I don't do TikTok but I have some serious depression and one of my biggest issues and fears is my bad memory. I often worry and wonder about things like early onset dementia or other memory related diseases. Is this something I can improve or will I forever have a bad memory regardless of what I do?",
            "title_similarity": "0.82423335",
            "sentiment_compound": -0.9572
        },
        {
            "id": "hu8ryt7",
            "score": 1,
            "text": "It’s the lowest of the lowest forms of expression.  Lower than drawing a penis with your own excrement",
            "title_similarity": "0.5217085",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hu8sdsa",
            "score": 1,
            "text": "Correlation doesn’t mean causation. Reversing this headlines could totally be true too",
            "title_similarity": "0.29455066",
            "sentiment_compound": 0.4728
        },
        {
            "id": "hu8sgfe",
            "score": 1,
            "text": "Well the fact that they downloaded the app willingly in the first place should be enough to deduce this information",
            "title_similarity": "0.19072703",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hu8sv6o",
            "score": 1,
            "text": "wow crazy who could have predicted this",
            "title_similarity": "0.32002613",
            "sentiment_compound": 0.34
        },
        {
            "id": "hu8v78p",
            "score": 1,
            "text": "Chupenlo adolescentes ctm no tengo tik tok",
            "title_similarity": "0.25646344",
            "sentiment_compound": -0.296
        },
        {
            "id": "hu8x4ye",
            "score": 1,
            "text": "Newsflash:  Social media is from hell.",
            "title_similarity": "0.4866136",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hu8xd5b",
            "score": 1,
            "text": "I hate such click-bait, misleading titles. Just read the paper, guys.\n\nYou could say the opposite to this title, and you still would be right. The only correct title would be “Anxiety and depression among teens have a positive correlation with TikTok 'addiction'”.",
            "title_similarity": "0.7427969",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hu8y8rz",
            "score": 1,
            "text": "Given this study deals specifically with China, by TikTok did they mean Douyin?",
            "title_similarity": "0.17594421",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu8yf1y",
            "score": 1,
            "text": "Good thing I’m not on TikTok and never will get on it",
            "title_similarity": "0.27132875",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hu8z0bd",
            "score": 2,
            "text": "This is why the belief that moderating ourselves is easy must be called into question. We all know it’s necessary but we all know we say it even as we do certain things immoderately. Not saying we gotta ban these things but if we can’t have a conversation about how difficult moderation is then we really are doomed.",
            "title_similarity": "0.5281886",
            "sentiment_compound": -0.9147
        },
        {
            "id": "hu8zxir",
            "score": 1,
            "text": "well it does make sense.\nmany of those tik toks are kids showing off their lavish / rich influencer lifestyle, supercars, sick appartments, beauty, perfect bodies etc\n\n\n\nbut lets be real, all social medias are like that. there are very little content creators on social medias such as tik tok / instagram / facebook, its literally just ppl showing off to make themselves feel good. \n\n\n\n\nkids need to spend more time on youtube or twitch. this is where ppl actually do fun and interesting stuff. there is so much to do on youtube its crazy, algorthm is good and keeps suggesting new stuff to watch. \n\n\n\nsocial medias are cancer.",
            "title_similarity": "0.45064268",
            "sentiment_compound": 0.9349
        },
        {
            "id": "hu90b18",
            "score": 1,
            "text": "Just China systematically dumbing down entire American generations while also buying a ton of housing in cash.",
            "title_similarity": "0.4284914",
            "sentiment_compound": -0.128
        },
        {
            "id": "hu919cr",
            "score": 1,
            "text": "That or like most tik tok trends their faking it",
            "title_similarity": "0.5304021",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hu91y5t",
            "score": 1,
            "text": "Anybody who is addicted to anything has worse mental health.",
            "title_similarity": "0.7818339",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hu92mgv",
            "score": 1,
            "text": "don’t push HER button too often or else you get the whipped",
            "title_similarity": "0.5345384",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu92okd",
            "score": 1,
            "text": "Maybe people who are depressed and anxious seek things like TikTok out?",
            "title_similarity": "0.76220757",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hu932pd",
            "score": 2,
            "text": "I’ve seen this first-hand as a former high school and now college student. Kids’ attention spans have massively decreased and their senses of humor have corroded into oblivion. Only quick-cut, loud, and random videos can entertain nowadays.",
            "title_similarity": "0.6157342",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hu932yt",
            "score": 1,
            "text": "A pill for everyone! *Are you not entertained.... Is this not why you are here?*",
            "title_similarity": "0.4889011",
            "sentiment_compound": -0.3716
        },
        {
            "id": "hu93avk",
            "score": 1,
            "text": "Wel... good thing I'm not a kid!",
            "title_similarity": "0.2172059",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hu93hq1",
            "score": 2,
            "text": "TTUD: TikTok Use Disorder\n\n\nWhat a time to be alive",
            "title_similarity": "0.3490406",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hu93mdm",
            "score": 1,
            "text": "In my day we abused substances",
            "title_similarity": "0.5701703",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hu93scg",
            "score": 1,
            "text": "The media published similar pieces when the radio was first invented - people were scared that everyone would stop talking to each other if we let everyone listen to it all day",
            "title_similarity": "0.4823041",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hu94v0l",
            "score": 1,
            "text": "Is there a control for this? Like maybe the most depressed teens just gravitated towards tik tok.",
            "title_similarity": "0.8163679",
            "sentiment_compound": -0.1823
        },
        {
            "id": "hu95uiw",
            "score": 2,
            "text": "As an avid user of tiktok I can definitely say that it has ruined my attention span. I struggled with adhd before tiktok but after acclimating to it it is nearly impossible for me to do anything more than 10 minutes straight. It triggers stimulation in such a rapid fire way that literally nothing else is comparable. The algorithm is pretty good so I don’t get discouraged about my sense of self-worth from the content - they are pretty good about showing you content that aligns with your own interests and sense of self. But I DO get depressed because I wish I was doing something more meaningful with my time and wish I was able to enjoy it - but whenever I try the attention span always breaks down and I revert to that easy fix.\n\nI really don’t think the effects of social media on our attention span have been studied enough. There was a notable change in myself after I started using portable devices, and it has been a slippery slope progressively getting worst. First I transitioned from hardcore Desktop gaming to casual laptop gaming. Then after I got a smart phone I no longer had attention for the laptop. I went through an addiction to chat-apps for a couple years, which I was only able to break by downloading reddit. I kept running out of new feed on reddit so I started juggling up reddit and facebook. I was notably disinterested in reading all day but it was something to do. And then I found tiktok. As much as I wish I didn’t use it, it straight up feels like emotional withdrawal if I go too long without using it. I’m stuck in this feedback loop. I didn’t get the laptop until my mid 20s, so this was all a very sudden dramatic shift to both my hobbies and my attention span. Up until that first laptop I never felt like I had attention span issues, I had fairly balanced interests and significantly higher follow through. Now I feel broken.",
            "title_similarity": "0.6830415",
            "sentiment_compound": 0.9808
        },
        {
            "id": "hu95yk3",
            "score": 1,
            "text": "It’s ran by the Chinese as well!!!!",
            "title_similarity": "0.19271435",
            "sentiment_compound": 0.5053
        },
        {
            "id": "hu9645b",
            "score": 1,
            "text": "So this is what reddit is probably doing to me",
            "title_similarity": "0.2686445",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu96my0",
            "score": 1,
            "text": "I feel bad for today's teens bombarded by so much quick and easy media.",
            "title_similarity": "0.6051972",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hu96z4x",
            "score": 1,
            "text": "Its more likely that they are depressed and using platforms like tiktok to escape from the feeling.",
            "title_similarity": "0.7710282",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hu99w5x",
            "score": 1,
            "text": "Cap my sister is more on tiktok than me and she doesn't have any depression in comparison to me",
            "title_similarity": "0.36686224",
            "sentiment_compound": 0.4585
        },
        {
            "id": "hu9a6jq",
            "score": 1,
            "text": "Whew. Good thing I don't use tiktok. Just Reddit every chance I have.",
            "title_similarity": "0.31294316",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hu9ad9t",
            "score": 2,
            "text": "I’m going to need to see a comparative study with comparison/controls for a ADHD diagnosis before I’m going to accept that TTUD (TikTok Use Disorder) is related to the impaired executive function, depression, and anxiety and not a just correlation between people with ADHD that get sucked into the free dopamine of TikTok.",
            "title_similarity": "0.59197325",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hu9al4z",
            "score": 1,
            "text": "Hmm who would have guessed mindlessly scrolling for hours a day would cause issues?",
            "title_similarity": "0.49300718",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu9aqp3",
            "score": 1,
            "text": "I am pretty sure I saw all of these same things for instagram, Snapchat, Facebook, MySpace, etc. it’s all the same. People only show what they want you to see, you compare your life to theirs, you get sad. It’s nothing new",
            "title_similarity": "0.33878535",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hu9arar",
            "score": 1,
            "text": "Tik tok and youtube stories are straight up cancer",
            "title_similarity": "0.4147616",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hu9b6c4",
            "score": 1,
            "text": "I found myself in that situation.",
            "title_similarity": "0.0977302",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu9bae8",
            "score": 1,
            "text": "Why is “addicted” not addicted? Is it a joke, or is it simply not something that will be widely recognized?\n\nIt’s an infinite dopamine flow. It IS addiction. Cmon now.\n\nAlso anyone looking for why it’s just TikTok is considering this incorrectly. It’s NOT just TikTok. It’s TikTok who’s most brazen. Do you think Reddit isn’t addictive? And your news feed? Twitter? Facebook?\n\n\nIt’s the same formula, just geared differently. Let’s get real. The issue is dark UIs. “Dark user interfaces” for the curious. \n\nThe modern internet is concerning. If regulating TikTok gets the ball rolling, then let it happen already. It’s going to be a whole generation down the drain otherwise.\n\nEdit: oh and the obl TikTok bad Reddit good. It’s all the same. Let’s stop being biased.",
            "title_similarity": "0.6260973",
            "sentiment_compound": -0.3313
        },
        {
            "id": "hu9bhht",
            "score": 1,
            "text": "I mean, I'm sceptical, the rates of depression don't seem to be statistically different than average.",
            "title_similarity": "0.54799247",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hu9dne5",
            "score": 2,
            "text": "I always find it amazing how teens are compelled to reply to just any empty comment they read.",
            "title_similarity": "0.42839232",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hu9ek6y",
            "score": 1,
            "text": "Didn't really read the article but what exactly was the setup of the study? Because couldn't it also be that people who have anxiety and depression disorders end up using TikTok more?\n\n(It's common sense that addiction to media is a huge problem but to this specific study)",
            "title_similarity": "0.67547286",
            "sentiment_compound": -0.8426
        },
        {
            "id": "hu9erxw",
            "score": 1,
            "text": "I only use Reddit. Only Reddit. I’m not on anything else, other than YouTube.",
            "title_similarity": "0.18458132",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu9fcjd",
            "score": 1,
            "text": "Oh they say this about every app",
            "title_similarity": "0.04424285",
            "sentiment_compound": 0.0
        },
        {
            "id": "hu9g5zi",
            "score": 1,
            "text": "And adults addicted to Reddit lead sad lives",
            "title_similarity": "0.7725637",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hu9gslj",
            "score": 1,
            "text": "Are you sure you're drawing the causal arrows in the correct direction?",
            "title_similarity": "0.23419753",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hu9gvyv",
            "score": 1,
            "text": "Reddit does not seem much better for mental health. The content on tik tok way more funny then the content on Reddit. I go to Reddit for the in depth discussions while I go to tik tok if I am wanting short, funny, and entertaining videos.",
            "title_similarity": "0.58183247",
            "sentiment_compound": 0.7641
        },
        {
            "id": "hu9h4my",
            "score": 2,
            "text": "I think I know why. I downloaded tik tok a few months ago and started seeing videos people made that targeted some of my insecurities. In the videos, the people were making fun of said insecurities of mine. As it turns out, I would actually finish watching those entire videos so the algorithm started showing me more of those. Eventually I was hooked on watching videos that brought down my self esteem. I noticed that eventually and quickly deleted tik tok. I’m doing better.",
            "title_similarity": "0.59054863",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hu9h9ja",
            "score": 2,
            "text": "TikTok is the most addictive app I've ever used.  I've decided to stop using it because of how much time I waste on it and how bad it ultimately make me feel about myself and the world.",
            "title_similarity": "0.7387783",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hu9ike8",
            "score": 1,
            "text": "Good thing I’m not addicted to TikTok \n\n49k reddit karma",
            "title_similarity": "0.36447895",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hu9j3tl",
            "score": 1,
            "text": "Makes perfect sense, imagine scrolling back in time and seeing yourself “dance” repeatedly.",
            "title_similarity": "0.15827295",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hu9jcit",
            "score": 1,
            "text": "Something not mentioned is that Tiktok tends to attract ADHD people because it’s an easy endless dopamine machine basically and teens/people with ADHD are way more prone to these problems anyways. So it could totally be a correlation and not a causation.",
            "title_similarity": "0.64737904",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hu9la3c",
            "score": 1,
            "text": "Idk, it's a mic of tiktok, all social media, processed foods, drugs/alcohol/sugar, whatever other unhealthy living habits most people have, and whatever unhealthy situation they have to deal ith",
            "title_similarity": "0.47176567",
            "sentiment_compound": -0.802
        },
        {
            "id": "hu9nmsv",
            "score": 1,
            "text": "It brings easy money to a lot of parents, so nothing can be done.",
            "title_similarity": "0.37923452",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hu9nts8",
            "score": 1,
            "text": "Is there an article about adults who totally aren’t addicted and can totally quit any time they want?",
            "title_similarity": "0.43422294",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hu9q8cx",
            "score": 1,
            "text": "What if the kind of person who gets addicted to tiktok would anyway get addicted to gaming, substances, Facebook, candy crush or porn, depending on their tastes?\n\nMaybe some brains fall faster into dopamine cycling addiction regardless of what the addiction is",
            "title_similarity": "0.6517757",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hu9v63m",
            "score": 1,
            "text": "I’ve never used tiktok, but when I see my brother or sister scrolling trough tiktok sometimes I understand because the content I’ve seen is just depressingly bad.",
            "title_similarity": "0.6021231",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hu9xxxl",
            "score": 1,
            "text": "I deleted it because there were too many half naked girls on there. Took me a while to realize that was bad for my sexual health.",
            "title_similarity": "0.7230084",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hua1m5m",
            "score": 1,
            "text": "I'd like to see a similar study but for Reddit",
            "title_similarity": "0.3152555",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hua3q8k",
            "score": 1,
            "text": "Reddit scrolling is no different.",
            "title_similarity": "0.1119445",
            "sentiment_compound": -0.296
        },
        {
            "id": "hua8wpu",
            "score": 1,
            "text": "Why the quotes on addicted?",
            "title_similarity": "0.5773264",
            "sentiment_compound": 0.0
        },
        {
            "id": "huaa76y",
            "score": 1,
            "text": "How to cripple future generations 101: Facebook < Instagram < Tik Tok < reverted back to caveman times",
            "title_similarity": "0.3852597",
            "sentiment_compound": 0.0
        },
        {
            "id": "huaenqq",
            "score": 1,
            "text": "Wow. I'm so glad that people were paid to look into this.\nMy sarcasm lvl is close to 100. I'm in the mid.80s currently. Please forgive me. I'm going for comedy, not edgelord BS",
            "title_similarity": "0.32894868",
            "sentiment_compound": 0.902
        },
        {
            "id": "huao8nl",
            "score": 1,
            "text": "Tiktok is just bad for any one’s health. It’s a bunch of people just trying to get their 5 seconds of fame. Or “hey look at me !” And I couldn’t even imagine for the female audience. Everything is be good looking, have a fat ass and everything is sexualized. Theres people doing extravagant things all day on there it just gets to you sometimes, especially when your younger and crave all those things. I’ve seen it firsthand with my gf and Facebook, seeing everyone go on vacation and go and do things. “Why isn’t my life like that” is a lot of what it is I think",
            "title_similarity": "0.5934266",
            "sentiment_compound": 0.1511
        },
        {
            "id": "hub82gu",
            "score": 1,
            "text": "Annecdotally, TikTok was a huge detriment to my mental health. It would be a mixture of cute animals, food, and then suddenly videos of graphic animal abuse or police brutality. \n\nI found my anger levels affecting my offline behavior so I uninstalled it. Haven't looked back.",
            "title_similarity": "0.63075984",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hwumfvu",
            "score": 1,
            "text": "Just want to point out that “TikTok use disorder” is not an actual disorder.",
            "title_similarity": "0.39336973",
            "sentiment_compound": 0.3732
        },
        {
            "id": "hxvje1x",
            "score": 1,
            "text": "And I thought I already hated til tok",
            "title_similarity": "0.53487736",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hyapktx",
            "score": 1,
            "text": "Simply put, social media apps make us sad, then dumb.",
            "title_similarity": "0.71643704",
            "sentiment_compound": -0.7506
        }
    ]
}