{
    "The brains of patients who died as a result of COVID-19 infection displayed some of the same molecular changes found in the brains of those with Alzheimer’s disease, a new small study found. The findings may explain why some long-term COVID sufferers report memory problems.\n": [
        {
            "id": "hvs7e42",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.54229033",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hvsc2cg",
            "score": 19,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsgr08",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsnbu2",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsdymy",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsbe1n",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsfuvv",
            "score": -20,
            "text": "It also brings out Alzheimers in people that are prone to it. As soon as my grandfather got covid and the vaccine his got 100x worse.",
            "title_similarity": "0.7421247",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hvsniex",
            "score": 17,
            "text": "The average age of death in United States for people testing positive for COVID-19 is about 78 years old, and involves at least two life-threatening comorbidities such as Alzheimer’s or cancer or emphysema. It seems only logical that many of them were experiencing diminished cognitive ability, or am I off-base here? Clue me in?",
            "title_similarity": "0.7581619",
            "sentiment_compound": -0.2406
        },
        {
            "id": "hvsgijm",
            "score": 32,
            "text": "Aren’t the majority of people dying with COVID the same age groups as those with Alzheimer’s ie old people?",
            "title_similarity": "0.73590505",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvsgf1q",
            "score": -22,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvssmik",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvtdc0y",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvu0ibm",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvu26uo",
            "score": 0,
            "text": "The people who die from covid-19 are likely to be old. I’d guess around 70 and older. It would make sense that people who die from covid-19 (older  people) would show signs of Alzheimer’s. Possibly the old age and the fact that they were already suffering from some mild form of Alzheimer’s before they were infected with the virus caused them to be more susceptible to death from the virus",
            "title_similarity": "0.7773789",
            "sentiment_compound": -0.9599
        },
        {
            "id": "hvsk2u3",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsgk0c",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsur9l",
            "score": 0,
            "text": "There is *some* evidence that nicotine may have certain benefits on the brain. There probably haven’t been any studies done, but could nicotine help with Covid-19?",
            "title_similarity": "0.5933472",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hvsmywc",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvt4hbr",
            "score": -3,
            "text": "Are we certain they weren’t already developing Alzheimer’s before they died from Covid?… \n\nChicken or the egg…",
            "title_similarity": "0.5893516",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hvt2r39",
            "score": -8,
            "text": "Could it be that the demographics that are overrepresented in COVID deaths are also the ones most likely to suffer from Alzheimer's disease? Last time i checked the average age of death from COVID was around 80.",
            "title_similarity": "0.670609",
            "sentiment_compound": -0.8255
        },
        {
            "id": "hvsumnw",
            "score": -5,
            "text": "Sounds like the cause of Alzheimer’s is our pulmonary system failing. No oxygen to brain after all tends to hurt the brain... sometimes the most simple answer is the truth.",
            "title_similarity": "0.61404073",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hvszbt7",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.14625205"
        },
        {
            "id": "hvtdzt9",
            "score": 2,
            "text": "I think that it is safe to say that, as individuals are infected and then reinfected with future variants, these types of lingering effects will probably accumulate. It is, in a very real sense, the death of a thousand cuts.",
            "title_similarity": "0.65506756",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hvsmzes",
            "score": 19,
            "text": "This study found molecular changes in the brains of patients who died from COVID-19 that were also found in the brains of those with Alzheimer's disease. This could explain why some long-term COVID sufferers report memory problems. While this is a small study, it provides valuable insight into how COVID may impact the brain. More research is needed to confirm these findings and to determine if there is a link between COVID and Alzheimer's disease.",
            "title_similarity": "0.92412364",
            "sentiment_compound": -0.765
        },
        {
            "id": "hvsh3jg",
            "score": 61,
            "text": "Good to know all of us long haulers aren’t just crazy thinking we have symptoms.",
            "title_similarity": "0.43978208",
            "sentiment_compound": 0.128
        },
        {
            "id": "hvt3452",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.14625204"
        },
        {
            "id": "hvv8ivx",
            "score": 0,
            "text": "80% of the patient were near or past the average life span of humans. How do we know that these brain problems stem from Covid and not just old age? Only 10 brains were studied as well. They also made this clear, “While the mechanisms that lead to cognitive impairment associated with COVID-19 are not well understood, there have been recent reports studying SARS-CoV-2 infection and brain biochemistry and neuropathology.” So they barely even understand if Covid affects brain chemistry.",
            "title_similarity": "0.68217915",
            "sentiment_compound": 0.1496
        },
        {
            "id": "hvweni7",
            "score": 0,
            "text": "Maybe people with dementia don’t want vaccines.",
            "title_similarity": "0.5752318",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hwdfb9m",
            "score": 0,
            "text": "I wonder if brain damage is caused by the infection, or if those who are brain damaged are more likely to refuse to vaccine and thus more likely to get infected.",
            "title_similarity": "0.6243986",
            "sentiment_compound": -0.8948
        },
        {
            "id": "hvs8k44",
            "score": 308,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvt3q8z",
            "score": -11,
            "text": "Could it not be possible that because the majority of people who died of covid we’re elderly and most likely had  Alzheimer’s already?",
            "title_similarity": "0.71505827",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hvsn2bn",
            "score": -11,
            "text": "“Long-term” being 2 years right?",
            "title_similarity": "0.18703564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvsrbuh",
            "score": 1,
            "text": "Given the microemboli seen in the acute phase I was wondering if amyloid deposits would lead to higher prevalence of Alzheimers in those effected by covid",
            "title_similarity": "0.75303924",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvt72tt",
            "score": 1,
            "text": "How many of these patients were vaccinated against COVID in this study? Was this even taken into account?",
            "title_similarity": "0.63975066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvte23x",
            "score": 1,
            "text": "Could this info be used to justify “implied consent” when considering conspiracy laden decisions when it comes to treatment? (Ivermectin treatment and redmisivir fears etc)",
            "title_similarity": "0.45232466",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hvvf808",
            "score": 1,
            "text": "This is why prevention is better than treatment.",
            "title_similarity": "0.35735652",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hvscp0e",
            "score": 87,
            "text": "Iirc elevated blood glucose is comorbid with COVID-19 severity and type III diabetes (cognitive decline due to insulin resistance). So I would speculate that that is a cofounding variable here.",
            "title_similarity": "0.56585675",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvsvv6e",
            "score": 8,
            "text": "What about vaccinated people?",
            "title_similarity": "0.29192048",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvsdthx",
            "score": 19,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsbxci",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.14625204"
        },
        {
            "id": "hvu4r9c",
            "score": -4,
            "text": "Did these patients die from Covid or with Covid. It doesn’t address vaccines inability for an individual to get Covid?",
            "title_similarity": "0.53827786",
            "sentiment_compound": -0.765
        },
        {
            "id": "hvscbo1",
            "score": 370,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvtzapc",
            "score": -3,
            "text": "To those of you suffering symptoms, Scripps research has collected impressive data suggesting you could really benefit from daily consumption of Rosemary extract. It stops a powerful inflammatory feedback loop (NLRP3) in both long-covid and Alzheimer’s and seems particularly effective against oxidative stress and tauopathies, but the only thing not clear is minimum effective dose in humans at this time: https://www.mdpi.com/2076-3921/11/1/124/htm",
            "title_similarity": "0.70857584",
            "sentiment_compound": 0.6723
        },
        {
            "id": "hvsegtp",
            "score": 69,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsocps",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvshmet",
            "score": 119,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvscfl1",
            "score": 256,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsgoxd",
            "score": -24,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsiehv",
            "score": 89,
            "text": "Some things that are worth looking into are the relationship between Covid and receptors that bind with nicotine:  https://febs.onlinelibrary.wiley.com/doi/full/10.1111/febs.15521\n\nAnd the role of nicotine as a therapeutic for both Alzheimer’s and Parkinson’s:  https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1670208/\n\nNicotine has also had some therapeutic consideration to lessen immune reactions leading to cytokine storms from COVID19 infection.",
            "title_similarity": "0.7098322",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hvsfsrd",
            "score": 935,
            "text": "This is my worry about covid. It may become less deadly in the long run but we still don't have a lot of research about what happens in the background. While it's still out there, I won't go without a mask.",
            "title_similarity": "0.46083137",
            "sentiment_compound": -0.2382
        },
        {
            "id": "hvscj5c",
            "score": 259,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsxxzw",
            "score": 55,
            "text": "That is not a good sign. Alzheimers is a terrible disease. One of my friends has memory loss since getting covid. Did blood tests and it was revealed her Vitamin D is super low. Getting pills for that now as apparently it is so low sunshine alone wont do the job.",
            "title_similarity": "0.61851907",
            "sentiment_compound": -0.0599
        },
        {
            "id": "hvsdnoq",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvt0a7l",
            "score": 119,
            "text": "Interesting work, but the sample size is 10 people. Hope they go back and expand their study so we can begin to consider these ideas",
            "title_similarity": "0.5226528",
            "sentiment_compound": 0.8248
        },
        {
            "id": "hvsl7vk",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvtewog",
            "score": 91,
            "text": "6 of the 55 patients edit: were (not where) between 38-58 years of age - the rest were over 66 years of age.. would love to see some data on patients specifically under 45- seems like if u have 49 70-80 year olds in a study you would be likely to find dementia like symptoms/ damage to brain just due to age and suffering from illness/stress",
            "title_similarity": "0.7345849",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hvspujh",
            "score": 24,
            "text": "Could it be that neurons die because of lack of oxygen associated with covid?",
            "title_similarity": "0.50077415",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hvsh88p",
            "score": 225,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsy71g",
            "score": 365,
            "text": "I am an MD doing a PhD on Alzheimer’s disease. \n\n\nI don’t think it is unreasonable to think that Covid-19 infections could be linked to increased risk of developing Alzheimer’s disease in the future. There is data indicating that might be the case. \n\n\nIn fact, one of the largest growing concerns amongst dementia researchers is the impact that wide spread Covid-19 might have on the prevalence of dementia.",
            "title_similarity": "0.72331727",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hvsl08g",
            "score": 40,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvsuhsz",
            "score": 486,
            "text": "I remember when I worked at a clinic last fall in the department of neuropsychology and we had a patient who was admitted because of severe memory problems. I read his sheet and the diagnosis was \"SARS-CoV-2\". That was the moment where it kind of hit me that I always underestimated the long-term damages of Corona. \nThe patient became better but never as good as before his infection.",
            "title_similarity": "0.76011175",
            "sentiment_compound": -0.7277
        },
        {
            "id": "hvsqg8e",
            "score": 367,
            "text": "I wonder if this is linked to what we in the hospital call “COVID brain”.  Patients become unresponsive from encephalopathy.  Or confused and agitated and won’t leave their high-flow oxygen or Bipap on and are more likely to be placed on a ventilator.",
            "title_similarity": "0.5644256",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hvsel5h",
            "score": 1434,
            "text": "I work as project coordinator in a clinical trial for a tracer (similar to a contrast) used in PET scans that can detect the amount TAU proteins found in the brain. Very curious to compare the results of participants before and after 2020.",
            "title_similarity": "0.62347627",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hvsfvhb",
            "score": 4546,
            "text": "Maybe it's only because it's an area of research that I'm working in but, the amount of papers that have been linking COVID-19 to Alzheimer's disease is crazy. Just Google 'covid-19 and apoe-4\" and you'll get dozens of papers, and that's just one gene .\nAPOE-4 is a gene commonly thought of as a AD risk factor, it's also been linked to an increased rate of \"chemo-brain\" or \"brain-fog\" during chemotherapy. Now, it's been linked an increased sensitivity to COVID-19 infection, and that same increase in \"brain-fog\"\n\nEdit Grammar; 4am Reddit isn't my best writing time.",
            "title_similarity": "0.75862575",
            "sentiment_compound": -0.4682
        },
        {
            "id": "hvsw0hg",
            "score": 2,
            "text": "The problem is that the glymphatic system will probably be doing upkeep for the next few years. So, those are things I can reccomend to help it clean up the gunk remaining from virulence and regular actiivity",
            "title_similarity": "0.63323694",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hvsyf8o",
            "score": 139,
            "text": "What is the treatment for \"brain-fog\"? Is there any research put into it?",
            "title_similarity": "0.5102042",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvt0nim",
            "score": 1,
            "text": "Is this legit? How much data do we have on this? Are we about to get mad cow disease’d in 10 years time!",
            "title_similarity": "0.5425234",
            "sentiment_compound": -0.593
        },
        {
            "id": "hvt0rkd",
            "score": 2,
            "text": "They're suffering brain damage because they're suffering from hypoxia. If you suffocate your brain long enough, it's going to be damaged.",
            "title_similarity": "0.6236546",
            "sentiment_compound": -0.9062
        },
        {
            "id": "hvt19bx",
            "score": 1,
            "text": "Are these reversible or temporary changes? I always thought alzheimer is a one way ticket",
            "title_similarity": "0.5363375",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvt1flx",
            "score": 5,
            "text": "Dumb question: can someone get a genetic test done and have a simplified table to what they might have to deal with someday ?",
            "title_similarity": "0.5040275",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hvt1m76",
            "score": 1,
            "text": "Not a doctor or medical professional … I work adjacent to long term care. \n\nIn the first months of the pandemic, I watched as Covid ravaged memory care units quickly infecting and killing AD residents but somehow sparing those with vascular dementia or Lewy Body Disease. \n\nAlthough I was heartbroken by the losses , I saw a silver lining that researchers would likely have breakthroughs in AD research which could lead to earlier diagnosis and effective treatments.",
            "title_similarity": "0.7392868",
            "sentiment_compound": -0.4854
        },
        {
            "id": "hvt2q3m",
            "score": 7,
            "text": "How come nobody has asked if these patients have had any doses of the covid vaccine?",
            "title_similarity": "0.37426022",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvt39v1",
            "score": 1,
            "text": "I’m no expert in this area, but I did see in the study that the molecular connection to long Covid in the brain is not understood. I may be grasping at straws (I had Covid) but have there been studies that definitively connect Covid to long term brain damage. Most of them are people self reporting symptoms, which for highly subjective things like memory loss, brain fog, is suspect. In early days, the Brit’s performed autopsy’s and found nothing in the brains of Covid victims, but those were early days. Thanks.",
            "title_similarity": "0.68302876",
            "sentiment_compound": -0.7273
        },
        {
            "id": "hvt3kd6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvt447f",
            "score": 14,
            "text": "Man as someone who watched their mom waste away from early onset starting in elementary/middle school this is genuinely my nightmare. Covid just ran through our house finally, my husband, my children, and me. I’m so ready for all of those “scientists have found a breakthrough in Alzheimer’s research” articles that pop up annually to be accurate and for this to be just done. Brain fog has been wrecking me lately, I’ve been done with Covid quarantine for only 2 weeks but it’s still getting me with this damn fog. The despondent feeling just from scrolling through the comments right now is honestly overwhelming. It’s only 7 am where I’m at and I’m done with Reddit for today.",
            "title_similarity": "0.6400269",
            "sentiment_compound": -0.5215
        },
        {
            "id": "hvt715m",
            "score": 1,
            "text": "Is there any research on whether COVID could trigger dementia early for those who are predisposed to having it later in life?",
            "title_similarity": "0.65995574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvt7cdk",
            "score": 1,
            "text": "Is there any approach to find a way to cure this?",
            "title_similarity": "0.33945554",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvt867g",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvt94el",
            "score": 1,
            "text": "Is this happening because of a lack of oxygen? Or something else",
            "title_similarity": "0.2358246",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hvt99bw",
            "score": 1,
            "text": "So they’re saying that CoVid has caused the buildup of tau proteins in the brain?",
            "title_similarity": "0.55364025",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvtaiu2",
            "score": 1,
            "text": "Right from the first seemingly legitimate reports of long-COVID, it has been my primary fear personally and my primary concern societally.\n\nPutting my personal fears aside, what are the implications for the workforce, the healthcare system, and the long-term care system?",
            "title_similarity": "0.48292142",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hvtbdvl",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvtc8vt",
            "score": 1,
            "text": "Could it be as simple as lower oxygen levels = dead brain cells? Or at least something along these lines have an atrophy-like effect on the brain? I’m just curious if other similar conditions have a similar effect on the brain",
            "title_similarity": "0.664649",
            "sentiment_compound": -0.6767
        },
        {
            "id": "hvtgeur",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvtgh3j",
            "score": 1,
            "text": "Do all viruses affect the brain, or is this something specific to covid?",
            "title_similarity": "0.55055356",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvth4sj",
            "score": 2,
            "text": "I am a radiochemist and I make pet tracers for a living. AFAIK pet tracers are the only confirmatory test for alzheimers disease that can directly measure beta amyloid plaques en vivo. I know that we do FDG scans for covid patients currently as I see it on our work schedule all the time but I'm not sure exactly what they're looking for. FDG is glucose-based PET tracer that allows us to image glucose metabolism in the body. It is most commonly used to image for cancer but can also be used to show relative brain activity in different parts of the brain in patients.",
            "title_similarity": "0.6616689",
            "sentiment_compound": -0.8605
        },
        {
            "id": "hvtla5n",
            "score": 1,
            "text": "Morbid as it is, we're gonna need a sizably larger study before we can turn \"may\" into \"likely\".\n\n(In other words: *\"further research is needed\").*",
            "title_similarity": "0.31837595",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvtlxr8",
            "score": 1,
            "text": "That kind of discovery is very unsettling. Is it only determined by autopsy after the person dies or is there some other way to determine it more quickly with an alive human being? Over time the disease takes over and becomes manifest of course. If certain persons who get COVID then get Alzheimer's that is very scary. BUT if those who already have the tendency to get it or are in the early stages of it and then get COVID then it is not related. How long before we know which it is?",
            "title_similarity": "0.71750563",
            "sentiment_compound": 0.2877
        },
        {
            "id": "hvtmmqz",
            "score": 1,
            "text": "It will be interesting to see long term studies.  My wife's mom and grandmother had/have Alzheimer's.  My wife got Covid (Delta) late 2020 and totally had Covid brain fog.  For a good 6-9 months I thought she was in early stages of Alzheimer's.  I had to repeat everything.  Forgetful.  Absent minded. Couldn't track a conversation. Etc.   She seems to be better but I wonder if it accelerated anything.  (She's 55).",
            "title_similarity": "0.71912634",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hvtmpc9",
            "score": 1,
            "text": "Isn't this common in obesity in general? Most covid deaths are in obese people.",
            "title_similarity": "0.5201597",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvtn993",
            "score": 1,
            "text": "I would think reduced oxygen is pretty bad for the brain. Especially considering those are the cells most unable to replace themselves.",
            "title_similarity": "0.4775263",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hvtnizt",
            "score": 1,
            "text": "What is most unsettling is that this was created, by us, humans, in a lab. We have only ourselves to blame.",
            "title_similarity": "0.40218076",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hvto0ne",
            "score": 1,
            "text": "I'm hoping it isn't permanent. I find it harder to multi task and remember simple things now. Small mistakes but they are frustrating.",
            "title_similarity": "0.41791606",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hvtp4ec",
            "score": 1,
            "text": "This is a great disease for kids.",
            "title_similarity": "0.33765274",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hvtp9q6",
            "score": 1,
            "text": "Great so the old people with all the houses and money can continue to be deadbeats living off the work of the younger masses in the broken system they helped create.",
            "title_similarity": "0.52375346",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hvtq4f4",
            "score": 1,
            "text": "Could this be a vaccine reaction? Is that question being asked? I just asked it.",
            "title_similarity": "0.40488076",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvtqrkd",
            "score": 1,
            "text": "What it Covid-19 was there since a longer time but the people who go it forgot about it, due to the Alzheimer they got from it?",
            "title_similarity": "0.6317711",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvtquj6",
            "score": 1,
            "text": "They should just rename this sub to /r/commentersmisreadingstudies",
            "title_similarity": "0.34288403",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvtr5rf",
            "score": 1,
            "text": "A colleague I work with had to start taking ADHD medication after getting COVID. She had memory loss and difficulty concentrating even a year later. One time she forgot that she already bought her halloween costume and proceed to buy another one. Pretty scary...",
            "title_similarity": "0.66972494",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hvtrbsx",
            "score": 1,
            "text": "it is almost like this virus was created in a lab or something",
            "title_similarity": "0.5095013",
            "sentiment_compound": 0.4951
        },
        {
            "id": "hvts1xf",
            "score": 1,
            "text": "I’m curious about TBI and apoe. Can anyone here lend any information? I’ve googled a lot but anything I might have missed would be awesome!",
            "title_similarity": "0.49360666",
            "sentiment_compound": 0.6996
        },
        {
            "id": "hvts8tw",
            "score": 1,
            "text": "You mean in the brains of dead 86 year Olds.",
            "title_similarity": "0.4488418",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hvtsby9",
            "score": 1,
            "text": "This is so scary considering the huge numbers of those who \"survived\" COVID and it was no big deal. My mom was a polio survivor and decades later was diagnosed with post-polio syndrome and five year later early onset drmu. We lost her by 65.",
            "title_similarity": "0.60830283",
            "sentiment_compound": -0.1321
        },
        {
            "id": "hvtsera",
            "score": 1,
            "text": "Ahhhh so that’s why my memory’s bad",
            "title_similarity": "0.38397664",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hvtt80h",
            "score": 1,
            "text": "That is terrifying, considering that I had long haul covid19 and one of the worst results of having had it has been my poor memory!",
            "title_similarity": "0.4304945",
            "sentiment_compound": -0.9041
        },
        {
            "id": "hvttdvw",
            "score": 1,
            "text": "Could this also explain the rise of people with no critical thinking skills who are antivaxers?",
            "title_similarity": "0.4324314",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hvttksn",
            "score": 3,
            "text": "Related and a fairly relevant study that I got in one my Academic Feeds:\n\nCovid mimics Infection: Comprehensive investigations revealed consistent pathophysiological alterations after vaccination with COVID-19 vaccines\n\n\n[Comprehensive investigations revealed consistent pathophysiological alterations after vaccination with COVID-19 vaccines | Cell Discovery](https://www.nature.com/articles/s41421-021-00329-3)\n\n-----\n\nAbstract\n\nLarge-scale COVID-19 vaccinations are currently underway in many countries in response to the COVID-19 pandemic. Here, we report, besides generation of neutralizing antibodies, consistent alterations in hemoglobin A1c, serum sodium and potassium levels, coagulation profiles, and renal functions in healthy volunteers after vaccination with an inactivated SARS-CoV-2 vaccine. Similar changes had also been reported in COVID-19 patients, suggesting that vaccination mimicked an infection. Single-cell mRNA sequencing (scRNA-seq) of peripheral blood mononuclear cells (PBMCs) before and 28 days after the first inoculation also revealed consistent alterations in gene expression of many different immune cell types. Reduction of CD8+ T cells and increase in classic monocyte contents were exemplary. Moreover, scRNA-seq revealed increased NF-κB signaling and reduced type I interferon responses, which were confirmed by biological assays and also had been reported to occur after SARS-CoV-2 infection with aggravating symptoms. Altogether, our study recommends additional caution when vaccinating people with pre-existing clinical conditions, including diabetes, electrolyte imbalances, renal dysfunction, and coagulation disorders.\n\n-------\n\nSelected bits:\n\n\"Upon SARS-CoV-2 infections, many people developed various degrees of respiratory syndromes, and some with gastrointestinal conditions. It had been reported that blood coagulation disorders, vasculature issues, electrolytes imbalances, renal disorders, metabolic disorders, etc. were major clinical complications with COVID-1916,17. The manner in which vaccination would mimic an infection has not been fully evaluated. In this study, we enrolled healthy volunteers who were to be vaccinated with an inactivated SARS-CoV-2 vaccine (Vero Cell)3, to participate in antibody and neutralizing antibody testings, as well as detailed clinical laboratory measurements before and at different times after vaccination (two-dose regimens with slightly different schedules were applied). To our surprise, we observed quite consistent pathophysiological changes regarding electrolyte contents, coagulation profiles, renal function as well as cholesterol and glucose metabolic-related features, as if these people had experienced an infection with SARS-CoV-2. In addition, PBMCs scRNA-seq results also indicated consistent reductions in CD8+ T cells and increases in monocyte contents, as well as enhanced NF-κB inflammatory signaling, which also mimicked responses after infection. Surprisingly, type I interferon responses, which had been linked to reduced damages after SARS-CoV-2 infection and milder symptoms, appeared to be reduced after vaccination, at least by 28 days post the 1st inoculation. This might suggest that in the short-term (1 month) after vaccination, a person’s immune system is in a non-privileged state, and may require more protection.\"\n\nAnd;\n\n\"To study detailed gene expression changes induced by vaccination, we merged individual samples into pseudo-bulk samples and used paired sample test to identify differentially expressed genes (DEGs) (Fig. 3h and Supplementary Table S9). Significantly upregulated genes were involved in “TNFα signaling via NF-κB”, “inflammatory responses”, and “cytokine-cytokine receptor interaction”, “IL6-JAK STAT3 signaling”, “coagulation”, “hypoxia”, which had been reported for COVID-19, while cell cycle-related pathways were downregulated (Fig. 3i). These results supported the notion that vaccination mimicked an infection6,7,8,9,10,11,12.\"\n\n\nObviously, and I suggest it, to read the whole thing.",
            "title_similarity": "0.63029385",
            "sentiment_compound": 0.959
        },
        {
            "id": "hvttzm4",
            "score": 1,
            "text": "The evidence for the alzheimer is caused by pathogens hypothesis keeps building.",
            "title_similarity": "0.6373222",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvtu9ic",
            "score": 3,
            "text": "Neuroscientist here, it's worth pointing out that obesity and diabetes (both conditions which increase the risk of severe outcomes with covid) are *also* associated with increased risk of Alzheimer's.\n\nI know many folks in gerontology that actually refer to Alzheimer's colloquially as \"diabetes type III\".\n\nAll that said, this is a potentially difficult association to unravel, did covid cause these neurological changes, or did the patients already have them -- more likely, it's an interaction of the two.",
            "title_similarity": "0.7018776",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hvtue88",
            "score": 1,
            "text": "I wish I could blame my memory problems on covid, but I think I'm just stupid.",
            "title_similarity": "0.50251293",
            "sentiment_compound": -0.743
        },
        {
            "id": "hvtugaa",
            "score": 2,
            "text": "Great now we have to worry about covid turning the world into idiocracy for real",
            "title_similarity": "0.30410612",
            "sentiment_compound": 0.296
        },
        {
            "id": "hvturw5",
            "score": 1,
            "text": "Holy crap, what we know about this disease gets worse every day.",
            "title_similarity": "0.43375328",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hvtxpi0",
            "score": 1,
            "text": "I think a small problem with this is that one doesn’t know if the patients had the beginnings of Alzheimer’s in the first place, being as the average age of death for CoVid is in the same age group as when Alzheimer’s begins to manifest itself, as far as I know.",
            "title_similarity": "0.70819616",
            "sentiment_compound": -0.765
        },
        {
            "id": "hvty0ox",
            "score": 1,
            "text": "How do I check for this in SNPedia?",
            "title_similarity": "0.2887533",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvtz4lc",
            "score": 1,
            "text": "Viral dementia is a well known phenomenon. The way viruses can interfere with proteostasis and drive chronic ER-stress, trigger Type-1 interferon inflammation, and more makes viruses powerful drivers of neurodegeneration. \n\nhttps://pubmed.ncbi.nlm.nih.gov/16526945/\n\nIf you're vaccinated against viruses whenever possible, you are far less likely to get a virus based neuropathology.\n\nBeing vaccinated is about way more than just preventing infection. It's also about attenuating and shortening the length of infections so you don't get worse side effects from a virus or other pathogen in the long term.",
            "title_similarity": "0.6745629",
            "sentiment_compound": 0.7472
        },
        {
            "id": "hvu0134",
            "score": 2,
            "text": "Is it just SARSII that does this? Do we know if any other corona viruses do this? Has it even been looked into?",
            "title_similarity": "0.41748893",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvu2s1p",
            "score": 2,
            "text": "To the people who think they're intelligent by pointing out the fact that COVID generally affects older people more, and older people are more at risk for Alzheimer's too, it's not that hard to actually click the link and check the sample:\n\n\"Age- and sex-matched controls exhibited absence of neurological disorders and cardiovascular or pulmonary diseases.\"",
            "title_similarity": "0.72043204",
            "sentiment_compound": 0.2306
        },
        {
            "id": "hvu5ykx",
            "score": 1,
            "text": "It would be pretty wild if we made fundamental discoveries about Alzheimer's or other diseases as a result of Covid.",
            "title_similarity": "0.63368785",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hvu6qdi",
            "score": 1,
            "text": "Why is there so many links between covid and futur health impacts ? Is it the same with other viruses ?",
            "title_similarity": "0.59695613",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvu8m6v",
            "score": 1,
            "text": "Is it because they had trouble breathing so the oxygen deprivation impacted their brains?",
            "title_similarity": "0.5091543",
            "sentiment_compound": -0.6969
        },
        {
            "id": "hvubx0p",
            "score": 2,
            "text": "Control group should probably include only people with non-COVID pulmonary disease, if you want to isolate COVID-19 effects - it's well known that respiratory tract failure is [associated with dementia](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4616489/).\n\nTherefore, found effects can be caused not by virus directly, but by oxygen deprivation.",
            "title_similarity": "0.6212358",
            "sentiment_compound": -0.6757
        },
        {
            "id": "hvugx9w",
            "score": 1,
            "text": "The long term effects of Covid may prove taking the shot is well worth it regardless how skeptical you are.",
            "title_similarity": "0.43707627",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hvui1hf",
            "score": 1,
            "text": "So COVID-19's effects range include,\n\nnothing\n\nmild cold\n\nbad flu\n\nheart disease\n\nkidney damage\n\nother vascular damage\n\nliteral AIDs effectively\n\nbrain damage akin to Alzheimer's\n\nedit: forgot about brain damage that affects taste, smell, and other central nervous system functions.\n\nand it transmits at least twice as effectively as the flu. Am I missing anything?",
            "title_similarity": "0.67080593",
            "sentiment_compound": -0.8151
        },
        {
            "id": "hvun6uf",
            "score": 1,
            "text": "When you got multisystem organic problems because of covid you got probably a brain damage? Not alzheimer because of covid or am i false?",
            "title_similarity": "0.72866166",
            "sentiment_compound": -0.7399
        },
        {
            "id": "hvunpek",
            "score": 1,
            "text": "This is scary information",
            "title_similarity": "0.13088721",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hvunwhc",
            "score": 1,
            "text": "Is this study also suggesting that COVID-19 has an impact on the brain's ability to regulate emotions and possibly leading to increased feelings of depression?",
            "title_similarity": "0.64096653",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hvupq8l",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14625205"
        },
        {
            "id": "hvupxtb",
            "score": 1,
            "text": "What does a long term COVID sufferer mean?",
            "title_similarity": "0.37708366",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hvur3kb",
            "score": 1,
            "text": "More data please. So far, this is basically anecdotal.",
            "title_similarity": "0.27568695",
            "sentiment_compound": 0.3774
        },
        {
            "id": "hvv2ki8",
            "score": 3,
            "text": "I was told a decade ago that my coxsackie virus got into my brain and that's why I stoped being able to walk and had brain fog.  \n\nMy specialist has autopsied brains of others who died with my same virus and evidently he can see the damage with the naked eye.\n\nThey said \"Viruses just do that sometimes sorry.  You'll either get better... or you wont.\"\n\nI didnt.",
            "title_similarity": "0.7541773",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hvv2ug4",
            "score": 1,
            "text": "Could it be that the one of the causes of Alzheimers is due to a viral infection in the brain?",
            "title_similarity": "0.6899355",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvv4eft",
            "score": 1,
            "text": "I am eagerly awaiting all the research and information to come about this. I got COVID before we knew it was COVID. I work in a retail establishment that EXPLODED with business while a mysterious illness was going on. I ended up seeing my gyno believing I was perimenopausal due to my bizarre symptoms. He told me I most certainly had a virus but he couldn’t guess what type. I had fatigue and sweating beyond anything I had ever experienced before. Plus a slew of other symptoms. Anyway my general care doctor told me it was definitely COVID before we recognized it as such. \n\nI have developed such awful brain fog that hasn’t seemed to get better at all. Infact it’s been getting worse. I am terrified of what this means for me. I am terrified of AD or dementia developing. I have known for awhile now that I am different and something is wrong. So many symptoms that are wrecking havoc on me. This is a field I can only hope we will continue to investigate and find some good news in.",
            "title_similarity": "0.6185993",
            "sentiment_compound": -0.9274
        },
        {
            "id": "hvv4ljt",
            "score": 1,
            "text": "This is scary and why I don't even want to get the virus. This is no flu",
            "title_similarity": "0.21831582",
            "sentiment_compound": -0.3045
        },
        {
            "id": "hvv7kub",
            "score": 1,
            "text": "Thank you for sharing this info everyone!",
            "title_similarity": "0.24145022",
            "sentiment_compound": 0.68
        },
        {
            "id": "hvv8cxm",
            "score": 1,
            "text": "Could someone explain the article to me? the terms used are too complex for me to understand and overall I'm not sure what information I should take from it.",
            "title_similarity": "0.31878924",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hvvc8lb",
            "score": 1,
            "text": "What would be so cool is if by researching this they found a cure for Alzheimer’s or at least learned more about it. My dad has Alzheimer’s so it would be awesome to see!",
            "title_similarity": "0.6912969",
            "sentiment_compound": 0.8117
        },
        {
            "id": "hvvh9du",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvvh9pv",
            "score": 1,
            "text": "Is this for all variants?",
            "title_similarity": "0.10345372",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvvl3qr",
            "score": 1,
            "text": "Is this article claiming people who are already born with the APOE gene is developing Alzheimer’s after covid or is covid itself encoding these genes to people with cognitive problems after having covid?",
            "title_similarity": "0.8153528",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hvvolai",
            "score": 1,
            "text": "Does the vaccine do the same thing? Doublr vaxxed here but my dad had alzheimers and my half brother who is 50 something has started showing some signs",
            "title_similarity": "0.69470817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvvq76m",
            "score": 1,
            "text": "Oxygen deprivation will do that",
            "title_similarity": "0.26153877",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hvvyz59",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvw8ha3",
            "score": 1,
            "text": "My local university just found that covid has the same effect on lymphocytes has aids..... (to a lesser intensity)",
            "title_similarity": "0.6426488",
            "sentiment_compound": 0.0
        },
        {
            "id": "hvwfh5a",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.08305133"
        },
        {
            "id": "hvwggzh",
            "score": 1,
            "text": "The majority of those who died due to COVID-19 are  70 y.o and up. So molecular changes found in the brain could possibly be due to them already suffering from mild Alzheimer's or old age pre-infection. It would make sense that way. However, this is a valuable insight into how the disease may affect the brain.",
            "title_similarity": "0.88814485",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hvy5pf9",
            "score": 1,
            "text": "90%+ of covid deaths in the US were people older than 50 up to over 80 years of age. Does that have something to do with the correlation of Alzheimer's? If so then it's misleading to say covid somehow causes Alzheimer's across all age groups when the majority of the dead were at risk for Alzheimer's already.",
            "title_similarity": "0.6396128",
            "sentiment_compound": -0.8542
        },
        {
            "id": "hvyodj7",
            "score": 1,
            "text": "I’m sitting here reading this and thinking “hmm, patients that die of Covid are really dying from lack of oxygen, hence the ventilation, and hypoxia does similar things to the brain as Alzheimer’s, could it just be lack of oxygen..?”\n\nSo I looked into it, [found this.](https://www.brighamhealthonamission.org/2020/07/29/deceased-covid-19-patients-show-hypoxic-injury-in-the-brain/).\n\n“Our findings showed high levels of hypoxic-ischemic injury, which is to be expected in patients with severe lung disease,” says Isaac Solomon, MD, PhD, a pathologist in the Brigham’s Department of Pathology.",
            "title_similarity": "0.74125373",
            "sentiment_compound": -0.9211
        }
    ]
}