{
    "Consuming small doses of psilocybin at regular intervals — a process known as microdosing — does not appear to improve symptoms of depression or anxiety, according to new research.\n": [
        {
            "id": "hw1277l",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.42768136",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hw15nbf",
            "score": 7,
            "text": "I'm glad to see real science about this. I'm very leary of the idea of self medication.",
            "title_similarity": "0.31764698",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hw16s7a",
            "score": 33,
            "text": "I'd be interested to know who funded the study.",
            "title_similarity": "0.22457281",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hw13z2n",
            "score": 246,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1uyjg",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1nrv8",
            "score": -10,
            "text": "Still better than SSRIs....",
            "title_similarity": "0.38629526",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw2btlh",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.31197834"
        },
        {
            "id": "hw16t0r",
            "score": -18,
            "text": "Except multiple studies plus numerous personal accounts say otherwise. Back when I first did mushrooms and ecstasy I only knew the drugs as party drugs and just wanted to have a good time, but they ended up being the most life changing things I have ever done. From my own experience I can 100% back all the claims about helping with depression, social anxiety, and suicidal tendencies.",
            "title_similarity": "0.49662942",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hw12dgt",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1p3kh",
            "score": 5,
            "text": "Not a good move to completely rely on mind altering drugs to pull you out of depression.",
            "title_similarity": "0.7936301",
            "sentiment_compound": -0.7274
        },
        {
            "id": "hw216ic",
            "score": -1,
            "text": "Considering the massive body of research showing otherwise, I’m very suspicious of this study.",
            "title_similarity": "0.51479816",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hw2e4bw",
            "score": 1,
            "text": "Here is my study:  It works for me and I've seen it personally work for three others out of the 5 people I know that have tried it, so 80% success rate.",
            "title_similarity": "0.26028746",
            "sentiment_compound": 0.6096
        },
        {
            "id": "hw2obcx",
            "score": 1,
            "text": "Wondering about the sample size?\n\n>Of 75 initial participants, 63 completed the baseline measures, 68 completed session 1 (S1), 61 completed session 2 (S2), 59 completed session 3 (S3) and 56 completed session 4 (S4). We did not collect information as to their motivations for dropping out of the study. Thus, 58 participants completed measures at both S1 and S3, 55 completed measures at both S2 and S4 and 49 completed measures at baseline, S2 and S4. We further excluded participants from the analysis who did not comply with the behavioural guidelines: 6 participants in S1 and S3, and 11 participants in sessions S2 and S4. These participants either consumed other psychoactive substances during the study or deviated in their microdosing schedule from acceptable conditions of dosing. The acceptable conditions include that participants should dose between 5 and 7 doses per 3 weeks, that they leave at least 1 day between doses, that they take the full doses and that they ingest their dose within 45 min to 2.5 h before each lab session. Thus, for the repeated-measures analyses further discussed below, 52 participants were included for S1 and S3, consisting of 29 females and a mean age of 29.75 (ranging from 29–60) years and 44 were included for S2 and S4, consisting of 21 females and a mean age of 30.6 (ranging from 20–60) years.\n\nBasically 50 people without mental health issues took a one-size-fits-all microdose and reported statistically insignificant (but not zero) improvements in mental health. The authors also acknowledge that as many as half the participants figured out which group they were on, which *may* have affected their responses.\n\nGive the results of this study the weight it deserves, which is \"not much.\"",
            "title_similarity": "0.6945764",
            "sentiment_compound": -0.5489
        },
        {
            "id": "hw1vis7",
            "score": -3,
            "text": "If you're not doing shrooms in 2022 sucks to be you, depression or no",
            "title_similarity": "0.622818",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hw1ezx4",
            "score": 35,
            "text": "Definitely did not help my anxiety. Probably made it worse, to be honest. It was pretty fun otherwise though. \n\nReally wish people would stop trying to claim recreational drugs are secretly miracle cures to everything. What actually helped my anxiety was benzos and SSRIs. Things I avoided for a decade because of the stigma around them.",
            "title_similarity": "0.7154878",
            "sentiment_compound": 0.8794
        },
        {
            "id": "hw1g15q",
            "score": 0,
            "text": "Microdosing had almost no impact on me, however I took a large dose once (6g) and felt absolutely nothing because it turned out my antidepressants dulled the effects. However, even though I didn’t trip or hallucinate, the positive impact it had on my life was immense. I’ve never felt such positivity, I changed my whole life after that. It was like the world was brighter and it was just easier to be happier or to do things. It never erased my depression, but it did make it easier for me to work through those emotions. It didn’t last forever though, after about 3 months I began to notice everything seemed dimmer, it was becoming increasingly more difficult for me to get up and be positive. I’ve tried taking shrooms again, but it hasn’t had the same effect.",
            "title_similarity": "0.6692811",
            "sentiment_compound": 0.8958
        },
        {
            "id": "hw1fwrw",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw16dfn",
            "score": -31,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw17bmc",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw168pt",
            "score": -28,
            "text": "This is not a creditable source.",
            "title_similarity": "0.45779073",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hw1lntw",
            "score": -1,
            "text": "Lots of studies, lots of findings",
            "title_similarity": "0.00856395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1q1tq",
            "score": 2,
            "text": "No one is micro-dosing to manage depression/anxiety. That’s predominantly being researched in conjunction with macro-dosing.\n\nThe micro-dosing argument was always about assisting with focus and the ability to concentrate throughout the day.",
            "title_similarity": "0.63172674",
            "sentiment_compound": -0.34
        },
        {
            "id": "hw1t4jb",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1dyno",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.31197834"
        },
        {
            "id": "hw1j3p2",
            "score": 0,
            "text": "You need a whole dose",
            "title_similarity": "0.075085625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1j42z",
            "score": 0,
            "text": "I've never micro dosed but I have taken them once a year and so far I feel they really helped me flip a switch on my negative self talk and worldview. Ultimately feeling more connected to the universe made me less pissed off at the world. But that was just my personal experience with them thus far.",
            "title_similarity": "0.5579617",
            "sentiment_compound": -0.8924
        },
        {
            "id": "hw1m6ow",
            "score": 0,
            "text": "Pretty convenient all these studies coming out to prove that non traditional medicine is all placebo effects",
            "title_similarity": "0.37467968",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hw1pini",
            "score": 0,
            "text": "Ugh, where tf is the dose amount? That fact could change the whole conclusion of this experiment.",
            "title_similarity": "0.44373125",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hw44dcl",
            "score": 0,
            "text": "I was always under the impression that the benefit of psilocybin was from the ego death, and one cannot experience an ego death thru microdosing.",
            "title_similarity": "0.6566856",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hw163ql",
            "score": 342,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw17103",
            "score": 12,
            "text": "The existing research about psilocybin for depression and anxiety backs a single dose at 25mg (that's roughly 40g fresh or 5g dried mushrooms). Very high efficacy in treating depression at that dose, although that's a pretty heavy trip. Microdosing so far hasn't been demonstrated in studies, so I'm not surprised this one doesn't either.",
            "title_similarity": "0.66845834",
            "sentiment_compound": -0.6937
        },
        {
            "id": "hw194hv",
            "score": -2,
            "text": "This also aligns with my personal research.",
            "title_similarity": "0.21206704",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw19b82",
            "score": -2,
            "text": "Well, it helped me A LOT with my OCD, and just yesterday I got a message from the wife of my boss saying that they had the best weekend of their relationship and she said it was thanks to the mushrooms he got. He haves PTSD and lives anxious at the point that sometimes he can't even function.\nThey weren't too micro anyways.",
            "title_similarity": "0.48705584",
            "sentiment_compound": 0.802
        },
        {
            "id": "hw29q5r",
            "score": 2,
            "text": "A study with 52 participants. A study of this size would never detect the effect of SSRI's either. Placebo is 80% as effective as SSRI's in trials, you need thousands of people to determine statistical significance.",
            "title_similarity": "0.5307432",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hw1wvwe",
            "score": -3,
            "text": "You can’t treat depression with medicating. There are depressive habits that need to be eliminated. There are more than 20 of them affecting various brain parts.",
            "title_similarity": "0.72673345",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hw1bqfy",
            "score": -15,
            "text": "Uhhh, what? Theres a plethora of research that says the exact opposite. Anecdotal but i have microdosed on a regiment directed by a therapist after several critical incidents in my former job that left me with complex ptsd; it absolutely helped with my mental health in amazing ways.",
            "title_similarity": "0.547933",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hw177m9",
            "score": 23,
            "text": "But what about just 2 or 3 large doses? Under supervision, of course. I've read that up to something like 70% say they have a life altering experience. One that \"flips a switch\" on how they view things. Relieving depression that had been resistant to other treatments.",
            "title_similarity": "0.55073166",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hw19h0x",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1hlwx",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1fcrd",
            "score": 4,
            "text": "I've met many people that say psilocybin has helped them, and a lot of people that are definitely \"spun\" too, or the after effects of too much over a period of time, usually from lsd though. But I honestly want to know of more people out there that react badly to mushrooms like I do. I used to do L often when I was younger. And it took years before I suddenly started having bad trips. I've done shrooms a total of three times and 2 out of the  three times were horrible. The only good trip I had was a tea brew. There should be studies on the negative side effects and what exactly makes someone have a bad trip because there's not much information on that. I used to think perhaps it increased anxiety and paranoid when I never used to be paranoid. Or maybe, I already had anxiety throughout my whole life and it just made it more apparent. Do only anxious people and manic personalities create bad trips? Or is it something more? Is it gender specific or hormonal imbalances? Has anyone else had bad trips?",
            "title_similarity": "0.5689943",
            "sentiment_compound": -0.9742
        },
        {
            "id": "hw1rl1o",
            "score": 36,
            "text": "All I really have on it is anecdotal. My experience with macro and mini dosing (.5g-1g) has varied in efficiency. I’ve found my most profound and beneficial experiences to be with doses >2g. Mini dosing can give me a feeling of unity and compassion while mini doses can get me to break down my ego and evaluate my life. I’ve found picking something I want to focus on changing and thinking about that subject has been the most beneficial. I’ll give the example of my alcoholism. I have created mental blocks keeping me from thinking about how my drinking had affected people but when I took a macro dose and was ready to address the issue and focused on it I was able to evaluate my problem without my ego and those barriers getting in my way. I could look at how I had hurt people and myself and what I knew I needed to do to change that. It helped me quit drinking and I am almost 1 year sober from alcohol. I have had experiences with it where I didn’t feel like I had any benifit from taking it and just got anxiety from it. \n\nI like to view it like this. You have a house and there’s a room in it that’s locked that you can’t see in but know it’s a mess and it’s starting to stink up the rest of the house. Benzos make you forget the room exists and forget it smells or not care that it smells. Ssri’s make you not mind the smell or that there’s a mess or like the smell. And mushrooms are a key to open that room. You still have to put in the work to clean the room, but you have a way of fixing it. It might fill back up with other junk but you can get the key again and clean it up if you’re willing to put in the work.",
            "title_similarity": "0.5789139",
            "sentiment_compound": 0.6637
        },
        {
            "id": "hw1i20x",
            "score": 4,
            "text": "Why does no one talk about HPPD? I hadn’t even heard of it until I had it.",
            "title_similarity": "0.55288494",
            "sentiment_compound": -0.296
        },
        {
            "id": "hw1wfxy",
            "score": -2,
            "text": "Said the person who ate mushrooms and had a bad time.",
            "title_similarity": "0.51602817",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hw1948z",
            "score": -1,
            "text": "Since I’ve tripped normally, and understand the mental and emotional “reset” button that psilocybin helps reset. I’ve personally noticed Microdosing psilocybin helping with depression and clear headspace. Anxiety and focus? Nadda. But this wasn’t the same schedule as the research team. I was on everyday for around 2 years and would certainly notice a “drop off” if I had missed a daily dose of psilocybin. But I also have inattentive ADHD. So, that could be something to do with it.",
            "title_similarity": "0.6630008",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hw1aplc",
            "score": -1,
            "text": "After reading the comments I really became interested in taking shrooms, since I have anxiety/ depression. However, I had some real bad horrortrips on weed and I am afraid that this could happen on shrooms as well. Would you suggest doing it anyway?",
            "title_similarity": "0.57064533",
            "sentiment_compound": -0.5888
        },
        {
            "id": "hw1cigl",
            "score": -1,
            "text": "Correct me if I’m wrong. But taking mushrooms works by unlocking new neural paths or connections to the frontal lobe? And that is how it works to combat depression, because depressive people get stuck in neural patterns etc? Or maybe I’m talking out my ass.",
            "title_similarity": "0.6106143",
            "sentiment_compound": -0.9691
        },
        {
            "id": "hw1d6bt",
            "score": -1,
            "text": "Using a stock image to make it look as explicit and bad as possible should be a giant red flag about this study.",
            "title_similarity": "0.31506434",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hw1fgc5",
            "score": 1,
            "text": "Ok, now do mega dosing.",
            "title_similarity": "0.099746644",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1hg8p",
            "score": 1,
            "text": "Humph. They worked for me.",
            "title_similarity": "0.12377833",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1i4gv",
            "score": -1,
            "text": "Not sure what research they did BUT it works for 2 of my friends. One does 1/8th every 6 hours and his depression is gone and he's very extroverted now. The other on goes on and off and you can tell when shes off\n\nSo.......yeah it does work",
            "title_similarity": "0.5196383",
            "sentiment_compound": -0.3359
        },
        {
            "id": "hw1i5lk",
            "score": 1,
            "text": "As a veteran with PTSD, anxiety, and depression. Who has self medicated using it. That study is way off. It was a night and day difference in my life once I started microdosing. Literally like a commercial where everything is black and white beforehand then turns to vibrant color.",
            "title_similarity": "0.64282537",
            "sentiment_compound": 0.128
        },
        {
            "id": "hw1izuk",
            "score": 1,
            "text": "How about macro dosing?",
            "title_similarity": "0.23586717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1jj0k",
            "score": 1,
            "text": "I've tried micro dosing, did nothing for me. Tried upping the dosage, and came to the conclusion that the trip from shrooms is in no way worth the sickness that comes with them.",
            "title_similarity": "0.7522642",
            "sentiment_compound": -0.434
        },
        {
            "id": "hw1ndqa",
            "score": -1,
            "text": "And the vaccine is safe and effective.",
            "title_similarity": "0.30821157",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hw1o8kv",
            "score": 1,
            "text": "Who payed for the study?",
            "title_similarity": "0.33642346",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1oaz9",
            "score": 1,
            "text": "Super small sample size (with a heavy weight on a single age/gender), small time frame, unorthodox dosing process, clickbait headline, hosted on PsyPost. Am I missing something or are we just allowing anything in this sub? I wouldn't trust this article either way. Horrible methodology. Even one of the articles mentioned in the abstract is about LSD, not psilocybin. I am sure there are more glaring issues, past my first read. Wow.",
            "title_similarity": "0.71212673",
            "sentiment_compound": 0.3814
        },
        {
            "id": "hw1omaw",
            "score": -1,
            "text": "I disagree with this. We can say the same thing about antidepressants and the like. Everyone is different and every body/brain is different. \n\nSource—former microdoser of both lsd and mushrooms. Probably will be current again soon.",
            "title_similarity": "0.55832386",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hw1phqo",
            "score": 1,
            "text": "Someone who tried microdosing shrooms here.\n\nFor the first two weeks, I had never felt better. I had been depressed so long that I FORGOT what happy felt like. I felt bright, productive, and energized. I also knew that I had to regulate my dosage as to not develop a tolerance. Well even with the suggested dosage regulation, eventually, that joyous feeling faded. Since it was too expensive to keep taking for little to no effect, I stopped and am now back to my old, depressed self.\n\nDamn those first two weeks were something else though",
            "title_similarity": "0.6477977",
            "sentiment_compound": 0.5696
        },
        {
            "id": "hw1qw43",
            "score": 1,
            "text": "I think their doing it wrong",
            "title_similarity": "0.357368",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hw1ukm6",
            "score": 1,
            "text": "I've begun microdosing with mushrooms and it has had a major impact on my overall mood, and ability to function. This is not new science, just now getting it's due attention.",
            "title_similarity": "0.43679205",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hw1uwtb",
            "score": 1,
            "text": "What? So the research before was wrong and the millions that have done it and gained their life back, are also are wrong?",
            "title_similarity": "0.55302966",
            "sentiment_compound": -0.6072
        },
        {
            "id": "hw1veck",
            "score": 1,
            "text": "Well i know that's not true because i am a guinea pig for that exact issue.",
            "title_similarity": "0.30482066",
            "sentiment_compound": -0.0598
        },
        {
            "id": "hw1zog8",
            "score": 1,
            "text": "This study:\n\nStart with 75 people who have no mental health issues.\n\nGive them a bag of psychoactive mushroom pills at 0.7g of mushrooms per pill.\n\nGive them a bag of wild mushroom/seed pills of equal weight (the 'placebo').\n\nTell them, \"Okay everyone, honor system!\"\n\n25% of participants take their shrooms without completing the program.\n\nOthers figure out what they are taking (they \"broke blind\").\n\nSome take 5 doses over 3 weeks. Some take 7 doses.\n\nSome test results were of minor improvement between placebo and medicated groups.\n\nBoth groups somehow improved, showing a significant 'placebo effect.'\n\nTotally skip the possibility that most people just consumed the good stuff in week one.\n\nConclude there is no benefit due to psychoactive mushrooms.\n\nLink to study: [https://journals.sagepub.com/doi/full/10.1177/02698811211050556](https://journals.sagepub.com/doi/full/10.1177/02698811211050556)",
            "title_similarity": "0.5642571",
            "sentiment_compound": 0.7195
        },
        {
            "id": "hw292x8",
            "score": 1,
            "text": "Then it was to small a dose.  It does, I'm here because of it.",
            "title_similarity": "0.33105826",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2fjef",
            "score": 1,
            "text": "Well it works fantastically for me and many other people I know.",
            "title_similarity": "0.06216888",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hw2ohac",
            "score": 1,
            "text": "Brought to you buy… Pfizer pharmaceuticals",
            "title_similarity": "0.3323508",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2qrca",
            "score": 1,
            "text": "Who ran these studies? After years and years of the the exact opposite being the case, this happens to come out? \n\nAlso, if this happens to be a valid control group (meaning no fuckery going on to sabotage the study), what about the product? I know from experience, that if you continuously use clones to colonize your substrate, their potency dramatically decreases. There isn’t a set number of viable generations one can assume is good, it just drops off a cliff when it happens.",
            "title_similarity": "0.69093883",
            "sentiment_compound": -0.4479
        },
        {
            "id": "hw30wmw",
            "score": 1,
            "text": "Isn’t it also true that something like 90% of clinical health studies are funded by Big Pharma at this point?  Unless the peer reviewers are pouring over the data with a fine tooth comb, then there is a good chance that the results of any study these days will be in the interest of big pharma.",
            "title_similarity": "0.42646936",
            "sentiment_compound": 0.9186
        },
        {
            "id": "hw18byq",
            "score": 34,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw16pxd",
            "score": 20,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1aend",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1e93d",
            "score": 9,
            "text": "Interesting, but I thought the whole idea behind psychedelic microdosing was to use it in combination with therapy or some form of positive thinking/positive reinforcement in order to achieve the desired results? The drug just assists in the treatment process, the drug itself isn't a cure for depression, PTSD etc...",
            "title_similarity": "0.7151008",
            "sentiment_compound": 0.5187
        },
        {
            "id": "hw1yx33",
            "score": 25,
            "text": "BiG PHaRma!! Study bad!!!\n\nThe main investigator, [Michiel van Elk](https://www.universiteitleiden.nl/en/staffmembers/michiel-van-elk#tab-1) is one of the very few scientists who does sound research into consciousness altering substances and experiences. He got his PhD, cum laude, in cognitive neuroscience at a very prestigious neurolab. He does his current work at a reknown research institute. He gets funding for this type of ‘alternative’ work, which in this field - psychology/psychiatry - is very rare. You should be cheering for this man and his work if you want to give non-pharmaceutical drugs and solutions for the mental health crisis a chance.\n\nBut nooooo, the results are not what you want them to be so half of the people here do EXACTLY what they claim BiG pHArmA is doing.\n\nEdit: for comparison, I’m a researcher too and I do very safe (meaning: noncontroversial) research. Not saying it’s not important of course, just saying it’s a safe field. I get funded a lot, like literally millions and that’s why I can do large, multiyear, studies. Acquisition is still hard because of the hyper competition, which every fellow researcher knows, but I’m sure it’s way easier for me than for this type of research. And people probably don’t know, but discrediting this work hurts funding because ‘trust from society’ is important. So if you want this research to be done and get better, discrediting it based on unfounded arguments doesn’t exactly help. It does the exact opposite.",
            "title_similarity": "0.48878124",
            "sentiment_compound": 0.9611
        },
        {
            "id": "hw1up8r",
            "score": -5,
            "text": "making a claim like this from a <100 person study is nothing short of embarrassing\n\nEDIT: The author of the article not the scientists involved in this legitimately groundbreaking work!",
            "title_similarity": "0.52928996",
            "sentiment_compound": 0.6093
        },
        {
            "id": "hw17gi8",
            "score": 2,
            "text": "Well. That's discouraging",
            "title_similarity": "0.32910025",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hw1b12v",
            "score": -2,
            "text": "Yeah , eat 7gms of mushroom. No more for 6 months. That is how you use it. Numb nuts",
            "title_similarity": "0.51883554",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hw1c4sc",
            "score": 1,
            "text": "Just doing a quick review myself of a few of the papers on this topic, it seems like the results are highly patient dependent. For some people, microdosing does seem to have a significant and long-lasting positive effect, for others it doesn't help, and for a few it could even worsen symptoms of anxiety and/or depression. In general, it seems like habitual users of psilocybin or other drugs reported the most benefit. It also seems that men were more likely to reported a positive effect than women. Overall, more study is definitely needed, but this could prove to be a viable treatment option for some patients.",
            "title_similarity": "0.6739582",
            "sentiment_compound": 0.6309
        },
        {
            "id": "hw1he50",
            "score": 3,
            "text": "It greatly helped me after my father passed away.",
            "title_similarity": "0.30610913",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1hxp7",
            "score": 2,
            "text": "*“Or the study design was bad or insufficiently thorough” - the article",
            "title_similarity": "0.53471625",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hw1o907",
            "score": 2,
            "text": "ADHD folks have a default mode Network that never shuts off. I'm sure that microdosing is quite helpful for them.\n\nPsilocybin acutely reduces DMN connectivity and increases the connectivity of task-positive networks.",
            "title_similarity": "0.58874",
            "sentiment_compound": 0.659
        },
        {
            "id": "hw1r48b",
            "score": 3,
            "text": "Heroic dose like a grown up",
            "title_similarity": "0.18245389",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hw21ono",
            "score": -2,
            "text": "It never did. People just wanted an excuse to do mushrooms and not feel weird about it.",
            "title_similarity": "0.6191716",
            "sentiment_compound": 0.2066
        },
        {
            "id": "hw1bsny",
            "score": 56,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1ogbq",
            "score": 19,
            "text": "I don't understand microdosing of anything. Wouldn't microdosing of anything over a long period of time make your body tolerant of it, and therefore nullify any effect it has?",
            "title_similarity": "0.71912086",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hw1pb7q",
            "score": 3,
            "text": "Yeah cuz microdosing is LAME. Take the ride and eat a few grams!",
            "title_similarity": "0.5704181",
            "sentiment_compound": -0.3869
        },
        {
            "id": "hw1syu1",
            "score": 2,
            "text": "I cannot speak to the results of this study. All I can do is relay my personal experience which was; it helped me to turn a corner and if I found myself in that hole again I would do it again. My alcohol consumption was dramatically reduced as well.",
            "title_similarity": "0.6392193",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hw18hzm",
            "score": 0,
            "text": "Doesnt for me. Some studies said when accompanied with therapy",
            "title_similarity": "0.54541963",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1cixj",
            "score": 0,
            "text": "question: how much of microdosing is placebo and its really more a highlight of having a regulated routine that you allegedly know is ‘good’ for you- that ends up producing these results?",
            "title_similarity": "0.5390003",
            "sentiment_compound": 0.4482
        },
        {
            "id": "hw1clus",
            "score": 0,
            "text": "What about large doses?",
            "title_similarity": "0.067549065",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1cvg3",
            "score": 0,
            "text": "You need periods of stability",
            "title_similarity": "0.32240766",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1g569",
            "score": 0,
            "text": "Time to sell my Mindmed stock?",
            "title_similarity": "0.3150847",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1gjms",
            "score": 0,
            "text": "Just gotta macrodose then.",
            "title_similarity": "0.26000965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1gv7i",
            "score": 0,
            "text": "Yeah the most convincing theory I’ve heard which explains the anti-depressant effects of psilocybin is the mystical experience. The mystical experience is necessary to see the changes in depressive symptoms. This doesn’t surprise me at all, still interested though none the less.",
            "title_similarity": "0.55623806",
            "sentiment_compound": 0.7501
        },
        {
            "id": "hw1hgsy",
            "score": 0,
            "text": "You know what does? MACRO-dosing.",
            "title_similarity": "0.20164542",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1hgug",
            "score": 0,
            "text": "I would love to see what MAPS had to say about this.",
            "title_similarity": "0.13502924",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hw1ibhd",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1j9e2",
            "score": 0,
            "text": "I bet micro dosing MDMA would do the trick but it's just too risky for various reasons. I find the best thing for those symptoms is a lot of cardio and sobriety. I like to ride my bike. It doesn't come in a day but stick with it.",
            "title_similarity": "0.61683744",
            "sentiment_compound": 0.8294
        },
        {
            "id": "hw1k1yp",
            "score": 0,
            "text": "...”according to old research.” It ment right ?",
            "title_similarity": "0.3148286",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1k7pq",
            "score": 0,
            "text": "What  does work is eating the threshold amount that effectively hits you.\n\nShrooms effect people in different amounts and at different dosages Because of tolerance genetics and age.\n\nThere is no micro dose amount in the same way there isn't a cealing amount.  It does work when you get it right because it's saved me Many times suffering from PTSD insomnia and bipolar disorder.",
            "title_similarity": "0.5883318",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hw1k9cl",
            "score": 0,
            "text": "Drugs are so good they work when you think about them lulz",
            "title_similarity": "0.38847792",
            "sentiment_compound": 0.7745
        },
        {
            "id": "hw1k9h2",
            "score": 0,
            "text": "Sounds fun, though!\n\nSorry if I am violating rules. It was too good.",
            "title_similarity": "0.41838259",
            "sentiment_compound": 0.4003
        },
        {
            "id": "hw1km1t",
            "score": 0,
            "text": "If it’s not working in 20 minutes take more",
            "title_similarity": "0.45859116",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1km49",
            "score": 0,
            "text": "It did for me but personally it hasnt been substainsble. \n\nIt does help but you cant take it for long periods of times. It start feeling overwhelming and you want to stop. \n\nYou can start taking it again but again the same thing happens. Its still a cycle of depression \n\nI used Lsd and not mushrooms but im guessing its pretty much the same. \n \nI could see it helping a normal person be better using correctly. But to cure depression totally it hasnt worked for me",
            "title_similarity": "0.7928978",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hw1knw1",
            "score": 0,
            "text": "That’s because what you really need is to take a shitload and travel to another dimension.",
            "title_similarity": "0.29964122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1kzy7",
            "score": 0,
            "text": "That’s a bit disheartening",
            "title_similarity": "0.3047735",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hw1lgn6",
            "score": 0,
            "text": "Have these people heard about anti-depressants yet?",
            "title_similarity": "0.5494355",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1pncb",
            "score": 0,
            "text": "I'm pregnant with my 3rd and having my 3rd c section and I wish to GOD I could microdose beforehand so I don't freak out like I did in the past 2 surgeries.  I am always convinced I'm going to die and it fucks up the whole experience.  In fact, I feel a constant sense of dread throughout pregnancy.",
            "title_similarity": "0.44061607",
            "sentiment_compound": -0.2976
        },
        {
            "id": "hw1r7bw",
            "score": 0,
            "text": "yes, you need hero dose",
            "title_similarity": "0.1904667",
            "sentiment_compound": 0.743
        },
        {
            "id": "hw1sawr",
            "score": 0,
            "text": "It’s just more drugs. Drugs have an effect and the absence of the drug then has an effect as well. I tried microdosing for depression and…I was just on a drug. And then I felt worse when the drug went away. Pills from psychiatrists are the same deal. Just drugs. There’s no long term wellness in a drug. There’s no recovery or healing. Your body adjusts and you need more drugs and different dosages. “Medical marijuana” = same deal. Just drugs. Coping mechanisms. Sorry but sobriety is the best way for long term consistent mental wellness. Also the hardest so I understand why so few people go for it. I wouldn’t deny anyone a coping mechanism that helps them. But the vast majority of the psychiatry grift could be eradicated if it were somehow profitable to encourage people to have a routine, maintain a regular sleep schedule, eat relatively healthy food, not drink or do drugs, and exercise. Exercise and sleep are the most important. And also the hardest when you’re depressed which is a real bummer. I have been there. For months at a time. Drugs of any kind eventually don’t work. There is no such thing as a “chemical imbalance.” Most psychiatry is a scam that does far more harm than good. Whoa I’ve found myself on a soap box here tonight. Sorry. I’ll stop soon. I have strong feelings because I’ve seen lives ruined including mine when so-called “doctors” prescribe “medicine” to “treat” “mental illness.” It’s just drugs. Yes there are some extreme cases that need extreme treatment and care. But pretty much everyone else would be fine with regular sleep, no sugar, exercise, and sobriety. That’s enough. I’m not allowed to post on the internet anymore tonight. I wish everyone peace and wellness. If I can save one person some of the hell years I had to go through it’s worth it.",
            "title_similarity": "0.7188257",
            "sentiment_compound": 0.9856
        },
        {
            "id": "hw1ttgl",
            "score": 0,
            "text": "PILOT STUDY level research",
            "title_similarity": "0.19507027",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw210vt",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw2903d",
            "score": 0,
            "text": "it didn't help me and I tried two  separate times",
            "title_similarity": "0.6184161",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hw29862",
            "score": 0,
            "text": "*Post* *Malone* *enters* *the* *chat*",
            "title_similarity": "0.23282747",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2ck90",
            "score": 0,
            "text": "The issue with microdosing is that mental health isn't a one size fits all situation so claiming anecdotes on how it \"helped\" isn't really applicable considering how we could pull other opinions that say that it made their mental health even worse. I could say smoking crack helps my depression but does that really warrant disregarding how potentially dangerous it is?\n\nIt always stresses me out when people preach about their own microdosing experience and then more or less develope this idea that they're some expert on drugs and how the effect the brain and chemistry of it.",
            "title_similarity": "0.7362807",
            "sentiment_compound": -0.9262
        },
        {
            "id": "hw2hhml",
            "score": 0,
            "text": "Woooh boi, I'm sure all the ~~junkie~~ *responsible consumers* of Reddit will take these news with maturity and intelligence...",
            "title_similarity": "0.26830027",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hw2nqz5",
            "score": 0,
            "text": "Mushrooms aren't a cure all like some kind of magic pill. They show you what you need to work on (especially larger doses) and when they are combined with the right kind of therapy, they can show a massive improvement in people's mental health and anxiety. \n\nEven if it's a placebo, it has helped my wife in the last 6 months, so who am i to say what works and doesn't work.",
            "title_similarity": "0.7034621",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hw2ok9i",
            "score": 0,
            "text": "I don’t think a psychedelic has any effect on the feelings of depression or anxiety. I think it effects a persons perception— with a newfound perception a person may find sudden value in another aspect of their consciousness. Even that would be subjectively up to the person as to weather or not it’s valuable. I was depressed and sad about issues that still upset me before psychedelics, but I was doing completely different things before tripping. Post trip I now feel like a complete alter ego, but I’m still admittedly disappointed by things that previously bothered me that are unchanged. Like having a relationship. Perhaps there’s a trip one May experience that discards this aspiration to instead live a happy single lifestyle, but maybe they’re still sad they don’t have as much income. I think we’ll always hold onto things that are upsetting until they do change. It’s my opinion that psychedelics can cause a voluntary switch in pursuits/ego/identity/character development/fears/rationality. It’s definitely a mind altering substance and not to be taken lightly. The best and scariest idea behind psychedelics is that you can have really really “good trip” but on that spectrum exists a really really “bad trip”. The changes coming back to a neurotypical rational may not subside— faults you never knew you had or maybe positive traits could take a whole new center point in your story.",
            "title_similarity": "0.75783956",
            "sentiment_compound": 0.7546
        },
        {
            "id": "hw2ooa0",
            "score": 0,
            "text": "Hypothesis: Consuming new and taboo substances for the first time provides a temporary mood boost that tapers off with time.",
            "title_similarity": "0.61943525",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hw2qvmi",
            "score": 0,
            "text": "Pictures of ppl takeoff pills are always so weird looking",
            "title_similarity": "0.49323368",
            "sentiment_compound": -0.3052
        },
        {
            "id": "hw2uf0w",
            "score": 0,
            "text": "75 people. Very reassuring",
            "title_similarity": "0.19783036",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hw309as",
            "score": 0,
            "text": "It it at all surprising that people use all sorts of logic to justify getting high?",
            "title_similarity": "0.35954416",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hw31edj",
            "score": 0,
            "text": "Of course it doesn’t. Everyone is just looking for legal excuses to use drugs and be impaired. Just like Marijuana cures everything. Rub it on your skin, eat it, smoke it good for pain, etc.",
            "title_similarity": "0.4915717",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hw34sbc",
            "score": 0,
            "text": "Reddit has been saying it does for years and now it doesn’t so yea get vaccinated",
            "title_similarity": "0.48024938",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw37zkn",
            "score": 0,
            "text": "I don’t care either way what people ingest in their own bodies.  I dislike when they say things like micro dosing fixes all my problems, I drive better high. Or weed cures asthma, none of these things are proven and need more study.",
            "title_similarity": "0.6653364",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hw3mn0r",
            "score": 0,
            "text": "We all choose how we are going to feel today. The cure for depression is to just snap out of it.",
            "title_similarity": "0.38898647",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hw3n0n9",
            "score": 0,
            "text": "I can only imagine the drug users falling over themselves to explain why this needs to be taken with a pinch of salt. The more you look the more you see anti-vaxxers aren’t unique at all in terms of their behaviour, it’s just the topic which matters there.",
            "title_similarity": "0.57946676",
            "sentiment_compound": -0.128
        },
        {
            "id": "hw3zl02",
            "score": 0,
            "text": "While the study of microdosing is important and in it's infancy, after having read the paper this article is based on, one of the key takeaways, for me, was this:\n\n>participants were self-selected from a microdosing workshop. As a result, most of our participants had tried psychedelics previously, which means that they may have broken blind easier or may have been desensitized to the microdosing effects. Second, the psilocybin doses were made by the participants using dried psilocybin truffles, meaning that **we cannot be sure of the exact amounts of psilocybin in the individual doses that the participants consumed.**\n\nEmphasis mine. They were using people who are already familiar with psychedelic's, and did not control dosage size.",
            "title_similarity": "0.6874283",
            "sentiment_compound": -0.4874
        },
        {
            "id": "hw44o6s",
            "score": 0,
            "text": "Only a hero’s dose will do",
            "title_similarity": "0.44134775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw4718q",
            "score": 0,
            "text": "Microdosing doesn't work. I remember reading a research article where they gave the pts extremely large doses",
            "title_similarity": "0.62199134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw4bmrd",
            "score": 0,
            "text": "I don't get microdosing anyway. It's not, to me, like a drink you can just have one and relax or one pull off a joint not get too baked.\n\nTo me, a trip is a trip and a psilocybin trip is a spiritual experience. Usually it will dramatically improve my depression for a few days while I am still having a lingering feeling if being at one with the cosmos.\n\nAfter a few days I want to cry again at the state of the world and my own life.",
            "title_similarity": "0.7350715",
            "sentiment_compound": -0.3204
        },
        {
            "id": "hw4go2j",
            "score": 0,
            "text": "All the druggies here searching for angles to shoot down the study.\n\nYou want to take drugs go ahead, nobody's stopping you but quit trying to sell me that snake oil.",
            "title_similarity": "0.42668366",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hw52hou",
            "score": 0,
            "text": "The great institution of OZ has spoken, please disregard it's agenda behind the curtain.",
            "title_similarity": "0.35769257",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hw5awaz",
            "score": 0,
            "text": "Basically these amateurs should take more and annihilate their understanding of depression to move past it and accept their traumas, join the five gram club",
            "title_similarity": "0.40102062",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hw5byj5",
            "score": 0,
            "text": "They forgot to include the catalyst….THC",
            "title_similarity": "0.58002186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw61yac",
            "score": 0,
            "text": "Probably get better results when atmospheric pressure is high.",
            "title_similarity": "0.33198637",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hw1im1k",
            "score": -11,
            "text": "Ya no. Micro Dosing has helped me immensely. This cant be accurate for everyone. Stop Generalizing.",
            "title_similarity": "0.64299357",
            "sentiment_compound": -0.296
        },
        {
            "id": "hw32jqk",
            "score": 6,
            "text": "- \"Another caveat is that many people in our study broke blind and they figured out what condition they were assigned to,” van Elk added. “This is a more generic problem for this type of research: the effects of psychedelics are so obvious — even at lower doses — that it is difficult to prevent people from figuring out what condition they are assigned to. If people subsequently figure out that they are in the active/experimental condition (e.g., based on subtle side-effects), this in turn can contribute again to the placebo response.”\n\nSo the whole study is already compromised. Writing a \"gotcha\" headline when your data isn't clear is dumb.",
            "title_similarity": "0.6758431",
            "sentiment_compound": -0.89
        },
        {
            "id": "hw181v6",
            "score": -1,
            "text": "Gotta take that full trip dosage.",
            "title_similarity": "0.09991324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1ahdn",
            "score": -1,
            "text": "That's sad, must go large!",
            "title_similarity": "0.19580224",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hw1azxo",
            "score": -1,
            "text": "Well, it’s worked for me at least somewhat in the past, maybe it was just placebo but in my mind at least I was a little happier and more relaxed when I was able to micro dose for a few weeks. Maybe the effect would have diminished had I kept it up",
            "title_similarity": "0.66844773",
            "sentiment_compound": 0.8873
        },
        {
            "id": "hw1bqbb",
            "score": 1,
            "text": "microdosing is supposed to slightly shift your normal thinking to get new ideas. to me this change of rutine can be helpful for some in depression/ptsd, im kind of suprised by this studys result.",
            "title_similarity": "0.5838462",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hw1ciks",
            "score": -1,
            "text": "Man I was taught all these benefits by my mate as a teenager and these muthafuckas are finally supporting it",
            "title_similarity": "0.25841162",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hw1dop2",
            "score": 1,
            "text": "annnnnnd there goes the placebo",
            "title_similarity": "0.24376076",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1dq6p",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1fe33",
            "score": 1,
            "text": "A mental enema is how I would describe it",
            "title_similarity": "0.30909914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1fl6n",
            "score": -1,
            "text": "no, you have to take a lot at once for that, and the effects are short lived.",
            "title_similarity": "0.5219635",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1gcce",
            "score": -1,
            "text": "This is great research and we need more than one study with \\~ 70 people. I would like to see a double-blind study with 7,000 people from 700 cities globally.",
            "title_similarity": "0.27557176",
            "sentiment_compound": 0.765
        },
        {
            "id": "hw1gwj5",
            "score": -1,
            "text": "That’s why you do it all at once. Either you’re depression is cured or for 4-12 hours you scrap around trying to get out of hell.",
            "title_similarity": "0.4381561",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hw1h5r8",
            "score": -1,
            "text": "Be interesting to see exactly how this new study was structured. You can easily structure a study to skew the results toward a predetermined outcome.",
            "title_similarity": "0.2525315",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hw1jkx7",
            "score": -1,
            "text": "I believe the title overstates the impact of the study. I am glad that a negative study was published but the authors aknowledge both the limited power and enhances placebo effect being shown. While I have seen many similar studies, often looking at different characteristics to measure, I did not see a meta study. Is there one available?",
            "title_similarity": "0.6842934",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hw1jz1n",
            "score": 1,
            "text": "Needs further testing. I shall continue experimenting.",
            "title_similarity": "0.22571543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1kpmr",
            "score": 1,
            "text": "Not micro dosing, but heroic dosing straight up fixed my depression and anxiety immediately. Thank God for South American Shaman.",
            "title_similarity": "0.48830628",
            "sentiment_compound": 0.7227
        },
        {
            "id": "hw1kvou",
            "score": 1,
            "text": "Seems like there are serious problems with research on microdosing. For one the definition of what constitutes a microdose varies widely from a dose below a perceptual threshold to one sometimes significantly above it. If microdosing is indeed effective at a perceptual dose, then I don’t see how (as the article mentions) you could really create a blind study without using some sort of active placebo.",
            "title_similarity": "0.74259824",
            "sentiment_compound": 0.5325
        },
        {
            "id": "hw1nvl0",
            "score": -1,
            "text": "Microdosing means nothing at all. Thank you so very much for the lesson in meaninglish.   Macrodosing test apes are ready.",
            "title_similarity": "0.47447953",
            "sentiment_compound": 0.1002
        },
        {
            "id": "hw1o4o8",
            "score": 1,
            "text": "Anecdotal evidence alert: I believe it helped me through a really rough patch recently. \n\n100mg every 3rd day for about 45-60 days. Often accompanied by some light meditation and lots of journaling. But plenty of times just went about whatever work tasks I had for the day. Maybe between hour 1-2 I would notice the effect a small amount if I was listening to music, but mostly not noticeable. Went higher doses a few times and was clearly noticing the effects so I backed down.\n\nImo it made me just a little bit less resistant to what I was feeling and allowed thoughts and emotions to surface in a way that felt more peaceful than without microdosing. It was like I could take a troubling event or memory or emotion and kinda hold it in my hands and look at it from different angles without feeling afraid or anxious or depressed. It let me understand it more, learn some lessons about the hard times, and integrate those lessons over time. \n\nAlso I journal normally, but while microdosing I felt I wrote more freely, maybe 10-20% more freely nothing like paradigm shifting. Just enough to again let the things I’m struggling with come up to the surface more than they normally would. \n\nJust my experience!",
            "title_similarity": "0.67031014",
            "sentiment_compound": 0.5737
        },
        {
            "id": "hw1ofi1",
            "score": -1,
            "text": "Druggies in full COPE and damage control mode",
            "title_similarity": "0.2527079",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hw1qec8",
            "score": -1,
            "text": "No excuse for doing drugs anymore.",
            "title_similarity": "0.5801494",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hw1x3ft",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw2bnh3",
            "score": 1,
            "text": "That my friend, is a lie.",
            "title_similarity": "0.43459943",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hw2evyl",
            "score": 1,
            "text": "Or so the Germans would have you believe",
            "title_similarity": "0.18957564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2oohv",
            "score": 1,
            "text": "My personal research says different.",
            "title_similarity": "0.47258157",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2oqp7",
            "score": 1,
            "text": "I just did a paper for college on primary research that contradicts this.",
            "title_similarity": "0.42313564",
            "sentiment_compound": -0.34
        },
        {
            "id": "hw2qpqm",
            "score": -1,
            "text": "Leave it to Reddit to try its best to come with every excuse they can to defend their precious psychedelics",
            "title_similarity": "0.42952123",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hw30cls",
            "score": 1,
            "text": "I've been dosing for about 18yrs now, I can definitely tell you that it helps battle depression and anxiety.",
            "title_similarity": "0.44091508",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hw342y6",
            "score": 1,
            "text": "All that means is you need a bigger dose. We know this does work dor depression, end of life anxiety etc",
            "title_similarity": "0.34175527",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hw34wy7",
            "score": 1,
            "text": "There's going to be a lot of push back on any positive results from this type of experimentation because drug manufacturers want you to keep buying all the anti depressant skittles that make you numb and dependent for the rest of your life. When in reality, psylocibin DOES help depression and anxiety according to actual people with depression that I've talked to. I'm not suprised there's a breakthrough study that tries to shun any previous positive findings. Drug manufacturers cannot benefit from you if you address your problem through natural means.",
            "title_similarity": "0.62161124",
            "sentiment_compound": -0.7833
        },
        {
            "id": "hw3b43d",
            "score": 1,
            "text": "Don't microdose , do the heroic dose",
            "title_similarity": "0.47806102",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hw3ttk9",
            "score": 1,
            "text": "Small doses rarely are therapeutic by themselves. Idk where this theory that micro dosing works came from, probably the essential oils movement.",
            "title_similarity": "0.71227854",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hw42nt5",
            "score": 1,
            "text": "I anecdotally disagree",
            "title_similarity": "0.40875006",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hw47hfd",
            "score": 1,
            "text": "Gotta eat at least 7g of mushrooms",
            "title_similarity": "0.34985393",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw56n3a",
            "score": 1,
            "text": "If you think under 100 people is enough to get the average for an entire human races and or single country is enough you're nuts",
            "title_similarity": "0.41915327",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hw58twd",
            "score": 1,
            "text": "Have you tried it though? It absolutely does work.",
            "title_similarity": "0.2222862",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw58v8n",
            "score": 1,
            "text": "For anyone who swears by microdosing, or people interested in microdosing, remember two things:\n\n•Studies are still small and more research needs to be completed.\n•The placebo effect is a very real thing. If it is working for you, then don't be discouraged. Let it work! You know yourself, and if you feel the improvement, then it is real to you. It means that your friends may not experience what you have, but it doesn't mean that you should let a paper prevent you from improving your symptoms if you feel it genuinely works for you.",
            "title_similarity": "0.673136",
            "sentiment_compound": 0.8648
        },
        {
            "id": "hw59fm9",
            "score": 1,
            "text": "I saw significant improvements in my depression and anxiety a when I ran a course of microdosing.\n\nThis research can eat my ass.\n\nIf you're feeling like you'll never get put of the cycle of anxiety/depression, try it. It works.",
            "title_similarity": "0.57882035",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hw2ca40",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw19ooh",
            "score": -2,
            "text": "There goes my plans for the next 30 years.",
            "title_similarity": "0.17214599",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1if4n",
            "score": 2,
            "text": "> The psilocybin microdoses were created by the participants during the microdosing workshop. The doses contained 0.7 g of dried psilocybin-containing Galindoi truffles, which corresponds to around 1/10th of a medium-high dose.\n\nI have a really hard time taking this study seriously if this was their method of administration. Anyone who has worked with psychoactive mushrooms knows that the amount of psilocybin can vary heavily between samples. These types of studies need to be using isolated psilocybin with accurate dosages between participants.",
            "title_similarity": "0.66983855",
            "sentiment_compound": -0.4005
        },
        {
            "id": "hw1jxp1",
            "score": -2,
            "text": "Yeah cause microdoseing sucks! Buy the ticket and take the ride take the full hit or don’t take it all",
            "title_similarity": "0.40895495",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hw1jz39",
            "score": 2,
            "text": "Well my grandma, who has suffered her entire life with mental illness, would disagree.",
            "title_similarity": "0.50205815",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hw1m9wk",
            "score": 2,
            "text": "Since when did a drug not out preforming a placebo stop them from being used? For the average depressed person SSRIs aren’t any different than placebo. https://jamanetwork.com/journals/jama/article-abstract/185157",
            "title_similarity": "0.7799318",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hw1mbi5",
            "score": 2,
            "text": "Anecdotally, I and a family member of mine have found semi-regular use of *moderate* doses to have had noticeable positive effects on depression/anxiety.\n\nI was never sold on microdosing, though I thought it looked promising.  But I'm still firmly in the camp that psilocybin *probably can* have positive therapeutic effects for people with conditions such as anxiety, at least in some situations.\n\nI look forward to seeing more research in this area, now that psilocybin, and traditionally 'recreational' drugs in general, are becoming less taboo in our culture.  Straight up prohibition not only deprives people unnecessarily, but it stands in the way of unbiased scientific inquiry.",
            "title_similarity": "0.7263164",
            "sentiment_compound": 0.9019
        },
        {
            "id": "hw1mmbb",
            "score": -2,
            "text": "To the surprise of absolutely nobody with even the tiniest shred of good sense...",
            "title_similarity": "0.47656447",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hw1qp5q",
            "score": -2,
            "text": "It's weird that being a drug addict might not cure my depression. Who could have guessed?",
            "title_similarity": "0.7570805",
            "sentiment_compound": 0.3178
        },
        {
            "id": "hw1urok",
            "score": -2,
            "text": "This doesnt surprise me.",
            "title_similarity": "0.42053276",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hw1uyor",
            "score": 2,
            "text": "That's because the real psychological potential of psilocybin is at larger doses.",
            "title_similarity": "0.3735303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2gw70",
            "score": 2,
            "text": "100% worked for me, like without a shadow of a doubt… study should be redesigned.",
            "title_similarity": "0.19711661",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hw306pz",
            "score": 2,
            "text": "It’s all about the macrodose",
            "title_similarity": "0.18539086",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw17shk",
            "score": 1496,
            "text": "Can everyone just be rationale and acknowledge that the science of this is still in its infancy? No one study should be gospel, no one study proves anything for everyone for all time. \n\nLike many things the odds are that this will turn out to be an effective treatment for some people, do nothing for some, and have pretty damaging side affects for yet others.\n\nNone of us know for certain, personal anecdotes are just that, and getting all conspiracy minded helps no one.",
            "title_similarity": "0.66999936",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hw198t4",
            "score": -3,
            "text": "Total u turn since last week... \n\nLooking forwards to next week's re results again",
            "title_similarity": "0.29009932",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1dnw1",
            "score": -3,
            "text": "This article is brought to you by big pharma. Just say no to nature’s medicine and take our physically addicting opioids.",
            "title_similarity": "0.5148761",
            "sentiment_compound": -0.296
        },
        {
            "id": "hw2sh0h",
            "score": 3,
            "text": "\"Because it's organic and anyone can find it, we dont make any money off it. Thats why its not working\"\n- Big Pharma",
            "title_similarity": "0.5677646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw17ebo",
            "score": -4,
            "text": "Don’t tell that to ATAI, MNMD, CMPS or CYBN!",
            "title_similarity": "0.48613486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw191yk",
            "score": -4,
            "text": "No money in micro dosing lsd mandates",
            "title_similarity": "0.67119575",
            "sentiment_compound": -0.296
        },
        {
            "id": "hw1ctqm",
            "score": 4,
            "text": "So trip my balls off occasionally to gain the full effect is what I'm getting? Challenge accepted",
            "title_similarity": "0.38635218",
            "sentiment_compound": 0.6728
        },
        {
            "id": "hw1ndjq",
            "score": 281,
            "text": "Confused about some wording here.  Their results section both says “revealed that psilocybin microdosing did not affect emotion processing or symptoms of anxiety and depression compared with placebo” and also “that symptoms of depression and stress were significantly reduced in the first block compared with baseline”\n\nHow can symptoms both not be affected and also be significantly reduced?\n\nEdit: the explanation has been given many times now.  Read the replies instead of replying yourself again",
            "title_similarity": "0.77023774",
            "sentiment_compound": -0.9398
        },
        {
            "id": "hw1m636",
            "score": 33,
            "text": "From what I have come to understand as some scientists have tried to explain is, when you consume psilocybin it converts into psilocin which seems to have almost an exact chemical structure to serotonin. Some believe that especially in brains that have experienced trauma (which commonly leads to things like addiction) have less neural activity between synaptic responses (think less signal with bluetooth). Serotonin works together in playing a role with this (honestly too complicated for me to attempt- please take all this with grain of salt) so when you consume it helps with increasing neural activity. Best way I think about this is- if your brain is a highway and your PTSD or Depression (where low serotonin is common) keeps you at a four lane highway while after consuming psilocybin it turns your neural activity into a six lane freeway. This likely helps you process a lot including your trauma, or help you cope with your depression or lessen the worst of it's symptoms.   \nI would note, anecdotally, that is how it has helped me with my mental health. However I have noticed I do better with larger doses (no more than 1.5g - usually 0.5-1) with longer spaces of time between them. (Dependent on outside factors in life, current mental state and active support networks)",
            "title_similarity": "0.7344413",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hw1pbi7",
            "score": 840,
            "text": "My understanding was that periodic full doses was much more effective, especially when paired with more traditional therapy. It's news to me that anyone was looking into the effects of microdosing, especially an an antidepressant.\n\nI do think, though, that a much more promising direction in general for psilocybin is for migraines and cluster headaches.",
            "title_similarity": "0.5479023",
            "sentiment_compound": 0.7496
        },
        {
            "id": "hw2fs8r",
            "score": 6,
            "text": "Well, it works for me, so I’m going to keep doing it",
            "title_similarity": "0.15807526",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hw13xbb",
            "score": 268,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1af6g",
            "score": -5,
            "text": "Sure thing. But those pharmaceutical drugs do right?",
            "title_similarity": "0.35857978",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hw1ouoe",
            "score": 2566,
            "text": "These are obviously preliminary results, but how many of the people here dismissing them out of hand are also the kind of people who say \"trust the science\" when the science agrees with them?",
            "title_similarity": "0.54709166",
            "sentiment_compound": 0.899
        },
        {
            "id": "hw15fdb",
            "score": 479,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1sbz1",
            "score": 11,
            "text": "Curious to see how more studies play out over the years. I’m expecting more studies with these same conclusions along with some “Microdosing Psilocybin shows real promise”.\n\nMacro doses should be involved in the studies too though. I’m sure they will be at some point.",
            "title_similarity": "0.43324807",
            "sentiment_compound": 0.7414
        },
        {
            "id": "hw1nu2d",
            "score": 70,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1u3we",
            "score": 56,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw15o2z",
            "score": 4809,
            "text": "> Thus, for the repeated-measures analyses further discussed below, 52 participants were included for S1 and S3, consisting of 29 females and a mean age of 29.75 (ranging from 29–60) years and 44 were included for S2 and S4, consisting of 21 females and a mean age of 30.6 (ranging from 20–60) years.\n\nFor those wondering about sample size",
            "title_similarity": "0.33524162",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw152ph",
            "score": 1805,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1ucna",
            "score": 81,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1b8ts",
            "score": 1,
            "text": "Can I ask a serious question? Does anyone think it'd help with tinnitus?",
            "title_similarity": "0.48850402",
            "sentiment_compound": 0.4137
        },
        {
            "id": "hw1h0om",
            "score": 1,
            "text": "I remember reading research saying the same thing over a decade ago. Unfortunately I don’t remember it well enough to link the source, but I remember something about how the dose needed to be high enough to trigger hallucinations in order to be effective.",
            "title_similarity": "0.5408633",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hw1ktmn",
            "score": 1,
            "text": "I'm a bit confused about the microdosing thing... You shouldn't be able to tell the difference, yeah?\n\nLike, the amount you take is so small... You shouldn't be feeling a psychedelic effect?",
            "title_similarity": "0.8124794",
            "sentiment_compound": 0.3378
        },
        {
            "id": "hw1mgrg",
            "score": 1,
            "text": "Did it say how good the placebo was",
            "title_similarity": "0.3724208",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw1mmyg",
            "score": 1,
            "text": "Well yeah you need therapy too",
            "title_similarity": "0.22373763",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hw1nirs",
            "score": 1,
            "text": "I’ll need to test it though, just to be sure, for reasons…",
            "title_similarity": "0.27189642",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hw1nkia",
            "score": 1,
            "text": "Microdose? Nah man, take a heroic dose and gain more perspective, resets your thought patterns",
            "title_similarity": "0.38017637",
            "sentiment_compound": 0.765
        },
        {
            "id": "hw1nsa3",
            "score": 1,
            "text": "Large doses it is then!",
            "title_similarity": "0.012830335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1ny28",
            "score": 1,
            "text": "Yeah just have big doses between longer intervals.",
            "title_similarity": "0.16559365",
            "sentiment_compound": 0.296
        },
        {
            "id": "hw1nzoj",
            "score": 1,
            "text": "Large doses, on the other hand, work wonders. That's been my experience, at least.",
            "title_similarity": "0.26511872",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hw1o29d",
            "score": 1,
            "text": "Right, the whole bag at once then...",
            "title_similarity": "0.01587238",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1o2bw",
            "score": 1,
            "text": "Meh, ever since my days of using psychedelics and smoking mad pot I just have a lingering surreal feeling, things just looks semi cartoony, unreal, dreamy, strange, etc. not worth it for me personally anymore.",
            "title_similarity": "0.5897398",
            "sentiment_compound": -0.6669
        },
        {
            "id": "hw1o9ee",
            "score": 1,
            "text": "Anecdotally, microdosing psilocybin changed my life.",
            "title_similarity": "0.58343184",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1oao1",
            "score": 1,
            "text": "This is probably a misleading title as the placebo effect alone should lead to improvements",
            "title_similarity": "0.5822482",
            "sentiment_compound": -0.34
        },
        {
            "id": "hw1ocvi",
            "score": 1,
            "text": "Sounds like someone had a bad trip…",
            "title_similarity": "0.42367083",
            "sentiment_compound": -0.25
        },
        {
            "id": "hw1oczp",
            "score": 1,
            "text": "So they’re discounting the placebo effect and practically saying it doesn’t exist?",
            "title_similarity": "0.595314",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1of1q",
            "score": 1,
            "text": "What about taking a whole fuckload every once in awhile?",
            "title_similarity": "0.2423047",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1okon",
            "score": 1,
            "text": "You heard the science guys, it’s all about the macrodose again!!",
            "title_similarity": "0.27543426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1op7p",
            "score": 1,
            "text": "Anyone not reading beyond the title of this submission? Here are the results written by the authors\n\n> Our confirmatory analyses revealed that psilocybin microdosing did not affect emotion processing or symptoms of anxiety and depression compared with placebo. Our exploratory analyses revealed that psilocybin microdosing did not affect self-reported interoceptive awareness, that symptoms of depression and stress were significantly reduced in the first block compared with baseline, that participants broke blind in the second block and that there was no effect of expectations. Further research in a substance-naïve population with clinical range anxiety and depressive symptoms is needed to substantiate the potential beneficial effects of microdosing.",
            "title_similarity": "0.7950398",
            "sentiment_compound": -0.9744
        },
        {
            "id": "hw1p0cx",
            "score": 1,
            "text": "I never understood microdosing. Psylobin and lsd cause short term resistance.\nIf you take It several times in a short period, only the fist times will have effect...",
            "title_similarity": "0.77905524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1p33b",
            "score": 1,
            "text": "I'm going to have to say NO to this one, thank you!",
            "title_similarity": "0.34983286",
            "sentiment_compound": -0.184
        },
        {
            "id": "hw1p8b3",
            "score": 1,
            "text": "Well, that's too bad.  Hallucinogenics seems promising medicinally, but maybe not, too.  there needs to be more research.\n\nIt's a sin that there wasn't more research on marijuana over the last few decades.  Whether that research showed ill effects, or medicinal uses, we need to know.",
            "title_similarity": "0.67891514",
            "sentiment_compound": -0.8573
        },
        {
            "id": "hw1p96d",
            "score": 1,
            "text": "Makes me feel awake like coffee.  I don't drink coffee.",
            "title_similarity": "0.5489787",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hw1peo8",
            "score": 1,
            "text": "I find that I have better focus microdosing, around 100mg -500mg.",
            "title_similarity": "0.3608451",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw1plrv",
            "score": 1,
            "text": "That's why I only drop lsd joto's",
            "title_similarity": "0.48522022",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hw1pnfh",
            "score": 1,
            "text": "Heroic doses it is then",
            "title_similarity": "0.17713703",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hw1pntg",
            "score": 1,
            "text": "Microdosing, sure... But what about large doses at regular intervals? Give the people what they want!",
            "title_similarity": "0.44456074",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hw1pqtk",
            "score": 1,
            "text": "Anyone know how it impact neurogenesis?",
            "title_similarity": "0.32240224",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1pr3p",
            "score": 1,
            "text": "I think many of us have enough real experience with psychedelics to know that they 'can' help. At this point, I think anyways, it should be more about determining a regimen that achieves the desired result without causing damage. The problem then becomes personalized regimens, as people may mentally respond differently (body mass is also a factor, isn't it?) Also, wouldn't what the patient did during the experiences affect their level of success. For instance, theoretically, wouldn't a person who meditated achieve better results than someone who was working during dosage? Somebody mentioned on here that this is a tool, not a taxi. Giving someone a car is not the same thing as teaching them to drive it. Ahh, I can see it already, Marlboro Mushrooms. Ya think they'll come in menthol?",
            "title_similarity": "0.68488646",
            "sentiment_compound": 0.8699
        },
        {
            "id": "hw1prq6",
            "score": 1,
            "text": "Obviously to all of you this is anecdotes but I for me personally and three other people I know microdosing has helped big time through a time of depression. When you are back to regular baseline it’s just a nice mood booster",
            "title_similarity": "0.48548925",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hw1ps66",
            "score": 1,
            "text": "Did they try macro though?",
            "title_similarity": "0.39595932",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1puzh",
            "score": 1,
            "text": "It's not supposed to improve depression or anxiety it's supposed to help you with computer programming.",
            "title_similarity": "0.6380688",
            "sentiment_compound": -0.6256
        },
        {
            "id": "hw1pvqq",
            "score": 1,
            "text": "Certainly not how I take it! I go enough to entertain myself with hallucinations \\~2x/month",
            "title_similarity": "0.51389444",
            "sentiment_compound": 0.6114
        },
        {
            "id": "hw1pw54",
            "score": 1,
            "text": "I'm really confused as well. I don't have depression or anxiety that I know of, but assuming these people are taking the threshold dose for their body size and tolerance, I find it impossible to imagine it doesn't have an effect. It's just as effective as MDMA.",
            "title_similarity": "0.73963064",
            "sentiment_compound": 0.8169
        },
        {
            "id": "hw1pxoh",
            "score": 1,
            "text": "Just makes you more open minded thus lowering your karma count",
            "title_similarity": "0.46297207",
            "sentiment_compound": -0.25
        },
        {
            "id": "hw1q1ei",
            "score": 1,
            "text": "Doses of heroin and methamphetamine is scientifically proven to improve symptoms of depression with me.",
            "title_similarity": "0.5182897",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hw1q8qm",
            "score": 1,
            "text": "Sample size is pretty small as far as a strong convincing study. I suppose this may be true what they have said but I am wary of anything much less than 300 participants. This had only 75 and doesn’t cover a broad range of people due to it’s size. Interesting inquiry tho!",
            "title_similarity": "0.68019676",
            "sentiment_compound": 0.8702
        },
        {
            "id": "hw1qa3l",
            "score": 1,
            "text": "I wonder what happens with a bigger dosage less frequently. I personally enjoy taking 2 grams or more twice a year. Does the mind and body good.",
            "title_similarity": "0.52372617",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hw1qdz8",
            "score": 1,
            "text": "Oooff. This isn’t going to make r/microdosing happy.",
            "title_similarity": "0.6138176",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hw1qe1z",
            "score": 1,
            "text": "I do recall Dr. Matthew Johnson, a professor of behavioural sciences and psychiatry at John Hopkins, mentioned this same thing. Microdosing doesn’t seem to work. BUT he also mentioned that taking a “heroic” dose had profound effects.",
            "title_similarity": "0.63338137",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1qexe",
            "score": 1,
            "text": "It’s amazing how every comment seems to have an underlying bias against the results of the study. As if everyone hoped that microdosing may be the answer. That being said, Is this the final answer? No, but it shouldn’t spark a defense response. If you want to preach about following the science, then let the science do its job",
            "title_similarity": "0.59633106",
            "sentiment_compound": 0.7615
        },
        {
            "id": "hw1qhzo",
            "score": 1,
            "text": "Despite what the studies say, personally microdosing on a semi regular basis helps me refrain from wanting to hang myself.. placibo or not i dont really care.",
            "title_similarity": "0.7459408",
            "sentiment_compound": -0.0631
        },
        {
            "id": "hw1qk46",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1qkbu",
            "score": 1,
            "text": "*”Of course, this does not mean that microdosing is completely ineffective,” van Elk said. “We only found no objective evidence in our controlled study. But there are indeed many caveats. It could well be that the dosing we used was suboptimal and needs to be fine-tuned on an individual basis. It could also be that it takes some time for microdosing to take effect and that merely doing this for a few weeks is not enough to establish the long-term effects.”*\n\n*”Another caveat is that many people in our study broke blind and they figured out what condition they were assigned to,” van Elk added. “This is a more generic problem for this type of research: the effects of psychedelics are so obvious — even at lower doses — that it is difficult to prevent people from figuring out what condition they are assigned to. If people subsequently figure out that they are in the active/experimental condition (e.g., based on subtle side-effects), this in turn can contribute again to the placebo response.”*",
            "title_similarity": "0.7626673",
            "sentiment_compound": -0.9439
        },
        {
            "id": "hw1qlv4",
            "score": 1,
            "text": "But it is fun and very easy to handle. I can’t recommend it enough.",
            "title_similarity": "0.38384473",
            "sentiment_compound": 0.9184
        },
        {
            "id": "hw1qn7e",
            "score": 1,
            "text": "That’s why I take 5 grams.",
            "title_similarity": "0.22442378",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1qu0o",
            "score": 1,
            "text": "Now do vitamin d (5k iu to start).",
            "title_similarity": "0.3268026",
            "sentiment_compound": 0.296
        },
        {
            "id": "hw1qye3",
            "score": 1,
            "text": "I’m more of a fan of periodic full doses. You feel something you learn something you hold onto it for a while. And then you leave it alone.",
            "title_similarity": "0.44430542",
            "sentiment_compound": 0.0935
        },
        {
            "id": "hw1r0o7",
            "score": 1,
            "text": "Im not surprised, i microdosed and didnt seem to notice much. Maybe i didnt do it for long enough though.\n\n100 percent that actual trips at least temporarily cures depression / anxiety.\n\nIts cause ya gotta \"break thru\" and that requires a normal size dose, not micro. But im  not a scientist.",
            "title_similarity": "0.7809285",
            "sentiment_compound": -0.4648
        },
        {
            "id": "hw1r0uu",
            "score": 1,
            "text": "I microdosed LSD when I was depressed and it really turned my life around. I remembered how to feel happy again. I've stopped since then and still feel generally much happier that I did before.",
            "title_similarity": "0.5498158",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw1r1ts",
            "score": 1,
            "text": "Oh man people are gonna be mad.",
            "title_similarity": "0.21972004",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hw1r20j",
            "score": 1,
            "text": "And I suddenly got more depressed and anxious, as I was hoping to be able to try this as a treatment.",
            "title_similarity": "0.46181488",
            "sentiment_compound": -0.469
        },
        {
            "id": "hw1r2ni",
            "score": 1,
            "text": "I feel like studies about depression are probably somewhat flawed if they were conducted during the pandemic.",
            "title_similarity": "0.70366776",
            "sentiment_compound": -0.6133
        },
        {
            "id": "hw1r5pn",
            "score": 1,
            "text": "Were the sample depressed?",
            "title_similarity": "0.48968625",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hw1r7cv",
            "score": 1,
            "text": "\"Continue the research\"",
            "title_similarity": "0.14703701",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1re9e",
            "score": 1,
            "text": "Yeah microdosing is a placebo. If I don't take a psychoactive dose it doesn't help",
            "title_similarity": "0.81630564",
            "sentiment_compound": -0.015
        },
        {
            "id": "hw1ri4t",
            "score": 1,
            "text": "Obviously.  Taking doses so low you can’t feel them won’t do anything.  Do I get grant money now?  Morons.",
            "title_similarity": "0.70188344",
            "sentiment_compound": -0.3697
        },
        {
            "id": "hw1rj14",
            "score": 1,
            "text": "Some of the concerns I have are that we actually don’t know what the qualitative improvement *is*. Does the anxiety and depression symptoms improve? Or do the perception, or impact  improve? This is extremely important to segregate. Yet we are not sure? Also I think there’s slot of crossover of anecdotal evidence that LSD and MDMA microdosing that got mixed up back a while ago that might muddy the idea that Psilocybin has no affects when it’s possible that a different substance was a progenitor or a synergy. It’s incredibly important to move entheogens and hallucinogens off of schedule 1 and 2 so they can be studied in clinical and biochemical ways.",
            "title_similarity": "0.75608224",
            "sentiment_compound": 0.6077
        },
        {
            "id": "hw1rmn0",
            "score": 1,
            "text": "As someone who does-I disagree.",
            "title_similarity": "0.3669217",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hw1rnej",
            "score": 1,
            "text": "Weird dosing.\n\n\"Take 5 to 7 of these over 3 weeks, dose is .7g\"\n\nI also feel like to whichever of the subjects weren't psychedelic naive, .7g would be *obviously* noticeable.",
            "title_similarity": "0.58235264",
            "sentiment_compound": 0.3847
        },
        {
            "id": "hw1rpk0",
            "score": 1,
            "text": "This is refreshing to read. Every headline for as long as I can remember have been touting psychedelics as cute-alls.",
            "title_similarity": "0.33220306",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hw1rr5x",
            "score": 1,
            "text": "Forgive my lack of total knowledge on the subject, but I thought there were some strides with micro dosing?",
            "title_similarity": "0.6520134",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hw1rr6v",
            "score": 1,
            "text": "Well I guess there's no reason for me not to take the whole tab now. Bon voyage, me",
            "title_similarity": "0.4704647",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hw1rrqc",
            "score": 1,
            "text": "...Note to self, next time I get my hands on psychedelics...go all in or chicken out, there is no between.",
            "title_similarity": "0.5383034",
            "sentiment_compound": -0.296
        },
        {
            "id": "hw1rssc",
            "score": 1,
            "text": "What were the dosages, if someone other than my laziness has looked into it?\nEdit: 0.7g dried was the dosage",
            "title_similarity": "0.6355923",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1rt17",
            "score": 1,
            "text": "It's fun on a hike, though.",
            "title_similarity": "0.28908715",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hw1ru60",
            "score": 1,
            "text": "pfffft this doesn't prove anything. The most trusted source on psychedelics is your local depressed hippie. They have proven that it works because it seems to work on them.",
            "title_similarity": "0.61886615",
            "sentiment_compound": 0.024
        },
        {
            "id": "hw1rvhj",
            "score": 1,
            "text": "Was the group also recieving psychological therapy? From my understanding, for both psychoactive drugs like these and the legal pyschiatry medicine for BP and similar, you are directed to take the medicine in tandum with talking to a therapist to achieve the full results. Source: use to be on medication myself and this is what my doctor told and the pharmacologist told me",
            "title_similarity": "0.48600224",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hw1rvoo",
            "score": 1,
            "text": "My word this sub is absurd sometimes. If there are any subs that should hold the scientific method to a high standard it should be this one. The amount of responses complaining about sample size and the lack of awareness of objectivity is insane. You may not like the results of this study but don't wear your confirmation biases on your sleeves. What a degeneration to science.",
            "title_similarity": "0.58266294",
            "sentiment_compound": -0.5354
        },
        {
            "id": "hw1rwe5",
            "score": 1,
            "text": "Maybe try macrodose daily.",
            "title_similarity": "0.3507094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1rxd2",
            "score": 1,
            "text": "“The danger isn’t in taking too much, it’s in taking too little.”",
            "title_similarity": "0.6340366",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hw1ry69",
            "score": 1,
            "text": "I’m concerned about a few things here\n1. Why within subject ? Do we know enough about the possibility of carry over effects with psilocybin?\n2. They excluded those with serious mental illness, so basically this was a non clinical population indicating a possibility of ceiling effects \n3. Why only 3 weeks ? That’s less than half the duration of previous studies…. Do we know how long long psilocybin needs to be taken exert full effect?",
            "title_similarity": "0.72152936",
            "sentiment_compound": -0.7476
        },
        {
            "id": "hw1s3ta",
            "score": 1,
            "text": "Ya, you need to see spirits to fight off those kinds of demons. Take it allllll",
            "title_similarity": "0.36355376",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hw1s7nz",
            "score": 1,
            "text": "People just want to believe it so they can have an excuse to do mushrooms",
            "title_similarity": "0.34516865",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hw1s812",
            "score": 1,
            "text": "This seems to have some issues that people have pointed out, but I'm skeptical of studies that would hurt the pharmaceutical industry. I wonder how much money is made on and invested in current treatments.",
            "title_similarity": "0.6949629",
            "sentiment_compound": -0.8201
        },
        {
            "id": "hw1s9y0",
            "score": 1,
            "text": "What a shocker. Seriously, why are we living in a age where taking untested supplements and psychotropic drugs is not questioned but taking a well tested vaccine or medicine is considered dangerous?\nI know people that would rather smoke weed than take a ibuprofen pill. Like literally. I asked if the weed works better and he admitted to me it doesn't but he doesn't want to \"play with drugs\".\n\nYou guys seriously think something that messes with your perception and brain chemistry doesn't have side effects fir your brain?",
            "title_similarity": "0.7290399",
            "sentiment_compound": 0.278
        },
        {
            "id": "hw1sc5r",
            "score": 1,
            "text": "We’ll there goes someone’s self medication.",
            "title_similarity": "0.36822593",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1seha",
            "score": 1,
            "text": "I can only speak for myself, but I’ve often had worse anxiety and feelings of depression when microdosing. It’s not every time, but it’s happened enough to notice a pattern.",
            "title_similarity": "0.6431469",
            "sentiment_compound": -0.9052
        },
        {
            "id": "hw1sgb2",
            "score": 1,
            "text": "I've done mushrooms for many years. They're my favorite actually. It was a bad trip that convinced me to see a therapist and then, eventually, a psychiatrist. If it weren't for the meds they put me on my life would be a chaotic hellscape by now.\n\nThese meds mean shrooms do nothing for me now but, I wouldn't trade it for anything. Hallucinogens were always my favorite, tried a bunch, cherish my experiences.\n\nThey aren't for everyone though. Even I had a lot of bad trips.\n\nOnly saying this cause it seems reddit does not like this post. I've fucked with shrooms for a long time. Never felt relief until I did therapy and medication.",
            "title_similarity": "0.553781",
            "sentiment_compound": -0.8989
        },
        {
            "id": "hw1skdn",
            "score": 1,
            "text": "Anecdotally, I say it works! Mostly because it *definitely* helps my depression",
            "title_similarity": "0.39803594",
            "sentiment_compound": 0.2244
        },
        {
            "id": "hw1skgn",
            "score": 1,
            "text": "I would like a proper RCT done on the Stamets stack. He is adamant about using ancillary mushrooms and vitamins to make microdosing work.\n\nMy own anecdotal evidence from several close friends is that it is a game changer for mentally healthy and unhealthy people as well. All have benefitted. Placebo? Real effect? Don't know. My own little world has benefitted greatly and I am contraindicated from using psilocybin due to a medication. It would be nice to have a proper study done with the stack.",
            "title_similarity": "0.5596699",
            "sentiment_compound": 0.9231
        },
        {
            "id": "hw1smer",
            "score": 1,
            "text": "Figures, psychedelics kinda need to kick your butt to fix you",
            "title_similarity": "0.42668468",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1so3a",
            "score": 1,
            "text": "Well well well, how the tables have turned.",
            "title_similarity": "0.14116013",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hw1sr85",
            "score": 1,
            "text": "So is there any clue to what the optimal dose/lowest amount you can take that helps alleviate depression",
            "title_similarity": "0.6210866",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hw1srcz",
            "score": 1,
            "text": "I find it ironic that their entire sample size stems from people who already did the mushroom cleanse.",
            "title_similarity": "0.41065156",
            "sentiment_compound": -0.128
        },
        {
            "id": "hw1srry",
            "score": 1,
            "text": "Still works for some people. Poor psilocybin is under so much scrutany. But alcohol, cigs/nicotine, etc are all \"ok\".\n\nThe important factor is that some things work for some people, but not others. It's vital for us to explore different options to help people. We can't just jam everyone full of antidepressants. I've heard about several cases of people being more depressed and suicidal whilst ON antidepressants. So we can't write off psilocybin due to this study. Needs further testing. Because so many people have positive experiences and outlooks on life after having mushrooms/LSD/MDMA.",
            "title_similarity": "0.7393883",
            "sentiment_compound": -0.7405
        },
        {
            "id": "hw1sxdi",
            "score": 1,
            "text": "Anecdotally, I’ve tried microdosing before and messed with a dosage that should’ve theoretically worked, according to those who normally microdose, but definitely got nothing out of it after a month. Anything more and I would’ve just been tripping.\n\nA lot of people do swear by it, but placebos are also a hell of a thing",
            "title_similarity": "0.6826931",
            "sentiment_compound": -0.705
        },
        {
            "id": "hw1sxjs",
            "score": 1,
            "text": "0.15g of typical cubensis once a day for 4 weeks definitely had a huge effect. Highs and lows were subdued and I also started shedding hair. It grew back once I stopped.\n\nIt also et me face things like chores without dread, but also lowered my overall enjoyment of life too. It was sad at all, it was just \"meh, ok\".",
            "title_similarity": "0.50375926",
            "sentiment_compound": 0.3999
        },
        {
            "id": "hw1syeg",
            "score": 1,
            "text": "That’s a big win for macrodosers",
            "title_similarity": "0.21412034",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hw1t3oq",
            "score": 1,
            "text": "Man I should tell my roommate who wants to trip for two weeks to cure her depression",
            "title_similarity": "0.33846956",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hw1t6us",
            "score": 1,
            "text": "Just keep the Prozac pumping",
            "title_similarity": "0.2540607",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1t93u",
            "score": 1,
            "text": "Idk but from my recreational experience. The best time is post a pretty good trip like an 1/8th. You feel rejuvenated in living in the moment and the world shimmers. Can last a good long while if you were able to work through something. Or completely confusing and scary…",
            "title_similarity": "0.41557997",
            "sentiment_compound": 0.9641
        },
        {
            "id": "hw1tcw8",
            "score": 1,
            "text": "I get cluster headaches, and when they first started I was told that microdosing would help. It turned out that larger amounts of mushrooms were needed. I wonder if it's similar for mental health. That a larger dose is needed. \nI think it's fantastic that research is being done, and I look forward to seeing more findings.",
            "title_similarity": "0.51207435",
            "sentiment_compound": 0.743
        },
        {
            "id": "hw1tfaj",
            "score": 1,
            "text": "I can tell you first hand that it helped my depression immensely. Very happy (and lucky) to be alive. Not on any anti-depressants, which I had long-term concerns about regarding side effects. I no longer microdose as it did it’s job and put me back on track. So thankful that this substance exists.",
            "title_similarity": "0.61453223",
            "sentiment_compound": 0.9135
        },
        {
            "id": "hw1tgbv",
            "score": 2,
            "text": "I’m still holding out hope that maybe this could help relieve some of the issues that come with having GAD and panic attacks.",
            "title_similarity": "0.5401012",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hw1tjju",
            "score": 1,
            "text": "I have had some experience with social anxiety. I don’t know why someone would take a medication to fix it. I know social anxiety isn’t the only kind and that there is probably worse versions of it. Everyone has anxiety and is just something you overcome. Depression is different.",
            "title_similarity": "0.6542083",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hw1tkei",
            "score": 1,
            "text": "Huh, on the exact day I decided to try a micro dose of psilocybin I get this article",
            "title_similarity": "0.42288923",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1u4c7",
            "score": 1,
            "text": "I want to be hopeful that the bigger studies will say differently, but my depression is still wearing the crown.",
            "title_similarity": "0.55571485",
            "sentiment_compound": -0.5789
        },
        {
            "id": "hw1uac9",
            "score": 1,
            "text": "So, let’s go back to taking it for fun. Where’s the fun in a micro dose? It’s not there, that’s where! Start boiling those shrooms!",
            "title_similarity": "0.4344186",
            "sentiment_compound": 0.8011
        },
        {
            "id": "hw1uazk",
            "score": 1,
            "text": "I’m assuming this testing was done somewhat recently . Would it make a difference if this was done during not the worst mental health crisis of the modern area ?\n\nCovid created an environment where nearly everyone has suffered tremendously as it pertains to mental health .",
            "title_similarity": "0.57188827",
            "sentiment_compound": -0.4599
        },
        {
            "id": "hw1ufxg",
            "score": 1,
            "text": "Microdosing should not be used for the treatment of depression or anxiety.\n\nStandard dosing practices combined with meditation, focus of intent, and a desire to listen to the plant; are necessary for one to relieve such psychological burdens.",
            "title_similarity": "0.6323892",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hw1uhbp",
            "score": 1,
            "text": "Just finished reading Michael Pollans book “How to Change Your Mind: What the New Science of Psychedelics Teaches Us About Consciousness, Dying, Addiction, Depression, and Transcendence” and it’s interesting to see this new information.",
            "title_similarity": "0.5186166",
            "sentiment_compound": -0.25
        },
        {
            "id": "hw1uhox",
            "score": 1,
            "text": "This is my personal experience\n\nMushroom trip - Helps with depression. Almost feels like you have \"reset\" your brain. The trip itself can be quite difficult.\n\nMicrodose psilocybin - Helps regulate and improve mood I guess is the best way I can put it. Doesn't really help with depression or anxiety.\n\nLSD Trip - Can be fun. I don't think it's as good at treating depression as shrooms because it is less of an inward experience.\n\nMicrodose LSD - Increased creativity and made me a bit more extroverted.",
            "title_similarity": "0.7124787",
            "sentiment_compound": 0.7261
        },
        {
            "id": "hw1uje3",
            "score": 1,
            "text": "What about massive doses?",
            "title_similarity": "0.09783973",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1ujrv",
            "score": 1,
            "text": "\"we need more studies on this\"\n\n*Study doesn't turn out the way you want*\n\n\"Well the sample size was too small / technique/etc\"\n\nThat's not how science works guys",
            "title_similarity": "0.71595514",
            "sentiment_compound": 0.34
        },
        {
            "id": "hw1umwm",
            "score": 1,
            "text": "The problem is probably 'microdosing'.",
            "title_similarity": "0.5103111",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hw1uow4",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw1uvll",
            "score": 1,
            "text": "Like how aderall use works everyday for some people and others it doesn’t. Or some people smoke weed in the morning and are fine and others can’t function. Think what we really need to study is what works for you.",
            "title_similarity": "0.66247183",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hw1uy71",
            "score": 1,
            "text": "Well, magic shrooms helped me out of suicidal depression. Been free of it for 2 years now.",
            "title_similarity": "0.5321909",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hw1v2g5",
            "score": 1,
            "text": "*this study brought to you by Big Pharma and the Government",
            "title_similarity": "0.2903623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1v4v5",
            "score": 1,
            "text": "Doesn’t matter. Legalize it anyway",
            "title_similarity": "0.33591732",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hw1v5mc",
            "score": 1,
            "text": "I appreciate that the comments are a bunch of different viewpoints this kind of discussion is why I love Reddit.",
            "title_similarity": "0.24445397",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hw1vax5",
            "score": 1,
            "text": "can trick me into thinking it works.",
            "title_similarity": "0.3066034",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hw1vchg",
            "score": 1,
            "text": "I'm loving all the research finally being done about psychedelic therapy and other routes other than SSRIs, even when there seems to be setbacks.  It's leaving me hopeful more than anything else right now that in the not horribly distant future we can finally figure out how to fix most people's serotonin problems for good.  At least I want to think so.",
            "title_similarity": "0.49403858",
            "sentiment_compound": 0.881
        },
        {
            "id": "hw1vf5j",
            "score": 1,
            "text": "But... they said I can do drugs though. I'm gonna keep looking for the right study that says I can do drugs.",
            "title_similarity": "0.4821577",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1vg7c",
            "score": 1,
            "text": "Works fars better than SSRI's",
            "title_similarity": "0.41318634",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw1vga0",
            "score": 1,
            "text": "The thing that does improve symptoms of depression or anxiety is reducing the work hours to 6 hours a day",
            "title_similarity": "0.5876188",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hw1vhi9",
            "score": 1,
            "text": "The major problem with these studies involving micrdosing and depression, is there are likely- either, a number of sources/causes, or a number of types of depression - impossible to tell if it might be great for one type but useless for another",
            "title_similarity": "0.6540673",
            "sentiment_compound": -0.7612
        },
        {
            "id": "hw1vlgk",
            "score": 1,
            "text": "This is why I MACROdose!",
            "title_similarity": "0.09945057",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1vny2",
            "score": 1,
            "text": "I had large dose and it changed my perspective",
            "title_similarity": "0.21501723",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1vpy2",
            "score": 1,
            "text": "Macrodosing is the way.",
            "title_similarity": "0.21876201",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1vqan",
            "score": 1,
            "text": "This has never stopped a Naturopath before",
            "title_similarity": "0.37040985",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hw1vqv1",
            "score": 1,
            "text": "That’s where you’re wrong, bucko",
            "title_similarity": "0.308709",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hw1vrkz",
            "score": 1,
            "text": "Funny how Reddit suddenly starts caring about scientific process and tries to find anything to discredit a study when it puts drugs in a bad light. If this was the other way around this whole thread would be signing such a different tune.",
            "title_similarity": "0.5998408",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hw1vrle",
            "score": 1,
            "text": "This is meaningless. The drug is not available for large scale testing - psilocybin is a Schedule I substance under the Controlled Substances Act. This article is just conjecture - nothing more.",
            "title_similarity": "0.7049768",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hw1vxfi",
            "score": 1,
            "text": "Welp can't argue, but shrooms in LARGE doses worked wonders for my depression.",
            "title_similarity": "0.5091028",
            "sentiment_compound": -0.6738
        },
        {
            "id": "hw1vyji",
            "score": 1,
            "text": "Not surprising given that currently research shows that high / hero doses are the ones appearing to have positive impacts on depression",
            "title_similarity": "0.5131495",
            "sentiment_compound": 0.3991
        },
        {
            "id": "hw1wage",
            "score": 1,
            "text": "IIRC the benefits that have been making headlines recently are when psilocybin is taken during psychotherapy sessions. This study only uses simple screening questions to evaluate a small sample size after they had consumed psilocybin or placebo. I see what they were going for, but this does not directly refute the benefits that have been reported previously.",
            "title_similarity": "0.75035965",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hw1wm4q",
            "score": 1,
            "text": "Just tried this myself and I totally turned a corner. A few memories I had were too depressed/recessed/unaddressed and the microdosing shook the bad thoughts away. Only did like 10 grams over few weeks, more than needed.",
            "title_similarity": "0.6199139",
            "sentiment_compound": -0.34
        },
        {
            "id": "hw1x3so",
            "score": 1,
            "text": "Terrance McKenna was right. Heroic dosing is the way to go. It's science.",
            "title_similarity": "0.22038794",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hw1xbax",
            "score": 1,
            "text": "Conducted by who? Research funded by who?",
            "title_similarity": "0.23458311",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1xg62",
            "score": 1,
            "text": "I would say 2-4 more intense trips a year might be better than constantly micro dosing. Just like any vacation longer than 2 weeks won’t bring any more “rest”. Take large multiple vacations a year.  Not small vacations daily",
            "title_similarity": "0.5964344",
            "sentiment_compound": 0.7178
        },
        {
            "id": "hw1xgex",
            "score": 1,
            "text": "Micro dosing doesn't work with shrooms or mescaline.",
            "title_similarity": "0.69885135",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw1xh1h",
            "score": 1,
            "text": "This saddens me as I've been trying to find a cure for my depression and PTSD. Something will work until it doesn't. I just want to feel normal.",
            "title_similarity": "0.606822",
            "sentiment_compound": -0.7797
        },
        {
            "id": "hw1y834",
            "score": 1,
            "text": ">The ***psilocybin microdoses were created by the participants*** during the microdosing workshop. The ***doses contained 0.7 g of dried psilocybin-containing Galindoi truffles***, which corresponds to around 1/10th of a medium-high dose. Participants were instructed to ***keep the doses in the fridge.***\n\nGalindoi truffles (AFAIK) are a form of Mexicana truffles which are sold to  beginners in Netherlands smart shops (so the weakest form).\n\nSo, the flaw in this particular study is that they used 0.7g of a weak form of truffles. They took some samples and found 1.5mg of psilocybin. But [recent research](https://www.reddit.com/r/microdosing/comments/qdta2z/research_data_more_evidence_of_the_chemical/) shows the potency of shrooms can vary up to 5x in the same flush.\n\nSo participants will have taken varying amounts of psilocybin. Also, some methods of drying can cause a [loss of potency](https://www.reddit.com/r/microdosing/comments/os7zym/research_data_temperature_stability_of_mushroom/).\n\nLater in the study:\n\n>**Limitations**  \n>  \n>We note five key limitations of our study. First, our sample suffers from selection bias, since participants were self-selected from a microdosing workshop. As a result, most of our participants had tried psychedelics previously, which means that they may have broken blind easier or may have been desensitized to the microdosing effects. ***Second, the psilocybin doses were made by the participants using dried psilocybin truffles, meaning that we cannot be sure of the exact amounts of psilocybin in the individual doses that the participants consumed.*** It is possible that the degree of psilocybin content varied across participants and thereby obscured our results. Third, we encountered a large drop-out rate during this project and several participants did not sufficiently comply with the behavioural guidelines to be included in the analyses. This resulted in small sample size relative to existent observational studies and in a further selection bias (i.e. only motivated participants likely stayed in). Moreover, due to such sample size, our study may have been underpowered to detect true effects, particularly the interaction effect hypothesized for the emotional go/no-go task.\n\nMore details about psilocybin preparation, storage and dosing in the [Psilocybin FAQ](https://www.reddit.com/r/microdosing/comments/q5zvyk/faqtip_019_why_you_may_need_to_adjust_the_dose/).\n______________\nAnother [microdosing study resulted in trippy effects](https://www.reddit.com/r/microdosing/comments/rja452/another_doubleblind_placebocontrolled_preprint/) after dosing (above the [threshold](https://www.reddit.com/r/microdosing/comments/plrxca/faqtip_101_what_is_the_subthreshold_dose/)) which can lead to tolerance and receptor downregulation, but they dosed **again** 2 days later:\n\n0.5g is too high for a microdose and for some can lead to ['come-up body load](https://www.reddit.com/r/microdosing/comments/mw2ohn/quick_tip_005_comeup_unpleasant_body_load/) and impairment. And some of these tests were conducted after dosing.\n\n>**Discussion**  \n>  \n>According to our results, 0.5 g of dried mushroom material did not significantly impact in any of these domains, although we observed a trend towards ***impaired performance in some cognitive tasks*** (attentional blink and Stroop). In contrast, *the overall acute  effects induced  by the  microdose (VAS total  score)* ***were  significant***, although  they lacked consistency across participants.\n\n* VAS (so no placebo effect with 0.5g):\n\n>Visual Analog Scale (VAS). The items were translated and adapted from Carhart-Harris et al. (2016) and presented in the form of VAS to determine the intensity of the effects experienced by subjects. The items rated in the VAS  were the  following: “My  imagination was  extremely vivid”, “The experience had  a dreamlike quality”, “Sounds influenced things I saw”, “My sense of space and size was distorted”, “I felt unusual bodily sensations”,  “My  thoughts  wandered  freely”,  “My perception  of  time  was  distorted”,  “I  saw  geometric patterns”, “Edges appeared warped”, “My thinking was muddled”, “I saw movement in things that weren’t really moving”, “I experienced a sense of merging with my surroundings”, “Things looked strange”, “I felt like I was floating”, “The experience had a supernatural quality”, “I experienced a disintegration of my self or ego”, “I felt a profound inner peace”, “The experience had a spiritual or mystical quality”, “I felt afraid”, “I feared losing control of my mind”, “I felt suspicious and paranoid”).\n\nIf you dose above the [threshold](https://www.reddit.com/r/microdosing/comments/plrxca/faqtip_101_what_is_the_subthreshold_dose/) that can lead to [intoxication](https://psychonautwiki.org/wiki/Dosage_classification#Threshold) which would explain the VAS.\n_____________\n[National Geographic](https://www.reddit.com/r/microdosing/comments/skpkqk/can_microdosing_psychedelics_boost_mental_health/) recently wrote that these placebo studies (when self-administering doses) are fundamentally flawed as no-one knows the potency of their microdose:\n\n>That presents a problem for both the scientists and the microdosers. When active users respond to surveys about their experiences for observational research, the scientists can’t be sure each person is taking the same amount. After all, there aren’t standardized products a person can pick up at the local pharmacy. It’ s especially challenging for someone to determine an exact psilocybin microdose from a batch of dried mushrooms or a lick of an LSD tab, says Jerome Sarris, executive director of the Psychae Institute in Melbourne, Australia.",
            "title_similarity": "0.5249672",
            "sentiment_compound": -0.9162
        },
        {
            "id": "hw1ygzk",
            "score": 1,
            "text": "\"...It could also be that it takes some time for microdosing to take effect and that merely doing this for a few weeks is not enough to establish the long-term effects.”\n\n“Another caveat is that many people in our study broke blind and they figured out what condition they were assigned to,”",
            "title_similarity": "0.70168686",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hw1yv7l",
            "score": 1,
            "text": "I've never heard of microdosing for mood/emotional effects, it's for boosted cognition. Normal doses at longer intervals is what's supposed to improve depression.",
            "title_similarity": "0.7266705",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hw1zgnm",
            "score": 1,
            "text": "I know for a fact some people can benefit from the perspective mushrooms can give you.  Is it not obvious that its not a cure all? Just throw the baby out with the bath water?  Mushrooms can give you the kind of insight into what is bothering you.  Some people might realize they are unhappy at in their profession or marriage and can then make changes to improve those things now that the problems been identified.  Some people might realize they are actually gay or that they are/arent religious but were unable to even consider admitting it to themselves.",
            "title_similarity": "0.60645807",
            "sentiment_compound": -0.2406
        },
        {
            "id": "hw1zh40",
            "score": 1,
            "text": "This doesn't surprise me because a John Hopkins study using cancer patients found that \"mystical experience mediated clinical outcomes\", in other words you need the full blown psychedelic experience to have the extreme reduction in anxiety and depression that they found. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5367557/",
            "title_similarity": "0.58573264",
            "sentiment_compound": -0.8974
        },
        {
            "id": "hw207a4",
            "score": 2,
            "text": "that's pretty obvious, the reason it works is because big trips can change people's view of the world for the better",
            "title_similarity": "0.36113656",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hw209if",
            "score": 1,
            "text": " will barely get things started...",
            "title_similarity": "0.44522494",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw21gh6",
            "score": 2,
            "text": "Results may be conflicting but the reason it literally doesn’t matter is because we have empiricism",
            "title_similarity": "0.5424507",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hw21glc",
            "score": 1,
            "text": "Damn. I really wanted this to be some illegitimate, pharma backed nonsense. It’s not. Good reasoning, good data. They’re not against psilocybin, just the cultural weight of the term ‘microdosing’ and its specific efficacy.",
            "title_similarity": "0.6509309",
            "sentiment_compound": -0.8447
        },
        {
            "id": "hw21k0t",
            "score": 1,
            "text": "Damn... Well, I'm still gonna do it.",
            "title_similarity": "0.05989506",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hw21qp8",
            "score": 1,
            "text": "Whelp. Back to mckenna heroic doses I guess.",
            "title_similarity": "0.25346178",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hw21wzv",
            "score": 1,
            "text": "I look forward to the next study that says the exact opposite in a few months",
            "title_similarity": "0.40817952",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw23sh6",
            "score": 1,
            "text": "that's a real bummer. I was hoping I might actually find something to help after 25 years of trying various chemicals and therapy.",
            "title_similarity": "0.552177",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw23tu5",
            "score": 1,
            "text": "at least it gave me hope. now what?",
            "title_similarity": "0.26089528",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw23tz9",
            "score": 1,
            "text": "Good to know what doesn’t work too.",
            "title_similarity": "0.4214766",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw23z67",
            "score": 1,
            "text": "I had a friend who regularly took mushrooms and they felt more depressed after several days/weeks of taking shrooms. I’ve seen nothing positive from it",
            "title_similarity": "0.5945188",
            "sentiment_compound": -0.5134
        },
        {
            "id": "hw243re",
            "score": 1,
            "text": "Psychedelic users, especially psilocybin regular users are the most in denial delusional people on earth",
            "title_similarity": "0.5087527",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw24awm",
            "score": 1,
            "text": "Asking people if they feel better too often perhaps stresses them out and prevents them from feeling better? Just a thought...",
            "title_similarity": "0.6415907",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hw24dwr",
            "score": 1,
            "text": "Yea I don’t agree with this finding. There are many instances in which this treatment has significantly helped people with PTSD. There have been multiple tests done that show the differential in patients that have not gone through vs patients that have. These findings are BS",
            "title_similarity": "0.56164956",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hw25iin",
            "score": 1,
            "text": "Of course it does. It makes the subject less likely to believe in depression or antidepressants so I guess it kinda does work",
            "title_similarity": "0.69002116",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hw26c0j",
            "score": 1,
            "text": "I can't imagine that it would. The two biggest components to psilocybin's therapeutic potential are its specifically distributed effects on brain neurochemistry and structure (increased connectivity, fear extinction in the hippocampus, neurogenesis in the hippocampus and increased brain plasticity) on the one hand, and insightful introspective and potential breakthrough experiences that can be practically applied to alter the structure of one's life and thought patterns.\n\nThe former effect is more applicable to healing fundamental brain aberrations or even potentially actual brain damage from a variety of minor and major causes while the latter is more applicable within therapeutic settings to combat disorders where the patient will benefit more from fundamental shifts in perspective and experience. Microdosing suits the former effect more while breakthrough experiences suit the latter more, with psilocybin's intrinsic effects on the brain working in tandem with therapy but having little effect purely in isolation.",
            "title_similarity": "0.554671",
            "sentiment_compound": -0.5672
        },
        {
            "id": "hw27ysz",
            "score": 1,
            "text": "Like... how a person would consume medication, perhaps?",
            "title_similarity": "0.5242677",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hw283f6",
            "score": 1,
            "text": "Well, there goes another possible treatment option",
            "title_similarity": "0.2837066",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hw28bay",
            "score": 1,
            "text": "That’s cause you don’t do it everyday I’m small doses. That’s just creating another addict. Do it in large doses a few times a year at your favorite concert. You’ll just have to trust me on this one.",
            "title_similarity": "0.5706388",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hw28i8e",
            "score": 1,
            "text": "Figures. A large dose makes quite the difference. They are two very different trips.",
            "title_similarity": "0.30485943",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw28t88",
            "score": 1,
            "text": "The hell it doesn't. I can speak from experience that it does help with those things.",
            "title_similarity": "0.3370704",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hw28xg6",
            "score": 1,
            "text": "I’m not a microdoser, but several psychotropic and dissociative drugs anecdotally help my specific mental illness for a time after the trip ends. I occasionally self medicate with psilocybin and ketamine. I take pretty big doses when I’m self medicating, though.",
            "title_similarity": "0.7453544",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hw2939y",
            "score": 1,
            "text": "Important to note that they excluded people with symptoms of depression or anxiety outside the normal range. So they excluded people with clinical range symptoms.",
            "title_similarity": "0.7302919",
            "sentiment_compound": -0.8261
        },
        {
            "id": "hw29dmf",
            "score": 1,
            "text": "You gotta do the work.  It's tough, it's rough, but you can't take a shortcut.  It's not the substance, it's the work that heals you.",
            "title_similarity": "0.52823806",
            "sentiment_compound": -0.0644
        },
        {
            "id": "hw29o68",
            "score": 1,
            "text": "Given how average the experience of antidepressants is for most people, more research should be made.",
            "title_similarity": "0.55959725",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2a3e0",
            "score": 1,
            "text": "“Of course, this does not mean that microdosing is completely ineffective,” van Elk said. “We only found no objective evidence in our controlled study. But there are indeed many caveats. It could well be that the dosing we used was suboptimal and needs to be fine-tuned on an individual basis. It could also be that it takes some time for microdosing to take effect and that merely doing this for a few weeks is not enough to establish the long-term effects.”\n\nThat was my first thought: what was the dose and for how long was the experiment conducted. I live in the north and a depressed winter vs not depressed relies wntirely on wether i micro dose liberty caps or not. I'm super sensitive and need about half a mushroom to begin with, working up to a whole mushroom as tolerance builds. \n\nPs. Dosage for liberty caps is different to say cubensis where you would dose in grams as the psilocybin/psilocin content in lb's don't vary much regardless of size.",
            "title_similarity": "0.7755203",
            "sentiment_compound": 0.8374
        },
        {
            "id": "hw2a80q",
            "score": 1,
            "text": "All I know is, microdosing saved my life.",
            "title_similarity": "0.38384345",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hw2aa39",
            "score": 1,
            "text": "I mean... okay. I've never microdosed. But I've had psychedelic mushrooms and lsd. And they *absolutely* alter your perspective and help with depression and anxiety. \n\n*However*, two things:\n\n1) Doing any drug continuously, and consistently, is going to have diminishing returns over time. You build up a tolerance. You become accustomed to the feeling so it's no longer new, just the norm. \n\n\n2) Too much of either is a bad thing; ultimately. (And can exacerbate anxiety/depression.) You're not gonna die. But you can easily become dependent on it just for the feeling it produces. And without it there's definitely a considerable period of adjustment before you start feeling whatever your \"normal\" is; new or old.\n\n\nSo, I dunno, everyone, my only advice is be mindful of the drugs you take, how much, how regularly, and what that *means* for you. Why do you enjoy it? Are you addicted? Should you quit before you are? Ask yourself questions. Face your *self*. \n\n\nThe best thing about my experience with psychedelics was, has been, that I can ponder ideas from a new perspective. I'm contemplative by nature so I find new questions to ask myself. But I also can easily overindulge myself. So it's a fine line. \n\n\nJust be in a safe place if you use anything heavy; with people you trust. It really makes a difference.",
            "title_similarity": "0.75402963",
            "sentiment_compound": 0.9777
        },
        {
            "id": "hw2aagi",
            "score": 1,
            "text": "Based on my own experiments, I really had to add more to the stack to get any long term benefit and actually get an edge on my depression. But after adding, Lions Mane and Niacin it was only a few months before a depression that had lasted 10 years was eradicated.   \n\nIt has been at least 2 years since I have felt any of those dark feels I used to have so regularly.   \n\nIt works, you just have to take the right things and do the work on yourself as well at the same time.  I’m talkin about exercise, meditation and finding more purpose and joy in life.",
            "title_similarity": "0.5688895",
            "sentiment_compound": 0.4302
        },
        {
            "id": "hw2aijc",
            "score": 1,
            "text": "Got me off the cigarettes tho",
            "title_similarity": "0.32872987",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2ajoz",
            "score": 1,
            "text": "Funded by Pfizer im sure",
            "title_similarity": "0.20527437",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hw2alfl",
            "score": 1,
            "text": "It’s been my experience that microdosing doesn’t do anything for me either",
            "title_similarity": "0.6752286",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2aln5",
            "score": 1,
            "text": "You have to dose, not micro-dose, to see any effects. Duhh",
            "title_similarity": "0.56938094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2alyp",
            "score": 1,
            "text": "…So what your saying is that I should increase my doses?",
            "title_similarity": "0.22150165",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hw2as9w",
            "score": 1,
            "text": "But let me guess this new pharma pill with 10000000% profit does what a joke all these studies have become science has sold it's integrity for a cheap payout",
            "title_similarity": "0.50194263",
            "sentiment_compound": 0.8765
        },
        {
            "id": "hw2b35c",
            "score": 1,
            "text": "Ok, I'll say this in case any of these researchers are here.\n\n**It's. Not. The. Drugs!**\n\nMushrooms can cure depression and anxiety, as *part of* a larger treatment involving mental preparation, right attitude, etc.\n\nChucking mushrooms at depressed people like they're another pharmaceutical isn't the right approach. Obviously it will work with some, but others will find themselves wandering back into their old ego-games, and some may even find themselves stuck in a nightmare bardo with no framework to find their way out with!",
            "title_similarity": "0.66076595",
            "sentiment_compound": -0.8395
        },
        {
            "id": "hw2b4ym",
            "score": 1,
            "text": "Microdosing is out, bring on acid parties. I try and have a full on trip once a year. I find it really helps preventing serious symptoms of depression. Also, regularly exercise, and plenty of water and a balanced diet are really helpful as well.",
            "title_similarity": "0.49701548",
            "sentiment_compound": 0.6606
        },
        {
            "id": "hw2bh66",
            "score": 1,
            "text": "better than drinking your liver to death.",
            "title_similarity": "0.41998595",
            "sentiment_compound": -0.25
        },
        {
            "id": "hw2bl9e",
            "score": 1,
            "text": "Definitely need more research on this topic lots more studies need to be done.",
            "title_similarity": "0.17715941",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hw2brvq",
            "score": 1,
            "text": "This makes me so sad. I was really hoping for new development on anxiety and depression relief.",
            "title_similarity": "0.5079154",
            "sentiment_compound": -0.4936
        },
        {
            "id": "hw2cbqw",
            "score": 1,
            "text": "It has been known for a long time now that micro doses are mainly placebo effect. Psilicin develops a very strong tolerance after one dose.",
            "title_similarity": "0.48445997",
            "sentiment_compound": 0.7245
        },
        {
            "id": "hw2cffb",
            "score": 1,
            "text": "do 3.5gs and have a real life changing moment",
            "title_similarity": "0.1663186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2cmnx",
            "score": 1,
            "text": "A psychiatrist once told me that psychedelics like psilocybin use the same neuron receptors than SSRIs.\n\nIs that true?",
            "title_similarity": "0.60938025",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hw2css2",
            "score": 1,
            "text": "Then I guess we’ll just have to stick to full dosing",
            "title_similarity": "0.31927967",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2d0jn",
            "score": 1,
            "text": "I feel like this isn’t really something that is a yes or no, I feel like it’s something specific to people. I don’t microdose on the regular, but I do occasionally and I feel like it does help with my depression slightly, definitely more that pristique or Prozac or any of the other garbage they gave me.",
            "title_similarity": "0.72459656",
            "sentiment_compound": 0.8026
        },
        {
            "id": "hw2dhtu",
            "score": 1,
            "text": "More trials… pharmaceutical companies don’t want there to be any benefit.",
            "title_similarity": "0.7109686",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hw2dkpm",
            "score": 1,
            "text": "I wonder who funded this. Wanna take a guess? Also; the sample size is puny.",
            "title_similarity": "0.51843625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2dsij",
            "score": 1,
            "text": "I've long suspected that micro-dosing is just a waste of good shrooms.\n\nBoy does the world ever feel less awful after macro-dosing though.",
            "title_similarity": "0.68373203",
            "sentiment_compound": -0.5434
        },
        {
            "id": "hw2dyow",
            "score": 1,
            "text": "Time to distrust the science and \"do more research \"",
            "title_similarity": "0.48668116",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hw2e5sv",
            "score": 1,
            "text": "Who would have thunk it, folks promoting drugs were likely vastly over-stating the benefits of the drugs, wow, you just never know.",
            "title_similarity": "0.5869713",
            "sentiment_compound": 0.836
        },
        {
            "id": "hw2efmo",
            "score": 1,
            "text": "Yes. Continue taking your Zoloft. Labs regularly commissioned by pharmaceutical companies find no evidence a natural path may work for some people to alleviate a natural problem. Everyone should remain on their zoloft",
            "title_similarity": "0.6337695",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hw2ek2m",
            "score": 1,
            "text": "Weird how one trip can change ur entire life and then you expect me to believe this? ALL we need is research!",
            "title_similarity": "0.47779226",
            "sentiment_compound": -0.2481
        },
        {
            "id": "hw2eoon",
            "score": 1,
            "text": "Someone better tell my depression that.",
            "title_similarity": "0.3550581",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hw2eovi",
            "score": 1,
            "text": "The pharmaceutical companies have a lot to lose with any natural treatment.",
            "title_similarity": "0.53512263",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hw2etpq",
            "score": 1,
            "text": "Arent there a ton of studies to the contrary?",
            "title_similarity": "0.2643677",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2ezly",
            "score": 1,
            "text": "Imagine living with anxiety and having done shrooms before and having the internet tell you that psilocybin could be an effective treatment for anxiety.\n\nFor people with anxiety, psychedelics are a living hell. Period.\n\nIf you’re even adjacent to the psychedelic community you know shits loads of people permanently fucked up from psychedelic use.\n\nAt what point do we start considering that Reddit is part of a modern MK Ultra experiment to see how many anxiety ridden neets they can get to take drugs?",
            "title_similarity": "0.5931879",
            "sentiment_compound": -0.93
        },
        {
            "id": "hw2f1x2",
            "score": 1,
            "text": "We knew this all along.",
            "title_similarity": "-0.061129227",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2fgwo",
            "score": 1,
            "text": "I was under the impression that people were going with considerably higher doses for depression relief. Micro-dosing is typically used for productivity, creativity, and critical thinking increases.",
            "title_similarity": "0.4857536",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hw2fue3",
            "score": 1,
            "text": "Personal experience: I was hoping it would work, but I didn't feel any difference.",
            "title_similarity": "0.5369646",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hw2g58o",
            "score": 1,
            "text": "Signed: Your friends at GKS",
            "title_similarity": "0.1785863",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hw2g940",
            "score": 1,
            "text": "I never had the patience to micro dose to test this out.  I bought the pills but just ended up macro dosing.",
            "title_similarity": "0.7043557",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2gkjw",
            "score": 1,
            "text": "I noticed a pattern:\n\nIf study says doing drugs is good every comment is on how great the authors are and how the methodology is perfect.\n\nIf a study says doing drugs is bad then all the comments are hypercritical of the study and are full of anecdotes about how they microdosed and now they have zero ailments and all their diseases have been cured. \n\nNaturally on this site, the anecdotes are unchallenged because drug good.",
            "title_similarity": "0.5370132",
            "sentiment_compound": 0.8779
        },
        {
            "id": "hw2gm6z",
            "score": 1,
            "text": "Hopefully the people in the study weren't already on antidepressants. Apparently they block out the good stuff? I dunno, I have taken shrooms twice and literally nothing happened, supposedly because of Paxil",
            "title_similarity": "0.769318",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hw2h00f",
            "score": 1,
            "text": "That is not good enough research to be comparable to all the research saying the opposite. \n\nLETS ALWAYS LISTEN TO SCIENCE \n\nhowever this is not substantial enough to change anyone’s views currently",
            "title_similarity": "0.6693572",
            "sentiment_compound": -0.4585
        },
        {
            "id": "hw2h84d",
            "score": 1,
            "text": "From my own experience psilocybin saved my life. I was on the verge of suicide. My first dose instantly changed me within an hour of taking it and I’ve been exponentially better ever since. I still have a lot of work to do in order to deal with the underlying issues that led me to depression but microdosing gave me so much hope. \n\nI don’t use any other form of medicine to treat depression now.",
            "title_similarity": "0.5579457",
            "sentiment_compound": 0.1324
        },
        {
            "id": "hw2h89t",
            "score": 1,
            "text": "Was the Johns Hopkins study focused on micro dosing or “macro” dosing?",
            "title_similarity": "0.49986523",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hw2ha3n",
            "score": 1,
            "text": "Since we're all sharing..\nFor me, micro helps with creativity and focus. It's also awesome for my public speaking events, it keeps me relaxed and removes the stage fright feeling. \nMacro, 2-3 times a year, has a positive mood effect that lasts for weeks afterwards.",
            "title_similarity": "0.39724565",
            "sentiment_compound": 0.9501
        },
        {
            "id": "hw2hglh",
            "score": 1,
            "text": "Never doubt the sheer power of a placebo.",
            "title_similarity": "0.22463138",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hw2hgzw",
            "score": 1,
            "text": "I tried microdosing. was a waste of money. Best to take a larger size sample once over a long period than it is to take small samples over the same period.",
            "title_similarity": "0.67043555",
            "sentiment_compound": 0.34
        },
        {
            "id": "hw2hibm",
            "score": 1,
            "text": "Is that a *pill-o-psilocybin?* How neat!",
            "title_similarity": "0.46595564",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hw2hlyp",
            "score": 1,
            "text": "50,000 years of use disagrees with you science, sorry. I suggest a macro dose anyways.",
            "title_similarity": "0.50642395",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hw2hnz8",
            "score": 1,
            "text": "*This research brought to you by the fine makers of your favorite opioids. Ask your doctor about them today!*",
            "title_similarity": "0.43195492",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hw2hokl",
            "score": 2,
            "text": "According to research ... done by folks that have never microdosed in their lives .....",
            "title_similarity": "0.49653825",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2hq6p",
            "score": 1,
            "text": "My main understanding of the research so far is that microdosing combined with therapy offers added benefit.  This is just people going home and taking mushrooms.",
            "title_similarity": "0.4663546",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hw2hvap",
            "score": 1,
            "text": "Works for me though. It decreased my desire to get wasted to a very high degree.",
            "title_similarity": "0.6033037",
            "sentiment_compound": -0.128
        },
        {
            "id": "hw2i6ai",
            "score": 1,
            "text": "I wonder who paid for this study.",
            "title_similarity": "0.4085089",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2i83i",
            "score": 1,
            "text": "I remember one of the \"landmark\" studies showing \"promising results\" having some seriously flawed methods but the scientifically illiterate masses were all hyped up on funding it. I tried pointing it out, but everyone I talked to about it just dismissed me despite me being a biochemist with a background in neuro.",
            "title_similarity": "0.5842478",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hw2iqe2",
            "score": 1,
            "text": "I never thought this would work in the first place.people generally get high or drunk expecting some out of body experience, or to take them away from everyday problems. That latter one isn't going away. Problems require solutions, and trying to avoid them only allows them to get worse. Problems require you to address them head on, and drugs or alcohol are not going to alleviate that. And those problems are usually what get people into the funk of depression in the first place. They can cause the anxiety associated with the depression. Hiding from them isn't going to solve them.",
            "title_similarity": "0.7068504",
            "sentiment_compound": -0.971
        },
        {
            "id": "hw2j5mp",
            "score": 1,
            "text": "This fits my personal experience tbh",
            "title_similarity": "0.15223895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2j7p0",
            "score": 1,
            "text": "Last I read it said it was overwhelmingly positive compared to standard anti depressant pills ? So is this not the case anymore ? This is very bad news , I never tried anything like this but it looked to have more promise than many other pills you buy this being a natural mushroom from nature.",
            "title_similarity": "0.62317705",
            "sentiment_compound": 0.5644
        },
        {
            "id": "hw2jb9s",
            "score": 1,
            "text": "The same thing was literally said about getting treatments of ketamine but I found it to be extremely helpful, just make me super tired (it’s a tranquilizer after all) and now it’s a viable treatment that gets offered for depression, anxiety and PTSD through Veterans Affairs programs but I was part of the trial study almost a decade beforehand, the “Guinea pig” money bought me a Bob-O-Pedic and the data helped veterans like myself.",
            "title_similarity": "0.53963965",
            "sentiment_compound": 0.3898
        },
        {
            "id": "hw2jm32",
            "score": 1,
            "text": "Macro dosing has an extremely positive effect on my headspace for weeks afterwards",
            "title_similarity": "0.26029852",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hw2jpq3",
            "score": 1,
            "text": "Anytime I would say this on Reddit I got flamed by a bunch of dude bros. \n\nIn fact mushrooms prolly made my mental health worse anecdotally. Reddit just loves shrooms. But for my treatment resistant depression and anxiety it did nothing and prolly made my anxiety much worse",
            "title_similarity": "0.5471258",
            "sentiment_compound": -0.9186
        },
        {
            "id": "hw2ju2x",
            "score": 1,
            "text": "Heck no, you've gotta find the right place and/or time to eat like 3 grams of the shrooms and have a pleasant and fruitful trip.  With psilocybin you need to eat just enough to trigger the whatever mechanism in your brain that creates the experience.  Too little and not much really happens, but \"just enough\" and it is like you tap into the living force for about 5 hours as your senses and awareness increases.  I really suggest only taking it on special occasions.  \n\nPersonally, I suggest big ass nature hike to a really cool place to enjoy OR eat them an what I'd call an \"epic\" concert where the artist puts on a show.  You really want to time peaking at the best moment and it is important to remember is to \"TIME\" eating them, it takes around 30 minutes to really start feeling them and you \"peak\" an hour after that.  After you peak, it will slowly taper off till one moment you just \"stop\" tripping. \n\nAND when it is over, it is over and you should abstain for days or weeks to reflect upon your experience. I personally like to eat them twice a year max when I've got everything lined up for an awesome event.",
            "title_similarity": "0.5378395",
            "sentiment_compound": 0.9853
        },
        {
            "id": "hw2ju5s",
            "score": 1,
            "text": "Subaru owners are pissed.",
            "title_similarity": "0.37445754",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hw2jv96",
            "score": 1,
            "text": "I’ve been MDing since March of last year.  It did help with my anxiety.  But this year I decided after almost a year of doing it it was time for a mental break.  \nIt’s not a miracle drug or a cure all but people shouldn’t be dismissive of it’s positive properties.",
            "title_similarity": "0.6775248",
            "sentiment_compound": 0.3164
        },
        {
            "id": "hw2jwpj",
            "score": 1,
            "text": "I tried microdosing and it did nothing for me, I got more out of going skiing in France for a week exercising, sleeping early and not doing any drink or drugs.",
            "title_similarity": "0.6013783",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2k16r",
            "score": 1,
            "text": "I have MDD and BPD, been experimenting with shrooms for a while and cannibus, and personally after having a \"shroom weekend\" once a month, the results spoke for itself. Helping my issues a lot",
            "title_similarity": "0.39165717",
            "sentiment_compound": 0.296
        },
        {
            "id": "hw2k1nf",
            "score": 1,
            "text": "Tried it. Gave me incredible anxiety.",
            "title_similarity": "0.2505095",
            "sentiment_compound": -0.2484
        },
        {
            "id": "hw2k59o",
            "score": 1,
            "text": "Gotta go big to see some real change",
            "title_similarity": "0.16111416",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2kmno",
            "score": 1,
            "text": "One of the problems with regular consumption of these substances is that your brain \\*very quickly\\* builds a tolerance. Roughly speaking, you can only trip once a week with psilocybin, or once every two weeks with LSD. Now it's unclear how this relates to microdoses - does the brain equally build a tolerance there? Not clear, but could be tested easily: microdose for a while and then try a regular psychedelic dose.\n\nNeither the scientists, nor the microdose enthusiasts, have ever discussed this question. Shows how oblivious we are to these substances.\n\n**tl;dr**  \nMy suspicion is that microdosing is physically impossible due to a quick build-up of tolerance. A well-known phenomenon with these substances, but ignored by microdosers and scientists.",
            "title_similarity": "0.7652903",
            "sentiment_compound": -0.5784
        },
        {
            "id": "hw2koe8",
            "score": 1,
            "text": "Personal experience.  I started out microdosing, generally around 0.2g of psylodiben mushrooms.  I did this for about 2 months on a month off for a year or so.  Then I took a couple big trips, not sure what the actual dosage was because I kept eating mushrooms.  After that my mental health has been better than I can ever remember.  I have also stopped drinking, and deleted social media(reddit is my only \"social media\") which has helped maintain my improved mental state.",
            "title_similarity": "0.5902722",
            "sentiment_compound": 0.4833
        },
        {
            "id": "hw2kotg",
            "score": 1,
            "text": "This news makes me depressed",
            "title_similarity": "0.417266",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hw2ks0t",
            "score": 1,
            "text": "That’s because you don’t need to microdose, you need to take the full dose to have a real impact. \n\nBetter yet, [macrodose.](https://i.redd.it/bf0jnr4ucst01.jpg)",
            "title_similarity": "0.51340955",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw2kz4z",
            "score": 1,
            "text": "Goddamn, I was really hoping to find a replacement for Xanax!  \n(I stopped taking it because working from home has removed all my stressors but some day and probably soon, I will have to start taking it again and there has to be a better option!)",
            "title_similarity": "0.5871538",
            "sentiment_compound": 0.4461
        },
        {
            "id": "hw2l2w6",
            "score": 1,
            "text": "Title is wrong and misleading.\n\nBoth the microdosing and the placebo group saw improvements. The problem was that this study may not have been sensitive enough to detect the benefits of microdosing psilocybin.\n\n> But it is still possible that microdosing has some positive psychological impacts. The scientific investigation into microdosing — and the use of psychedelic substances in general — is still in its infancy.\n\n> “Of course, this does not mean that microdosing is completely ineffective,” van Elk said. “We only found no objective evidence in our controlled study. But there are indeed many caveats. It could well be that the dosing we used was suboptimal and needs to be fine-tuned on an individual basis. It could also be that it takes some time for microdosing to take effect and that merely doing this for a few weeks is not enough to establish the long-term effects.”\n\n> “Another caveat is that many people in our study broke blind and they figured out what condition they were assigned to,” van Elk added. “This is a more generic problem for this type of research: the effects of psychedelics are so obvious — even at lower doses — that it is difficult to prevent people from figuring out what condition they are assigned to. If people subsequently figure out that they are in the active/experimental condition (e.g., based on subtle side-effects), this in turn can contribute again to the placebo response.”\n\n> Future studies should utilize larger sample sizes, which would make it easier to detect small effects, the researchers said.\n\n> “So in short: we found that psilocybin microdosing does not affect emotional processing and wellbeing,” van Elk said. “It could well be however that are study design was simply not sufficiently sensitive to pick up any signal that might be present in people who microdose. We need research that is more ecologically valid and that can study people in their daily lives and natural environments, rather than in a lab-based context. Smart wearables and experience-sampling techniques are important tools that can be used to this end.”",
            "title_similarity": "0.83099866",
            "sentiment_compound": -0.1983
        },
        {
            "id": "hw2l572",
            "score": 1,
            "text": "As someone who has tried it, I can say it doesn’t work as you think it might",
            "title_similarity": "0.59755826",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2lcbz",
            "score": 1,
            "text": "Big pharma is just trying to make plant medicines look bad ... because they threaten their business...",
            "title_similarity": "0.5503987",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hw2liac",
            "score": 1,
            "text": "Ok now try with large doses",
            "title_similarity": "0.10724943",
            "sentiment_compound": 0.296
        },
        {
            "id": "hw2line",
            "score": 1,
            "text": "Wait. Are you telling me that rushed results can change after long term study? NO WAY!!",
            "title_similarity": "0.5522092",
            "sentiment_compound": -0.5449
        },
        {
            "id": "hw2lnj0",
            "score": 1,
            "text": "F*ck so this whole time I've just been taking drugs and not doing an \"alternative therapy\"?",
            "title_similarity": "0.6378918",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2lptk",
            "score": 1,
            "text": "I eat them when I can, and still, depression and anxiety are ever-present.  Will keep trying.",
            "title_similarity": "0.31700063",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hw2lqz5",
            "score": 1,
            "text": "Can we still do shrooms legally though?",
            "title_similarity": "0.39892936",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hw2ls1x",
            "score": 1,
            "text": "There is no substitute for healthy coping skills apparently",
            "title_similarity": "0.5427785",
            "sentiment_compound": 0.128
        },
        {
            "id": "hw2luaz",
            "score": 1,
            "text": "This study has a conundrum with priming the issue a lot.  Placebo effects are known to work across the board, but to state this isn’t relevant because a placebo in a highly suggestive situation/study is a fallacy. As many have pointed out, more studies will be needed, and the lack of the layman’s understanding of what a placebo effect is will make that more difficult to fund. \n\nAlso: most studies if their participants break the blind early on, tend not to use those participants for fear of a different bias issue. What possibility exists that participants who were in the psychedelic group intentionally tried to behave in a manner consistent with what is expected in the study?  They didn’t do a bad job by any mean, just a better example of a pilot study than a full study given the number of protocol issues.",
            "title_similarity": "0.7489407",
            "sentiment_compound": -0.948
        },
        {
            "id": "hw2lvd1",
            "score": 1,
            "text": "Come on, you all knew it was a placebo",
            "title_similarity": "0.17526479",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2mk59",
            "score": 1,
            "text": "Yeah, this was definitely published by the maker of xaxan",
            "title_similarity": "0.004164082",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hw2my94",
            "score": 1,
            "text": "So macro dosing it is",
            "title_similarity": "0.17630236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2n7kv",
            "score": 1,
            "text": "I know they addressed this in the article, but how does one not figure out whether it was a placebo or not? psilocybin is not the subtlest of drugs.",
            "title_similarity": "0.7484059",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2nevb",
            "score": 1,
            "text": "I don't think anyone advocating use of psilocybin for depression would recommend it without therapy. The psilocybin is a tool to break up thought patterns and the therapy is to help form new, more positive thought patterns.",
            "title_similarity": "0.66795385",
            "sentiment_compound": 0.659
        },
        {
            "id": "hw2nkbb",
            "score": 1,
            "text": "This study is looking at the effects during a single dose. Not the long term effects of a continued protocol.",
            "title_similarity": "0.7035792",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2nnrw",
            "score": 1,
            "text": "Psychotherapist here: it appears this study was not completed with conjoint psychotherapy. I believe the anecdotal evidence occurred when micro dosing was done with a therapist to tap into deep emotional states to induce healing. I’d take this study with a grain of salt.",
            "title_similarity": "0.69991255",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hw2nr06",
            "score": 1,
            "text": "From experience, this is dubious. Some mental health issues certainly could be improved this way. Some could be made far worse, but I've known people who stopped being alcoholics after taking a single dose of mushrooms or LSD. Like turning off a light switch. With a good set and setting, and a trusted and experienced guide, I would think the outcome is far more likely to be constructive than destructive or neutral.",
            "title_similarity": "0.7327819",
            "sentiment_compound": 0.5187
        },
        {
            "id": "hw2nyi6",
            "score": 1,
            "text": "Well we know it’s tough to become addicted to psilocybin due to [exponential?]  increase usage. So using on regular intervals with the same dosage likely  has  little to no effect at all.",
            "title_similarity": "0.77772033",
            "sentiment_compound": 0.2449
        },
        {
            "id": "hw2nz9z",
            "score": 1,
            "text": "If anything, let’s remember the intended application of an actual trip.   Neuroplasticity is one thing but fixing or helping requires actual working experience that requires reflection after the fact.  Even a bad trip has benefits, but a release and reminder that life is wonderful on our terms is a big part of the mechanism with this therapy.",
            "title_similarity": "0.54511344",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hw2o496",
            "score": 1,
            "text": "Big pharma at it again trying to convince us their expensive drugs are the only way!!??",
            "title_similarity": "0.4620135",
            "sentiment_compound": 0.4486
        },
        {
            "id": "hw2o55o",
            "score": 1,
            "text": "One real dose can kick your depression in the ass for up to six months. Hell with micro dosing.",
            "title_similarity": "0.5159904",
            "sentiment_compound": -0.9153
        },
        {
            "id": "hw2o711",
            "score": 1,
            "text": "It didn’t help me at all. I was so disappointed because I had been led to believe it was a magical source to ending my suffering.",
            "title_similarity": "0.62336236",
            "sentiment_compound": -0.6588
        },
        {
            "id": "hw2ol04",
            "score": 1,
            "text": "Why are these stories so small?",
            "title_similarity": "0.44606715",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2om2n",
            "score": 1,
            "text": "“Use the new and improved version of Zoloft”",
            "title_similarity": "0.30927342",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hw2ooq8",
            "score": 1,
            "text": "No, big a BIG dose does!",
            "title_similarity": "0.08472468",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2ovcz",
            "score": 1,
            "text": "Is there proof behind antidepressants? Because doctors still push them like they’re a cure. Who paid for this research anyway…?",
            "title_similarity": "0.5185102",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hw2ox4j",
            "score": 1,
            "text": "If this pans out as a treatment or not, I'm just happy the experiments are being done.  Classifying any substance as effectively \"no medical usage\" is pure hubris.  It's claiming you have proven a negative.  Science with these, or in fact, any substance or treatment, as long as done within all ethical constraints should never be hampered by drug laws.",
            "title_similarity": "0.57676595",
            "sentiment_compound": -0.1275
        },
        {
            "id": "hw2p0sm",
            "score": 1,
            "text": "Removing TV from your life will help",
            "title_similarity": "0.47936112",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hw2pbbg",
            "score": 1,
            "text": "It was my opinion that microdosing was never going to be truly successful, because of my theory that a psychedelic trip operates in the same way as ECT - it causes a soft reboot of your cognitive processes, which interrupts bad cognitive routines as your brain basically starts up again. \n\nWhether you think these routines are strictly cognitive or biological in nature, it makes sense that bad patterns of thought are reset by the magnitude and duration of brain function disruption.",
            "title_similarity": "0.74680924",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hw2pi7y",
            "score": 1,
            "text": "I tried microdosing recently. I noticed it doesn't work myself. I think the lifechanging good feeling comes when you poison yourself, then you have a deep sense of relief when it's over, and you feel really good to be back to normal. But you wouldn't have the clarity without poisoning yourself.",
            "title_similarity": "0.720412",
            "sentiment_compound": 0.6505
        },
        {
            "id": "hw2pj9f",
            "score": 1,
            "text": "Have to do a good dose every few years. That’s all you need. Have a nice trip, face some inner demons and move on.",
            "title_similarity": "0.48913407",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hw2pk3i",
            "score": 1,
            "text": "I think the healing aspect of psilocybin has a lot to do with a kind of \"religious\" experience or whatever you like to call it. Microdosing just don't work that way. It may help you to get ready for a transforming dose, though",
            "title_similarity": "0.74791205",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hw2pu57",
            "score": 1,
            "text": "Mega dozes it is then!",
            "title_similarity": "0.11394032",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2pve7",
            "score": 1,
            "text": "It has helped my wife several times to come out of depression",
            "title_similarity": "0.26123968",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hw2q5fy",
            "score": 1,
            "text": "Appearances can be deceiving according to a species-long research known as the “human condition”.",
            "title_similarity": "0.4064275",
            "sentiment_compound": -0.34
        },
        {
            "id": "hw2q7o8",
            "score": 1,
            "text": "It all depends on your mindset when using the drug, and in no way does this discredit microdosing for therapeutic use. Personally I’ve microdosed acid at work and it’s been splendid, I’ve noticed it working it’s magic in the background & when I least expect it. I would recommend anyone to experiment with what they’re comfortable with and leave their minds open to new perspectives on their reality",
            "title_similarity": "0.56567466",
            "sentiment_compound": 0.802
        },
        {
            "id": "hw2qumo",
            "score": 1,
            "text": "this may be \"new research\" but it is basically off point to the conclusions that many want to draw from it/the headline's implicit conclusion.\n\nThe depression/addiction etc researchers that are working with psilocybin  are NOT microdosing. They are using full [whatever that means] doses in a controlled setting.",
            "title_similarity": "0.7668934",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hw2r4ke",
            "score": 2,
            "text": "I’m sorry but the rainbow capybara tells me otherwise…",
            "title_similarity": "0.4746164",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hw2r9te",
            "score": 1,
            "text": "After reading this partially this study doesn’t sound very impressive or convincing. Too many things that couldn’t have been accounted for.",
            "title_similarity": "0.7196381",
            "sentiment_compound": 0.762
        },
        {
            "id": "hw2rc74",
            "score": 1,
            "text": "From experience I doubt this finding.",
            "title_similarity": "0.54194534",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hw2rcsp",
            "score": 1,
            "text": "Here's an important point to consider that I haven't seen mentioned. The participants in this study were already psychologically healthy. They weren't depressed or have anxiety, so it may be the case that microdosing can't further improve them.",
            "title_similarity": "0.69940567",
            "sentiment_compound": 0.476
        },
        {
            "id": "hw2rh5i",
            "score": 1,
            "text": "Surprise! Give me a break.",
            "title_similarity": "0.3425475",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hw2rreo",
            "score": 1,
            "text": "Tell that to all the peoples who’s depression it’s cured and helped with.",
            "title_similarity": "0.28260767",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hw2rvfo",
            "score": 1,
            "text": "Who did this research, doctor Buzz killington?",
            "title_similarity": "0.27208728",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2s22i",
            "score": 1,
            "text": "A non scientific insert here, but my own experience as a 30(m) with chronic depression. I stopped drinking about a year ago after finally tiring of the endless cycle of alcohol induced hangziety and feeling like I was causing my own demise.\n \nI was curious about the preliminary research around micro dosing and depression so I figured I’d give it a try. I have found that micro dosing has had no real long term effect on my mental health. Positive or negative really, the days that I micro dosed felt different in that I certainly felt more engaged and relatively happy. The day after however I was back to base line. Having said that, engaging in heavier doses more frequently than one would normally has improved my mental health. \n\nHaving psychedelic experiences gives me an insight into my own consciousness. I feel like it opens all the doors allowing me the ability to unpack a lot of stuff in a short amount of time. Unlike micro dosing, I’ve found that I feel connected to my existence and feel purpose for weeks after such an experience.",
            "title_similarity": "0.7398472",
            "sentiment_compound": 0.9527
        },
        {
            "id": "hw2sjv9",
            "score": 1,
            "text": "Placebo is one hell of a thing!",
            "title_similarity": "0.18080558",
            "sentiment_compound": -0.7088
        },
        {
            "id": "hw2sunq",
            "score": 1,
            "text": "So take a bigger dose",
            "title_similarity": "0.14579746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2synw",
            "score": 1,
            "text": "Thats because you need infrequent larger doses to be effective against anxiety and depression. Entheogens have a very big space in the future of medicine and consciousness.",
            "title_similarity": "0.5140413",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hw2t0s5",
            "score": 1,
            "text": "That's why I take large doses",
            "title_similarity": "0.046907134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2t2il",
            "score": 1,
            "text": "...until the very next research project reveals microdosing psilocybin DOES in fact improve depression. People buy studies every second of the day.",
            "title_similarity": "0.5791899",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hw2t4h3",
            "score": 1,
            "text": "I find this contrary to my personal experience but whatever. Source: had been on many different SSRI’s for a long time, switched to microdosing about 4 years ago. The latter actually made a noticeable difference in my life.",
            "title_similarity": "0.50729007",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2t7zg",
            "score": 1,
            "text": "Annoying people are about to be really mad about this",
            "title_similarity": "0.3463446",
            "sentiment_compound": -0.7346
        },
        {
            "id": "hw2ta9s",
            "score": 1,
            "text": "From how we understand how psychedelics affect the brain, it makes sense that they alone would not solve mental health issues. \n\nThe interesting analysis would be to see how they interact with behavioral therapy. The theory would be that they can make it more effective. But just expecting them to be miracle pills I believe was always misguided.",
            "title_similarity": "0.7411479",
            "sentiment_compound": 0.8152
        },
        {
            "id": "hw2tbdh",
            "score": 1,
            "text": "aw that's a shame. Oh well, science giveth and science taketh away",
            "title_similarity": "0.40027893",
            "sentiment_compound": -0.25
        },
        {
            "id": "hw2tcwa",
            "score": 1,
            "text": "Legalize psilocybin! My city decriminalized!",
            "title_similarity": "0.43721688",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2tm4o",
            "score": 1,
            "text": "Wasn't that earlier famous paper just saying that psylocybin microdosing found to play a positive supportive role when paired with therapy or psychological support? Something about resetting synapses...",
            "title_similarity": "0.5156196",
            "sentiment_compound": 0.872
        },
        {
            "id": "hw2tw9v",
            "score": 1,
            "text": "I’ve found occasional macrodosing to be helpful.",
            "title_similarity": "0.35783142",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hw2twmo",
            "score": 1,
            "text": "This isn't going to fit reddits narrative",
            "title_similarity": "0.5571351",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hw2tzp4",
            "score": 1,
            "text": "You're doing it wrong, you have to take enough to question the reality around you and then you're cured of mental health problems. Worked for me, although I felt like the ground was trying to swallow me whole for a minute.",
            "title_similarity": "0.60773927",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hw2u4oj",
            "score": 1,
            "text": "Speaking from personal experience, microdosing was actually quite harmful to me. After about 6 months of microdosing (once every few weeks) I began having stroke-like symptoms and severe headaches.\n\nIt turns out that I have hemiplegic migraines and that microdosing appears to have been the catalyst for the most severe of symptoms.",
            "title_similarity": "0.5520885",
            "sentiment_compound": -0.6697
        },
        {
            "id": "hw2ubir",
            "score": 1,
            "text": "Treating anxiety with drugs only makes it worse in the long run, only facing fear teaches you to deal with anxiety.",
            "title_similarity": "0.60682356",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hw2uebh",
            "score": 1,
            "text": "While I appreciate the effort of these scientists, can they just not right now?",
            "title_similarity": "0.43239963",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hw2uigh",
            "score": 1,
            "text": "I believe that micro-dosing is recommended for increased focus and mental clarity, not for depression.\n\nLarger, one-off doses have been used effectively for depression, anxiety and - amazingly - for PTSD, which is otherwise untreatable.\n\nThis study is interesting but is it really useful, given that it is looking for an effect that no one is espousing?",
            "title_similarity": "0.7707226",
            "sentiment_compound": 0.7498
        },
        {
            "id": "hw2uk3g",
            "score": 1,
            "text": "Hang on, were people claiming that microdosing was good for that? I know there were some promising preliminary results in the 50s/60s using psylocibin and LSD in conjunction with talk therapy to treat a wide range of mental illnesses including addiction, schizophrenia, and PTSD, but I hadn't heard anyone suggest regular microdosing as an independent treatment.",
            "title_similarity": "0.6874947",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hw2um75",
            "score": 1,
            "text": "I dunno though. If i was always anxious, but could choose to be slightly elevated and anxious, or sober and anxious? Im going with slightly elevated every time",
            "title_similarity": "0.51439136",
            "sentiment_compound": -0.6254
        },
        {
            "id": "hw2umq2",
            "score": 1,
            "text": "Maybe people just like getting high?",
            "title_similarity": "0.27346176",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hw2ut7h",
            "score": 1,
            "text": "“While the appropriate time necessary for the benefits of microdosing to take effect is unknown, it is known that serotonergic antidepressants can take up to 2 months before measurable effects arise (Harmer et al., 2009), potentially because their effects are due to certain downstream changes in brain structure and function (Erb et al., 2016; Hanson et al., 2011). The argument that effects of microdoses may also require a longer period of repeated dosing rests on two key findings: that depression and stress-related disorders are associated with neural atrophy in the prefrontal cortex (PFC; Christoffel et al., 2011) and that serotonergic psychedelics can increase structural and functional plasticity in the PFC (Ly et al., 2018; Olson, 2018), thereby potentially counteracting the neurobiological markers of these disorders. It is possible that a period of consistent microdosing which succeeds 3 weeks is required for such changes to develop and we can expect an effect on emotion processing and mood-related symptoms only after these changes have occurred”",
            "title_similarity": "0.7024418",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hw2uugc",
            "score": 1,
            "text": "What about.... not small doses.",
            "title_similarity": "0.3253853",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2uy3g",
            "score": 1,
            "text": "Tell that to the actual dozens of people I've met that let them overcome heroin, amphetamines, alcohol especially. Personally let me let go of booze for many years and was the best antidote I found to break through the drug haze.\n\nVery valuable tool. Is it for everyone? Definitely not, but some people need to micro instead of take SSRIs or whatever else gets peddled to them. \n\nTo say in a blanket it doesn't appear to improve symptoms of depression counters the last 20 years of psychedelic research and the improved therapy sessions its done within, all over the world. It works and this is ridiculous clickbait, at best.",
            "title_similarity": "0.59823847",
            "sentiment_compound": 0.4745
        },
        {
            "id": "hw2uyol",
            "score": 1,
            "text": "You gotta macro dose to shock the anxiety out of you",
            "title_similarity": "0.48652944",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hw2vef6",
            "score": 1,
            "text": "I can't even begin to describe how much microdosing psilocybin has helped me. Please don't be put off by this if you were curious about it. Just do your research and look at the vast information that is out there, and don't be sucked in by one clickbait headline.",
            "title_similarity": "0.6641022",
            "sentiment_compound": 0.7253
        },
        {
            "id": "hw2vge6",
            "score": 1,
            "text": "In my experience microdosing helps for a day or two and then its back to same old same old. Full doses on the other hand, work for weeks or months..",
            "title_similarity": "0.43758586",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hw2vh5h",
            "score": 1,
            "text": "It works for me so I’ll keep micro dosing",
            "title_similarity": "0.38832915",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2w5j5",
            "score": 1,
            "text": "Anecdotally, it has helped me tremendously with depression and overall quality of life.",
            "title_similarity": "0.3742547",
            "sentiment_compound": -0.6096
        },
        {
            "id": "hw2w6kj",
            "score": 1,
            "text": "Dont care still better than reality",
            "title_similarity": "0.46317017",
            "sentiment_compound": -0.6167
        },
        {
            "id": "hw2wf7z",
            "score": 1,
            "text": "Luckily macrodosing does!!!\nMicrodosing constantly seems to do better with hippocampal neurogenisis though",
            "title_similarity": "0.44621357",
            "sentiment_compound": 0.795
        },
        {
            "id": "hw2wjkw",
            "score": 1,
            "text": "Haven't previous controlled trials shown that *psilocybin-assisted therapy* is what improved the symptoms of depression? ([For example](https://jamanetwork.com/journals/jamapsychiatry/article-abstract/2772630))\n\nIt's not the psilocybin itself that is helping people. The therapy is helping people. Psilocybin microdoses just better lubricates the process for people who aren't getting results with therapy alone.",
            "title_similarity": "0.77719057",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hw2wstw",
            "score": 1,
            "text": "The folks at  The Multidisciplinary Association for Psychedelic Studies (MAPS) have been saying this for a while. The true title should read \"does not appear to improve symptoms of depression or anxiety *better than placebo*.\" \n\nPlacebo is a hell of a drug, but studies have been showing that a \"heroic\" dose of psilocybin is the key.",
            "title_similarity": "0.7330003",
            "sentiment_compound": 0.3709
        },
        {
            "id": "hw2wu1e",
            "score": 1,
            "text": "Okay, so maybe it does not cause any noticeable improvement in depression and anxiety symptoms. That doesn't mean that that psilocybin isn't useful for tight purposes. The scientific evidence is pretty sound for help those who are terminally I'll come to terms with their death. Not to mention the amazing, transformative experiences people have while on them. So what, they don't cure anxiety and depression, that doesn't mean they are useless.",
            "title_similarity": "0.77814317",
            "sentiment_compound": -0.4745
        },
        {
            "id": "hw2wwcp",
            "score": 1,
            "text": "RIP all those startups",
            "title_similarity": "0.24607384",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2wyde",
            "score": 1,
            "text": "Pretty sure it was microdosing together with therapy, not just the other. Ffs. Nobody said this.",
            "title_similarity": "0.6856644",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hw2x3fl",
            "score": 1,
            "text": "Doesn't this confirm the findings a couple of years ago that it is only the first dose that helps?\n\nI thought the research from that point was to find the appropriate first dose to maximize effectiveness.",
            "title_similarity": "0.44930646",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hw2x592",
            "score": 1,
            "text": "Funny in my experience it’s best just to full dose psychedelics once a year and it snaps me out of my depressive rut.\n\nAfter being on every anti depressant, dose, and combo they could give over years with therapy I never felt any better.  One dose of acid and my perspective fundamentally changed for the better.\n\nThe pills made me fat and lazy but that’s what the pushers will always claim you should stick to.",
            "title_similarity": "0.58805287",
            "sentiment_compound": -0.0523
        },
        {
            "id": "hw2xagc",
            "score": 1,
            "text": "This study is a bit bungged. They basically are treating the psilocybin as a pure antidepressant (participants were instructed to take daily for 3 weeks, and then placebo for 3 additional weeks, or vice versa).\n\nThat being said I don't really think the most effective use of psilocybin is just to take daily in hopes it makes you feel better. It really should be taken for the purpose of having an introspective experience.",
            "title_similarity": "0.6244472",
            "sentiment_compound": 0.8439
        },
        {
            "id": "hw2xcjj",
            "score": 1,
            "text": "B-but it has such a trendy name!",
            "title_similarity": "0.10629816",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2xixa",
            "score": 1,
            "text": "Killing a narrative, Reddit in shambles.",
            "title_similarity": "0.3852004",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hw2xwk4",
            "score": 1,
            "text": "I think you need higher doses much less often to really let the medicine do it’s work. Requires introspection to be helpful that’s why I don’t think microdosing and just going about my day was helpful for me.",
            "title_similarity": "0.7709934",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hw2ydt9",
            "score": 1,
            "text": "Can anyone find the dosage they were taking? What amount is considered a microdose?",
            "title_similarity": "0.5708505",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2yhcx",
            "score": 1,
            "text": "Tell that to my depression and anxiety.",
            "title_similarity": "0.35465696",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hw2yhmt",
            "score": 1,
            "text": "I don't think that's how mushrooms work? I don't believe micro-dosing would cure depression because there's nothing micro about depression. I think these are complex things that numbers have a hard time accurately representing.",
            "title_similarity": "0.766731",
            "sentiment_compound": -0.2737
        },
        {
            "id": "hw2ylfn",
            "score": 1,
            "text": "You have to question why something with such a small sample size would be so heavily publicized.",
            "title_similarity": "0.4587974",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2ymtb",
            "score": 1,
            "text": "“We observed a strong generic placebo-effect though: both the placebo and the microdosing group showed a significant change in their wellbeing scores from the moment they started with the study. Thus, merely expecting that you are part of a clinical trial during which you might or might not receive a psychoactive substance already improves your wellbeing.”\n\nIt’s called hope, ya’ll. Most people lose that with depression and anxiety. I get the same feeling whenever I even see a new doctor for it.",
            "title_similarity": "0.6330425",
            "sentiment_compound": 0.4445
        },
        {
            "id": "hw2zcsa",
            "score": 1,
            "text": "I just know from my own experience that I feel emotionally better after taking a micro-dose. Yes, this is completely anecdotal. I have a terrible memory so when I forget to take my morning dose, I do genuinely feel more depressed before I realize why. So, imo, it's not the placebo effect. I would love for there to be larger scale studies, but it's great that we're even getting any studies at all.",
            "title_similarity": "0.62078404",
            "sentiment_compound": 0.7976
        },
        {
            "id": "hw2zf1d",
            "score": 1,
            "text": "How about just one large dose. I've heard one dose has positive effects that lasts for weeks. Why mess with micro dosing if one normal dose works?",
            "title_similarity": "0.50539505",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hw2zj2j",
            "score": 1,
            "text": "Nothing about the size of the dose these people were taking. I would take this study with a grain of salt.",
            "title_similarity": "0.5703918",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw2zj5u",
            "score": 1,
            "text": "I found out today that keeping drugs in schedule 1 not only keeps them as criminal offenses, but puts heavy restrictions on research of them too, to prevent anyone from finding out that they aren’t harmful/are beneficial.",
            "title_similarity": "0.6486229",
            "sentiment_compound": 0.2617
        },
        {
            "id": "hw2zx76",
            "score": 1,
            "text": "Who paid for the study big pharma?",
            "title_similarity": "0.4324385",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw304we",
            "score": 1,
            "text": "I personally know three people that do this that all have high functioning anxiety one has ptsd on top of anxiety. \n\nAll three would disagree, all three also have completely calmed their anxiety to the point where it no longer affects their daily lives after finding the proper dosage (different body types) \n\nThose three also know others that have done the same thing and I'd say by the information they've told me it's got an 85% chance of calming anxiety, depression however I'm not sure of because none of them that I know have it. \n\nEveryone is different, and I find either these reports are being biased, not testing enough people, or not finding correct dosages in the allotted testing period.",
            "title_similarity": "0.5724308",
            "sentiment_compound": -0.8038
        },
        {
            "id": "hw3050x",
            "score": 1,
            "text": "Well, that's depressing.",
            "title_similarity": "0.31806245",
            "sentiment_compound": -0.128
        },
        {
            "id": "hw307f6",
            "score": 1,
            "text": "Personally, i think a supervised dose where the user experiences ego death has a much longer lasting impact",
            "title_similarity": "0.3955403",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hw308fw",
            "score": 1,
            "text": "I can’t wait till the world really knows the power of this plant. I know several people first hand who stopped taking meds in lue of this therapy and they are all doing way better. Just like with weed, big pharma will hinder this at every corner.",
            "title_similarity": "0.52492654",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hw30e8z",
            "score": 1,
            "text": "r/microdosing fois people who wants more information",
            "title_similarity": "0.4250769",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw30odj",
            "score": 1,
            "text": "Don't tell the rich elite that their psilocybin doesn't work. It's an 1800s era miracle cure to those folks. The facts are from the few studies we have on this versus empirical evidence from modern hippies. Trust what you will.",
            "title_similarity": "0.6672931",
            "sentiment_compound": 0.6341
        },
        {
            "id": "hw30t6f",
            "score": 2,
            "text": "I thought people microdosed as like a form of nootropic or something. Silicon Valley types looking for an edge and whatnot. \n\nI know this is a science sub but I find psychedelics philosophically fascinating because it seems like they could shed light on mind/body questions.",
            "title_similarity": "0.54614294",
            "sentiment_compound": 0.8674
        },
        {
            "id": "hw316y1",
            "score": 1,
            "text": "Didn't science just tell us the opposite?",
            "title_similarity": "0.41331837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw317t2",
            "score": 1,
            "text": "Here come the dependents",
            "title_similarity": "0.13673335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw31dxf",
            "score": 1,
            "text": "Okay but people should still be allowed to do it for fun.",
            "title_similarity": "0.27908087",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hw31jq7",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.28496405"
        },
        {
            "id": "hw31oi2",
            "score": 2,
            "text": "I honestly don’t believe mushrooms arr a medical cure for depression.  The effects of any given trip vary wildly.  Psilocybin Mushrooms are good for you for a variety of reasons but its not a 1 size fits all depression cure, way more complex than that.  Mushrooms are a lot weirder than “cures depression”in my honest opinion.",
            "title_similarity": "0.7166325",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hw31ulh",
            "score": 1,
            "text": "Here’s the discussion on the r/microdosing subreddit FWIW\n\nhttps://www.reddit.com/r/microdosing/comments/snbrjl/psilocybin_microdosing_does_not_reduce_symptoms/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.45055795",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw31wpc",
            "score": 6,
            "text": "What about macrodosing?",
            "title_similarity": "0.2507456",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw323bi",
            "score": 1,
            "text": "I thought the benefits of microdosing had more to do with creativity/focus, don't recall seeing many people claiming microdosing had major effects on depression/anxiety. \n\nPurely anecdotal, but as someone who has done a fair amount of mushrooms over the years I firmly believe experiencing the trip itself is the major driver behind many of the mental health benefits. The bio-chemical interactions going on open you up to the experience, but without the trip I have a hard time believing it's any more effective than conventional pharmaceutical anti-depressant medications. \n\nHopefully further research over the next few years will shed light on all this.",
            "title_similarity": "0.6915396",
            "sentiment_compound": 0.9402
        },
        {
            "id": "hw32dlg",
            "score": 3,
            "text": "Depression and anxiety are symptoms of trauma stuck in your body and emotional and logic patterns. If you haven’t addressed the underlying trauma, you will never get “healed” from depression or anxiety. Somatic therapy + the right psychedelic and therapist is the most effective method.",
            "title_similarity": "0.61021155",
            "sentiment_compound": -0.9083
        },
        {
            "id": "hw32ift",
            "score": 1,
            "text": "Hell no. Go big or stay at home.",
            "title_similarity": "0.31478474",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hw32r15",
            "score": 1,
            "text": "BS I've been microdosing daily for 1.5 yrs. I FEEL AMAZING",
            "title_similarity": "0.30095828",
            "sentiment_compound": 0.6739
        },
        {
            "id": "hw330uo",
            "score": 1,
            "text": "Is there any way to find out who paid for this study?",
            "title_similarity": "0.41320366",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3332e",
            "score": 1,
            "text": "Ego deaths are good for the soul",
            "title_similarity": "0.35061985",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw33683",
            "score": 1,
            "text": "The current experiments, I seem to recall, were described  as using \"heroic doses\". Sounds great",
            "title_similarity": "0.23808238",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hw337ad",
            "score": 1,
            "text": "So I’m about to lose all my money invested into mindmed…cool",
            "title_similarity": "0.43773136",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hw33av1",
            "score": 1,
            "text": "Maybe its because they're microdosing?",
            "title_similarity": "0.49294302",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw33e1h",
            "score": 1,
            "text": "Well I still take shrooms occasionally, because it gives me a long lasting good feeling. I don't microdose though, 2-5g of dried shrooms. If it works, it works.",
            "title_similarity": "0.5651612",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hw34429",
            "score": 1,
            "text": "So just save up all the microdosing of a year for one big go. Got it.",
            "title_similarity": "0.3598243",
            "sentiment_compound": 0.539
        },
        {
            "id": "hw346wj",
            "score": 1,
            "text": "I know Paul Stamets has a microdosing app, does it ask users questions regarding their mental state? Anyone know if there's information or statistics released from the app team?",
            "title_similarity": "0.47903168",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw34qpa",
            "score": 1,
            "text": "All it did for me was give me a stomach ache.",
            "title_similarity": "0.40539867",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hw34qzj",
            "score": 1,
            "text": "My English is not that great, does improve here mean  negatively increases symptoms or positively makes them less bad",
            "title_similarity": "0.6544946",
            "sentiment_compound": -0.0518
        },
        {
            "id": "hw355o4",
            "score": 1,
            "text": "So many people make this their whole personality. I know one dude who is like the crypto bro of microdosing. He won't stop talking about it, every conversation gets looped back to mushrooms. There was a time an entire group of people camping ate some, myself included, just to get him to stfu about it.  I'm scared if he read this article he'd have a total breakdown.",
            "title_similarity": "0.35764483",
            "sentiment_compound": 0.125
        },
        {
            "id": "hw35gdl",
            "score": 1,
            "text": "As someone whose depression and anxiety has been greatly helped by psychedelic mushrooms, it’s my experience that it’s not so much the substance that helped, but the experience. \n\nWhile on mushrooms it is essentially impossible to feel anxious or depressed, which for me was a big wake up call - a reminder that I am capable of not feeling bad all the time, and that I once felt this way before. \n\nAfterwards, I would remind myself of that feeling and it greatly helped with my recovery. \n\nUnfortunately it’s also tempting for people to rely upon mushrooms to find that feeling again instead of doing the work needed. It kinda sent a friend of mine off the deep end because she was tripping so frequently.",
            "title_similarity": "0.6921171",
            "sentiment_compound": 0.0707
        },
        {
            "id": "hw35u1u",
            "score": 1,
            "text": "Bet this is a big pharma research. They are the big oil and cigarettes propaganda in todays word. Like how a glass of wine a day is better for your health found out earlier this year that it is a lie also… big corporations need to change or we shouldn’t allow them to advertise at all anymore",
            "title_similarity": "0.5494478",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hw35yqa",
            "score": 1,
            "text": "What about macrodosing?",
            "title_similarity": "0.2507456",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw36c02",
            "score": 1,
            "text": "Ok but it does and it did for me.\nAlmost like we don't have the same body chemistry as everyone else. Weird.",
            "title_similarity": "0.5158812",
            "sentiment_compound": 0.3314
        },
        {
            "id": "hw36h86",
            "score": 1,
            "text": "Favorite quotes from the head of research:\n\n\"Another caveat is that many people in our study broke blind and they figured out what condition they were assigned to\"\n\n&#x200B;\n\n\"It could well be however that are study design was simply not sufficiently sensitive to pick up any signal that might be present in people who microdose. We need research that is more ecologically valid and that can study people in their daily lives and natural environments, rather than in a lab-based context.\"",
            "title_similarity": "0.6671808",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hw36ifn",
            "score": 1,
            "text": "All I’m reading is, not even the drugs can help you now",
            "title_similarity": "0.6094399",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hw373i2",
            "score": 1,
            "text": "What about depression? Interested in depression because anxiety many times in present day is honestly normal. We live in a dangerous world. At least this is what the news continually pumps at us. So many kidnappings, human trafficking, murder suicide, raping, and more reported. Learning to move forward despite the danger is heroic.I think we are all every day heros.",
            "title_similarity": "0.41210032",
            "sentiment_compound": -0.9547
        },
        {
            "id": "hw3744u",
            "score": 1,
            "text": "A drop of water doesn’t help in a desert either",
            "title_similarity": "0.5917813",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hw37dx7",
            "score": 1,
            "text": "my personal experience could have been placebo, but when i did it i had finals for uni, never studied so efficiently and happy for finals in my life, also felt way more present",
            "title_similarity": "0.4301942",
            "sentiment_compound": 0.9039
        },
        {
            "id": "hw37jhf",
            "score": 1,
            "text": "It’s called “the heroic dose” for a reason",
            "title_similarity": "0.17500392",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hw37m3x",
            "score": 1,
            "text": "Nothing has been more aggravating, over the years, than watching replies flow in to people talking of depressive symptoms~ “just take some lsd, bruh, it cured me”~or the like. \nAs someone who’s suffered through a lifetime of anxiety/depression & obsessive compulsive disorder, and also had an experimentation phase years ago, doing my fair share of psilocybin mushies and lsd, I can safely say that though I felt better in the moment I was never “permanently cured”.",
            "title_similarity": "0.6395953",
            "sentiment_compound": 0.0534
        },
        {
            "id": "hw380gk",
            "score": 2,
            "text": "New research funded by big pharma that is.\n\nImagine their profit losses...",
            "title_similarity": "0.51465815",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hw38784",
            "score": 1,
            "text": "“Salt’s bad for you!”\n\n“Whoops! Salt’s ok, it’s eggs that are bad for you.”\n\n“OK wait, eggs are ok, but turns out salt really is bad for you.”\n\n“So it looks like eggs are probably ok, salt maybe no? IDK. Don’t smoke.”",
            "title_similarity": "0.559003",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hw38mke",
            "score": 1,
            "text": "How about large doses frequently?",
            "title_similarity": "0.067282155",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw393nh",
            "score": 1,
            "text": "It's funny how US government and pharma backed studies always seem to have different results than every other study and everyone's loved experience.  \n\n\"80% of people must be wrong when they say this, they are just lying or stupid or something. We designed a test tomorrow they are wrong in any circumstances and we found ourselves to be correct.\" -Big Pharma and USG grantwriter.",
            "title_similarity": "0.51495457",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hw39qfz",
            "score": 1,
            "text": "Eh I just wanna get high",
            "title_similarity": "0.11574463",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3a1hj",
            "score": 1,
            "text": "Yeh you need a heroic dose",
            "title_similarity": "0.17961758",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hw3afx8",
            "score": 1,
            "text": "I have a friend that doses,, he pretty much seems high most the time. More of a party than therapy.",
            "title_similarity": "0.33833617",
            "sentiment_compound": 0.8542
        },
        {
            "id": "hw3b45v",
            "score": 1,
            "text": "Daily meso dose makes me a happy fellow though. Aho!",
            "title_similarity": "0.3145089",
            "sentiment_compound": 0.6114
        },
        {
            "id": "hw3b4zc",
            "score": 1,
            "text": "So moderate to large doses do?",
            "title_similarity": "0.2564093",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3bc5p",
            "score": 1,
            "text": "From the get go I have been adamant about this not being a long term solution or a catch all for depression. Firstly, you build tolerance, so unless you want to keep upping your dose, it’s not going to work. Next, it causes your body to over produce some chemicals, then the next day, your supply is out, and you’re sad. And not just regular sad. Like deep lost in thought sad. \n\nI think once every 3 months, if you have depression and trauma, you should go all into a trip while speaking with a trained therapist. And then have 3 days of monitored spa time.",
            "title_similarity": "0.65291107",
            "sentiment_compound": -0.8619
        },
        {
            "id": "hw3blhh",
            "score": 11,
            "text": "Are they gonna come out with, \"But getting dangerously blasted off a quarter in tea every 6 months seems to do the trick.\"?",
            "title_similarity": "0.44440237",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hw3chl6",
            "score": 1,
            "text": "What if i take large doses at regular intervals?",
            "title_similarity": "0.22225612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3cj2d",
            "score": 1,
            "text": "Of course they're going to say this, big pharma doesn't like competition. Getta sell those psych meds.",
            "title_similarity": "0.6295214",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hw3cwvb",
            "score": 1,
            "text": "Where are the people saying trust the science now?",
            "title_similarity": "0.38030368",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hw3d01l",
            "score": 1,
            "text": "/r/psychology 2 months ago : science says psilocybin helps to cure depression\n\n/r/science today : it doesn't\n\n:')",
            "title_similarity": "0.660591",
            "sentiment_compound": -0.5862
        },
        {
            "id": "hw3dp87",
            "score": 1,
            "text": "Time to try megadosing, for science.",
            "title_similarity": "0.2279515",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3dpd3",
            "score": 1,
            "text": "Reading about microdosing on Reddit is akin to reading about Bernie Sanders in election years. One grows to think that the majority of the population supports it and it is seen as good. Then, one realizes that it is not yet fully accepted. I think microdosing has a better chance of being implemented long-term than Bernie Sanders, though.",
            "title_similarity": "0.58858573",
            "sentiment_compound": 0.8058
        },
        {
            "id": "hw3dqc3",
            "score": 1,
            "text": "So basically what I got for this is that if you are taking anything less than a gram then it’s basically a placebo. So does that mean the real benefits come from macrodosing regularly?",
            "title_similarity": "0.6270716",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hw3dwhi",
            "score": 1,
            "text": "great now i can tell my hippy friends to eat 5 grams for their mental health",
            "title_similarity": "0.3470701",
            "sentiment_compound": 0.802
        },
        {
            "id": "hw3dwtd",
            "score": 1,
            "text": "Here is my anecdotal story: \nI suspected that I suffered depressive episodes ever since I was a teenager but never got officially diagnosed or sought help for it, it would just come and go and I could live with it. Years ago, I'd been seeing stuff about microdosing helping to treat depression and thought \"Hey, I know where I can get some shrooms, I'll give it a go\". I'd tripped on mushrooms while in college a few times, so I was hoping this would just make my days a little brighter.\nOne Sunday morning I ground up some caps, measured out 2mgs of the powder and put it in some tea.\nAbout 2 hours later I felt really bad, like my heart was pounding, I was wiggly and I felt an overwhelming sense of doom. This lasted most of the day and I wasn't able to do anything but sit in a quiet room, TV and video games were way too much stimulation for me.\nThis ended up lasting for the better part of 3 days, I had to call out of work because I felt like I was having a heart attack, tight chest, trouble breathing, I thought I was dying. Eventually, I went to the hospital and (some may already have guessed) they said I was having panic attacks, gave me some meds for it and sent me home. They said there was no way the microdose was still effecting me but that it might have triggered the first panic attack and since then I just kept having panic attacks because I was so focused on my heart and breathing, thinking something was wrong with it. \nI continued to experience panic attacks and depressive anger outbursts for years afterwards. I felt like I broke my brain. \n\nI don't entirely blame the shrooms for the panic attacks. I actually think I was always on the verge of panic attacks prior and the microdose was just the little nudge that was needed for my dam to break and the waves of anxiety to overtake me. \n\nSince then I haven't tried microdosing and do not plan to. I now see a therapist about my depression/anxiety and I am having it treated appropriately and feeling much, much better. \n\n**TLDR: Tried microdosing for my anxiety/depression, spawned panic attacks. Now seeing therapist, feeling much better than self-medicated microdosing. See a therapist, don't self medicate.**",
            "title_similarity": "0.59842265",
            "sentiment_compound": -0.9914
        },
        {
            "id": "hw3e90z",
            "score": 1,
            "text": "Yeah it’s a tool not a fix all. If I needed to hammer in a bunch of nails but was using the hammer backwards of course it wouldn’t work.\n\nThe changes are within yourself not the mushroom. Use it to gain perspective and adjust your life how you see fit",
            "title_similarity": "0.6675067",
            "sentiment_compound": 0.8573
        },
        {
            "id": "hw3er2c",
            "score": 1,
            "text": "Anyone who has experience will tell you a macrodose helps",
            "title_similarity": "0.24401927",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hw3f51y",
            "score": 1,
            "text": "This is just micro dosing.  Personally, I don't see the benefit in micro doing but I do find value in taking a gram each time. I need the \"peak\" for at least a small time period.",
            "title_similarity": "0.6894968",
            "sentiment_compound": 0.3313
        },
        {
            "id": "hw3fjvw",
            "score": 1,
            "text": "The secret ingredient is crime?",
            "title_similarity": "0.311109",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hw3fm9t",
            "score": 1,
            "text": "Well \"new research\" isn't always right, now is it?\n\n-shoot enjoyer",
            "title_similarity": "0.6193855",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw3ggsp",
            "score": 1,
            "text": "At one point I had a boss that macro dossed Dailey claiming 3 or 4 grams was a small dose. Dude was insane.",
            "title_similarity": "0.5213547",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hw3gtxg",
            "score": 1,
            "text": "without even reading the research, I can tell the shroom-heads are not going to like this.",
            "title_similarity": "0.59590673",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hw3gv3g",
            "score": 1,
            "text": "Now do a study on heroic doses. I volunteer",
            "title_similarity": "0.30777797",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hw3ha11",
            "score": 1,
            "text": "ima stil do it though",
            "title_similarity": "0.12234038",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3hj0h",
            "score": 1,
            "text": "It was just last week it seems, the medical industry said microdosing was good for depression and anxiety.",
            "title_similarity": "0.5760687",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hw3hvkj",
            "score": 1,
            "text": "So what they are saying is you need what is commonly known as a “heroic dose” to get those benefits.",
            "title_similarity": "0.28358227",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hw3i0mb",
            "score": 1,
            "text": "Microdosing cannabis has changed my life for the better.",
            "title_similarity": "0.55689883",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw3it5z",
            "score": 1,
            "text": "Sweet. Gonna go back to macrodosing maybe once a month or so. If I’m being honest, quitting drinking helped my depression and anxiety more than anything and I only drank once a week.",
            "title_similarity": "0.626565",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hw3j11w",
            "score": 2,
            "text": "My former anxiety would like to have a few choice sharp words with this article.",
            "title_similarity": "0.33550736",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hw3jdmk",
            "score": 1,
            "text": "How about some MACROdosing trials.",
            "title_similarity": "0.3174073",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3ju4t",
            "score": 1,
            "text": "It’s also not recommended to dose if you have mental illness in your family because it could spark a mental illness in you if you take some. According to this docu on Drugs. \n\nI’ve thought about taking shrooms to help my anxiety but I know very little about my birth mom’s mental health",
            "title_similarity": "0.7647128",
            "sentiment_compound": -0.2607
        },
        {
            "id": "hw3k2nn",
            "score": 1,
            "text": "Works for me but I take it with lions mane, reishi,cordyceps and turkey tail mixed in the dose…",
            "title_similarity": "0.23732919",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3k8tz",
            "score": 1,
            "text": "Funny how, as we get closer to legalization, and with an unprecedented wave of depression just nearing the shore, I have seen small hit pieces on Ketamine and now psilocybin. Regardless of the fact that every article on both for the last decade or so has said otherwise. \n\nGlad I know so that I can give all my monies to Pfizer instead!",
            "title_similarity": "0.53438306",
            "sentiment_compound": 0.3595
        },
        {
            "id": "hw3ki8g",
            "score": 1,
            "text": "Microdosing always felt like the crypto currency of the drug world",
            "title_similarity": "0.40771762",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hw3kyqf",
            "score": 1,
            "text": "Mushrooms is the only drug I’ve done that when it’s over I feel better then before I took it with no draw backs",
            "title_similarity": "0.5813362",
            "sentiment_compound": 0.2139
        },
        {
            "id": "hw3lwl5",
            "score": 1,
            "text": "Saved my life, from depression and anxiety. I once didn't leave my house for 2 years and now I'm a relatively normal working member of society ,happy on top of that . thanks to microdosing psilocybin.",
            "title_similarity": "0.55301434",
            "sentiment_compound": 0.7139
        },
        {
            "id": "hw3m1mv",
            "score": 1,
            "text": "Yeah, micro dose was meant to be a small dose. Now everyone takes it like cigarettes.",
            "title_similarity": "0.469638",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hw3mfvg",
            "score": 1,
            "text": "The people in the study literally didn't have anxiety or depression in the first place, if one actually, y'know, READS the information contained in this study....\n\nSo.......",
            "title_similarity": "0.5971204",
            "sentiment_compound": -0.4909
        },
        {
            "id": "hw3mhog",
            "score": 1,
            "text": "Another thing to consider is that mushrooms grow naturally, and can be cultivated at home. They do not have as much profit potential as an SSRI or a benzodiazepine treatment. Psilocybin is a schedule 1 controlled substance, insurance companies will never pay for an illegal drug, drug makers won’t make much profit from selling them. The motivation for researching medicinal effects of psilocybin is to see if it can help people, and that’s not what the U.S. health care system is about. If it doesn’t show profit potential, Drug manufacturers will lobby Lawmakers against it.",
            "title_similarity": "0.73537886",
            "sentiment_compound": 0.9152
        },
        {
            "id": "hw3mip3",
            "score": 1,
            "text": "Oh I disagree with this 100%",
            "title_similarity": "0.3044868",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hw3nfy8",
            "score": 1,
            "text": "Depends on the dose I am thinking. If I take 2\\~ grams ( I am obese ) , I feel a little high, but my mood is fantastic for days. Noticeably so. Is it the remnants of a mellow trip? Did the psilocybin directly affect it?",
            "title_similarity": "0.6084178",
            "sentiment_compound": 0.7399
        },
        {
            "id": "hw3njnn",
            "score": 1,
            "text": "I’m not sure of the science and research behind this post.  I have not read into this claim. All I can share is my unique perspective and story. \n\nI also try to remember that substances affect different people in different ways.\n\nI currently microdose psilocybin and have noticed how my ability to cope under pressure has  improved from day one. I take half the recommended dose and only take on alternate days. \n\nIv noticed on days that I take / don’t take my anxiety/depression feels more controlled. Not completely gone but noticeably reduced.  \n\nLast year I micro-dosed for two weeks with similar results. So it’s not a permanent fix for me but a great non addictive tool to cope when I’m battling and at my lowest.  I’m currently on day 5.",
            "title_similarity": "0.73942745",
            "sentiment_compound": 0.4971
        },
        {
            "id": "hw3no9j",
            "score": 1,
            "text": "Who funded this research?",
            "title_similarity": "0.25435424",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3oukv",
            "score": 1,
            "text": "This study brought to you by big pharma",
            "title_similarity": "0.26418525",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3owuv",
            "score": 1,
            "text": "Eh I wanna see results on periodic large doses \n\nThe psycocilban",
            "title_similarity": "0.23770425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3p0oc",
            "score": 1,
            "text": "Yeah.  Trust the science.",
            "title_similarity": "0.20895523",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hw3p5jh",
            "score": 1,
            "text": "But it did last week. It’s ok tho, I’ll wait to see what is said next week. Ugh.",
            "title_similarity": "0.3383664",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hw3phag",
            "score": 1,
            "text": "it was a crank idea presented by cranks, so it's not surprising",
            "title_similarity": "0.37913746",
            "sentiment_compound": -0.2681
        },
        {
            "id": "hw3q2ej",
            "score": 1,
            "text": "I have social anxiety disorder and started microdosing hoping it would help. I microdosed shrooms for a three month period. I found that it made my negative thinking so much worse. Unfortunately have to stop the microdosing.\n\n[https://www.reddit.com/r/microdosing/comments/i80piy/i\\_have\\_social\\_anxiety\\_disorder\\_and\\_started/](https://www.reddit.com/r/microdosing/comments/i80piy/i_have_social_anxiety_disorder_and_started/)",
            "title_similarity": "0.5524761",
            "sentiment_compound": -0.8703
        },
        {
            "id": "hw3qytg",
            "score": 1,
            "text": "This article has misinformation written all over it, especially with that blatant lie of a picture.",
            "title_similarity": "0.3487784",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hw3qywq",
            "score": 1,
            "text": "if it feels good to the user, and it does no harm...why would anybody care?",
            "title_similarity": "0.50964296",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hw3s087",
            "score": 1,
            "text": "It's just a little more fun",
            "title_similarity": "0.2471513",
            "sentiment_compound": 0.513
        },
        {
            "id": "hw3s9uz",
            "score": 1,
            "text": "I could have been a test study for this in college. It does not improve ANYTHING.",
            "title_similarity": "0.6493995",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hw3sec4",
            "score": 1,
            "text": "Microdosing didn’t take flight to improve depression. It started because it helps create a more active and free thinking cognitive process. I have never heard any claims of it helping improve depression.",
            "title_similarity": "0.6987779",
            "sentiment_compound": 0.8707
        },
        {
            "id": "hw3ss9o",
            "score": 1,
            "text": "Well, there are hundreds of thousands of drugs/chemicals out there and this is a drop in the ocean.\n\nI thought the whole point of psilocybin regarding to mental health was to make CBT based therapies more successful.",
            "title_similarity": "0.4223968",
            "sentiment_compound": 0.624
        },
        {
            "id": "hw3st4r",
            "score": 1,
            "text": "Ahh yes, a tiny sample size. I can't wait till more research is done. Because anecdotally I've got friends who microdose and have found it to help enormously. We need to know more.",
            "title_similarity": "0.4876451",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hw3svnj",
            "score": 1,
            "text": "Makes sense. The approach that's been proven is to have a solid 'hero' dose, in a controlled environment guided by a professional, followed by one or two smaller doses. \n\nThere are treatments in late stage trials, hopefully we'll see something formal make it through the FDA in the next couple of years.",
            "title_similarity": "0.48593765",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hw3tced",
            "score": 1,
            "text": "First study I've seen saying they don't work. Based on ym own experience they are.... Okay at helping? They make me less of a robot than SSRIs and the depression is more present vs SSRIs which mjust made the depression a bit muted while being a robot.",
            "title_similarity": "0.72268414",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hw3tib1",
            "score": 1,
            "text": "Well, that's depressing.",
            "title_similarity": "0.31806245",
            "sentiment_compound": -0.128
        },
        {
            "id": "hw3udxt",
            "score": 1,
            "text": "taking large one does, or at least is fun",
            "title_similarity": "0.16649061",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hw3uu7m",
            "score": 1,
            "text": "Then why am I feeling great?",
            "title_similarity": "0.16832027",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hw3v5c1",
            "score": 1,
            "text": "Another caveat is that many people in our study broke blind and they figured out what condition they were assigned to….. sounds like some great science went on here…",
            "title_similarity": "0.43924323",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hw3vd2k",
            "score": 1,
            "text": "***appear***  The scientific term showing positive findings would take away from the profits of pharmaceutical companies...",
            "title_similarity": "0.59446573",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hw3vwff",
            "score": 1,
            "text": "So take large doses... Got it.",
            "title_similarity": "0.04889498",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3wlhb",
            "score": 1,
            "text": "Can someone who is better at statistics tell me how this is not 'at least promising':\n\n[https://journals.sagepub.com/na101/home/literatum/publisher/sage/journals/content/jopa/2022/jopa\\_36\\_1/02698811211050556/20220118/images/medium/10.1177\\_02698811211050556-fig3.gif](https://journals.sagepub.com/na101/home/literatum/publisher/sage/journals/content/jopa/2022/jopa_36_1/02698811211050556/20220118/images/medium/10.1177_02698811211050556-fig3.gif)  \n\n\nNot to mention they microdosed at most 5 to 7 times during each three week period..",
            "title_similarity": "0.6290069",
            "sentiment_compound": 0.5901
        },
        {
            "id": "hw3wpsf",
            "score": 1,
            "text": "Mega dosing should help",
            "title_similarity": "0.2738976",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hw3wxa9",
            "score": 1,
            "text": "It actually does but I wouldn’t know I only have anxiety and depression and they helped me more than any type of therapy ever has.",
            "title_similarity": "0.47755486",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hw3x43k",
            "score": 1,
            "text": "TLDR take “scientific research” with a grain of salt especially when it’s on Reddit",
            "title_similarity": "0.33301562",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3xk2i",
            "score": 1,
            "text": "I trust science, and I love mushrooms, though, I haven't done them for quite a while. I can only speak to their effects on me cause people handle them differently. I would agree that psilocybin can have lingering positive effects, as I always have a clearer less anxiety stricken brain for months after going on a trip. I fail to see how this can be achieved through microdosing, as I feel the dose must be large enough to send your brain to DEFCON 2.  It will be interesting to see.",
            "title_similarity": "0.64581907",
            "sentiment_compound": 0.8545
        },
        {
            "id": "hw3xv14",
            "score": 1,
            "text": "It does wonders for my Migraines however.",
            "title_similarity": "0.4347425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3y11w",
            "score": 1,
            "text": "Sure, right, ok. What about macro-dosing tho?",
            "title_similarity": "0.27021343",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hw3y6jq",
            "score": 1,
            "text": "Ask who paid for the research first.",
            "title_similarity": "0.34138757",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3y8fz",
            "score": 1,
            "text": "Sooo... is there more evidence for or against microdosing?",
            "title_similarity": "0.5225142",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3yqbp",
            "score": 1,
            "text": "I know of two people, one man and one woman between the ages of 25-35 that micro dose psilocybin. I've talked to them a bit about their use and how it's impacted their lives and found that they were both using for the same reason and seeing similar results. One person was very anxious and another person didn't say they were anxious, just that they have a \"very busy mind\". For both, they said micro dosing allows them to slow down and actually process their thoughts, focusing on the important thoughts.\n\nJust sharing this as a data point of my own :)",
            "title_similarity": "0.59279835",
            "sentiment_compound": 0.5118
        },
        {
            "id": "hw3z33g",
            "score": 1,
            "text": "But the study yesterday said it does! Now I don't know what to think...",
            "title_similarity": "0.45730907",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3zd00",
            "score": 1,
            "text": "I always assumed the experience was the key to mind change. Micro dosing doesn’t seem to alter neural pathways.",
            "title_similarity": "0.6284721",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw3zvcs",
            "score": 1,
            "text": "What?!?! Being high all the time wont solve my problems?\n\nColor me surprised",
            "title_similarity": "0.5356165",
            "sentiment_compound": 0.5705
        },
        {
            "id": "hw40eco",
            "score": 1,
            "text": "Says Dr. Harshinmyvibe",
            "title_similarity": "0.26493013",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw40elo",
            "score": 1,
            "text": "I’ve been saying for awhile that “macrodoses”, really just “regular” doses, of mushrooms seems to be far more effective than microdosing. Microdosing sometimes helps me with my ADHD symptoms, but when it comes to stress, depression, and anxiety, the research seems to overwhelmingly suggest that it’s the larger doses that yield the positive benefits.\n\nI read it awhile ago so the details might not be 100%, but one study’s findings suggested that the commonality between those who had their addiction/depression cured by psilocybin was the experience of a “spiritual experience” on the substance. You’re not likely to have that experience with a microdose",
            "title_similarity": "0.65845287",
            "sentiment_compound": -0.0653
        },
        {
            "id": "hw40iab",
            "score": 1,
            "text": "False it helped me tons",
            "title_similarity": "0.2409465",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw40jbb",
            "score": 1,
            "text": "This is exactly why I only dose in large quantities. It's hard to be depressed when you can hear colors..",
            "title_similarity": "0.46908593",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hw40wwz",
            "score": 1,
            "text": "“In four laboratory sessions, which took place about 1.5 hours after self-administering a dose of psilocybin or placebo,” \nMicro dosing doesn’t work like this..",
            "title_similarity": "0.6431742",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hw40zio",
            "score": 1,
            "text": "Looks like I’m switching back to macrodosing",
            "title_similarity": "0.32254028",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hw414kt",
            "score": 1,
            "text": "Just let scientists science and stop citing every new study as irrefutable proof of whichever point you want to make. It's really that simple. We're so trigger-happy with... knowledge?",
            "title_similarity": "0.374565",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hw419ua",
            "score": 1,
            "text": "I LOVE taking mushrooms but sadly, my own personal experience with micro-dosing was pretty bad.  I took it seriously as well. I ordered empty capsules, ground the shrooms into a fine powder and measured out .2 g doses, and had about 5 weeks worth when I was done.\n\nI micro-dosed for several weeks and even submitted data daily to a researcher, but I never noticed any benefits.  All I ever got was some slight nausea in the morning and that was it.  \n\nIt hasn't changed my mind on mushrooms, just on micro-dosing with them.  I still strongly recommend a prescription of a good trip every couple months or so, along with a great group of friends.  No other medicine can compare to the experience you get from those good times.",
            "title_similarity": "0.63561356",
            "sentiment_compound": 0.9665
        },
        {
            "id": "hw420m7",
            "score": 1,
            "text": "Why make such a big deal out of a single study with a small sample size?",
            "title_similarity": "0.50123036",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw424ap",
            "score": 1,
            "text": "I microdosed 3-4 times a week all of last year, taking a shred smaller than the size of my pinky nail. A size I would never feel the physical effects of. In the beginning it helped with mental acuity in college but was never a huge game changer. Thought it helped my depression and anxiety but one day I decided to stop and started feeling a bit better. Not much though\n\nThe depression and anxiety came from elsewhere. There is no magic cure for these problems. I’m doing better now and it’s due to a giant combination of things, quitting weed being one of the largest as an everyday smoker for the past 12 years.\n\nLong story short, you have to do work and make changes to beat anxiety and depression. It’s not easy and no one or thing can do it for you",
            "title_similarity": "0.7010671",
            "sentiment_compound": -0.9756
        },
        {
            "id": "hw42czb",
            "score": 1,
            "text": "150mg of psilocybin every third day was the protocol for most participants. Not the Stament protocol of 4 on 3 off.",
            "title_similarity": "0.49629772",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw42k0o",
            "score": 1,
            "text": "as someone who has done lots of psychedelics and benefited from the wells of therapeutic insight they offer, eating them every day in any quantity is a bad idea. Do big doses, take your lessons and write them down, then go back to the sustainable, daily mental health practices that are meditation, mindfulness, and therapy.",
            "title_similarity": "0.5870918",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hw4399i",
            "score": 1,
            "text": "Does that mean the people promoting the practice here on reddit are actually the addicts I suspected them to be?",
            "title_similarity": "0.5181891",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hw45l94",
            "score": 2,
            "text": "Well different strokes for different folks. It helped me.",
            "title_similarity": "0.33074716",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hw45ps9",
            "score": 1,
            "text": "These people also need counseling and not just a pill. The results with therapy are likely much better then just giving someone a bag of pills and saying good luck.",
            "title_similarity": "0.63837194",
            "sentiment_compound": 0.8807
        },
        {
            "id": "hw464no",
            "score": 1,
            "text": "but did they meditate",
            "title_similarity": "0.3979746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw46afc",
            "score": 2,
            "text": "Would like to see this study expanded upon, in length, dosing, and in participants. \nMight find a change in data with more.",
            "title_similarity": "0.2520499",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hw46qy3",
            "score": 1,
            "text": "I do macrodosing (4-5 grams) about 3 or 4 times a year. Always served an incredible purpose for me that would ring my brain into proper alignment for months and months and months on end.\n\nTried microdosing for a while, got more anxious, got a little weirded out, could never figure it out. Felt real odd and ineffective.",
            "title_similarity": "0.5020976",
            "sentiment_compound": -0.624
        },
        {
            "id": "hw46tah",
            "score": 1,
            "text": "Surprise surprise. It turns out weed isn’t going to be the new biofuel alternative either.",
            "title_similarity": "0.72867775",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hw47c0y",
            "score": 1,
            "text": "But wait, what about all the wooks who told me with such high confidence that this surely cured all their problems?",
            "title_similarity": "0.23670301",
            "sentiment_compound": 0.6956
        },
        {
            "id": "hw47c72",
            "score": 3,
            "text": "Only over a 3 week period, small sample size, and only every third day, they broke blind early. Still too soon to gather any information on this subject, hope more research is done.",
            "title_similarity": "0.49720716",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hw48s4n",
            "score": 1,
            "text": "A big \"hmmm\" about the study is that all the people were already healthy, none had depression or anxiety.",
            "title_similarity": "0.36713782",
            "sentiment_compound": 0.6121
        },
        {
            "id": "hw49802",
            "score": 1,
            "text": "Pfft, I'll do my own experiments thank you very much",
            "title_similarity": "0.2311591",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hw4apf2",
            "score": 1,
            "text": "Who funded the research?",
            "title_similarity": "0.2766742",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw4asmb",
            "score": 1,
            "text": "I desperately need to do this. But my insurance wouldn’t cover it.",
            "title_similarity": "0.4582898",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hw4b2bf",
            "score": 1,
            "text": "It does if you believe it does - much like a placebo. Whilst it not be applicable as \"proper medicine\", if you find it helps you then don't doubt it - the only downside is you might just be labelled as one of those homeopathic nutjobs.",
            "title_similarity": "0.6875015",
            "sentiment_compound": 0.6381
        },
        {
            "id": "hw4batv",
            "score": 1,
            "text": "OK then... I'll keep macrodosing",
            "title_similarity": "0.23129472",
            "sentiment_compound": 0.4466
        },
        {
            "id": "hw4bfe5",
            "score": 1,
            "text": "So....large samples...........got it. Thanks",
            "title_similarity": "0.06136303",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw4bjwo",
            "score": 1,
            "text": "I'm calling a big BS in this one. I know for a fact it helps me",
            "title_similarity": "0.15803292",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hw4btxq",
            "score": 1,
            "text": "Research paid by SRRI drug dealing companies....",
            "title_similarity": "0.43121517",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw4c2gk",
            "score": 1,
            "text": "Glad they don't \"research\" me.. because it works and worked for me",
            "title_similarity": "0.5240778",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hw4cd3x",
            "score": 1,
            "text": "The many people I know who’ve benefited from this would say otherwise",
            "title_similarity": "0.2911799",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw4cmko",
            "score": 1,
            "text": "I did my own study doing micro dosing every 3rd day. Over the course of 4 months i did notice i dwell much less on depressive and opressive thoughts, my moods dont swing nearly as hard, and i overall feel more content and mentally lighter. Its also made thinking through difficult topics much easier, i can look at things more rationally and realistically it feels and come up with a viable long term solution instead of a break neck bandaid just to keep moving forward. But i will admit it is NOT for everyone.",
            "title_similarity": "0.6557406",
            "sentiment_compound": 0.3376
        },
        {
            "id": "hw4cozv",
            "score": 1,
            "text": "Research funded by whom may I inquire?",
            "title_similarity": "0.22502409",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw4cy5n",
            "score": 2,
            "text": "Only taking big doses does.",
            "title_similarity": "0.27807876",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw4d7qk",
            "score": 1,
            "text": "Not surprised. Judging by the setup of other psilocybin triala with people suffering from depression, it seems to be the \"mystical experience\" of a single high dose in a good setting that helps them",
            "title_similarity": "0.6444535",
            "sentiment_compound": -0.4526
        },
        {
            "id": "hw4eyyz",
            "score": 1,
            "text": "This is such a big deal from an anti corruption stand point. Drugs that can’t be patented are showing enormous potential in treating mental illness in high doses one to three times. That model can’t easily be exploited by pharmaceutical companies. Daily dosing (particularly of analog patentable compounds) will perfectly fit the profit mode of these companies. The fact that it doesn’t work that way is a miracle and offers me a lot of optimism about the future of psychedelic medicine.",
            "title_similarity": "0.630387",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hw4g7ud",
            "score": 1,
            "text": "I know that microdosing LSD has worked a LOT better for me than adderal, and isn’t habit forming!",
            "title_similarity": "0.5981523",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hw4hh5d",
            "score": 1,
            "text": "So you need to consume a large quantity once in a while, got it!  Science!",
            "title_similarity": "0.23623173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw4i0wd",
            "score": 1,
            "text": "Well yeah, try a larger dose!",
            "title_similarity": "0.10648319",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hw4i7wv",
            "score": 1,
            "text": "Alright, large doses it is then.",
            "title_similarity": "0.017810313",
            "sentiment_compound": 0.25
        },
        {
            "id": "hw4iqq5",
            "score": 1,
            "text": " This study is not nearly conclusive to any real results. Anyone who read this hamwash clickbait article knows the same. The Authors of the study even say the same, saying that a number of variables make this study non-conclusive.\n\n\n The participants were pulled from a micro dosing workshop. The study was done over 3 weeks,far to short to confirm anything. Given the nature of psychodelics it's extremely plausible for participants to break blind.\n\n it's click bait sites/articles like this that create a bad name for this area of science. Given all of this I hope this field continues to grow, if only for more exposure.",
            "title_similarity": "0.6458626",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hw4kpij",
            "score": 1,
            "text": "Hmmm, so the study says it 'broke blind' ie. the test fell apart/failed, and yet they chose to make a conclusion despite that? And apparently they dosed with \"0.7 g\" of mushrooms, \"which corresponds to around 1/10th of a medium-high dose\", that sure doesn't sound like a 'micro' dose, I expect a lot of people would probably notice edge hallucinogenic effects from that dose and lead to breaking blind. I note that they're not using any Lionsmane etc. so not a Stamets stack. The whole idea of a microdose is that it's supposed to be sub-hallucinogenic and yet the dosages used would likely provide apparent visual etc. effects. Additionally it's notable that they have some pretty major Limitations on the study.\n\nIt sounds a lot like this study was designed to fail, and should realistically have been reported as inconclusive as a result.",
            "title_similarity": "0.76980484",
            "sentiment_compound": -0.7013
        },
        {
            "id": "hw4niot",
            "score": 1,
            "text": "From my experience it just made me more open and sensitive to things, often for not useful reasons. At high doses at least the benifits last me maybe 16 hours post being incapacitated.",
            "title_similarity": "0.538374",
            "sentiment_compound": -0.6492
        },
        {
            "id": "hw4nzhc",
            "score": 1,
            "text": "Just from a research perspective, at that sample size you're very unlikely to find anything significant unless the differences are absolutely massive, which is not the point of microdosing. IMO this research tells us nothing useful unless it has more solid numbers behind it",
            "title_similarity": "0.6553207",
            "sentiment_compound": 0.0739
        },
        {
            "id": "hw4otvw",
            "score": 2,
            "text": "One of the posters in r/microdosing has a great breakdown of why this study is so flawed here:  https://www.reddit.com/r/microdosing/comments/snnuj4/comment/hw3uyem/?utm\\_source=share&utm\\_medium=web2x&context=3",
            "title_similarity": "0.4011028",
            "sentiment_compound": 0.0281
        },
        {
            "id": "hw4r2ji",
            "score": 1,
            "text": "I much prefer a “hold onto your seat” kind of experience every few months anyway.",
            "title_similarity": "0.38769352",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw4rncr",
            "score": 1,
            "text": "It's about time. I've always believed the amount of healing is proportional to the dose taken (up to a certain point). I think microdosing is valuable, especially for people who don't want to jump into a trip but could benefit from the medicine, but repeated microdosing is a bad idea.",
            "title_similarity": "0.68174434",
            "sentiment_compound": 0.1874
        },
        {
            "id": "hw4ug9p",
            "score": 1,
            "text": "Heroic dose now recommended ehy? “Take it easy but take its”-Mc Kenna",
            "title_similarity": "0.44504333",
            "sentiment_compound": 0.5647
        },
        {
            "id": "hw4w1uf",
            "score": 1,
            "text": "Small sample size and easy to break the blind when your sugar pill doesn’t produce any psychoactive effect. \n\nEven at a micro-sized dose, you know you’ve taken it.",
            "title_similarity": "0.6634753",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hw4wtoh",
            "score": 1,
            "text": "Meanwhile the drugs that were made to treat these things make you feel suicidal. HMMMMMMMMM",
            "title_similarity": "0.5587903",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hw4y5gd",
            "score": 2,
            "text": "Anecdotal story for what its worth. Had major depression, constant suicidal thoughts for several consecutive years and thought I would have to fight it the rest of my life. It seemed likely that eventually I would lose the battle because I kept finding myself in moments where I wasn’t in control logically including occasional moments where I hurt myself or acted before I could even think. Impulses and thoughts that later made no sense to me, desperate to escape a torturous unending pain like a loved one just died. The point is it was as bad as it gets. Friend microdosed me with psilocybin, I didn’t believe it would do anything except maybe give me weird dreams. Didn’t take it for depression, that was just my state. Had massive mental change immediately light a switch turned on, and have never experienced depression in any comparable way since then. Can’t convince me it was coincidence. Ever since then I have been terrified to try anything mind-altering in case I undo whatever was fixed.",
            "title_similarity": "0.5687509",
            "sentiment_compound": -0.982
        },
        {
            "id": "hw4yxfu",
            "score": 1,
            "text": "The dose and timeline of the study was ridiculous.\n\nThis doesn't show any evidence to what this headline claims.",
            "title_similarity": "0.61814463",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hw54kqg",
            "score": 1,
            "text": "I posted this as a comment in a different sub, but it bears repeating here too:\n\nThis was NOT a study of the effects of psilocybin on anxiety or depression! If you read the actual paper, you see that the researchers **deliberately excluded participants with existing anxiety or depression** \\-- hence, the results can't comment on the effects of microdosing on those issues, even though that's how the media spun it. All of the participants were already mentally healthy. \n\nFrom the paper:\n\n>*First, our participants were only admitted if our pre-trial screening deemed them as physically and mentally healthy, and their symptoms of anxiety and depression at baseline were within the normal range on average.*\n\nThis table is important: [https://journals.sagepub.com/na101/home/literatum/publisher/sage/journals/content/jopa/2022/jopa\\_36\\_1/02698811211050556/20220118/images/large/10.1177\\_02698811211050556-table2.jpeg](https://journals.sagepub.com/na101/home/literatum/publisher/sage/journals/content/jopa/2022/jopa_36_1/02698811211050556/20220118/images/large/10.1177_02698811211050556-table2.jpeg)\n\nYou can see that people's baseline scores were pretty normal for depression and anxiety, and slightly higher (worse) for \"stress.\" But, and I repeat, no one here was clinically depressed or anxious.\n\nThe researchers note that the earlier studies showing that microdosing improved anxiety and depression allowed people with worse baseline mental health to participate, and this may be why those studies -- but not the current one -- showed benefit:\n\n>*This creates the possibility that their significant reductions in negative emotionality were in part due to higher negative emotionality at baseline, whereas our participants may have experienced a ceiling effect; they were already mentally healthy prior to microdosing and could not show further improvement during the study.*\n\nThey try to justify their results as still valid by citing another earlier study in which the participants had similar baseline mental health scores as the participants in this study (AKA, healthy/normal), but still saw reductions in depression and stress. But, this is a weird argument because it doesn't invalidate the notion that people with more severe mental health challenges may be the ones to show the most improvement from microdosing, and that giving microdoses to a healthy population might not, y'know, help the mental health issues they *literally do not have*.\n\nUltimately this is a paper examining what the researchers hypothesize are the underlying mechanisms for why psilocybin could benefit anxiety and depression (emotional modulation and introceptive processing), which might not be the true mechanisms. They tested their hypothesis by taking a group of mentally healthy people and seeing how psilocybin microdoses affected these particular metrics. They disproved their starting hypothesis (at least within the healthy population... still unknown what the results would be in a group that actually had anxiety and depression), but nothing in this paper can comment on whether or not psilocybin actually helps anxiety and depression.\n\nIt's a textbook case of the media making a headline more sensational by spinning it into something it's not actually about.",
            "title_similarity": "0.7156257",
            "sentiment_compound": -0.9968
        },
        {
            "id": "hw55odt",
            "score": 1,
            "text": "I think I'll stand by Paul stamets mushroom stack.",
            "title_similarity": "0.207843",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw5ey3k",
            "score": 1,
            "text": "It cured my anxiety.\n\nBut.... My anxiety was a result of brain fog, not being able to think straight or remember stuff. Microdosing fixed that.",
            "title_similarity": "0.71609056",
            "sentiment_compound": -0.0129
        },
        {
            "id": "hw5hz9e",
            "score": 1,
            "text": "I've done a good amount of shrooms and always thought this anti-depression/anxiety thing was a huge misconception.",
            "title_similarity": "0.46542555",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hw5mv0r",
            "score": 1,
            "text": "A lot of blue haired kids are gonna be pretty mad about this.",
            "title_similarity": "0.27143735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw5nlcw",
            "score": 1,
            "text": "It doesn't work unless you are at a jamband concert. It has a synergistic effect.",
            "title_similarity": "0.54827046",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw5nzm3",
            "score": 1,
            "text": "Yup been doing this for 10 years. I’ll do it for a week and it cures my depression for up to a year.",
            "title_similarity": "0.3662062",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hw5php5",
            "score": 1,
            "text": "So glad we are now able to do research. Not every hypothesis will be confirmed true, but without researchers being able to investigate, the effective of mushrooms and other psychoactive compounds will forever be conjecture.",
            "title_similarity": "0.6285511",
            "sentiment_compound": 0.8018
        },
        {
            "id": "hw5pzk3",
            "score": 1,
            "text": "Works for me. I wish it worked for everyone.",
            "title_similarity": "0.17470478",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hw5t5pi",
            "score": 1,
            "text": "Always “based on new research.”",
            "title_similarity": "0.22751665",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw5thwr",
            "score": 1,
            "text": "I tried it and it did absolutely nothing for me so it makes sense to me. But I have felt an antidepressant effect for a few weeks when I took high doses of mushrooms. But that’s just an anecdote. I have pretty bad depression and I’ve tried a bunch of antidepressants that didn’t do much except one although I had to stop due to my epilepsy.",
            "title_similarity": "0.68886775",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hw5v6vt",
            "score": 1,
            "text": "You need more research:) it depends, there are groups of people that find it very helpful!",
            "title_similarity": "0.28150183",
            "sentiment_compound": 0.5244
        },
        {
            "id": "hw5vcg0",
            "score": 1,
            "text": "Biggest question is what dose was given. We are really in the beginning of figuring out an effective microdose. Effective dose may be a little higher than some common micro dosing regimens. This may have simply been too low a dose.",
            "title_similarity": "0.6826719",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hw60h0o",
            "score": 1,
            "text": "Except that is does significantly improve these symptoms in real life",
            "title_similarity": "0.34516716",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hw61w3v",
            "score": 1,
            "text": "More science needs to be done but yes, recreational drugs are bad, even the 'good' ones like weed and mushrooms because they're drugs",
            "title_similarity": "0.58042693",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hw62nxi",
            "score": 1,
            "text": "5g, dark room, have a sitter, good music, good set, good setting.",
            "title_similarity": "0.32831913",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hw634no",
            "score": 1,
            "text": "What about large doses at irregular intervals?",
            "title_similarity": "0.26124933",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw6n3kk",
            "score": 1,
            "text": "How about plutonium In small dosis ?",
            "title_similarity": "0.38571808",
            "sentiment_compound": 0.0
        },
        {
            "id": "hw6paye",
            "score": 1,
            "text": "I feel like they help give important insights, but nobody should expect psilocybin to do all the work for them. Can also inspire motivation to make better choices, but again the person has to follow through with those decisions to make them healthy habits. If research is only based on simply taking microdoses, then I see why it doesn’t support longterm effects.",
            "title_similarity": "0.7412456",
            "sentiment_compound": 0.9723
        },
        {
            "id": "hw76oxu",
            "score": 1,
            "text": "I’m severely generally anxious and have been for the last 5 years or so and every time I trip (whether it be on acid or shrooms) I find that my anxiety completely dissipates and I’m able to interact with the people around me totally unbridled.",
            "title_similarity": "0.4665303",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hw7ihdq",
            "score": 1,
            "text": "Yeah, this doesn’t come as a huge surprise.",
            "title_similarity": "0.44328576",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hwd4w85",
            "score": 1,
            "text": "HARD eye roll. Can they agree already?",
            "title_similarity": "0.29353076",
            "sentiment_compound": 0.0943
        },
        {
            "id": "hwqsaui",
            "score": 1,
            "text": "Great read, also i personally believe that 3.5 g’s or higher is a must for shroom dosage. I am not taking a micro dose n think about my life its a waste of my time",
            "title_similarity": "0.6395545",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyxwczt",
            "score": 1,
            "text": "Using shrooms always made me depressed, so I don’t see how this makes any sense.",
            "title_similarity": "0.5865762",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i2h5au2",
            "score": 1,
            "text": "Purely mind controlled propaganda. This natural remedy threatens the pharmaceutical companies so they pump out propaganda control your mind to make you believe it doesn't work when it actually does. Quit posting crap like this",
            "title_similarity": "0.5726778",
            "sentiment_compound": -0.4747
        },
        {
            "id": "i4159s3",
            "score": 1,
            "text": "Speaking from personal experience, I was diagnosed with severe depression and anxiety. I was reluctant to take antidepressants so I tried eating healthy, exercise, yoga, vitamins, and medication to combat it. Helped a little but still depressed. I finally tried microdosing shrooms for a while. Did nothing for me. Made my anxiety worse. Perhaps it helps for people with slightly less depression. However, I will say that the 1st time I did shrooms a few years back, I took the “heroic dose” (5g) and that was the most elated I can remember being and the clearest my mind has been in what felt like forever. It lasted very long and I felt like a new person. Unfortunately depression found it’s way back so perhaps I have to do another macro dose",
            "title_similarity": "0.673021",
            "sentiment_compound": -0.8627
        },
        {
            "id": "i5sizjp",
            "score": 1,
            "text": "Well, this study says otherwise. \n\nhttps://www.reddit.com/r/technology/comments/qt0lrk/hallucinogen_in_magic_mushrooms_relieves/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.52266526",
            "sentiment_compound": 0.2732
        }
    ]
}