{
    "Ivermectin randomized trial of 500 high-risk patients \"did not reduce the risk of developing severe disease compared with standard of care alone.\"\n": [
        {
            "id": "hxgtad2",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue to be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.30409676",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hxhmrzb",
            "score": 22,
            "text": "I appreciate all the effort that goes into studies like this... But every time I see them (like this and the ones that say unvaccincated people are 97x more likely to die), all I can think is \"Great news for me, someone who trusts science... But this information is *still* going to do exactly nothing to convince antivaxxers that still haven't gotten it to change their minds.\" \n \nI don't think anything can. How depressing and stupid.",
            "title_similarity": "0.5501042",
            "sentiment_compound": -0.053
        },
        {
            "id": "hxh189e",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxh4sa2",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxh4yrs",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhcbiw",
            "score": 10,
            "text": "Where did the idea begin that this was a covid treatment option in the first place? Has anyone done some forensic sleuthing to track it back to a blogpost or something?",
            "title_similarity": "0.26258576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxh7nzo",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhds2h",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxie1cs",
            "score": -3,
            "text": "For those wondering how the bunk claims about this neurotoxic anti parasitic drug came to be so prevalent, perhaps you missed the bombshell reports that came out a couple months ago:\n\nFAR-RIGHT HEALTH CARE COMPANIES MADE MILLIONS PRESCRIBING UNPROVEN COVID REMEDIES\nHacked data shows the lucrative operation promoted by a prominent far-right organization.\nIntercepted\nOctober 13 2021, 6:01 a.m.\n\nhttps://theintercept.com/2021/10/13/intercepted-podcast-covid-ivermectin-profits/\n\n\n\nNETWORK OF RIGHT-WING HEALTH CARE PROVIDERS IS MAKING MILLIONS OFF HYDROXYCHLOROQUINE AND IVERMECTIN, HACKED DATA REVEALS\nThe data also reveals that 72,000 people paid at least $6.7 million for Covid-19 consultations promoted by America’s Frontline Doctors and vaccine conspiracist Simone Gold.\nMicah Lee\nSeptember 28 2021, 5:37 p.m.\n\nhttps://theintercept.com/2021/09/28/covid-telehealth-hydroxychloroquine-ivermectin-hacked/",
            "title_similarity": "0.58959925",
            "sentiment_compound": 0.7297
        },
        {
            "id": "hxh6rr0",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxh7o49",
            "score": 50,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxha2zw",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxh7sn1",
            "score": -31,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhrpcr",
            "score": 25,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi31d1",
            "score": 13,
            "text": "Even though the title is correct, I find it a bit misleading.  \n\nThat's because if you DO progress to \"severe disease\" it's then the \"secondary outcomes\" you'd want to be concerned with.  From the text under the Results heading, this is what we see:\n\n*For all prespecified secondary outcomes, there were no significant differences between groups. Mechanical ventilation occurred in 4 (1.7%) vs 10 (4.0%) (RR, 0.41; 95% CI, 0.13-1.30; P = .17), intensive care unit admission in 6 (2.4%) vs 8 (3.2%) (RR, 0.78; 95% CI, 0.27-2.20; P = .79), and 28-day in-hospital death in 3 (1.2%) vs 10 (4.0%) (RR, 0.31; 95% CI, 0.09-1.11; P = .09). The most common adverse event reported was diarrhea (14 \\[5.8%\\] in the ivermectin group and 4 \\[1.6%\\] in the control group).*\n\nThe initial statement that \"there were no significant differences between groups\" this is false, in a quick look at the numbers that follow, first with Ivermectin treatment and then with none.\n\n* Mechanical ventilation of **1.7%** vs **4.0%** (more than double---significant if I were in that pool)\n* Intensive care unit admission of **2.4%** vs **3.2%** (not strongly significant)\n* Hospital death within 28 days of **1.2%** vs **4.0%** (quite significant)\n\nNo significant differences?  The stated conclusion above doesn't appear to fit the data.",
            "title_similarity": "0.7020602",
            "sentiment_compound": -0.8901
        },
        {
            "id": "hxh72kh",
            "score": 150,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhcpot",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhbxjg",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhdub0",
            "score": 9,
            "text": "Has anyone with scientific or medical credentials even articulated a hypothesis about how ivermectin might be effective to treat Covid?",
            "title_similarity": "0.48584473",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hxhb2ev",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxh75ng",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxh6rqi",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxgx6kp",
            "score": 153,
            "text": "Is there a standard care for Covid?  I've seen nothing from the CDC on treatment options for Covid. It's just \"get vaccinated\" (and I am by the way).\n\nI'm not saying this to defend Invermectin at all, but just focusing on the last sentence of the op's headline, I'm frustrated as a parent and as one who's had Covid twice that after two years there is no \"standard of care\" for Covid (pre-hospitalization).",
            "title_similarity": "0.4788199",
            "sentiment_compound": -0.1406
        },
        {
            "id": "hxhmulp",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi1gva",
            "score": 0,
            "text": "Is it unsafe? Or does it just not work?",
            "title_similarity": "0.12658387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxheoi8",
            "score": 29,
            "text": "Mechanical ventilation occurred in 4 (1.7%) vs 10 (4.0%) (RR, 0.41; 95% CI, 0.13-1.30; P = .17), intensive care unit admission in 6 (2.4%) vs 8 (3.2%) (RR, 0.78; 95% CI, 0.27-2.20; P = .79), and 28-day in-hospital death in 3 (1.2%) vs 10 (4.0%) (RR, 0.31; 95% CI, 0.09-1.11; P = .09).  \n\n\nThe study is underpowered because the fraction of patients who progress to severe is a small one. Keep in mind even Pfizer's study with like 10,000 in each group was not able to produce statistically significant results in reducing all cause severe events or however they called it (they increased from 150 in control to 262) or mortality (1 more person died in vaccine group, 1 less covid death, 3 more heart attack deaths).",
            "title_similarity": "0.55223024",
            "sentiment_compound": -0.6231
        },
        {
            "id": "hxhn0i7",
            "score": -14,
            "text": "Can someone please explain to me something. I found that peer reviewed Brazil study that said that ivermectin works. But then there are other publications saying that there were errors made in that study.\n\nNow this study comes out and it says it doesnt work. Is someone gonna peer review this too? I just dont know what to believe anymore.\n\nAlso, in scientific community, is it generally accepted that only crazy people take this horse medicine or is there legitimate curiosity to see if works?",
            "title_similarity": "0.45298195",
            "sentiment_compound": -0.504
        },
        {
            "id": "hxhb7dl",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhair8",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxgyy74",
            "score": 762,
            "text": "Interesting; actually MORE of the ivermectin patients in this study advanced to severe disease than those in the non-ivermectin group (21.6% vs 17.3%). \n\n“Among 490 patients included in the primary analysis (mean [SD] age, 62.5 [8.7] years; 267 women [54.5%]), 52 of 241 patients (21.6%) in the ivermectin group and 43 of 249 patients (17.3%) in the control group progressed to severe disease (relative risk [RR], 1.25; 95% CI, 0.87-1.80; P = .25).”\n\n***IVERMECTIN DOES NOT WORK FOR COVID.***",
            "title_similarity": "0.71737456",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hxh0qit",
            "score": -48,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi1cpw",
            "score": -8,
            "text": "This looks like a decent study. It's not a nail in the coffin though since:\n\n* the sample sizes are too small\n* it's open-label\n\nYou would want a double blind study so the health care workers can't offer any bias in standard of care. I'm still not convinced one way or the other on ivermectin. There's too many conflicting studies and they seem to universally have methodology flaws and low sample sizes.",
            "title_similarity": "0.66831344",
            "sentiment_compound": 0.2504
        },
        {
            "id": "hxh705y",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxj8liw",
            "score": -4,
            "text": "So why is Pfizer creating a protease inhibitor pill if it doesn’t work?  Haven’t they proved protease inhibitors work?",
            "title_similarity": "0.40460706",
            "sentiment_compound": -0.1179
        },
        {
            "id": "hxib7zg",
            "score": 0,
            "text": "At best it’s inconclusive to treat Covid. Not good enough to be fda certified",
            "title_similarity": "0.40696818",
            "sentiment_compound": 0.6698
        },
        {
            "id": "hxhbp7e",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhncmd",
            "score": -1,
            "text": "[u/Honest_Ice_7239](https://www.reddit.com/u/Honest_Ice_7239)\n\nSouth Africa has a substantially higher case fatality rate & overall death rate per 100k than Israel.\n\nSource: https://coronavirus.jhu.edu/data/mortality\n\nIt's also very likely that South Africa's deaths are more undercounted than Israel's given the disparaties in their health systems.",
            "title_similarity": "0.58870506",
            "sentiment_compound": -0.8646
        },
        {
            "id": "hxh6pfp",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxh8t0x",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhbp42",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi2ctx",
            "score": 45,
            "text": "What people completely fail to understand is that Ivermectin was only ONCE found to be effective by a study in Egypt where they LIED ABOUT PATIENT DATA. This included making up two exact duplicate data sets (which is impossible if they were real data sets).\n\nIn one data set they used, a buddy of mine who is an epidemiology statistician reverse engineered the data to see what the set range was. He found that the only possible way to get the data was if EVERY SINGLE PATIENT in the set had an infection duration of either *exactly* 3 days or 18 days. Mathematically it would have been impossible for the data to produce the results.\n\nThe sample size was well over 100 people. So 100 randomly selected people each had infections of precisely 3 or 18 days. The chances of that happening are on a literal astronomical scale.\n\nEdit: I'm only going to say this once - anyone who wants to argue with me about this better bring primary sources. Literally EVERY study I can find about Ivermectin working references the Egypt study or *another meta study* which references the Egypt study, or references a study which is not peer reviewed or published in a legitimate source.\n\nI do this for a living, so if you're gonna lie to me, best of luck. However, I WILL be reporting anyone who is spouting disinformation without sources.",
            "title_similarity": "0.59079826",
            "sentiment_compound": 0.7934
        },
        {
            "id": "hxhsc81",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.0037072375"
        },
        {
            "id": "hxh9vdh",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhv78j",
            "score": -1,
            "text": "I know nothing about medicine, so this shouldn't come as a surprise, but I am not understanding how the researchers arrive at their conclusion from the study. Let me explain.\n\n\"Findings:  In this open-label randomized clinical trial of high-risk patients with COVID-19 in Malaysia, a **5-day course of oral ivermectin administered during the first week of illness** did not reduce the risk of developing severe disease compared with standard of care alone.  \nMeaning: The study findings do not support the use of ivermectin for patients with COVID-19.\" \n\nMy question is, is the conclusion stating that ivermectin does not have any impact for COVID-19 patients regardless of the length of treatment and dosage? I did not read the entire study, so please forgive me if I am missing something.\n\nThe patients were given ivermectin over the course of 5 days, and this had to discernible effect. However, why can we conclude from this that a higher dosage for a longer time would not work? It seems to be like a longer study would have to be undertaken to prove this.",
            "title_similarity": "0.6670896",
            "sentiment_compound": 0.5571
        },
        {
            "id": "hxh4kns",
            "score": -16,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxh4c43",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxh7jvj",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi994z",
            "score": 0,
            "text": "I understand the importance of doing these studies in the context of a world with a huge amount of disinformation constantly circulating.\n\nThat said, if I was a research scientist, I would feel like my skills and expertise are being seriously squandered if this ended up  being what I spent my time on.",
            "title_similarity": "0.30386126",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hxj8tlb",
            "score": 0,
            "text": "“Well we tested thing we already knew didn’t work, and confirmed it doesn’t work. Lucky for us we enjoy wasting our time disproving idiotic conspiracy theories.”",
            "title_similarity": "0.3326656",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hxj98o2",
            "score": 0,
            "text": "On a positive note, none of the trial participants developed heart worms.",
            "title_similarity": "0.6112219",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hxk6b8e",
            "score": 0,
            "text": "The fact that they had to do a scientific study to confirm that an anti-parasitic drug won’t work on a virus is insane to me",
            "title_similarity": "0.41635543",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hxheut2",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhdmaw",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhwty9",
            "score": 8,
            "text": "I don't get it... can someone please clarify why is it that these numbers are considered as non relevant info ? \n...\na)4 vs 10,\nb)6 vs 8,\nc)3 vs 10,...\n\n\"Mechanical ventilation occurred in 4 (1.7%) vs 10 (4.0%) (RR, 0.41; 95% CI, 0.13-1.30; P = .17), intensive care unit admission in 6 (2.4%) vs 8 (3.2%) (RR, 0.78; 95% CI, 0.27-2.20; P = .79), and 28-day in-hospital death in 3 (1.2%) vs 10 (4.0%) (RR, 0.31; 95% CI, 0.09-1.11; P = .09).\"\n\n.. Are these differences considered to be inside the margin of error ?",
            "title_similarity": "0.5558211",
            "sentiment_compound": -0.3527
        },
        {
            "id": "hxjfsmn",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxh8imd",
            "score": -16,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhob1t",
            "score": -20,
            "text": "It pisses me off that a lot of people won't believe the study results. Somehow even though actual science has saved millions of people from COVID, a lot of policy has been labeled as 'science' - especially by the left. So, when certain state governors or school boards ignore 'the science' and do their own thing and end up with better outcomes it looks like 'science' has failed. But it is actually dumb public policy that has failed and that has nothing to do with science.",
            "title_similarity": "0.55676115",
            "sentiment_compound": -0.8537
        },
        {
            "id": "hxhnrog",
            "score": -35,
            "text": "So it didn't provide a significant benefit in this study, but also did zero harm (no surprise there, it's one of the safest drugs that exists). And the pills cost pennies.\n\nCan any scientist explain why the hysteria in hospitals REFUSING to give ivermectin under any circumstances unless the patient signs himself out and takes it at home? I mean just the placebo effect would have been useful.",
            "title_similarity": "0.6792243",
            "sentiment_compound": -0.5416
        },
        {
            "id": "hxhz8jl",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxgua37",
            "score": 51,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxiquzd",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxj0jey",
            "score": 1,
            "text": "At what point during the infection was ivermectin given?",
            "title_similarity": "0.21144259",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxjvgt3",
            "score": 1,
            "text": "So in an underpowered study of mild cases when a low dose of ivermectin is administered late in the disease progressions for an arbitrary (clinically insignificant) amount of time there is no observable effect. \n\nThis is... both unsurprising and insignificant.",
            "title_similarity": "0.5772218",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hxhcuod",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhyyk8",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.0037072375"
        },
        {
            "id": "hxh9bmy",
            "score": 125,
            "text": "Im only playing devils advocate because i know if i quote this to my friend he will ask - is 490 a large enough sample size, and isnt 3 ivermectin deaths vs 10 non ivermectin deaths significant? or did i read that wrong?",
            "title_similarity": "0.61744475",
            "sentiment_compound": -0.3313
        },
        {
            "id": "hxhvbsj",
            "score": -1,
            "text": "Plenty of medicine we use today and have used for years might not do anything to help. \nFor example. Most people who get their CPR cards might recognize the name American Heart Association. I think just about every year they update the protocols for medical providers on what drugs to use in different emergencies. In 7 years of medicine I’ve watched the same drugs be removed, brought back and then removed again. \n\nWe practice best medicine off the best available science. Sometimes we are right some times we are wrong.",
            "title_similarity": "0.6233833",
            "sentiment_compound": 0.9217
        },
        {
            "id": "hxhzt3v",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxjmc9p",
            "score": 2,
            "text": "Now we wait for the “of course it says that, it only works if you mix it with urine and hydroxychloroquine”",
            "title_similarity": "0.20231353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxh3sps",
            "score": 567,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxib56r",
            "score": -5,
            "text": "To bad it isn't double blind placebo controlled.",
            "title_similarity": "0.45246226",
            "sentiment_compound": -0.3054
        },
        {
            "id": "hxjce8h",
            "score": 6,
            "text": "The people who need to hear this won't trust the science.",
            "title_similarity": "0.25911325",
            "sentiment_compound": -0.4023
        },
        {
            "id": "hxgybz1",
            "score": -26,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxiae2p",
            "score": 8,
            "text": "Can someone help me understand a few things about the study? Genuinely trying to understand a bit about the numbers.\n\n1. 21.6% (52 patients) of ivermectin group progressed to severe disease in comparison to 17.3% (43 patients) from the control group?\n\n2. Of those 52 severe ivermectin patients, 4  (7%) ended up on ventilators. Of the 43 control patients, 10 (23%) ended up on ventilators. Correct or is it the other way around? How is this not statistically significant?\n\n3. Of the 52 severe ivermectin patients, 6 (11%) ended up in intensive care. Of the 42 severe control patients, 8 (19%) ended up in intensive care. Does this exclude those that were on ventilators or died?\n\n4. Of the 52 severe ivermectin patients, 3 (6%) died. Of the 42 severe control patients, 10 (23%) died. Does this exclude ventilators and intensive care patients? Why is this not statistically significant?",
            "title_similarity": "0.6815162",
            "sentiment_compound": -0.9586
        },
        {
            "id": "hxhmnu4",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhoiy6",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.0037072375"
        },
        {
            "id": "hxhw0l6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxiyspc",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxj0q0o",
            "score": 0,
            "text": "They say the vaccine is unknown, unproven yet they pray to a make believe \"white dude\" in the sky. I'm done",
            "title_similarity": "0.36733443",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hxhff29",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhut5z",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhzozc",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhnb5f",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhr3my",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi4jx2",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxia3ro",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxidd9u",
            "score": -1,
            "text": "What standard of care?",
            "title_similarity": "0.11099898",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxj54dz",
            "score": -1,
            "text": "Is this not saying Ivermectin is as effective, or close to as effective as the normal treatment regimen..?",
            "title_similarity": "0.5782244",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hxj7jht",
            "score": -1,
            "text": "Shut up! Ivermectin 100% cures covid and cancer and everything else",
            "title_similarity": "0.42788625",
            "sentiment_compound": -0.69
        },
        {
            "id": "hxj98yv",
            "score": -1,
            "text": "I remember being used to treat certain symptoms in some patients where did this turn I to a miracle drug thing",
            "title_similarity": "0.43262613",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hxjcfpp",
            "score": 1,
            "text": "The deniers are already making a big deal about the higher mortality rate in the control group (p=0.09).  They can’t grasp the concept of statistical significance.  \n\nResults  Among 490 patients included in the primary analysis (mean [SD] age, 62.5 [8.7] years; 267 women [54.5%]), 52 of 241 patients (21.6%) in the ivermectin group and 43 of 249 patients (17.3%) in the control group progressed to severe disease (relative risk [RR], 1.25; 95% CI, 0.87-1.80; P = .25). For all prespecified secondary outcomes, there were no significant differences between groups. Mechanical ventilation occurred in 4 (1.7%) vs 10 (4.0%) (RR, 0.41; 95% CI, 0.13-1.30; P = .17), intensive care unit admission in 6 (2.4%) vs 8 (3.2%) (RR, 0.78; 95% CI, 0.27-2.20; P = .79), and 28-day in-hospital death in 3 (1.2%) vs 10 (4.0%) (RR, 0.31; 95% CI, 0.09-1.11; P = .09). The most common adverse event reported was diarrhea (14 [5.8%] in the ivermectin group and 4 [1.6%] in the control group).",
            "title_similarity": "0.65149605",
            "sentiment_compound": -0.8303
        },
        {
            "id": "hxjnz40",
            "score": 1,
            "text": "Among 490 patients included in the primary analysis (mean [SD] age, 62.5 [8.7] years; 267 women [54.5%]), 52 of 241 patients (21.6%) in the ivermectin group and 43 of 249 patients (17.3%) in the control group progressed to severe disease (relative risk [RR], 1.25; 95% CI, 0.87-1.80; P = .25). For all prespecified secondary outcomes, there were no significant differences between groups. Mechanical ventilation occurred in 4 (1.7%) vs 10 (4.0%) (RR, 0.41; 95% CI, 0.13-1.30; P = .17), intensive care unit admission in 6 (2.4%) vs 8 (3.2%) (RR, 0.78; 95% CI, 0.27-2.20; P = .79), and 28-day in-hospital death in 3 (1.2%) vs 10 (4.0%) (RR, 0.31; 95% CI, 0.09-1.11; P = .09). The most common adverse event reported was diarrhea (14 [5.8%] in the ivermectin group and 4 [1.6%] in the control group).\n\nThat seems to indicate that it works at preventing death, which is basically the most important metric to a person.  Albeit not statistically strong.  Sure it doesn’t seem at all better at preventing disease from becoming “severe “ but entering a hospital or ICU and ending up dying are very different.  The vaccines are the best prevention of severe disease and death, but in their absence this drug may help prevent death is how I am interpreting it.",
            "title_similarity": "0.78025186",
            "sentiment_compound": -0.8973
        },
        {
            "id": "hxjqwn4",
            "score": 1,
            "text": "\"Patients were excluded if they were asymptomatic, required supplemental oxygen, or had pulse oximetry oxygen saturation (Spo2) level less than 95% at rest.\"  \n\n\n... why?",
            "title_similarity": "0.5513188",
            "sentiment_compound": -0.34
        },
        {
            "id": "hxjvrvv",
            "score": 1,
            "text": "what about treating mild symptoms to just get over covid faster?",
            "title_similarity": "0.38445202",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxkgyvd",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxgyi4e",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxh4itl",
            "score": -24,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhe3kq",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxho5cf",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhw83r",
            "score": -2,
            "text": "Can someone please explain how the result is statistically significant even though their P=.25 instead of P<.05? I'm just questioning to understand.",
            "title_similarity": "0.46012402",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hxi0nxz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi2gq5",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi2qz0",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxipnlp",
            "score": -2,
            "text": "Why didn’t they include patients without symptoms? Presumably that would be an important subgroup to include given it isn’t always clear if you will become symptomatic.\n\nAlso unclear what precluded blinding the trial. \n\nThose are the most obvious criticisms. We could get into a discussion of dosing and adequate powering of the study but the above are good places to start.",
            "title_similarity": "0.47894326",
            "sentiment_compound": 0.6609
        },
        {
            "id": "hxj0scg",
            "score": -2,
            "text": "taking politics out of the topic. This study says ivermectin doesnt add to standard care, but they did not compare ivermectin as the care, vs no treatment. we cant conflation the conclusion to mean there is proof that ivermectin doesnt work until it is compared to those who didnt get treated with anything. ivermectin could very well be useless but this study doesnt show that.",
            "title_similarity": "0.5092506",
            "sentiment_compound": 0.3806
        },
        {
            "id": "hxj102o",
            "score": -2,
            "text": "The test is flawed because you’re comparing Ivermectin to “treatment” which can vary from patient to patient. If the people running this test wanted, they could vary the quality of all the activities that they club under “treatment” to get any desired result out of the study.",
            "title_similarity": "0.38690996",
            "sentiment_compound": -0.25
        },
        {
            "id": "hxj5mzm",
            "score": -2,
            "text": "Isn't Ivermectin being promoted as a potential cure? I don't think anyone has ever thought it was prophylactic.",
            "title_similarity": "0.4327628",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hxja18j",
            "score": -2,
            "text": "Not. Helping. \n\nActually wait. \n\nMaybe it is.",
            "title_similarity": "0.06236835",
            "sentiment_compound": -0.2235
        },
        {
            "id": "hxjaqra",
            "score": 2,
            "text": "It was just evil right wing assholes grifting gullible right wingers the entire time: https://www.fiercehealthcare.com/practices/right-wing-physicians-profit-off-fake-covid-19-treatment-new-data-finds",
            "title_similarity": "0.3181098",
            "sentiment_compound": -0.8934
        },
        {
            "id": "hxjdcqt",
            "score": -2,
            "text": "All those people see is 21 is better then 17, so this validates it for them.",
            "title_similarity": "0.5150554",
            "sentiment_compound": 0.7182
        },
        {
            "id": "hxjebdc",
            "score": -2,
            "text": "Doesn't make you less likely to catch Covid, but makes you more than 3 times less likely to die.  Seems like a worth while treatment option.",
            "title_similarity": "0.6621002",
            "sentiment_compound": -0.0911
        },
        {
            "id": "hxjkm98",
            "score": -2,
            "text": "It’s not supposed to be a preventative, it’s a treatment for AFTER you get it. Source: Mr. Ed told me",
            "title_similarity": "0.3395391",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxjv5ja",
            "score": 2,
            "text": "So what the author is saying is they should not inhibit the giving of ivermectin to anyone who wants it because it doesn't matter anyway.  Good stop inhibiting care.",
            "title_similarity": "0.37453932",
            "sentiment_compound": -0.1857
        },
        {
            "id": "hxhke11",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhzcsk",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi2i1p",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi4eg7",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxiq487",
            "score": -4,
            "text": "That’s true, if you look a the ivermectin group, and the control group- the number of people that progressed to severe disease were roughly the same. \n\n21.6% in the ivermectin group, and 17% in the control group. \n\nHowever, if we look at 28 day -in hospital all cause mortality deaths. \n\nWe see that 1.2% death rate ( 3 total) occurred in the ivermectin group, and 4% (10 total) occurred in the control group. \n\nNearly a quadrupling of 28-day all cause mortality hospital deaths.\n\nSo, BASED  ON THIS STUDY- the fact that it took place in Malaysia, should be relevant. ( not saying this is true, just that this is an extrapolation of the studies numbers,- I have no idea if  they would hold the same ratio) \n\nI think it’s fare to say that ivermectin won’t prevent most people from developing severe illness ( relative to standard care treatments) if given as a stand-alone treatment in response to Covid. \n\nHowever, there is a reduction in your chance of being in the 28-day all cause mortality  hospital death category.- although, there are several confounding factors in this study to consider. As a commenter informed me, Vaccine rates were not equal between the groups, and 4 of the 10 deaths in the control were related  to infections that developed from being in the hospital. \n\n\nAlso,\n\nMechanical ventilation occurred in 4 patients (1.7%) in the ivermectin group vs 10 (4.0%) in the control, another improvement, although smaller than the 28 day in hospital all cause immortality death.",
            "title_similarity": "0.6716317",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hxjaqcj",
            "score": -3,
            "text": "“4% death rate in control group vs 1.4% in ivermectin”,… what’s statistically insignificant is how deadly the virus is in the high risk population.",
            "title_similarity": "0.64427453",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hxhdgs5",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxjexnh",
            "score": -4,
            "text": "Yeah, it’s not supposed to be used alone. Multi drug treatments is where it’s at.",
            "title_similarity": "0.30299535",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hxh98x8",
            "score": 2279,
            "text": "I think it's important to note that while Ivermectin does not appear to be effective at treating Covid in many patients in the first world, it is both safe and statistically  useful in treating patients who are likely to be infected with a parasite.  The differences in trial results in more and less developed countries seems to support this conclusion.  It also makes sense, since it is an anti-parasitic drug, and parasitic infection reduces a person's ability to fight off Covid.",
            "title_similarity": "0.64205694",
            "sentiment_compound": 0.836
        },
        {
            "id": "hxhsngq",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhuth4",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi14ea",
            "score": -4,
            "text": "Reduction from 4% to 1.2% for deaths within 28 days. P .09, that looks pretty close to improvement.",
            "title_similarity": "0.6018988",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hxi27vj",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi9bww",
            "score": -4,
            "text": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8248252/\n\nTherapeutic Advances:\n\nMeta-analysis of 15 trials found that ivermectin reduced risk of death compared with no ivermectin (average risk ratio 0.38, 95% confidence interval 0.19–0.73; n = 2438; I2 = 49%; moderate-certainty evidence). This result was confirmed in a trial sequential analysis using the same DerSimonian–Laird method that underpinned the unadjusted analysis. This was also robust against a trial sequential analysis using the Biggerstaff–Tweedie method. Low-certainty evidence found that ivermectin prophylaxis reduced COVID-19 infection by an average 86% (95% confidence interval 79%–91%). Secondary outcomes provided less certain evidence. Low-certainty evidence suggested that there may be no benefit with ivermectin for “need for mechanical ventilation,” whereas effect estimates for “improvement” and “deterioration” clearly favored ivermectin use. Severe adverse events were rare among treatment trials and evidence of no difference was assessed as low certainty. Evidence on other secondary outcomes was very low certainty.",
            "title_similarity": "0.7140266",
            "sentiment_compound": -0.4566
        },
        {
            "id": "hxja6pm",
            "score": -6,
            "text": "So I should trust Steven Chee Loon Lim, MRCP; Chee Peng Hor, MSc; Kim Heng Tay. Who knows if they were paid off?",
            "title_similarity": "0.42408168",
            "sentiment_compound": 0.552
        },
        {
            "id": "hxjdgsq",
            "score": -4,
            "text": "You know, use of this drug was uncontroversial until Trump mentioned some research that showed it was an effective treatment for COVID-19.\n\nAre we really going to politicize drugs, now?",
            "title_similarity": "0.5231021",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hxhpa1m",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxgz859",
            "score": -28,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhv4g6",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.0037072375"
        },
        {
            "id": "hxi1eac",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxh0wp1",
            "score": 1233,
            "text": ">In this randomized clinical trial of high-risk patients with mild to moderate COVID-19, ivermectin treatment during early illness did not prevent progression to severe disease. The study findings do not support the use of ivermectin for patients with COVID-19.\n\nThis was the consensus for a while and it's great to see it confirmed by an actual clinical trial.",
            "title_similarity": "0.7417917",
            "sentiment_compound": -0.3678
        },
        {
            "id": "hxhzh0x",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxh8ift",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxh45e2",
            "score": -34,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxgunbp",
            "score": 7734,
            "text": "So... Same findings as the meta analysis from last June...\n\nhttps://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab591/6310839",
            "title_similarity": "0.39353567",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxho77a",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhs57g",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxht8qc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhwbnj",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxhy0sk",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi5tfr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.043332923"
        },
        {
            "id": "hxi5udr",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxi6cpm",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxibkji",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxilo4n",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxip4wx",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxiq7jr",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxitcco",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxivier",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxivpbj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxix3d4",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.04333291"
        },
        {
            "id": "hxj0p2r",
            "score": 2,
            "text": "“JAMIE LOOK THAT UP!”\n\nCan’t wait for the Joe Bros reaction to this.",
            "title_similarity": "0.15446773",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxj0uc2",
            "score": 1,
            "text": "Who could've predicted this outcome...",
            "title_similarity": "0.20443773",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxj1e30",
            "score": 1,
            "text": "So the sun doesn't rise in the west after all.",
            "title_similarity": "0.23229782",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxj2day",
            "score": 1,
            "text": "A quick note.  If you’ve got a dog they are probably on a heart worm medicine.  I looked at it for the first time ever a couple of days ago, and it was Ivermectin.  So I’m all set if I get sick and the evil [fill in your favorite paranoid fantasy villain here] cabal says “no life saving dewormer for you!”",
            "title_similarity": "0.40442127",
            "sentiment_compound": -0.75
        },
        {
            "id": "hxj2sxt",
            "score": 1,
            "text": "Why are they testing a horse drug on humans?!?!?",
            "title_similarity": "0.30524254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxj3gkg",
            "score": 1,
            "text": "What is the value in continuing to beat this dead horse? Who paid for this study? Who benefits?",
            "title_similarity": "0.33927512",
            "sentiment_compound": -0.395
        },
        {
            "id": "hxj3pav",
            "score": 1,
            "text": "*gasps* in Aaron Rodgers",
            "title_similarity": "0.11974083",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxj3sh5",
            "score": 1,
            "text": "Try and convince an antivaxxer.",
            "title_similarity": "0.096947044",
            "sentiment_compound": 0.25
        },
        {
            "id": "hxj4yu6",
            "score": 1,
            "text": "which disease though? was it specifically for covid, or just viruses in general?",
            "title_similarity": "0.25691092",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxj5c3x",
            "score": 1,
            "text": "You know something is useless when even the placebo effect wants nothing to do with it.",
            "title_similarity": "0.25516894",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hxj7grw",
            "score": 1,
            "text": "And not even a placebo boost.",
            "title_similarity": "0.20384362",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hxj7slr",
            "score": 3,
            "text": "Hey Jamie look that up!",
            "title_similarity": "0.006288072",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxjawud",
            "score": 1,
            "text": "The amount of Ivermectin required to kill Covid in a human body would kill the subject.",
            "title_similarity": "0.28371042",
            "sentiment_compound": -0.886
        },
        {
            "id": "hxjb8a7",
            "score": 1,
            "text": "PPmerino estás aquí? Yo sé que sí",
            "title_similarity": "-0.005056806",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxjbmze",
            "score": 1,
            "text": "You could have just asked a pharmacist and saved lots of money and resources.",
            "title_similarity": "0.50285304",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hxjfd9e",
            "score": 1,
            "text": "This is interesting to me, considering I agreed to participate and was given an ivermectin trial (no idea if it was real or placebo) when I got Covid a few months back.",
            "title_similarity": "0.4386153",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hxjhf2x",
            "score": 1,
            "text": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC300808/\nThis article comes to mind",
            "title_similarity": "0.08566457",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxjisvu",
            "score": 1,
            "text": "So why hasn’t my horse died of Covid yet?",
            "title_similarity": "0.3629148",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hxjkers",
            "score": 1,
            "text": "I'm not one to consider Ted Nugent a science expert, but at the start of the pandemic, he said, \"I'll bet there won't be a lot of old-time rock & roll people that are affected by COVID.\"\n\nHis reasoning was that so many of them went on tours to foreign lands and were required to take Ivermectin and other vaccines & drugs to prevent malaria and other diseases we didn't have in the USA.",
            "title_similarity": "0.5510842",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hxjl69v",
            "score": 1,
            "text": "Then why waa Ivermectin over hyped during the second covid wave?",
            "title_similarity": "0.36326686",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxjmm6d",
            "score": 1,
            "text": "‘I GOT WORMS’ - j Carrey, dumb n dumber",
            "title_similarity": "0.14469208",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hxjocjx",
            "score": 1,
            "text": "Interesting. A study which: \n\n* Is done in a country with a high incidence of parasitic disease like dengue, where the population is frequently given ivermectin?\n* The drug under investigation is given up to *a week* after symptoms appear? Not immediately administered, a week.\n* The study population is all in a prime high risk category (>50 years of age)\n* Reported comorbidities were significant such as hypertension (369 [75.3%]), diabetes mellitus (262 [53.5%]), dyslipidemia (184 [37.6%]), and obesity (117 [23.9%]). All of these are noted to be high-risk factors for increasing severity of the disease as well as lengthening the time for treatment. \n\nWell, to me it sound like the study data self-sorted into an unhealthy population that was already known to be hugely at risk, and also unlikely to be responsive to ivermectin, since the drug is widely available in Malaysia, and potential patients who are sensitive to it would not have reported symptoms and therefore been sorted out of the trial.\n\nWithout even looking at data, this study was designed to fail (i.e., show a negative correlation) from the beginning. \n\nAm I reading this wrong? (I'm not)",
            "title_similarity": "0.5813253",
            "sentiment_compound": -0.7222
        },
        {
            "id": "hxjq8yx",
            "score": 3,
            "text": "I dunno... Facebook AND my neighbour claims otherwise soooo....",
            "title_similarity": "0.17419958",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxjx7hp",
            "score": 1,
            "text": "Yeah but are people who think ivermectin is effective against Covid more likely to have a parasitic infection? Then ivermectin would indeed be better for them.",
            "title_similarity": "0.51300955",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hxjxp7p",
            "score": 1,
            "text": "What a waste of a study. Everyone already knew this, and the people using it are not inclined to listen to the results of a study.",
            "title_similarity": "0.27253255",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hxk10pa",
            "score": 1,
            "text": "Yay more confirmation...",
            "title_similarity": "0.07178643",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hxk1pun",
            "score": 1,
            "text": "It’s vital to point out that it has negligible at best benefits on covid, but also not demonise a useful drug as “animal medicine”",
            "title_similarity": "0.47661766",
            "sentiment_compound": 0.2242
        },
        {
            "id": "hxk265d",
            "score": 1,
            "text": "dang it. so I took the apple favored horror this morning for nOTHIng.",
            "title_similarity": "0.37225848",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hxk3n5u",
            "score": 1,
            "text": "In monotherapy as always.",
            "title_similarity": "0.15666476",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxk6zbv",
            "score": 1,
            "text": "The only people this matters for are the people who don't care about science and studies unless they can cherry pick something that supports their view",
            "title_similarity": "0.35560012",
            "sentiment_compound": -0.0008
        },
        {
            "id": "hxkghg8",
            "score": 1,
            "text": "Too bad … but we don’t read let alone believe science.",
            "title_similarity": "0.24955294",
            "sentiment_compound": -0.5789
        },
        {
            "id": "hxki4qj",
            "score": 1,
            "text": "No amount of advertising consensus will do anything if there’s a vested interest in maintaining the status quo.",
            "title_similarity": "0.2804265",
            "sentiment_compound": 0.34
        },
        {
            "id": "hxkru04",
            "score": 1,
            "text": "Next thing your going to tell ME is that Santa Claus isn't real! The tooth Fairy is really mom and dad! That I am not special! Fido isn't just playing dead when we buried him in the backyard! Next to grandma!",
            "title_similarity": "0.33709955",
            "sentiment_compound": 0.4137
        },
        {
            "id": "hxkstd5",
            "score": 1,
            "text": "Next they should do this with Apple cider vinegar and other things that we already know won’t work.",
            "title_similarity": "0.2551663",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxksy10",
            "score": 1,
            "text": "So, is the sample small because there are not enough people classified as “High-Risk Patients”?\n\nAlso, has anyone seen a study with just regular folks and a larger sample? I’d be curious about that. I saw that Duke University started a national study back in January.",
            "title_similarity": "0.6029269",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hxkvfyr",
            "score": 3,
            "text": "Y’all probably keep up with this better than I, but wasn’t a study recently published about how it helps patients. I think it was based out of Japan?",
            "title_similarity": "0.54332614",
            "sentiment_compound": 0.6796
        },
        {
            "id": "hxkvpj6",
            "score": 1,
            "text": "I didn’t see a detailed explanation of what “standard of care” consisted of. For instance, was there a higher incidence of remdesivir use in the group given ivermectin? I have read that remdesivir (if that is included in “standard of care”) can actually increase fluid in the lungs, which would exacerbate pneumonia symptoms. It would help to know the details.",
            "title_similarity": "0.5500484",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hxkwt3u",
            "score": 1,
            "text": "It’s not about preventing disease it’s about a segment\nOf the population specifically wanting to do things because they were told not to. They present a risk to your species in perpetuity but the other humans aren’t ready to have that conversation yet",
            "title_similarity": "0.35866836",
            "sentiment_compound": 0.4092
        },
        {
            "id": "hxkyxxa",
            "score": 1,
            "text": "So glad these researchers had to waste their time seeing if an anti-parasitic medicine that focuses on the digestive tract would have an affect on a virus that attacks the respiratory system.",
            "title_similarity": "0.44256815",
            "sentiment_compound": -0.3415
        },
        {
            "id": "hxl6sd5",
            "score": 3,
            "text": "Wait. Reduced mortality by a significant amount though.",
            "title_similarity": "0.47044998",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hxlcimg",
            "score": 1,
            "text": "So all those highschool dropouts on facebook who fall for everything lied to me?",
            "title_similarity": "0.3005255",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hxlf8ko",
            "score": 1,
            "text": "Why would you be willing to take ivermectin, but not get a vaccine?",
            "title_similarity": "0.35195115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxlkyvu",
            "score": 1,
            "text": "Why was ivermectin considered a possible treatment in the first place?",
            "title_similarity": "0.29081494",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxmqqj0",
            "score": 1,
            "text": "Are we gonna waste $ testing other de worming meds too?",
            "title_similarity": "0.37801012",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hxn40mi",
            "score": 1,
            "text": "Hmmm, if you dig in beyond the headline there were 4 ventilated within the Ivermectin-group versus 10 in the placebo-group. There were 6 admissions in the Ivermectin-group and 8 in the placebo-group. And a total of 3 deaths in the Ivermectin-group versus 10 in the placebo-group. So with regards to whether patients ended up on a ventilator, were admitted, or died the Ivermectin-group patients did significantly better than placebo-group patients. And this is a bad result? What a I missing?",
            "title_similarity": "0.7298465",
            "sentiment_compound": -0.7476
        },
        {
            "id": "hxpsjyr",
            "score": 1,
            "text": "There have been some assumptions in the media that the new JAMA article is somehow definitive on the matter of ivermectin for covid-19 treatment. \n\nThe JAMA trial is far from gold-standard, in that it is open label, underpowered and without a funding statement. It was also conducted among high risk patients with other health problems only so may be relevant to only a subset of people.                                                  \n\nThe study was not powered to detect a difference in death rates, however fewer deaths occurred among patients receiving ivermectin compared with controls (3 versus 10 people died, respectively).  This may be an important finding, which is corroborated by other scientists and frontline doctors.                                                                      \n\nThe following would therefore be a more appropriate conclusion:  \"The study findings suggest that ivermectin given on its own to high risk covid-19 patients with co-morbidities may make little or no difference to the course of their disease; however, our study was underpowered to detect a statistically significant difference in deaths.",
            "title_similarity": "0.7248285",
            "sentiment_compound": -0.8813
        },
        {
            "id": "hy134s5",
            "score": 1,
            "text": "if that is a true statement than there shouldnt be a problem with people wanting to be treated with it then. So let patients and doctors decide whats appropriate treatment, and the federal gov can bug off.",
            "title_similarity": "0.47081983",
            "sentiment_compound": 0.6197
        },
        {
            "id": "hy1y73j",
            "score": 1,
            "text": "My conspiracy theory mom just shared this study with me to counter this -https://journals.lww.com/americantherapeutics/fulltext/2021/08000/ivermectin_for_prevention_and_treatment_of.7.aspx\n\nCan anyone help me tell if it's legit?",
            "title_similarity": "0.2990492",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hymrp4p",
            "score": 1,
            "text": "How will we know unless they release ALL the data that we paid for. The word trust is totally misused. Instead of demonizing and censoring people who question the authorities that have a history of fraud and corruption. This is the age of information. Allow adult conversations.\nhttps://www.yahoo.com/news/cdc-isnt-publishing-large-portions-124915536.html",
            "title_similarity": "0.4514616",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hzx4dr7",
            "score": 1,
            "text": "Did anybody actually read the study?\n\nIvermectin Group 241 pt     Standard Care  249 pt                                                                                                                  Ventilated                      4 (1.7%)                             10 (4.0%)                                                                        ICU admission              6 (2.4 %)                              8 (3.2%)                                                                       Death                             3 ( 1.2%)                             10 (4.0%)                                                                      Diarrhea                       14 (5.8%)                               4 (1.6%)                                                                       \n\nCan somebody please explain to my ignorant anti-science ass (my dumb ass just like to look at the numbers) why getting diarrhea is not any worse than dying?",
            "title_similarity": "0.57103693",
            "sentiment_compound": -0.8179
        },
        {
            "id": "i1fq58p",
            "score": 1,
            "text": "Can some ELI5 why these studies are more accurate/insightful than ones that conservatives are pointing to? For example https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8248252/",
            "title_similarity": "0.5005992",
            "sentiment_compound": 0.0
        }
    ]
}