{
    "The US has increased its funding for public schools. New research shows additional spending on operations—such as teacher salaries and support services—positively affected test scores, dropout rates, and postsecondary enrollment. But expenditures on new buildings and renovations had little impact.\n": [
        {
            "id": "hxp2who",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue to be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.5513916",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hxp9ljw",
            "score": 8,
            "text": "Take half your defense budget, put it into early childhood education. In 10-20 years you will have a much safer, more productive country.",
            "title_similarity": "0.70541614",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hxpb8jx",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "-0.018808084"
        },
        {
            "id": "hxp6fdh",
            "score": -11,
            "text": "I thought there is very little evidence that increasing teacher salaries impacts student outcomes. Anecdotally - look at China. Dirt cheap salaries and their students are better than the US on average...",
            "title_similarity": "0.7352769",
            "sentiment_compound": 0.128
        },
        {
            "id": "hxpggo7",
            "score": 6,
            "text": "As someone married to a public school teacher, which is one of the things I love about my wife, is that our schools are underfunded in most of the US. Teacher salaries, depending on the area, can range from needing to sell amateur porn or OnlyFans video/pics to make ends meet, or enough to live comfortably - including retirement.\n\nIn my opinion, teachers are undervalued for all of the stuff they do. My wife bought sneakers for one of her students because the parents are too poor. She spends on average $1,100 on school supplies each year that parents expect schools to provide but don't due to a lack of sufficient funding (that money comes out of our budget each year). It really grates me when someone entitled tool complains about teachers not doing enough and does not even consider funding as the issue - a major reason why my wife doesn't want me to go to school board meetings because I am too confrontational about stuff, especially when I have the facts and sources to back up my claims and overcome any objection from the willfully ignorant (it always leads to a stalemate because they cannot be reasoned with but hey you never know when someone might listen).\n\nSorry for the tangent, I always get riled up by stuff like this.",
            "title_similarity": "0.69172645",
            "sentiment_compound": -0.7034
        },
        {
            "id": "hxpe2id",
            "score": -10,
            "text": "It would be interesting to see the impact on education outcomes if, instead of ratcheting up the current tenure-based / seniority-based pay scale for teachers, we moved to a merit-based pay system like much of the private sector already uses.",
            "title_similarity": "0.6981159",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hxp7px4",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.045050018"
        },
        {
            "id": "hxphflf",
            "score": -6,
            "text": "Vouchers would create higher scores and more direct learning.",
            "title_similarity": "0.50605",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hxpgeqf",
            "score": 6,
            "text": "Did spending money on this research increase test scores or do we need another study to waste even more money to find something out that is obvious….",
            "title_similarity": "0.6823919",
            "sentiment_compound": -0.128
        },
        {
            "id": "hxpaecz",
            "score": -5,
            "text": "Meanwhile, in Florida…",
            "title_similarity": "-0.04060911",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpojw3",
            "score": 1,
            "text": "You mean investing in something can improve performance?? I’m shocked.\n\nCan’t wait for Reddit to figure out investing in the police force will help performance too.",
            "title_similarity": "0.68011737",
            "sentiment_compound": 0.5661
        },
        {
            "id": "hxphq6j",
            "score": 3,
            "text": "meanwhile 2 posts above, florida is taking $200mm from school districts that didnt follow mask mandate rules. Yay Florida!",
            "title_similarity": "0.46966583",
            "sentiment_compound": 0.5707
        },
        {
            "id": "hxpimrc",
            "score": 3,
            "text": "The article says spending per student has doubled since 1980. Too bad $1 in 1980 is worth $3.41 today. Article doesn't mention inflation. The country is spending less now per student than it was in 1980.",
            "title_similarity": "0.71016365",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hxp92fs",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.045050018"
        },
        {
            "id": "hxp95pj",
            "score": 43,
            "text": "What I've never understood about US schools, is that teachers seem to be expected to pay for classroom supplies out of their own pockets.",
            "title_similarity": "0.56839246",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hxpnk02",
            "score": 9,
            "text": "If a government program doesn't work, it was underfunded. \n\nSolution: Increase funding.\n\nIf a government program \"works\", it is a good thing and should be expanded.\n\nSolution: Increase funding.\n\nSelf-licking ice cream cone, then you pay an \"expert\" to come up with a study that confirms that you do indeed need to increase funding and you claim it is \"the science\".\n\nThis same propaganda cycle is why we have 7 wars going on right now.",
            "title_similarity": "0.7376901",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hxq23xd",
            "score": -1,
            "text": "They needed to research that better funded schools and teachers lead to better test scores? -_- how do these people put pants on without a whole room full of people telling them how?",
            "title_similarity": "0.72936106",
            "sentiment_compound": 0.7319
        },
        {
            "id": "hxpx9vj",
            "score": -6,
            "text": "The reason for poor quality education is the lack of teachers who care. The more you pay them, the more it attracts people who are only in it for the short hours, the middle class salary and the benefits package and when the kids graduate while unable to spell simple words and the only math they know is pushing buttons on a calculator it is because their teachers did not care.",
            "title_similarity": "0.6956608",
            "sentiment_compound": 0.0186
        },
        {
            "id": "hxpg3mk",
            "score": 17,
            "text": "I'll post this here because I believe it's important and but talked about as an easy thing to change.\n\nProperty taxes right now are what funds a large portion of schools \n\nInstead of the state taking in all those taxes and distributing the funding based on population concentration... They take the taxes from the rich neighborhoods and distribute them to the schools in that district.\n\nTo give everyone a much more even starting place this should be changed to be based on population concentration. Each child should be getting an equal amount of funding towards their education regardless of where they live.\n\nThis is on democrats as much as republicans too btw.\n\nIn the modern social climate I can't believe politicians aren't screaming about the need for this change",
            "title_similarity": "0.7461248",
            "sentiment_compound": 0.9174
        },
        {
            "id": "hxpd42m",
            "score": 15,
            "text": "Paying teachers enough so they don't have second jobs and can concentrate on doing the very best for your kid, what a concept",
            "title_similarity": "0.66034013",
            "sentiment_compound": 0.6697
        },
        {
            "id": "hxpl3zt",
            "score": 1,
            "text": "Why can’t we have both. Raise salaries and new buildings. I teach in a school that was built 60 years ago that was meant to be temporary so most of the buildings on campus are portables. They are an absolute mess. Heating and air systems are ancient that either don’t work leaving some rooms way to hot in the summer and too cold in winter or that do the opposite making rooms to hot in the winter and too cold in the summer (the classrooms are in pods so some rooms can get to much heat/cold while other get next to nothing). But aside from the buildings there are other things like desks. The desks in my room are ancient and falling apart. \n\nListen I get it, bang for buck, you may not get as much value out of a new school or a newly renovated school then you will other expenditures but when schools are physically broken, dreary and uncomfortable, no one wants to be there.",
            "title_similarity": "0.58537006",
            "sentiment_compound": -0.8674
        },
        {
            "id": "hxp6yvm",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.045050018"
        },
        {
            "id": "hxpjhpj",
            "score": 0,
            "text": "This seems quite logical. Increase financial support on the humanistic side of things, see humanistic benefits.\n\nRenovations are unfortunately necessary, structures decay and as tech advancement both require constant upkeep but likely impact the children very little. I bough I could see it have a positive influence on teachers and how they can provide their lessons!",
            "title_similarity": "0.80253214",
            "sentiment_compound": 0.7953
        },
        {
            "id": "hxrkm02",
            "score": 0,
            "text": "Pay teaches more, demand they do the best job, keep kids in school for the full day, get rid of the anti-america rhetoric, and most importantly- get rid of the useless race mongering middle management staff members that are not teachers of core curriculum.",
            "title_similarity": "0.7337319",
            "sentiment_compound": 0.25
        },
        {
            "id": "hxu2px6",
            "score": 0,
            "text": "Cut down some bureaucratic arm and pay the people that does the work well.",
            "title_similarity": "0.5135426",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hxp4nds",
            "score": 215,
            "text": "[removed]",
            "title_similarity": "-0.045050018"
        },
        {
            "id": "hxqvm66",
            "score": -1,
            "text": "They need to fund driver's ed again because America has the worst drivers.",
            "title_similarity": "0.52892697",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hxrro3m",
            "score": 1,
            "text": "Reality is not this clear cut. I encourage everyone to read up on Abbott districts, which was basically a experiment on funding underperforming schools that ran for decades.\n\nIn New Jersey a bunch of poorer school districts sued the state and won. As a result they received state funding to make them the most well funded schools in the state, on par if not exceeding the wealthiest schools. They also received state funded pre-K classes for all students which no other school has. However many other schools which were equally as poor did not participate in the lawsuit and didn't receive the extra funding. So this created a natural experiment where one group of poor schools received extra funding while the rest did not.\n\nAbbott schools used the large amount of extra funds on basically everything. Teacher salaries were increased, smaller classrooms, better facilities and student equipment, etc. Basically everything was improved.\n\nDecades later, the results were mixed. Compared to their equally poor non-Abbott counterparts. Abbott districts schools students did have somewhat improved performance in early grades likely due to the universal free Pre-K education. This advantage became smaller and smaller and disappeared by middle school and high school. Overall the experiment was a failure and showed simply increasing funds did not change eventual student performance.\n\nThe US already has one of the highest per pupil K-12 student funding in the world and spend way more than the OECD average on education. Yet our results are very average. Cultural attitude towards education seems to have way more impact than funding. Even among similar nations this can vary greatly - for example like us Norway also spends a huge sum for mediocre results while Finland spends less for excellent results.",
            "title_similarity": "0.75059474",
            "sentiment_compound": 0.9297
        },
        {
            "id": "hxpsxkf",
            "score": 97,
            "text": "Great study! We absolutely need to increase teacher pay and other high-ROI areas highlighted by this study. At the same time, the unfortunate truth is that the U.S. already spends more per pupil on K-12 education than all but three OECD countries and 37% more than the rich-country average. So, it's not just about spending more money in aggregate; it's about redirecting spending away from unproductive uses (like football stadiums) toward more productive uses.\n\nSource: https://nces.ed.gov/programs/coe/indicator/cmd",
            "title_similarity": "0.7263989",
            "sentiment_compound": 0.7449
        },
        {
            "id": "hxpb4zj",
            "score": 8,
            "text": "I work with a lot of high schools. Theres one I work with in a somewhat dingy building, but they produce some amazing students. I think they are just very mission-focused (theres a religious element), care mightily about what they do, and (crucially) have enough funding to cover a great education without having great facilities.",
            "title_similarity": "0.7210065",
            "sentiment_compound": 0.9137
        },
        {
            "id": "hxpgcfz",
            "score": 44,
            "text": "The best thing that could happen to education would be a massive jobs program placing millions of bodies into schools as nurses, social workers, coaches, psychologists, tutors, classroom aides, and 1-to-1 paraprofessionals. Teachers are tasked with helping kids catch up who are 3-4 years behind in their skills, and often exhibit behaviors that complicate the mission of teaching them *or* their classmates. They're asked to do this alone, and they're asked at the same time to challenge the students who are 3-4 grades ahead. Technology has made this individualization easier, but we need human beings to work with kids individually if we want to see big changes. These could be teacher trainees in a year(s)-long residency; these could be new graduates in a program like Teach for America, but not meant to Union-bust; these could be retirees looking for extra work; these could be regular unemployed people who've gone through basic training. Different needs require different levels of expertise. Hell, if teachers had their own *secretary*, that would give them more time to plan lessons and work 1-on-1 instead of making copies, decorating classrooms, inputing grades, contacting parents, sending out reminders to students about late work, etc., etc.",
            "title_similarity": "0.72357804",
            "sentiment_compound": -0.0194
        },
        {
            "id": "hxpl64t",
            "score": 2,
            "text": "You can get even better results by simply issuing school vouchers and letting parents decide",
            "title_similarity": "0.72658134",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxpliac",
            "score": -2,
            "text": "Yeah if only a majority of each cities budget wasn't going to police we would have a mich better country. Its disgusting how much money we burn funding those obsolete public servants.",
            "title_similarity": "0.6069369",
            "sentiment_compound": -0.128
        },
        {
            "id": "hxppqo9",
            "score": -2,
            "text": "America has also increased public funding to private for profit schools, charter schools, religious schools, vouchers and into the coffers of rabid right wing nutjobs whose goal is to destroy public education.",
            "title_similarity": "0.61534154",
            "sentiment_compound": 0.128
        },
        {
            "id": "hxppsto",
            "score": -2,
            "text": "I'm sorry. The US gave funds to public education? That's a thing that the US does?",
            "title_similarity": "0.5447004",
            "sentiment_compound": -0.168
        },
        {
            "id": "hxpucki",
            "score": 2,
            "text": "Infrastructure investment may not translate into short term academic gains, but is very important. Schools are literally crumbling in the northeast corridor.",
            "title_similarity": "0.72775376",
            "sentiment_compound": 0.517
        },
        {
            "id": "hxpv7nl",
            "score": 2,
            "text": "Wow… such exciting science! If you *invest* in your *people* and help them *grow* (students) or have *fiscal stability* (teachers), the results are positive! \n\n\n**SOMEONE** tell *all* the greedy corporations now!!! They can treat us right, and we will still work; we now have the science…. \n\n\nOh, wait, this was all common sense and what the *rest of the developed world* has been doing this with their education for years. No wonder we are so far behind….",
            "title_similarity": "0.76080614",
            "sentiment_compound": 0.871
        },
        {
            "id": "hxpvo3l",
            "score": 2,
            "text": "Could the title be any worse?",
            "title_similarity": "0.14742467",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hxpy3fn",
            "score": -2,
            "text": "Good teachers can teach students in a shack. A fancy building can’t teach students.",
            "title_similarity": "0.5061542",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxpzry9",
            "score": 2,
            "text": "Headline is pretty misleading. New building and renovation had little IMMEDIATE impact. Try living in a building that's falling apart and has poor HVAC 9 or 10 hours a day for a couple years and see how positively it affects you.",
            "title_similarity": "0.6740062",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hxqkbgw",
            "score": 2,
            "text": "I guess I disagree a little bit. Getting asbestos out of schools, providing better ventilation and better indoor air quality to reduce mold growth in gymnasiums, upgrading tech resources and server rooms and ensuring roof and gutter systems work, won't have immediate measurable impacts on student achievements, but doing so is worth it. We owe kids safe functioning buildings. Buildings that don't harm kids, cause asthma and what knows whatever else is worth it.",
            "title_similarity": "0.7627121",
            "sentiment_compound": 0.945
        },
        {
            "id": "hxqomn8",
            "score": 2,
            "text": "Only in the US do we need to spend millions on \"researching\" common sense. For fucks sake.",
            "title_similarity": "0.52932996",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hxqsjf3",
            "score": -2,
            "text": "Bet most of this got pilfered by corrupt school boards and ended up the coffers of qanon/extremist groups.",
            "title_similarity": "0.5068617",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxp9jlh",
            "score": -3,
            "text": "Are these Charter schools by any chance?",
            "title_similarity": "0.3420055",
            "sentiment_compound": 0.25
        },
        {
            "id": "hxpdu68",
            "score": 4,
            "text": "No shiet. Good facilities are pointless without good teachers, and good teachers can still teach without sub-par facilities.",
            "title_similarity": "0.57041776",
            "sentiment_compound": -0.4788
        },
        {
            "id": "hxpk1oq",
            "score": -3,
            "text": "And yet in Florida, the governor is backing a plan to strip money away from counties that defied a \"no mask mandates\" order - the very counties that were hit hardest by Covid in a state that was among the hardest hit. Just because they wouldn't cooperate with his dangerous health policy that was instituted for political reasons instead of science or medical health reasons. The governor's personal politics are more important than education.\n\nDon't worry, he'll be running for president soon, and you'll all get to meet Governor Death Sentence.",
            "title_similarity": "0.44849256",
            "sentiment_compound": -0.4768
        },
        {
            "id": "hxpnnv7",
            "score": 3,
            "text": "What good is a new building if the textbooks are from 1961?",
            "title_similarity": "0.51815766",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxqizik",
            "score": -2,
            "text": "Too bad classrooms are now infested with activists",
            "title_similarity": "0.2991361",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hxqdlsm",
            "score": 11,
            "text": "I vividly remember arguing with some GOP idiot years ago about teacher salaries. \n\nHe claimed that lower salaries would attract better and more dedicated teachers  . . . in what capitalist mentality does a lower salary attract better candidates? It was incredibly stupid.\n\n If you're smart and skilled enough to be a great teacher, then that means you have the intellect and skills to go into the private sector. And make several times the salary of a teacher.",
            "title_similarity": "0.7254391",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hxpctv7",
            "score": 63,
            "text": "About ten years ago in my town there was a huge battle over the attempt to build a big new elementary school that would combine three smaller and very old schools that were each very expensive to maintain. One of them was over 100 years old and it was falling apart when I went there in the 70's. I don't remember the bill but it was a huge expense that would pay off over time. Too many people considered it a wasteful \"pet project\" that the town manager was pushing because she had worked for many years in the school system and the whole thing was scrapped. Last year my old elementary school had to be shut down and the students all crammed into the other two schools and everyone complained that the town didn't do anything about this sooner.   \n\nI'm not trying to contradict this article at all but sometimes a new building is necessary and I don't want people to automatically assume buildings are always a bad thing.",
            "title_similarity": "0.61948967",
            "sentiment_compound": -0.7423
        },
        {
            "id": "hxpvt0z",
            "score": 5,
            "text": "I work in school capital projects. Our goal when improving schools is not to increase test scores or concern about dropout rates. It is to provide a comfortable, safe space for students and teachers to do thier thing. Our goal is to provide a space where students who might not get food at home can eat a meal cooked in our facilities. Our goal is to build the additional classrooms required to have the space to reduce class sizes so that additional teachers can be hired in the first place.  \n  \nState and federal capital funding does not even provide enough for districts to eliminate unsafe environments from within thier schools so doesnt get close to providing enough to replace old schools. We rely on tax payers to supplement for this. There have also been plenty of studies where income and test scores are correlated, higher income areas pass more bonds and levies and have nicer facilities.  Of course increased teacher salary helps attract good teachers and gives them the the means to teach better. This does not mean we shouldn't also be continuing to fund school construction.",
            "title_similarity": "0.7409252",
            "sentiment_compound": 0.968
        },
        {
            "id": "hxplbjn",
            "score": 16,
            "text": "Did they also include things like health outcomes of the children? Because *that's* a driver behind a lot of renovations. Some schools with in unsafe buildings with inadequate HVAC, mold problems, etc. \n\nThe other big bonus of new and renovated buildings is that they cut maintenance and energy costs over decades. \n\nSo if you're evaluating the worthiness of new buildings based upon test scores, you're using the wrong metric.",
            "title_similarity": "0.7606919",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hxpebas",
            "score": 7,
            "text": "We are going through this in my district. We had a good news meeting and we’re told we are opening more classrooms in a different building. Meanwhile we don’t have enough staff, therapists don’t have space to work, there are no communal spaces for students, etc. \nit was a decision to benefit the town who keeps allowing more developments and apartments to be built and need space for students. It was never about what was best for the students or staff",
            "title_similarity": "0.7455167",
            "sentiment_compound": 0.836
        },
        {
            "id": "hxp9z7e",
            "score": 27,
            "text": "[removed]",
            "title_similarity": "-0.045050018"
        },
        {
            "id": "hxpqdpf",
            "score": 8,
            "text": "It’s somewhat of a misnomer. New buildings don’t positively affect test scores, but are necessary in districts where there are in schools that were last updated in the Reagan admin. You can’t hope to have the bedrock for better outcomes without better, more up to date classrooms and facilities. Hell, most older schools don’t have the electrical capacity to cover most modern electronics that are being used at the scale they are. Mainly because it’s difficult to recruit teachers (even well paid teachers) long term to a school that has constant maintenance problems. Especially when talking about how they are locked down for active shooter situations. \n\nAlso, school buildings/capital assets are a depreciating cost, meaning that you can recoup some of the initial loss over years, they are also an easier sell for tax payers, as they are something they can see, so the bond issuance has a better chance of passing when new infrastructure is passed. But teacher pay does give a better payoff, but it’s a more difficult sell. Because giving teachers a raise of 10k per year for a district of 1000 teachers is 10million, and if they stay until retirement (30 years) that’s 300million… that translates to higher test scores that may or may not help the local community. \n\nI wonder if the macro decision was made that certain communities need to have lower test scores to maintain the status quo of low achievement to keep college enrollment lower, and minimum wage earning more robust in applicants.",
            "title_similarity": "0.7879087",
            "sentiment_compound": 0.6862
        },
        {
            "id": "hxpgmrf",
            "score": 28,
            "text": "Infrastructure is a generally long term cost with little immediate impact.  Eventually crumbling schools with bad quality air and failing lighting has terrible consequences .",
            "title_similarity": "0.53735447",
            "sentiment_compound": -0.872
        },
        {
            "id": "hxprm7r",
            "score": 53,
            "text": "As a teacher they will spend this on more professional development that goes in one ear and out the other. Our education system is falling apart because teachers don't stay long enough to become experienced.",
            "title_similarity": "0.63240397",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hxpbuwi",
            "score": 207,
            "text": "Does having a dozen VPs help?!?!?",
            "title_similarity": "0.37639332",
            "sentiment_compound": 0.5892
        },
        {
            "id": "hxp9zyj",
            "score": 237,
            "text": "[Adams’ opening budget i](https://ny.chalkbeat.org/2022/2/18/22941418/nyc-mayor-adams-2022-budget-proposal-education-cuts-school-hiring-freeze/)ncludes about $110 million in cuts this school year and $57 million each year after that in cuts to the education department’s central offices, which include salaries, overtime, professional development, and per-session costs.",
            "title_similarity": "0.61000943",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hxp8z9q",
            "score": 128,
            "text": "As a teacher in a new building that still struggles to get supplies, this is true.",
            "title_similarity": "0.59980404",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hxp6xek",
            "score": 175,
            "text": "Still should invest in both. Many school\nBuildings in the Northeat date from the Great Depression and before.",
            "title_similarity": "0.5737206",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hxpk1xo",
            "score": 167,
            "text": "Teacher here. We have staffing shortages which definitely affect student achievement, especially our Special Education students. Higher salaries would definitely help that. We don’t need new buildings, although I wouldn’t say no either. I currently have 3 leaks in my classroom when it rains, but I also have 3 trash cans, so it’s all good at the moment. If I get one more leak though, the district is going to need to spring another $10 for a fourth trash can.",
            "title_similarity": "0.7541426",
            "sentiment_compound": 0.6537
        },
        {
            "id": "hxp6pbu",
            "score": 447,
            "text": "“I think something to keep in mind here is that these may not be the relevant outcomes. It may be that they keep children in school and more engaged. Maybe that doesn't translate into a large increase in academic improvements, but they could be leading to a host of other benefits that we're not seeing in my data—maybe a reduction in criminal activity or a reduction in the likelihood of getting into trouble outside of school. Wisconsin also had very decent infrastructure already. So we might see different effects if you do this in a school district that has very bad infrastructure to begin with, where the returns could be higher.”\n\nImportant to note that infrastructure/capital spending may have other positive follow-on effects, not related to dropout rate or test scores. \n\nI’d be interested to see the effect of the salaries/support services on each quartile of student performance. Do better teachers help everyone evenly across the board? Better for middle of the road students? Kids who are struggling?",
            "title_similarity": "0.79256654",
            "sentiment_compound": 0.9021
        },
        {
            "id": "hxpglno",
            "score": 73,
            "text": "The same issue is driving up costs at colleges and universities. A study in 2017 by the National Center for Education Statistics demonstrated that the percentage of university spending on non-instructional spending has almost doubled since 1980. As a parent of two college-aged kids, I could see this anecdotally while visiting colleges. Most campuses now resemble luxury country clubs with outrageous amenities that students will never see the like of after graduation. Also, administrative buildings are proliferating on campus to house an ever-expanding bureaucracy of various deans and directors.",
            "title_similarity": "0.62710357",
            "sentiment_compound": -0.6261
        },
        {
            "id": "hxpbfbg",
            "score": 5531,
            "text": "Yeah, this is why the campaign in CO to use weed tax to fund education was sort of a sham... the weed money goes towards construction of new buildings and building updates. I mean newer buildings are cool and all, but they basically just made MORE underfunded schools. As a former CO teacher, I can't tell you how often people would say 'well what about that weed money' when we tell them that we are one of the lowest paid teaching staff in the country (especially when you consider the cost of living). I really think that taking a look at where education funds are being spent is as important as raising funds.",
            "title_similarity": "0.74082804",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hxpjv5c",
            "score": 475,
            "text": "Local town super underpays teachers, but paid 1.1 million to replace metal siding on the high school to the brother in law if a school board member. It's a small school, there is no way it cost that much.\n\nA wealthy donor died and left $200k to be used by the music department. School board instead used the money to buy a live display type sign to display text and the time/temperature for the high school from a relative/friend's company.\n\nThey've recently completed a new gym as well. Not a replacement, just a brand new separate gym.\n\nAnother district where I worked charged insurance to parents for take home devices but tried to make me swap serial numbers and get devices repaired under warranty so the superintendent could use the money to pay for his trips to Florida. Last I saw the account it had $200k in it.\n\nSpending more on education is not the same as improving education.",
            "title_similarity": "0.6831745",
            "sentiment_compound": 0.1406
        },
        {
            "id": "hxpg6s8",
            "score": 1733,
            "text": "Smaller class sizes. Well grounded, research based. A practical effective humane student-teacher ratio should be the FIRST goal allocating funding.",
            "title_similarity": "0.6095793",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hxpegrk",
            "score": 3,
            "text": "I suspect the same would be true with colleges.  Buildings and Administration spending far less effective than teaching.",
            "title_similarity": "0.59131414",
            "sentiment_compound": 0.5279
        },
        {
            "id": "hxpex67",
            "score": 1,
            "text": "Bummer. I started to see some improvements in my school when I was a senior and wanted to be part of the program, but I was told only freshmen were eligible.",
            "title_similarity": "0.68182284",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hxpfh3x",
            "score": 1,
            "text": "Hey can somebody tell this to the universities in the US? Nobody needs that 5 star luxury resort for a dorm (and the corresponding tuition hikes)",
            "title_similarity": "0.56661254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpfnoo",
            "score": 1,
            "text": "The funding stopped going to students decades ago, but mostly in the last 30 years. Why. Why is admin so top-heavy.",
            "title_similarity": "0.61802197",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hxpfx9w",
            "score": 1,
            "text": "My contract isn’t negotiable for another three years…",
            "title_similarity": "0.32732356",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpfxw1",
            "score": 1,
            "text": "This isn't surprising.  My experience with public education has always been that, for the most part, facilities have been adequate or better, while teaching and administrative staff was spotty. My kid's elementary school teachers were great. Unfortunately I was not able to say that about his middle school teachers or all of his high school teachers.  And while my kid was well disposed towards the school environment, many of his peers were not, and schools seem incapable and unwilling to deal with kids who have difficulty.",
            "title_similarity": "0.7871485",
            "sentiment_compound": 0.4188
        },
        {
            "id": "hxpgnvq",
            "score": 3,
            "text": "I wish they had some data on what percentage of funding increases went to these various programs. It'd help to know if, for example, most funding goes into buildings and this could be used as evidence for a change. Or maybe most funding increases go to teachers/services already and this is evidence for keeping them. IDK, some context would be helpful.",
            "title_similarity": "0.74067247",
            "sentiment_compound": 0.7242
        },
        {
            "id": "hxpgs2g",
            "score": 1,
            "text": "I mean this makes sense in the way that having a functional school building is more of a base line requirement to have a functioning school.  Also most schools buildings are renovated or replaced prior to the original building becoming non-functional (which makes a lot of sense).\n\nSo basically the investment in new school renovations/buildings is needed but won't result in a significant tangible increase in student performance.  This doesn't mean we shouldn't renovate or build new schools.",
            "title_similarity": "0.79499894",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hxph7aq",
            "score": 2,
            "text": "I dont know, maybe because the social capital is significantly more important and valuable for establishing connections then how pretty the building looks?",
            "title_similarity": "0.6156499",
            "sentiment_compound": 0.8251
        },
        {
            "id": "hxphcsu",
            "score": 3,
            "text": "Not in Iowa. Our idiot governor raised the budget 2.5%. not even enough to keep up with inflation. So it's essentially a reduction. There are teacher shortages all over the state, my kids constantly complain about how they don't have teachers in their class sometimes. And it's just some student teacher that sits there for the entire class because they don't know what to do. Covid Kim does not want an educated populace.",
            "title_similarity": "0.58242893",
            "sentiment_compound": -0.7665
        },
        {
            "id": "hxphwth",
            "score": 1,
            "text": "Probably the law of diminishing returns. Most school buildings in the US are probably satisfactory and fancy architecture just isn’t needed.\n\nOn the other hand, I hope this conclusion isn’t used to neglect genuinely bad physical structures. Like kids should still have air conditioning, heat, clean bathrooms, and reasonable space.",
            "title_similarity": "0.7643101",
            "sentiment_compound": 0.743
        },
        {
            "id": "hxpi9ai",
            "score": 12,
            "text": "And that’s because the new buildings and renovations don’t impact class sizes, teacher supports, or student needs in the academic sense.",
            "title_similarity": "0.706022",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxpimg9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.045050018"
        },
        {
            "id": "hxpisk2",
            "score": 2,
            "text": "Anybody notice all the new schools? It’s always rebuilds.....invest in the people already!!!",
            "title_similarity": "0.6026159",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpjbnk",
            "score": 1,
            "text": "Down in Oklahoma they are trying the do neither approach.",
            "title_similarity": "0.2154839",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpjeje",
            "score": 1,
            "text": "I haven’t read past the authors abstract and conclusion, but I wonder if there are renovations that do impact performance. There are schools that are falling apart and I think renovations for those would give students a better piece of mind, allowing them to concentrate. I’ll read more to see, but I didn’t see any indication on “severity” or anything like that, just “capital projects”",
            "title_similarity": "0.72667986",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hxpjm6d",
            "score": 1,
            "text": "Unless that building has the potential to strait up collapse and kill all the people inside",
            "title_similarity": "0.19057482",
            "sentiment_compound": -0.836
        },
        {
            "id": "hxpjo8w",
            "score": 1,
            "text": "A house is just a building. It's the people living there that make it a home. You have to invest in people not stuff.",
            "title_similarity": "0.4273888",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpjswn",
            "score": 1,
            "text": "Kids are taught in bunkers, road sides, churches, delapidated shacks... you name a structure type, and kids have probably had school inside of it at some point. \n\nMoney for stuff tangible to the students and the educators OF COURSE would improve the experiece for the students, and their desire to continue their studies. Feeling like you are wanted and not just a burden and that you are not wasting your time and can see benefits to what you're learning... \n\nTitle makes this sound like this is some sort of unknown variable they just discovered in the sands of Egypt.",
            "title_similarity": "0.6692622",
            "sentiment_compound": 0.9465
        },
        {
            "id": "hxpkb4b",
            "score": 2,
            "text": "There is a case working its way through WA courts (a state that enshrines education as a paramount duty into its constitution- see McCleary case) that seeks to consider buildings and construction of schools as fundamental to the process of education. To me, the case is compelling. \n\nhttps://www.kuow.org/stories/wahkiakum-school-district-sues-the-state-over-its-funding-model",
            "title_similarity": "0.5119579",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hxpkcx9",
            "score": 2,
            "text": "Meanwhile in Kansas we keep lowering standards and acting shocked when quality of education is affected.  Teachers and administration are stretched so thin that any whining parent's kid gets a pass and a diploma anyway...  We've also learned that schools are mostly just government-funded daycare so two-income homes can keep working for corporate masters to keep the machine running...  It is a situation where we may have clearly defined curriculum but we are teaching future generations all the wrong lessons.",
            "title_similarity": "0.6975785",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hxpkcyz",
            "score": 1,
            "text": "Who could have guessed that treating teachers well correlates to better students?\n\nOh wait, everyone with a brain knows this.\n\nMeanwhile, Texas just building more football stadiums.",
            "title_similarity": "0.5889501",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hxpkps2",
            "score": 1,
            "text": "Not here in Utah, in fact the state legislature is looking to redirect school funding... Which has always been woefully insufficient... To other government departments.",
            "title_similarity": "0.63928163",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hxpktf0",
            "score": 1,
            "text": "Cries in Baltimore city public schools funding and scores",
            "title_similarity": "0.45249814",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hxpl7bs",
            "score": 1,
            "text": "When did we increase funding for public schools?",
            "title_similarity": "0.6342757",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hxpla5r",
            "score": 1,
            "text": "Keep in mind,  renovations go beyond aesthetics. There are many school buildings that need work to keep them safe, up to code, up to modern classroom requirements, as well as removal of asbestos.",
            "title_similarity": "0.5730141",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hxplept",
            "score": 1,
            "text": "Paying people more = better performance. Who would have guessed.",
            "title_similarity": "0.5985726",
            "sentiment_compound": 0.4902
        },
        {
            "id": "hxplke9",
            "score": 1,
            "text": "OMG your saying paying the people doing the work and not just buying them nicer buildings to work in improves the people doing the work results? \n\nDamn, never would have guessed...",
            "title_similarity": "0.6933838",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hxplyul",
            "score": 1,
            "text": "This is deeply shocking...ly not a surprise at all.",
            "title_similarity": "0.2290416",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hxpm04d",
            "score": 1,
            "text": "That's because you're adding new buildings and renovating schools in the rich area code.",
            "title_similarity": "0.65877223",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hxpm0ox",
            "score": 1,
            "text": "Give all the kids gaming laptops!",
            "title_similarity": "0.26065874",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpm50a",
            "score": 1,
            "text": "In other obviously news fire is hot, more at eleven.",
            "title_similarity": "0.34716475",
            "sentiment_compound": -0.34
        },
        {
            "id": "hxpm7tx",
            "score": 1,
            "text": "Teachers are why I pushed so hard in school & college. I still remember my first grade teacher… he called me a chatterbox haha it was true",
            "title_similarity": "0.598088",
            "sentiment_compound": 0.6038
        },
        {
            "id": "hxpmks2",
            "score": 1,
            "text": "Show me a job where they make the conditions better and salary better, and of course the results of the job will be better.\n\nThis is more common sense than science.",
            "title_similarity": "0.6492904",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hxpmlee",
            "score": 1,
            "text": "Isn’t this common sense?",
            "title_similarity": "0.11339186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpmm12",
            "score": 1,
            "text": "LAUSD is very well paid yet low in education. [Here](https://ktla.com/news/local-news/lausd-enrollment-sees-its-steepest-decline-in-20-years-dropping-by-more-than-27000-students/) so this \"New research \" is full of BS.",
            "title_similarity": "0.702229",
            "sentiment_compound": 0.0754
        },
        {
            "id": "hxpmp7v",
            "score": 1,
            "text": "With that said, fixing school infrastructure should still be a major priority. The water pipes from the 20s often contain high traces of lead.",
            "title_similarity": "0.6036204",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpmwz5",
            "score": 1,
            "text": "Who would’ve thought that paying teachers more would motivate them more?  What unworldly intelligence proposed this idea?",
            "title_similarity": "0.61257243",
            "sentiment_compound": 0.7651
        },
        {
            "id": "hxpmxrq",
            "score": 1,
            "text": "Not to be harsh but they could've just had a look on Europe or Canada (I guess).",
            "title_similarity": "0.375454",
            "sentiment_compound": 0.1786
        },
        {
            "id": "hxpn0yz",
            "score": 1,
            "text": "That's interesting but money isn't the problem. We spend more per student than most places. It isn't working.\n\nIt's the method and curriculum. Where I went to school you were fucked or had it made by third or fourth grade when they separated students based on ability. Some of us were placed on an advanced path and the rest got classes designed for the lowest common denominator. No nuance, no effort to help kids catch up.\n\nI was earning college credits by my junior year of high school, I only did half days during my senior year because they ran out of classes to offer.\n\nMeanwhile I kid I knew on the other track was held back so many times that they just kicked him out. He showed up to his second first day of 8th grade, at a middle school, driving his own car. He asked a teacher where he should park... they told him to leave.",
            "title_similarity": "0.72340536",
            "sentiment_compound": 0.5746
        },
        {
            "id": "hxpn2oh",
            "score": 1,
            "text": "What surprising results",
            "title_similarity": "0.11739305",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hxpnavd",
            "score": 1,
            "text": "Maybe force them to not dump it into sports?",
            "title_similarity": "0.31748107",
            "sentiment_compound": 0.2924
        },
        {
            "id": "hxpngd4",
            "score": 1,
            "text": "A school is not a building.",
            "title_similarity": "0.07201161",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpnijg",
            "score": 1,
            "text": "The irony of my front page... https://imgur.com/a/zST3RKs\n\nI am interested to see what the future of education funding is. Anecdotally, most people seem to care about infrastructure and technology funding.",
            "title_similarity": "0.60501707",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hxpnk0q",
            "score": 1,
            "text": "Wait you mean student outcomes aren’t tied to the facilities portfolio? Well color me surprised!",
            "title_similarity": "0.5097998",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hxpnozo",
            "score": 1,
            "text": "Let’s continue to not pay teachers what they’re worth then",
            "title_similarity": "0.36837316",
            "sentiment_compound": 0.2951
        },
        {
            "id": "hxpnrtf",
            "score": 1,
            "text": "Test scores are the problem. Standardized test writers create the narrative and can improve or reduce student performance depending on what will make them money.",
            "title_similarity": "0.6685569",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hxpnwim",
            "score": 1,
            "text": "Newer building would help some school districts. Some don't even have air conditioning. Kids trying to focus when they are in a sweaty room of B.O. doesn't work.",
            "title_similarity": "0.6541617",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hxpo6tf",
            "score": 1,
            "text": "The biggest per capita bang for buck its new textbooks, at least in poor school districts.  \n\n\nThere is a return to good A/C in buildings, especially in hotter climates.",
            "title_similarity": "0.77626014",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hxpoaxz",
            "score": 1,
            "text": "Great, and my state is trying to push state scholarship funding for private schools.",
            "title_similarity": "0.52205104",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hxpodh2",
            "score": 1,
            "text": "I might have missed it, but it seems like \"*the US* has increased... \" could use some quantifying.",
            "title_similarity": "0.55064005",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hxpohdx",
            "score": 1,
            "text": "Wow who would have guessed that having more found could lead to a positive outcome...",
            "title_similarity": "0.4595601",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hxpoi08",
            "score": 1,
            "text": "Except Florida it seems",
            "title_similarity": "0.04108554",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpomk6",
            "score": 1,
            "text": "Oh, you mean like we've been trying to tell people this whole time?",
            "title_similarity": "0.23799908",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxpon4e",
            "score": 1,
            "text": "Yeah, getting rid of the asbestos in our public schools would t have a direct affect on test scores. But we should probably do it.",
            "title_similarity": "0.7053119",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hxpoo0v",
            "score": 1,
            "text": "The issue is with disparity in actual building quality... A building considered in poor shape / disrepair in the suburbs may be just ugly, in need of paint, or more AC window units.\n\nIn the cities it's more like, crumbling ceilings/walls, asbestos dust in the air, lead in all of the water and bad rodent/roach/bedbug infestations.",
            "title_similarity": "0.38558114",
            "sentiment_compound": -0.7968
        },
        {
            "id": "hxporf5",
            "score": 1,
            "text": "Well.....\nDuhhhh.\n\n\nHow is a million dollar indoor half football field with a gym supposed to improve education?\nOr a new theater room?\nA new track field?\nA second baseball field?\nAnother indoor pool?\nAn ugly fence around the entire campus?\n\n\nThis was my high school.\n\nThey invested millions into anything but education.\n\nAt least, they used to.\nThey have since changed and found the heart to fund educational programs.",
            "title_similarity": "0.6665678",
            "sentiment_compound": 0.8446
        },
        {
            "id": "hxpougx",
            "score": 1,
            "text": "Our district funds buildings with a 1% local sales tax, which freed up budget for staffing.\n\nAlso, modern buildings are absolutely a necessary cost. A snowstorm caused one of our 100 year old elementary roofs to collapse. Luckily, it was on a snow day and the building was empty.",
            "title_similarity": "0.6549418",
            "sentiment_compound": 0.25
        },
        {
            "id": "hxpp4ys",
            "score": 1,
            "text": "They should stop giving suburban schools more than they deserve in tax funding and stop taking funding from urban schools where most of people live.",
            "title_similarity": "0.582257",
            "sentiment_compound": -0.25
        },
        {
            "id": "hxpp51d",
            "score": 1,
            "text": "So where is the salary increase for teachers the Biden admin promised?",
            "title_similarity": "0.63238573",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hxpp56l",
            "score": 1,
            "text": "Yeah I don't think anyone with a brain didn't see this working..just sayn",
            "title_similarity": "0.3465497",
            "sentiment_compound": 0.296
        },
        {
            "id": "hxpp5e7",
            "score": 1,
            "text": "Then there’s Florida and ron deathSantis who is taking away 200 million from schools who didn’t obey his no mask mandates.",
            "title_similarity": "0.38357562",
            "sentiment_compound": -0.296
        },
        {
            "id": "hxppfts",
            "score": 1,
            "text": "Yeah, look at any wealthy suburban public school where teachers make $60-100k and you’ll see how the students THRIVE. I got lucky that I grew up in such an area even though I was/am working class.",
            "title_similarity": "0.6354824",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hxppguq",
            "score": 1,
            "text": "Wow! Who could have guessed",
            "title_similarity": "0.11321635",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hxppha2",
            "score": 2,
            "text": "Now THAT is interesting since most universities are engaged in a facilities arms race with each other to attract students now. Wonder if its true of postsecondary school too. \n\nThe problem for practical application of this information is that many other countries get better education outcomes with a fraction of the cost we incur in America so a funding solution is a total nonstarter",
            "title_similarity": "0.71539295",
            "sentiment_compound": 0.914
        },
        {
            "id": "hxppia0",
            "score": 1,
            "text": "It’s like paying people enough that they don’t have to worry about money allows them to focus on their job better, who knew.",
            "title_similarity": "0.6109997",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxppief",
            "score": 2,
            "text": "Why doesn’t anybody listen to the teachers? They’re all pretty insistent that the administration and school boards and whatnot are the problem. Bloated salaries 5-20x that of the teachers, bonuses, no oversight, corruption, only looking out for their own paycheck.",
            "title_similarity": "0.561098",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxpppoz",
            "score": 1,
            "text": "I’m wary of the conclusions of this study regarding improved test scores. They looked at schools where voters chose to increase funding for either operations or capital expenditures. That already skews the data in a way that you can’t control out differences in communities.",
            "title_similarity": "0.7599962",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hxppsmu",
            "score": 1,
            "text": "Yes please! I don’t mind if the next generations are smarter than me even to the point where I’m an old man thought of as stupid.",
            "title_similarity": "0.5510323",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hxpptpv",
            "score": 1,
            "text": "Study shows sky blue during the day, but not at night",
            "title_similarity": "0.38973802",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxppydd",
            "score": 1,
            "text": "Well I’ll be goddamned.. it’s like teachers teach stuff instead of buildings.  Can I get funding to research the obvious?",
            "title_similarity": "0.54370207",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hxppyii",
            "score": 1,
            "text": "One should definitely come before the other. It sucks walking into your workplace and seeing how much money was spent on it while you get pennies.",
            "title_similarity": "0.4529745",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hxpqb81",
            "score": 2,
            "text": "A actual education is better than a fancy new building? Nnnoooo.....Coporate America doesn't agree I'm sure.",
            "title_similarity": "0.6686319",
            "sentiment_compound": -0.0444
        },
        {
            "id": "hxpqbop",
            "score": 1,
            "text": "I'm happy to hear the results and see the US put them to use. But honestly this was a no brainer.",
            "title_similarity": "0.53054345",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hxpqj7t",
            "score": 1,
            "text": "So better paid and supplied teachers provide a better education than shiny new buildings? Who'd've think it.",
            "title_similarity": "0.75076085",
            "sentiment_compound": 0.7264
        },
        {
            "id": "hxpqqn2",
            "score": 1,
            "text": "Idk living in Metro Detroit and knowing plenty of people who went to schools with completely rotted and destroyed buildings, I do feel like lower income areas benefit from spending on infrastructure. It really kills your passion for learning when a rotten ceiling panel falls on your head during class.",
            "title_similarity": "0.5838777",
            "sentiment_compound": -0.659
        },
        {
            "id": "hxpr2ds",
            "score": 1,
            "text": "School budgets are a joke. Most have over inflated budgets that can only be spent on buildings, so that’s why you have new football stadiums and teachers who haven’t had a raise in years.",
            "title_similarity": "0.7252516",
            "sentiment_compound": 0.296
        },
        {
            "id": "hxpr3rv",
            "score": 1,
            "text": "I'm sure that's true to a degree but when the pandemic hit I was grateful that our town's school had already gotten a significant renovation in 2014, as its ventilation system was in really good shape.",
            "title_similarity": "0.6930547",
            "sentiment_compound": 0.9192
        },
        {
            "id": "hxpr3sl",
            "score": 1,
            "text": "I’d be interested to see a breakdown in amenities for the schools. \n\nSeveral schools in the city I live in down have Central air and a majority of the rooms can’t have AC units due to the design of the windows. How much of an impact would being comfortable have on the learning environment? How much does better lighting contribute to overall perception which may have an impact?",
            "title_similarity": "0.6429641",
            "sentiment_compound": 0.8504
        },
        {
            "id": "hxpr4e1",
            "score": 1,
            "text": "I mean… maybe we just divert a few billion, not that much, away from military every year and add it to education. \n\nUsually military is like 10x as much as education. I think 2019-2021 it was like 700 billion for military and 60-70 billion for education.",
            "title_similarity": "0.6542655",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hxpr5il",
            "score": 1,
            "text": "I’d be interested to see a breakdown in amenities for the schools. \n\nSeveral schools in the city I live in down have Central air and a majority of the rooms can’t have AC units due to the design of the windows. How much of an impact would being comfortable have on the learning environment? How much does better lighting contribute to overall perception which may have an impact?",
            "title_similarity": "0.6429641",
            "sentiment_compound": 0.8504
        },
        {
            "id": "hxprc12",
            "score": 1,
            "text": "I didn't see why test scores go up and drop out rates go down. Did it mention that?",
            "title_similarity": "0.66690737",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hxprh00",
            "score": 1,
            "text": "I wonder how the US compares to other nations as far as money spent per pupil. If we are even in the top 5 then no amount of money spent will fix it. They already clearly have a spending problem. Let people build million dollar stadiums and they’ll do that with the money instead. It’s bureaucratic meaning it won’t be fixed unless the system is changed.",
            "title_similarity": "0.64600956",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hxprwce",
            "score": 1,
            "text": "Almost like when we invest in people, people's lives are better.",
            "title_similarity": "0.56382954",
            "sentiment_compound": 0.6258
        },
        {
            "id": "hxpryt3",
            "score": 1,
            "text": "Yea I wouldn’t expect new building or renovations to make that much of an impact, but maybe sure a schools roof doesn’t leak and collapse is a necessary expenditure. No different than maintenance on any other building.",
            "title_similarity": "0.6999116",
            "sentiment_compound": -0.8047
        },
        {
            "id": "hxps2uq",
            "score": 1,
            "text": "In the school districts I've lived in, the biggest newsworthy building spending was new buildings in order to accommodate a fast growing student body. The idea being higher capacity = more room for teachers / smaller classroom sizes. These findings are interesting to me because it's counterintuitive that smaller classroom sizes that result from building new classrooms and hiring new teachers \\_wouldn't\\_ lead to better educational outcomes.\n\nAre these research conclusions drawn by correlation and not causation where the effect of building expenditures are confounded by operational spending? In other words, construction may be a necessary expenditure to accomodate higher operations spending, but operations spending is the stronger indicator of student outcomes?\n\nAdditionally, how does this study explain the impact of preventative building expenditures? I remember an instance of one school building growing up that when it rained it would sometimes have leaks in the roof. If it started during the day, the janitor would come into the classroom and put a bucket under the drip and we'd move on - I don't think it directly impacted our education. However, one summer the school district completely replaced the roof and renovated most of the top floor classrooms. Would the growth of mold impacted educational outcomes if left unhampered? Quite possibly. Yet did our educational outcomes change because of these expenditures? I doubt it - ideally the roof was replaced before it impacted students.",
            "title_similarity": "0.80624264",
            "sentiment_compound": 0.9239
        },
        {
            "id": "hxps3a4",
            "score": 1,
            "text": "Is this surprising to anyone?",
            "title_similarity": "0.14129226",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hxps7cf",
            "score": 1,
            "text": "I won’t pretend to have intimate knowledge on the subject or to have been following it closely. However, as someone who works, having a good salary is an extremely strong motivator for me to do well. When you perform good work and you’re paid well, you feel good. When you feel good, you perform well. It’s a bit of a feedback cycle. What we currently pay teachers probably causes a lot of burnout and doesn’t enable them to give their best to our country’s students. A lot of teachers are emotionally attached to their work, understandably of course, but are torn between maintaining a quality of life outside of school and educating the children of our future.",
            "title_similarity": "0.7233012",
            "sentiment_compound": 0.8572
        },
        {
            "id": "hxpscm0",
            "score": 1,
            "text": "I hope that they have increased the budget.\n\nI heard they were going to cut it.",
            "title_similarity": "0.62290245",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxpsgj5",
            "score": 1,
            "text": "To be fair, there's an element to the building part, but that's more safety than tangible test results. Doing construction work on a 15 year old school? No benefit. Replacing a 75 year old school with modern efficiencies, layouts, connectivity, and most of all environmental systems? Absolutely.\n\nAnd yes, it needs to be coupled with funding for the staff to increase properly. A well funded teacher pays off dividends for a child's education. It's the old phrase \"you get what you pay for.\"",
            "title_similarity": "0.76424783",
            "sentiment_compound": 0.936
        },
        {
            "id": "hxpsj6x",
            "score": 2,
            "text": "Teachers will never get high pay working for the government. Best route for teachers is to work for private schools paid for by a voucher system.",
            "title_similarity": "0.5770942",
            "sentiment_compound": 0.6701
        },
        {
            "id": "hxpsknh",
            "score": 1,
            "text": "Well now that we’ve tried impoverishing and endangering teachers I guess we might as well tried the opposite",
            "title_similarity": "0.40921247",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxpsrad",
            "score": 1,
            "text": "Very true but a rich benefactor can't spaff thier name across a teacher's pay increase.",
            "title_similarity": "0.67402613",
            "sentiment_compound": 0.8518
        },
        {
            "id": "hxpsrqc",
            "score": 2,
            "text": "Increased spending on *which* schools over the last four decades? Did the ones that need it get funding or did the already-rich schools get richer?",
            "title_similarity": "0.6862962",
            "sentiment_compound": 0.7059
        },
        {
            "id": "hxpt1q6",
            "score": 1,
            "text": "Yeah teachers in the US are for the most part massively underpaid.  That's going to remain the \"long pole\" problem in educational outcomes no matter what else you build, say, or do.\n\nAlthough pedagogy as a field would also benefit from an overhaul.  That might require deeper structural changes.",
            "title_similarity": "0.68369424",
            "sentiment_compound": 0.3455
        },
        {
            "id": "hxpt3tp",
            "score": 1,
            "text": "Yeah I know lots of people who talk about their favorite teacher that inspired them. I don’t know anyone who talks about how their school’s renovation inspired them. I know research confirms a hypothesis, but this should not be surprising to anyone that went to school.",
            "title_similarity": "0.6413913",
            "sentiment_compound": 0.5543
        },
        {
            "id": "hxpt6iy",
            "score": 1,
            "text": "Pay the teachers and stop giving them 25+ kid classes. Simple",
            "title_similarity": "0.5717894",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hxptkdo",
            "score": 1,
            "text": "Case in point. Nevada is ranked 49th in the nation for academic achievement and also right at the bottom with fewest dollars spent per student on education.",
            "title_similarity": "0.5236044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxptknj",
            "score": 1,
            "text": "Former teacher, left the classroom because the job was draining the life from me. Class size is the greatest contributing factor to student success. A teacher with 20 students can do wonders.",
            "title_similarity": "0.5864981",
            "sentiment_compound": 0.836
        },
        {
            "id": "hxptl42",
            "score": 1,
            "text": "Maybe next budget can be for the infrastructure part, maybe resources and teacher salaries was the priority for this budget year.",
            "title_similarity": "0.6287194",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxptnwe",
            "score": 1,
            "text": "The schools in my district are falling apart and catching fire, but the taxpayers won’t pay for a levy :(",
            "title_similarity": "0.5012635",
            "sentiment_compound": -0.7543
        },
        {
            "id": "hxpton2",
            "score": 1,
            "text": ">New research shows additional spending on operations—such as teacher salaries and support services—positively affected test scores\n\nNew when? 100 years ago?",
            "title_similarity": "0.75465006",
            "sentiment_compound": 0.3527
        },
        {
            "id": "hxptwv3",
            "score": 1,
            "text": "Yea but my classroom is so dank and gross there’s mushrooms growing in it. And moss all over the outside. It’s a portable, and it’s depressing.  Facilities do matter, but happy teachers can make up for a bad facility.",
            "title_similarity": "0.39253846",
            "sentiment_compound": -0.754
        },
        {
            "id": "hxpu840",
            "score": 2,
            "text": "Who would’ve thunk it",
            "title_similarity": "0.12006088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpubg3",
            "score": 1,
            "text": "True story: principal has underperforming highschool.  Triggers federal aide on the condition that principal steps down.  School board makes him superintendent for being a team player.  Now mconstruction company is building an off the chain nice facility for them. Super bro is part of meetings for oversight and contributes nothing.  All of the money goes into nicer facilities for the same old staff to luxuriate in.  Lots of expensive doors and casework tho.",
            "title_similarity": "0.6465589",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hxpucpo",
            "score": 2,
            "text": "Also brain drain. The best and brightest don’t go into education.",
            "title_similarity": "0.44348848",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hxpuf4k",
            "score": 1,
            "text": "And all I can think is how much my college has spent on amenities and buildings versus things that actually help people learn something new.\n\nThe spending doesn't go to the people.  Just like the military.  It goes to new toys, not personnel and their needs.",
            "title_similarity": "0.68566227",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hxpuqbm",
            "score": 1,
            "text": "No surprise there. There is a point at which buildings need to be replaced, and they are an approximately stupid amount of money.",
            "title_similarity": "0.45687118",
            "sentiment_compound": -0.6386
        },
        {
            "id": "hxpuvij",
            "score": 1,
            "text": "City politics are heavily influenced by donations from real estate developers. Elected officials will often funnel public spending increases towards building projects to line the pockets of their benefactors.",
            "title_similarity": "0.5801181",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hxpv10l",
            "score": 1,
            "text": "This is what I love about the United States. People raise issues and they are actually addressed by the officials. Not something I can say about my own country: India.",
            "title_similarity": "0.55211806",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hxpv5tc",
            "score": 1,
            "text": "The teachers in the US will now proceed to grasp said researchers by their shoulders and give them a hearty shake. Could also ready “men finally have idea that women have been talking about for decades. Deemed brilliant. Good job, boys”",
            "title_similarity": "0.60026675",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hxpvido",
            "score": 1,
            "text": "Because getting rid of asbestos and mold doesn't necessarily make you smarter.",
            "title_similarity": "0.507964",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hxpvmf9",
            "score": 1,
            "text": "That’s great, but fixing a few broken pieces of a broken system doesn’t fix the system",
            "title_similarity": "0.5151765",
            "sentiment_compound": -0.775
        },
        {
            "id": "hxpvqlj",
            "score": 1,
            "text": "There are so many sources of funding... lotto, drugs, massive housing tax... yet it seems to find it's way to administration instead of teachers.",
            "title_similarity": "0.53138",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpvuqn",
            "score": 1,
            "text": "People have been screaming to fund actual classrooms and not superintendents or building project for decades.",
            "title_similarity": "0.5689443",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hxpvx1k",
            "score": 1,
            "text": "I don’t know man, i think getting rid of asbestos in philly schools might have some positive impacts on student performance too",
            "title_similarity": "0.68385077",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hxpvxg1",
            "score": 1,
            "text": "There is a zero-sum economic side of this as well.\n\nBetter facilities attract teachers and staff that are willing to work for less. They also attract families to the area which increase property values, and provide better long term funding since property taxes are a big source of funds.\n\nThe problem with these economics is if one school district is winning, another is losing. So you get overspend on facilities.",
            "title_similarity": "0.81452227",
            "sentiment_compound": 0.9292
        },
        {
            "id": "hxpvxg5",
            "score": 1,
            "text": "Wow the most obvious thing that we knew all along has been proven to be true? Wow.",
            "title_similarity": "0.26670238",
            "sentiment_compound": 0.886
        },
        {
            "id": "hxpvyte",
            "score": 1,
            "text": "The only thing I would potentially argue about here is  those things we might consider basic as needs for renovations, which never truly seem to be addressed. The kickbacks make new buildings appealing for only those never touching the classroom, while leaving understaffed classes and the kids in the old buildings potentially in unsafe conditions. \n\n\"A 2019 Harvard study looked at water tests from 10,888 schools in 12 states, and found that nearly half of the schools (44%) had at least one water sample with worrisome lead concentrations.\" Business Insider, 2019\n\nThis article looked at the mass of schools without air conditioning in areas where temperatures spike above 90F/32C\nhttps://www.the74million.org/article/exclusive-too-hot-to-learn-records-show-nearly-a-dozen-of-the-biggest-school-districts-lack-air-conditioning/\n\nThis one looked at heat and mentioned asbestos and pests/animal droppings https://www.bloomberg.com/news/articles/2018-01-05/why-public-schools-can-t-keep-the-heat-on",
            "title_similarity": "0.69011164",
            "sentiment_compound": -0.7584
        },
        {
            "id": "hxpvz63",
            "score": 1,
            "text": "whats the time period of the study? why are the most funded schools some of the worst? like he could move across the state line to illionis and actually find the most funded schools and have some seriously different results",
            "title_similarity": "0.62181056",
            "sentiment_compound": -0.5661
        },
        {
            "id": "hxpw7d2",
            "score": 1,
            "text": "There are schools without a/c, heat, asbestos, or enough functioning toilets.  Buildings do need to be maintained.  It shouldn't be a, \"you can have this, but not that\".\n\nIt's all needed. I still can't get over teacher's pay.",
            "title_similarity": "0.6458926",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hxpw9qh",
            "score": 1,
            "text": "Almost like people that are happy at their jobs perform better.",
            "title_similarity": "0.50359714",
            "sentiment_compound": 0.8319
        },
        {
            "id": "hxpwcbm",
            "score": 1,
            "text": "This article is super vague, someone please explain.  Is it only Wisconsin increasing funding to teachers and where is the money coming from?",
            "title_similarity": "0.60977876",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hxpwevr",
            "score": 1,
            "text": "Love the new football stadium",
            "title_similarity": "0.4028163",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hxpwnel",
            "score": 1,
            "text": "I like that this shows up on my feed right user a post about how Florida schools are defunding their schools for up to 200 million for not stopping mask mandates.",
            "title_similarity": "0.52338",
            "sentiment_compound": 0.4486
        },
        {
            "id": "hxpwpbq",
            "score": 1,
            "text": "I know tons of experienced, 10+ year teachers leaving. All of them at one point didn't care about the money and just loved it as a passion. Things have gotten so hostile for teachers the good ones are leaving in droves.",
            "title_similarity": "0.622247",
            "sentiment_compound": 0.5867
        },
        {
            "id": "hxpwtnc",
            "score": 1,
            "text": "over the years here in Australia, our govt has been giving private schools more and more money.. in comparison to Public schools\n\nIt's just a sham",
            "title_similarity": "0.6856257",
            "sentiment_compound": 0.34
        },
        {
            "id": "hxpwwcg",
            "score": 1,
            "text": "Yeah the military was given a larger budget each year and the world is less peaceful.. guess we should scale it back.",
            "title_similarity": "0.62327456",
            "sentiment_compound": 0.6258
        },
        {
            "id": "hxpx4pw",
            "score": 1,
            "text": "Who would’ve guessed that paying the people that actually teach (instead of building a football stadium) could improve how much students learn??",
            "title_similarity": "0.74141926",
            "sentiment_compound": 0.504
        },
        {
            "id": "hxpxj1d",
            "score": 1,
            "text": "Wow...it's almost like treating people as if they were human encourages others to do the same. What a concept.",
            "title_similarity": "0.3448255",
            "sentiment_compound": 0.6258
        },
        {
            "id": "hxpxlb2",
            "score": 1,
            "text": "Silly me, I've always thought kids learned mostly from the buildings.",
            "title_similarity": "0.54340595",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hxpxm2x",
            "score": 1,
            "text": "Wow, fckn SHOCKING! Pay teachers & support staff more and you attract better candidates who do a better job teaching the kids! HOW HAVE WE NOT THOUGHT OF THIS BEFORE?! THIS IS REVOLUTIONARY!!!",
            "title_similarity": "0.73818684",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hxpxnqv",
            "score": 1,
            "text": "We need a complete overhaul of all the schools anyway. There are so many that still have asbestos (is the bestos!) and very piss poor water quality. Our kids could be doing perfect, but they don't need to be slowly poisoned going to school.",
            "title_similarity": "0.64091706",
            "sentiment_compound": -0.7527
        },
        {
            "id": "hxpxoez",
            "score": 1,
            "text": "You really can’t generalize like that. A school in inner city Chicago with the ceiling tiles falling down from water damage isn’t the same as a rich country school adding a new wing when it comes to renovation.",
            "title_similarity": "0.5498952",
            "sentiment_compound": 0.3744
        },
        {
            "id": "hxpxp9v",
            "score": 1,
            "text": "Teacher salary?  I was due for a whopping $800 raise this year.  The district decided they were too broke to give raises.  This has happened multiple times over the course of my career to the tune of 10's of thousands of dollars.",
            "title_similarity": "0.5402161",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hxpxr3i",
            "score": 1,
            "text": "you know what also doesn't help test scores? giving the upper administration a raise",
            "title_similarity": "0.6360922",
            "sentiment_compound": 0.0366
        },
        {
            "id": "hxpxxvh",
            "score": 1,
            "text": "We moved into a new hugh school in my sophomore year, where I wasn't able to further my math education because they didn't have enough math teachers. This was in 1970.",
            "title_similarity": "0.59345126",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpxzs8",
            "score": 1,
            "text": "It's almost as if investing in education yields better results",
            "title_similarity": "0.6631062",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxpy44u",
            "score": 1,
            "text": "Wow, almost like investing in good people who can effectively communicate a great message to the next generation is better than plopping them in front of the newest mac…. Funny thing that \n\nUp next: iPad babies confused when preschool has people",
            "title_similarity": "0.70424837",
            "sentiment_compound": 0.9607
        },
        {
            "id": "hxpycw0",
            "score": 1,
            "text": "Wait, sitting in a fancy building doesn't make you smart?",
            "title_similarity": "0.36610514",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hxpyf7l",
            "score": 1,
            "text": "I experience this firsthand",
            "title_similarity": "0.054385938",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpyfam",
            "score": 1,
            "text": "Wow who would've knew",
            "title_similarity": "0.06921977",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hxpygws",
            "score": 1,
            "text": "The problem is that the more educated a person is the less likely they are tu vote republikkkan. \nTherefore, they oppose anything that helps education",
            "title_similarity": "0.5787095",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hxpylzc",
            "score": 1,
            "text": "Huh, crazy how when teachers are adequately paid and given the support they need their students succeed",
            "title_similarity": "0.6334257",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hxpymwg",
            "score": 1,
            "text": "Spend on free prek. Best bang for the buck.",
            "title_similarity": "0.46000683",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hxpyt0x",
            "score": 1,
            "text": "when will any funding be allocated for online services\n\neveryone should be able to get accredited education online, and it should be a component of public funding to do so in order to make it operational enough to be able to give certification for various jobs.\n\nthese funding numbers are astronomical and insane for the poor performance they bring to the table, but we keep ignoring these proven powerful tools time and time again, not mentioning them, not funding them, and not elevating them to the position of modern necessity they should occupy",
            "title_similarity": "0.67456245",
            "sentiment_compound": -0.4118
        },
        {
            "id": "hxpyye7",
            "score": 1,
            "text": "Well color me fuckin’ surprised!",
            "title_similarity": "0.112042174",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hxpzlcn",
            "score": 1,
            "text": "It's almost as if teachers (and thereby their students) are the most important aspect of school.\n\nAnd that by helping teachers (paying them more) and making sure they have the supplies needed to perform their tasks is causal to completing their mission.\n\nAnd that building new buildings and making old buildings look \"cool\" only does good for the usual government contractor suspects with any of the kickback schemes involved - and has little to no effect on the mission. Well, I'm sure environmental (heating, cooling, kitchen/dining, humidity, ...) affect students, but flashy new buildings? Apparently not.",
            "title_similarity": "0.8024832",
            "sentiment_compound": 0.6775
        },
        {
            "id": "hxpzml3",
            "score": 1,
            "text": "Wouldn't need to fund a research if people just listened to everyone whose been saying this for decades.",
            "title_similarity": "0.550634",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxpzol2",
            "score": 1,
            "text": "We need building renovations because 40 kids can't fit in 1980S manufacturered homes that some schools use for classrooms. Also the pipes are bad, so the waters bad in most schools.",
            "title_similarity": "0.55570436",
            "sentiment_compound": -0.8546
        },
        {
            "id": "hxpzqz4",
            "score": 1,
            "text": "Baltimore has pretty much the highest teacher salaries in the nation (and 2X other districts/cities), and pretty much the worst outcomes. And which support services - more diversity consultants? USA also already spends more on public schooling (by a long shot) than most (actually all I think) modern western countries, with  outcomes that are very far from the best.\n\nThere are decades worth of large studies as to how increasing funding has a very tenuous connection to outcomes. But I'm sure this \"new research\" changes everything, like Einstein's theory of special relativity",
            "title_similarity": "0.68137175",
            "sentiment_compound": 0.936
        },
        {
            "id": "hxpzucp",
            "score": 1,
            "text": "> The US\n\nWonder If the increase in spending on education is happening in red states,\n\nProbably not.",
            "title_similarity": "0.67801774",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hxpzw6s",
            "score": 1,
            "text": "But, how will we educate our youth if we don't build that new football stadium and buy new uniforms?!? Think of the children people. Sports I mean (education) is important!! Sarcasm if it wasn't clear :/",
            "title_similarity": "0.5876995",
            "sentiment_compound": -0.3834
        },
        {
            "id": "hxpzwkg",
            "score": 1,
            "text": "What about building expenses on air conditioning. I taught in a school built in the 1890s. Still to this day it has no cooling, and radiator heating. In Aug-Sept, May-Jun, the students were often miserable.",
            "title_similarity": "0.48277095",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hxpzz8v",
            "score": 1,
            "text": "I think a huge boost to teachers that requires zero funding would be to just eliminate federal income tax for k-12 teachers up to ~80k, at least for the pay they receive directly from the school/district. That would be like boosting the pay of every teacher in the country without having to pay them a single dime more.",
            "title_similarity": "0.7318127",
            "sentiment_compound": 0.8124
        },
        {
            "id": "hxq00oc",
            "score": 1,
            "text": "You forgot except the states taking it away, like Florida",
            "title_similarity": "0.20024431",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxq0242",
            "score": 1,
            "text": "Spending on 'professional development' should be zero. Put that towards raises and maybe your developed professionals won't quit.",
            "title_similarity": "0.6374413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxq02cu",
            "score": 1,
            "text": "Where/when did they increase funding?   Our funds are so low it’s not funny.",
            "title_similarity": "0.6137455",
            "sentiment_compound": -0.4305
        },
        {
            "id": "hxq040i",
            "score": 1,
            "text": "Huh. Why woulda thunk it?",
            "title_similarity": "0.099790506",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxq07dc",
            "score": 1,
            "text": "Another study in the works is exploring whether raincoats prevent you from getting wet. We will update you with the highly controversial and confusing results.",
            "title_similarity": "0.44685534",
            "sentiment_compound": -0.4865
        },
        {
            "id": "hxq0994",
            "score": 1,
            "text": "Elementary school counselor here. I wish they would increase funding for school counselors. My current caseload is 530:1 (more than twice what is recommended by the American School Counselor Association), and this is not uncommon for elementary schools. It is exhausting being one counselor for over 500 students.",
            "title_similarity": "0.6720082",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hxq0dew",
            "score": 1,
            "text": "This must have been a very isolated study considering the horrible teacher pay and complete lack of funding for their supplies found across most of America.",
            "title_similarity": "0.4423187",
            "sentiment_compound": -0.8313
        },
        {
            "id": "hxq0qmz",
            "score": 1,
            "text": "There is a big difference in spending money to build a brand new facility or fancy addition like a theater building and spending money to ensure every school has a working hvac system or water fountains. Hard to learn effectively if you are shivering in class during the winter.",
            "title_similarity": "0.60833657",
            "sentiment_compound": 0.765
        },
        {
            "id": "hxq0tsl",
            "score": 1,
            "text": "I won’t argue with the numbers but I will say this: when teachers are in buildings that support learning, our happiness on the job is vastly increased. When teachers are happier, we do better work, and students are happier too. Nobody wants to work in a place where the roof leaks or the windows lack screens or the electric system is too outdated to power the tools they need. \n\nBut it doesn’t have to mean total renovation. When my school added outlets, removing the need for annoying and trip-hazard extension cords, it made my daily life 10% better. When built-in storage was added, the ability to remove clutter and improve organization made my classroom a 10% more pleasant place to be. The building is over 100 years old and still has good bones. It doesn’t need an overhaul. It just needs improvements. \n\nSwitching to LED lighting instead of fluorescent, updating furniture, and replacing worn-out whiteboards are more ideas for improving schools that don’t require entire new buildings to go up. Small changes can snowball to make a big impact.",
            "title_similarity": "0.8154807",
            "sentiment_compound": 0.9929
        },
        {
            "id": "hxq0vdi",
            "score": 1,
            "text": "Meanwhile, in Oklahoma, our governor continues his commitment to take us to the worst state in the union for education. He’s no quitter!",
            "title_similarity": "0.4420923",
            "sentiment_compound": -0.6114
        },
        {
            "id": "hxq132m",
            "score": 1,
            "text": "New research shows better schools make schools better",
            "title_similarity": "0.7066932",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hxq15i6",
            "score": 1,
            "text": "I'm just wondering what kind of research was needed to come to the obvious",
            "title_similarity": "0.25138858",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxq1efl",
            "score": 1,
            "text": "Nevada really need it’s the education system here is so bad.",
            "title_similarity": "0.372733",
            "sentiment_compound": -0.6696
        },
        {
            "id": "hxq1gj7",
            "score": 1,
            "text": "We needed research to tell us this?",
            "title_similarity": "0.29531002",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxq1ktf",
            "score": 1,
            "text": "New research shows what the rest has known and researched over hundreds of years. No wonder the Us is falling back behind, when basics results of international reseach of the 70ies and 80ies are in the US considered \"new reseach\".\n\nI've to say this constant reinventing the wheel is mind blowing for someone new to the US.\n\nDon't get me wrong, its important, bbut this isn't new at all.",
            "title_similarity": "0.7115543",
            "sentiment_compound": 0.1416
        },
        {
            "id": "hxq1opv",
            "score": 1,
            "text": "Meanwhile, Florida is experimenting on removing $200 million per school. Must be trying to create more GPO voters.",
            "title_similarity": "0.51235735",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hxq1w62",
            "score": 1,
            "text": "I mean this information is not new at all we have known this for a very very long time, its basically common sense even. Glad they're finally getting around to it though.",
            "title_similarity": "0.42778802",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hxq20we",
            "score": 1,
            "text": "The funding for our schools ALWAYS goes towards building a higher gym or better uniforms for our football team. It never goes towards our teachers, teaching material, school lunches, etc. ugh.",
            "title_similarity": "0.59235704",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hxq23hu",
            "score": 1,
            "text": "Imagine having to do a study to reach this conclusion.",
            "title_similarity": "0.22492152",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hxq28da",
            "score": 1,
            "text": "Capitalist thought processes are at work, here.  Let's update the buildings.  Let's buy new computers.  Let's repave the parking lot.  Let's put new turf on the sports fields...  Wait, you want us to increase teacher salaries?  What are you, a commie?!\n\nThe fastest route to a better education system is happy, engaged teachers.  That starts with teachers who can afford to relax a little.",
            "title_similarity": "0.7535368",
            "sentiment_compound": 0.9377
        },
        {
            "id": "hxq29ia",
            "score": 1,
            "text": "Nooo really? When we invest in education/youth they do well! \n\nKeep kids off the streets and in school man",
            "title_similarity": "0.6503935",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hxq2hfz",
            "score": 1,
            "text": "From the perspective of a teacher, this study points to the obvious facts we use every time we negotiate our own contracts with the district we work for. I'm a lead negotiator for my small, one district, teachers union and it's always a battle with the district who claims they need to save money for future infrastructure costs instead of spending money on the things that directly effect the students.  \n\nTeachers have to negotiate their own contracts using their own resources. The district they are negotiating against will hire consultants and have layers on retainer using the school districts money. Some teachers unions will get some help and representation from their state teachers union which we pay to be a part of. It's kind of like being represented by a public defender in a murder trial. This imbalance also contributes to less spending on teacher/support staff salaries. We had to collectively bargain for counseling services for students in the midst of a pandemic and/or impacted or displaced by floods and fires (Sonoma County, California).  Meanwhile  superintendents write their own six-figure contracts which include monthly cell phone and vehicle allowances which are approved by board who hires the superintendents on the first place.\n\n\nA big part of the spending problem is who is ultimately in control of the spending. That money is spent per the direction of the district school board members. They are elected community members and need not have any qualifications. The school board gets their information from a superintendent who has a vested interest in not spending money because it looks good on their resume to have grown their schools reserves (superintendents don't usually stay with a school for more than 3-5 years). The superintendent employs a CBO, or will sometimes fill that roll themselves. That's who decides how to spend millions of dollars at our schools.",
            "title_similarity": "0.62023574",
            "sentiment_compound": 0.8024
        },
        {
            "id": "hxq2tt1",
            "score": 1,
            "text": "You mean that new gymnasium isn't improving little Timmy's test scores?! Damn those lazy do nothing teachers!",
            "title_similarity": "0.6549072",
            "sentiment_compound": -0.7973
        },
        {
            "id": "hxq3244",
            "score": 1,
            "text": "Weird how people do better at their job if they are paid more, good thing this study was conducted I'd have never guessed people worked for money.",
            "title_similarity": "0.719672",
            "sentiment_compound": 0.659
        },
        {
            "id": "hxq386k",
            "score": 1,
            "text": "Problem is, a lot of school districts will be willing to put money into things that are visible over things like salary. This really goes for everything tbh.",
            "title_similarity": "0.59797657",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hxq3dps",
            "score": 1,
            "text": "How could expenditures in new buildings have little impact? if a school has a max capacity of 1000 students and the number of students has reached 1250 students because of a growing population wouldn't a new building/renovations be a requirement?\n\nOr is this saying that the new shiny 75 Million dollar high school football stadium doesn't contribute much to education?",
            "title_similarity": "0.7094955",
            "sentiment_compound": 0.4479
        },
        {
            "id": "hxq3hl2",
            "score": 1,
            "text": "Humans are more important than hardware.",
            "title_similarity": "0.31231397",
            "sentiment_compound": 0.2716
        },
        {
            "id": "hxq3nia",
            "score": 1,
            "text": "Isnt this obvious? Why would there need to be a study to confirm this?",
            "title_similarity": "0.293503",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxq3osg",
            "score": 1,
            "text": "Baltimore city has the highest funded schools in the state and a new study released said 90% of seniors can't read at an elementary school level. It's not the money.",
            "title_similarity": "0.648972",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxq3pxt",
            "score": 1,
            "text": "I would say spend more money on mentor teachers, teacher salaries, and less on administration. Teachers should be supervised by merit hired teachers, not MBA graduates. Smaller class sizes should be the first fix, no more than 12 students per teacher. Pay teachers enough that they do not worry about their finances away from the classroom ($100,000k).\nMake teaching a profession on the same level of respect as medical doctors.",
            "title_similarity": "0.7299244",
            "sentiment_compound": 0.6914
        },
        {
            "id": "hxq3t3e",
            "score": 1,
            "text": "Was this before or after the current rate of inflation kicked in, wiping out those gains?",
            "title_similarity": "0.49239153",
            "sentiment_compound": 0.34
        },
        {
            "id": "hxq3vxi",
            "score": 1,
            "text": "Ive been saying this for years, ever since I helped build new schools. All that money goes into tangible objects! We were over constructing everything with nice materials, oak handrails, glass torphy cases. All the education money goes into a damn building.",
            "title_similarity": "0.6157206",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hxq44zp",
            "score": 1,
            "text": "More money in our schools is great, now if we could just find a way to keep our politicians out of our schools we'd be all set.",
            "title_similarity": "0.7396441",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hxq4bh1",
            "score": 1,
            "text": "> positively affected test scores, dropout rates,\n\nDoes this mean more people dropped out?",
            "title_similarity": "0.58679867",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hxq4iz7",
            "score": 1,
            "text": "Make sure they are good teachers though.",
            "title_similarity": "0.41938978",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hxq4v7p",
            "score": 1,
            "text": "Who would have guessed.",
            "title_similarity": "0.086031914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxq50uh",
            "score": 1,
            "text": "Absolutely pay teachers more to attract a competitive market.  Building updates do help though. Learning on equipment 40 years old creates a massive disconnect. Schools that look crappy tend to get treated crappy.",
            "title_similarity": "0.7121483",
            "sentiment_compound": -0.1567
        },
        {
            "id": "hxq53bb",
            "score": 1,
            "text": "Renovations are pretty important, though, even if they're not sexy. It's also probably hard to capture the impact econometrically, because it's probably more about avoiding an erosion of student outcomes than directly working to improve them.",
            "title_similarity": "0.6593716",
            "sentiment_compound": 0.2607
        },
        {
            "id": "hxq53w1",
            "score": 1,
            "text": "Baltimore city schools have some of the highest per student spending in the nation and yet consistently rank as one of the worst schools in America with often single digit numbers of students proficient in basic reading/writing/maths skills. \n\nNot saying these findings are not important. But the Baltimore city schools sure seem to be an outlier to the idea of better funding equates to better achievement.",
            "title_similarity": "0.7031649",
            "sentiment_compound": 0.8318
        },
        {
            "id": "hxq5ai0",
            "score": 1,
            "text": "Except Texas and Florida. Both Republican lead states. Republicans are destroying America.",
            "title_similarity": "0.27668142",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hxq5e8w",
            "score": 1,
            "text": "Sorry, but shouldn't this be obvious?",
            "title_similarity": "0.10574685",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hxq5gye",
            "score": 1,
            "text": "It isn’t rocket surgery to know if we provide the youth with the best we can, they will grow to be successful, contributing adults. \n\nEducation is a lot cheaper to finance than ignorance. \n\nWe have to have a standard curriculum, but not a standard way of financing education?",
            "title_similarity": "0.7995161",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hxq5jvx",
            "score": 1,
            "text": "New research shows what common sense would have told anyone with half a brain",
            "title_similarity": "0.54908884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxq5kli",
            "score": 1,
            "text": "Remember when Betsy Devos was attempting to dismantle  public schools? Does this funding make up for all she ruined?",
            "title_similarity": "0.42317164",
            "sentiment_compound": -0.5362
        },
        {
            "id": "hxq5u13",
            "score": 1,
            "text": "He says that capital expenditures did not raise student outcomes between the year before a bond was passed and the following year.  Of course they don’t.  The time between passing the funding for a school and the time the school is built is about 3-4 years.  Why would test scores go up while the new building is still being designed and hasn’t even started construction?  The logic this whole study is based on seems deeply flawed because it completely ignores project timelines.  Of course hiring teachers, etc. has more of an immediate impact than building a school.  It would be pretty damn hard for it not to.\n\nThe quality of school facilities absolutely has an impact on education.  Bad HVAC, poor lighting, lack of natural lighting, inability to retrofit old buildings with modern education technology, inadequate learning space to accommodate the number of students, etc.\n\nSource: Been a part of about 50 new schools and major renovation projects.",
            "title_similarity": "0.7271099",
            "sentiment_compound": -0.945
        },
        {
            "id": "hxq61ec",
            "score": 1,
            "text": "What?!? No, REALLY? *shocker*",
            "title_similarity": "0.08010767",
            "sentiment_compound": -0.5358
        },
        {
            "id": "hxq61vc",
            "score": 1,
            "text": "Wait wait wait…so you’re telling me that if I have a flat tire, I should fix the tire instead of getting a new paint job?  This is madness.",
            "title_similarity": "0.40256304",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hxq65as",
            "score": 1,
            "text": "It's so crazy to me that we still don't seem to ever get that it isn't so much how much money you throw at a problem, but that you spend that money in the right areas to get the results you're looking for.",
            "title_similarity": "0.6045623",
            "sentiment_compound": -0.4012
        },
        {
            "id": "hxq66ma",
            "score": 2,
            "text": "Not in Florida it seems",
            "title_similarity": "0.05183833",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxq6ce4",
            "score": 8,
            "text": "You mean one teacher corralling 24 six year olds isn’t a great educational environment?",
            "title_similarity": "0.56926346",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hxq6mlv",
            "score": 1,
            "text": "I worry that a study headline like this might lead to bad practices in providing buildings, building maintenance, and renovations.\n\nHow much of this result might be that those areas are already on average properly funded while teachers and support servies are not?\n\nThere should be a point where funding provides diminished returns, that doesn't mean the money shouldn't be spent to maintain the system.",
            "title_similarity": "0.7072412",
            "sentiment_compound": -0.296
        },
        {
            "id": "hxq72m2",
            "score": 1,
            "text": "Think is they need to make sure the money actually gets to the teachers and support programs.",
            "title_similarity": "0.5030553",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hxq7cny",
            "score": 1,
            "text": "It's almost like it doesn't necessarily matter ***WHERE*** people are taught, but rather the quality of the person doing the teaching and their ability to actually teach.",
            "title_similarity": "0.5431406",
            "sentiment_compound": 0.5448
        },
        {
            "id": "hxq7crf",
            "score": 1,
            "text": "As a teacher, it is laughable how obvious this is: hire more teachers, make class sizes smaller, students do better.",
            "title_similarity": "0.7041461",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hxq7i5z",
            "score": 1,
            "text": "Some states spend more money on flower beds and lawn care than support staff while the 5th graders in the building still can't read.",
            "title_similarity": "0.6590011",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hxq91d1",
            "score": 1,
            "text": "It's almost like if you pay teachers a decent wage they actually care more, wow crazy.",
            "title_similarity": "0.656858",
            "sentiment_compound": 0.7522
        },
        {
            "id": "hxq92cu",
            "score": 1,
            "text": "Oh wow the buildings don’t teach the kids? Wild.",
            "title_similarity": "0.4075018",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hxq92fr",
            "score": 1,
            "text": "I totally agree with this but, hear me out. There comes a point when you cannot lower student:teacher ratio any more by hiring new teachers because there is no place to put them.\n\nThat is where my district is. we have trailers",
            "title_similarity": "0.66412014",
            "sentiment_compound": 0.11
        },
        {
            "id": "hxq99nl",
            "score": 1,
            "text": "Ahhh. They finally caught on to the pattern of dummies educations has been yarking out, eh?",
            "title_similarity": "0.49110836",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxq9aqf",
            "score": 1,
            "text": "A major confound, not significantly addressed, is that districts where people would vote to increase to have their taxes increased are often very different from that wouldn't vote to have their taxes raised.  \n\nNo matter that the increased revenue would go to schools, communities full of people on the edge generally won't pay more, while communities with excess income are more likely to do so.\n\nUltimately the difference will result in a rather select population to extrapolate a larger conclusion on.\n\nFurthermore, districts with a lot of empty-nesters, are less likely to vote to increase taxes to fund schools.",
            "title_similarity": "0.79487634",
            "sentiment_compound": 0.7919
        },
        {
            "id": "hxq9ct6",
            "score": 1,
            "text": "Our best investment for the future is in people",
            "title_similarity": "0.39673132",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hxq9qci",
            "score": 1,
            "text": "When I was in high school my school built a new campus. Spent two years at the old building and two years at the new. I would have preferred the old building. The history, memories, and tradition were irreplaceable. New campus felt cold and rigid. No personality. Sure we had better and bigger facilities but still.  Plus there were cameras everywhere and felt like a prison.",
            "title_similarity": "0.63557696",
            "sentiment_compound": -0.3779
        },
        {
            "id": "hxqagok",
            "score": 1,
            "text": "Buildings and facilities don't do the teaching.",
            "title_similarity": "0.20758069",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqaocs",
            "score": 1,
            "text": "I really hope this applies to the arts too. Public schools never seem to fund their fine art classes enough.",
            "title_similarity": "0.6421536",
            "sentiment_compound": 0.6115
        },
        {
            "id": "hxqaqt4",
            "score": 1,
            "text": "Did they actually increase funding or just catch up with inflation from the last 10 years?",
            "title_similarity": "0.59151435",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hxqasd8",
            "score": 1,
            "text": "It's almost like paying teachers something that doesn't keep them in poverty would improve their work ethic or something. Absolutely wild",
            "title_similarity": "0.70722854",
            "sentiment_compound": 0.204
        },
        {
            "id": "hxqaxmb",
            "score": 1,
            "text": "AS A TEACHER, QUIT FOCUSING ON TEST SCORES.  They have NOTHING to do with post-secondary success.",
            "title_similarity": "0.4525816",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hxqb7rw",
            "score": 1,
            "text": "They had to research this...seems pretty obvious to me.",
            "title_similarity": "0.2874143",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxqbngo",
            "score": 1,
            "text": "How is this not a no brainer",
            "title_similarity": "0.113883086",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hxqbo0h",
            "score": 1,
            "text": "How many of the new buildings are football stadiums",
            "title_similarity": "0.38329938",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqbx3c",
            "score": 1,
            "text": "This teacher will read the article later after finish my 2nd job.",
            "title_similarity": "0.45308107",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqc4o0",
            "score": 1,
            "text": "If teachers don’t have to work second jobs, they will come to school each morning more refreshed.",
            "title_similarity": "0.7233058",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqc5w3",
            "score": 1,
            "text": "Hm, that's funny cause they're actively cutting funding in NY, among others, right now",
            "title_similarity": "0.4592377",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hxqcfqq",
            "score": 1,
            "text": "I completely agree with what is being said here, but I also wonder if the ‘shiny new building’ might attract better teachers?",
            "title_similarity": "0.6660044",
            "sentiment_compound": 0.84
        },
        {
            "id": "hxqcttp",
            "score": 1,
            "text": "Wow what a revelation",
            "title_similarity": "0.04334513",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hxqcys6",
            "score": 1,
            "text": "I think it probably depends on different factors. My area just poured hundreds of millions of dollars into new buildings out of necessity. The buildings were old, covered in mold, and asbestos. Kids were constantly out of class because they were sick. You could pour that money into teachers salaries, but it wouldn't affect test scores if the kids weren't there. The teachers were the ones advocating for new buildings. \n\nBuilding a new school when it's not necessary seems pointless, but I think most districts don't build new buildings unless it's necessary, or they foresee it being necessary in the near future, and the funding is available at that moment. \n\nNow that it's done though, teachers are finally getting some nice raises and are being paid closer to what they deserve. Starting salary raised by about $15k in the last 3 years.",
            "title_similarity": "0.71174526",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hxqd7sh",
            "score": 1,
            "text": "I would imagine some of those building expenditures were long overdue though. I’m sure our schools are not immune to our infrastructure woes. It may not directly improve test scores and dropout rates, but could be necessary nonetheless. Not all cases of course, but I’m sure there have been many.",
            "title_similarity": "0.71270776",
            "sentiment_compound": 0.1288
        },
        {
            "id": "hxqdgwj",
            "score": 1,
            "text": "Who would of thought giving teachers the resources they need would improve learning. Since I was a kid teachers have been paying out of pocket to teach properly. They already make nothing and have student loans. Teachers paying for school supplies has always been BS...",
            "title_similarity": "0.69430053",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hxqdhl7",
            "score": 1,
            "text": "Hasn't the US increased spending for decades and the quality of education has gone down at the same time?",
            "title_similarity": "0.6393982",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hxqdit6",
            "score": 1,
            "text": "I missed something where apparently someone claimed new buildings get better grades?",
            "title_similarity": "0.6365615",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hxqdllt",
            "score": 1,
            "text": "Good thing the research has finally proven the thing every single person has been saying for decades",
            "title_similarity": "0.37037432",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hxqeczx",
            "score": 1,
            "text": "Florida: Hold my beer…",
            "title_similarity": "0.050493594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqelb1",
            "score": 1,
            "text": "This isn’t new research, we have known this.",
            "title_similarity": "0.2620782",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqeo1c",
            "score": 1,
            "text": "I understand that there are better uses but my high school was built in the thirties and woefully needed to be updated. Not all spending needs to correlate with an increase in test scores. It's okay to spend money on quality of life.",
            "title_similarity": "0.80768216",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hxqesvi",
            "score": 1,
            "text": "Also more funding for cops doesn’t equal less crime. Maybe if we as a society invested in schools more than police we wouldn’t have so much poverty/crime.",
            "title_similarity": "0.74222994",
            "sentiment_compound": -0.4951
        },
        {
            "id": "hxqfbci",
            "score": 1,
            "text": "I am maintenance at a school district. Can you send this to my boss?",
            "title_similarity": "0.5075494",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqfds0",
            "score": 1,
            "text": "You mean raised our homeowners' taxes? Yeah, I'm aware of that. Thanks.",
            "title_similarity": "0.57232964",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hxqfpk7",
            "score": 1,
            "text": "Wait!  What about the giant football stadiums in TX?  Do those help?",
            "title_similarity": "0.3082157",
            "sentiment_compound": 0.5191
        },
        {
            "id": "hxqfpuo",
            "score": 1,
            "text": "We will never have good public education until the right wingers stop being afraid of anything that might be considered \"socialism\" aka anything the government dies to help people.",
            "title_similarity": "0.5684482",
            "sentiment_compound": -0.2278
        },
        {
            "id": "hxqfzte",
            "score": 2,
            "text": "This article is a  sham. Based on inflation and currency valuation, $1 in 1980 is about $3.14 today. So effectively they have CUT money to teachers since 1980. To really do any good they must double the effective value since 1980. Meaning teachers should be making at least 6 times what they were in 1980. Hint. They are not.",
            "title_similarity": "0.68982947",
            "sentiment_compound": 0.8615
        },
        {
            "id": "hxqg6i4",
            "score": 1,
            "text": "We already spend more per capita than any other western country I can think of, so the solution is to throw more money at it?",
            "title_similarity": "0.5340735",
            "sentiment_compound": 0.3774
        },
        {
            "id": "hxqg6tx",
            "score": 1,
            "text": "Funding educational programming leads to education? No way!",
            "title_similarity": "0.41372424",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hxqg9e7",
            "score": 1,
            "text": "money going to teachers and programs benefits the students.\n\nmoney going to construction benefits the parents.",
            "title_similarity": "0.685808",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hxqgfco",
            "score": 1,
            "text": "\"The United States has dramatically increased its funding for public schools over the last four decades. Real per-pupil expenditures have nearly doubled since 1980\"\n\nFirst paragraph and it's terrible. The rate of inflation since 1980 to 2022 is 241.2% from usinflationcalculator.com. What that means is that the US could have spent $100 in the 1980 and spent $180 (since the article does list NEARLY double) and that would be actually lower. $100 in the 80's is $341.20. Are they patting themselves on the back for funding the schools less?",
            "title_similarity": "0.69474906",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hxqgim4",
            "score": 1,
            "text": "Huh... I'm a teacher, haven't seen that cash...",
            "title_similarity": "0.45420718",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqgl02",
            "score": 1,
            "text": "The population is increasing so we need to build more schools and renovations are necessary to prevent the buildings from literally collapsing.",
            "title_similarity": "0.68166065",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hxqhg4z",
            "score": 1,
            "text": "I want to see a study where low performing teachers are fired. \n\nWilling to bet you'll see dramatic improvements.\n\nConsidering US teachers are already some of the highest paid teachers in the world, yet they produce some of the lowest achieving students in the world.\n\nAnd school buildings need to be constructed with the same mindset as commercial office space. Vertical and cost per sqft, not the vanity projects they are today.",
            "title_similarity": "0.7309464",
            "sentiment_compound": -0.6167
        },
        {
            "id": "hxqhho8",
            "score": 1,
            "text": "It is truly a shame that florida begs to differ.",
            "title_similarity": "0.114545226",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hxqhnfo",
            "score": 1,
            "text": "My wife is a public school teacher… read her the headline and her only response was “I could’ve told you that”. Smaller classes and more support for the kids, especially those who need it. Who’d have thunk?",
            "title_similarity": "0.66748905",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hxqi318",
            "score": 1,
            "text": "As someone from a city with a huge amount being spent on students, even the money itself isnt necessarily the key to success. Yes they spent a lot on upgrading schools but they've also spent a ton on administration and on salaries to keep teachers. Many city schools used to have police stationed to maintain order. They instead put the funding towards programs designed to help students achieve more and towards after school programs and better food programs. All things shown via studies to reduce drop out rates, increase grades, and shown to, over the course of 10 years, even minimize violence. These are great and I support the measures to a point. However these were all shown to be long term impacts. What the schools forgot? The violence, drop out rates, gang affiliation, etc of *right now*.  They're now looking to re-implement the police presence. \n\nSo, they're spending a ton on programs and are using the police money to maintain a dozen programs not available to the suburbs, and now need to spend even more to bring back the police (there was one school that had something like 5 teachers attacked in one day and several teachers from multiple schools have reported experiencing PTSD) to keep the current class from terrorizing their peers and their teachers. All this in a city already spending record numbers in their students. And, with the county taxes paying for a lot of this when the suburbs have graduation rates of nearly 100%. It's a tough pill to swallow to be told we need to pay *even more* than we already are. Right now my city is something like 25K a student while the suburbs average like 16K a student.",
            "title_similarity": "0.8383151",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hxqi6x8",
            "score": 1,
            "text": "As someone from a city with a huge amount being spent on students, even the money itself isnt necessarily the key to success. Yes they spent a lot on upgrading schools but they've also spent a ton on administration and on salaries to keep teachers. Many city schools used to have police stationed to maintain order. They instead put the funding towards programs designed to help students achieve more and towards after school programs and better food programs. All things shown via studies to reduce drop out rates, increase grades, and shown to, over the course of 10 years, even minimize violence. These are great and I support the measures to a point. However these were all shown to be long term impacts. What the schools forgot? The violence, drop out rates, gang affiliation, etc of *right now*.  They're now looking to re-implement the police presence. \n\nSo, they're spending a ton on programs and are using the police money to maintain a dozen programs not available to the suburbs, and now need to spend even more to bring back the police (there was one school that had something like 5 teachers attacked in one day and several teachers from multiple schools have reported experiencing PTSD) to keep the current class from terrorizing their peers and their teachers. All this in a city already spending record numbers in their students. And, with the county taxes paying for a lot of this when the suburbs have graduation rates of nearly 100%. It's a tough pill to swallow to be told we need to pay *even more* than we already are. Right now my city is something like 25K a student while the suburbs average like 16K a student.",
            "title_similarity": "0.8383151",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hxqia0l",
            "score": 2,
            "text": "This is only because districts that can afford vanity renovations, either do them already, have done them recently, or plan to continue to do them in the future.\n\nThere are separate districts where facility upgrades are badly needed; and often, the schools there have trouble financing those necessary upgrades.",
            "title_similarity": "0.6845024",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hxqicie",
            "score": 2,
            "text": "We saw this firsthand at the school I teach at. We've been overcrowded for years and the county finally got around to building a second building on campus. It's very nice- clean, well-made, with built-in smart boards and convertible desks for the teachers (they fold between a sitting and standing desk).\n\nWe're still chronically understaffed because teacher salaries aren't worth the workload in this area, and a lot of those fancy classrooms are full of kids being babysat by the librarian because there are no teachers and no subs.\n\nNew buildings are great, but the building doesn't teach kids.",
            "title_similarity": "0.68030787",
            "sentiment_compound": 0.5997
        },
        {
            "id": "hxqigvt",
            "score": 2,
            "text": "US already has the highest spending per pupil in K-12 system and the output is still mediocre. I mean sure more money will help but maybe we should look at the efficiency too",
            "title_similarity": "0.73864186",
            "sentiment_compound": 0.7079
        },
        {
            "id": "hxqisf5",
            "score": 2,
            "text": "Getting the ol lead paint and pipes and the asbestos out probably does have some benefit, let's not lie. And some of those old buildings are prisons, practically. I couldn't care less if it's not actively contributing to better standardized test scores, which are already the enemy of education.",
            "title_similarity": "0.67371553",
            "sentiment_compound": -0.2937
        },
        {
            "id": "hxqj8x9",
            "score": 1,
            "text": "PSA: Watch Bad Education for why those kind of building expenditures are worthless",
            "title_similarity": "0.51827896",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hxqjjwi",
            "score": 1,
            "text": "I see headlines like this and think did you need researchers to tell u this or is it republicans forcing money and labor to justify paying necessary people the minimum",
            "title_similarity": "0.56039655",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxqjps7",
            "score": 2,
            "text": "I’ve never seen a regular elementary school get replaced before it was like totally decrepit. \n\nPlus schools especially in more rural areas are kind of a community hub that is used for more than just education. But I do believe that a new building doesn’t make the education better.",
            "title_similarity": "0.70512533",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hxqk069",
            "score": 5,
            "text": "I have seen nice new buildings to support parts of my district while old dilapidated buildings from the 50's in other parts of the district maybe get a new coat of paint. You really have to get into the details on a district by district basis to see the real issues.",
            "title_similarity": "0.6585674",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hxqkncw",
            "score": 1,
            "text": "This should be pretty obvious to a point, which is precisely why a certain political party likes to defend education.  Well educated people tend to lean left, question the status quo, are more prone forward thinking than trying to pretend it's still the frontier days, and they generally demand more equality.  They're also harder to sucker.",
            "title_similarity": "0.6609302",
            "sentiment_compound": 0.765
        },
        {
            "id": "hxqkofu",
            "score": 1,
            "text": "It's critical those resources are distributed inversely proportional to the property taxes in the area. This is not a \"lift all boats\" matter. There is a consistent pattern of anti-competitive education budgeting which has children in affluent areas receiving *considerably* more resources. Even though it's all *publicly funded* education.\n\nThey don't want to be paying for the education of the kid who will compete with their kid. But at the very same time, gamifying the housing market for a lower cost zipcode but higher budget school district has been the name of the game for decades. It's only when it applies in reverse that it becomes a problem for anyone.\n\nProperty values and education budgets should be considered completely distinct and irrelevant from one another.",
            "title_similarity": "0.81144",
            "sentiment_compound": -0.544
        },
        {
            "id": "hxqks4h",
            "score": 1,
            "text": "After meeting my wife who has taught high school for over 10 years.. it became apparent to me that the education system needs an absolute overhaul. It is nearly a useless and glorified babysitting system. It's really pathetic.",
            "title_similarity": "0.5685388",
            "sentiment_compound": -0.5413
        },
        {
            "id": "hxqksfj",
            "score": 2,
            "text": "They had to do a study on this? Dude. We all knew this.",
            "title_similarity": "0.25196296",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqktys",
            "score": 1,
            "text": "\"Additional spending on operations, such as teacher salaries and support services, positively affected test scores, dropout rates, and postsecondary enrollment. But extra capital expenditures on new buildings and renovations had little impact.\"\n\nAs a teacher it is so frustrating to constantly be told they can't pay you more or hire more support faculty or teachers with bond money, all while seeing these multi million dollar facilities constantly being built that literally do nothing for student outcomes.",
            "title_similarity": "0.8087051",
            "sentiment_compound": 0.2667
        },
        {
            "id": "hxqlqw4",
            "score": 1,
            "text": "Well unfortunately conservatives know this and try their hardest to kill educational funding.",
            "title_similarity": "0.39042506",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hxqlxzj",
            "score": 2,
            "text": "The US already spends alot on education.  The problem, like usual, is where the money is spent.  Faaar too much funding doesn't go directly to teachers and their classrooms.  It pays salaries of administrators and middlemen who spend way too much time justifying their jobs.  And far too much goes into the pockets of private companies who convince said administrators that 'their' system is worth the absurd amounts of money they charge.\n\nTeachers should be paid enough that it attracts good talent. And those teachers shouldn't have to continually pay money out of their meager salary to improve their classroom in the most minimal aspects.",
            "title_similarity": "0.74848866",
            "sentiment_compound": 0.9118
        },
        {
            "id": "hxqmm5d",
            "score": 1,
            "text": "Kansas City Schools Desegregation Experiment. \n\nThey spent a ton on everything, and showed little for it. Showing a diminishing return on education spending.",
            "title_similarity": "0.69927585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqnd8a",
            "score": 2,
            "text": "NEW research shows that giving MONEY to POOR people makes them HAPPIER and society IMPROVES\n\nStay tuned for next year's pilot study",
            "title_similarity": "0.728477",
            "sentiment_compound": 0.7378
        },
        {
            "id": "hxqo8bf",
            "score": 1,
            "text": "In some cases the buildings needed upgrades to protect children's health however, no? Mold remediation, lead paint, outdated HVAC systems/poor ventilation, etc. Of course, I would assume in many cases construction is happening unneccessarily or as a result of corruption.",
            "title_similarity": "0.6222768",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hxqoxkn",
            "score": 1,
            "text": "We need buildings though.  I wonder what happened in the 60s to build so many facilities, but we need it again.",
            "title_similarity": "0.5175834",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqoy0l",
            "score": 2,
            "text": "I'd just like the chime in that educational success (while obviously very important) isn't the only factor that should be considered. Our local high school has had humidity problems since it was built, and at this point is so full of mold, that it needs to be completely replaced. No it probably won't improve test scores or drop out rates, to do so, but no child should have to compromise their health for their education.",
            "title_similarity": "0.74474335",
            "sentiment_compound": -0.458
        },
        {
            "id": "hxqozpq",
            "score": 1,
            "text": "But the kids graduating are dumber than ever.",
            "title_similarity": "0.43710026",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hxqpeju",
            "score": 2,
            "text": "It never gets to the problem or source they say it does. It goes directly to the pockets of city councils and politicians. Let’s be real here.",
            "title_similarity": "0.33315858",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hxqpkoy",
            "score": 2,
            "text": "We really need to tear the system down and rebuild it with a modern mindset. Schools are setup to create obedience in a workplace and kill free thought. \nThey teach nothing useful you can scrap half the subjects and problem solved. Even better replace those with useful skills! Money management, financing, life savings, how insurance works and why it’s important \nTons of better subjects",
            "title_similarity": "0.60716695",
            "sentiment_compound": 0.7569
        },
        {
            "id": "hxqpw8q",
            "score": 1,
            "text": "More money to teachers means more competition for the position means better qualified teachers means students enjoy school and learn more. \n\nAs a teacher myself, I am far more motivated working in a higher paying school district than when I was in my previous position. And my supervisors are more motivated to run a better school.",
            "title_similarity": "0.7661825",
            "sentiment_compound": 0.9391
        },
        {
            "id": "hxqq8cy",
            "score": 1,
            "text": "Weird. Take care of the people who care for your children, increase of results. Build a ridiculously overpriced football arena?? No results. Still scratching my head over outcome.",
            "title_similarity": "0.60316133",
            "sentiment_compound": 0.5803
        },
        {
            "id": "hxqqdae",
            "score": 1,
            "text": "but how can I feel good about my taxes if I can't see the effects of them from inside my car???",
            "title_similarity": "0.53844374",
            "sentiment_compound": 0.6586
        },
        {
            "id": "hxqqhtw",
            "score": 1,
            "text": "Yeah but buildings and renovations is how rich America gets richer at the local scale.",
            "title_similarity": "0.57552135",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hxqqqo1",
            "score": 1,
            "text": "Almost like that extra football stadium didn't matter... \n\nImagine if instead of spending $5M on a building, the old buildings - that are made of brick - got minor upgrades (HVAC, ethernet/WiFi, projectors - though much of this was likely in place years ago) for 1/5th the amount and the remaining $4M went into an endowment. 5% market returns above inflation is ~200k a year. That's what... 3 teachers a year including taxes and benefits?",
            "title_similarity": "0.6680064",
            "sentiment_compound": 0.5766
        },
        {
            "id": "hxqr7vq",
            "score": 1,
            "text": "And no one was surprised.\n\nBuildings don't teach kids.",
            "title_similarity": "0.4201705",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hxqr9yi",
            "score": 1,
            "text": "Interesting bc my kid is on his 3rd fundraiser this year",
            "title_similarity": "0.42000905",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hxqrati",
            "score": 1,
            "text": "Putting money into schools is the best investment a government can make. Simple as that.",
            "title_similarity": "0.6494864",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hxqrj7p",
            "score": 1,
            "text": "Our school board is taking away teacher/custodial bonuses and approved new cell phones for the school board. Very upsetting",
            "title_similarity": "0.56026816",
            "sentiment_compound": 0.4601
        },
        {
            "id": "hxqs3xi",
            "score": 1,
            "text": "Hmmm, when we spend less on buildings and renovations the poor kids seem to get sick and die more frequently resulting in an upswing in test scores. I think we’re on to something here Johnson.",
            "title_similarity": "0.6086061",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hxqshk4",
            "score": 1,
            "text": "this is outrageous how have the Republicans allowed this to happen????",
            "title_similarity": "0.3323028",
            "sentiment_compound": -0.6072
        },
        {
            "id": "hxqsr9u",
            "score": 1,
            "text": "Just read japanese kids cook for each other.  In my opinion, we should teach the kids how to cook for 12 yrs, let them make lunches for each other.  State can pay for it.  They can take it out of the salaries of the superintendents.  Healthier kids means lower healthcare costs later, we save billions.",
            "title_similarity": "0.68747276",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hxqtf17",
            "score": 1,
            "text": "Gee, it’s almost like getting paid what you deserve will boost moral for that person therefore boosting overall moral. If you love your job and act like it, it will show. If you love your job, act like it, and get paid what you feel your worth is or more, you’ll inspire.",
            "title_similarity": "0.55494857",
            "sentiment_compound": 0.9766
        },
        {
            "id": "hxqtiyr",
            "score": 1,
            "text": "Isn't that like common knowledge since 10 years ago?",
            "title_similarity": "0.35475022",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hxqv84k",
            "score": 1,
            "text": "Buildings make for great photo ops. Bringing a teacher from poverty and clinical depression to a more stable and sustainable state of living is harder to slap onto a campaign website or air the news. There are also way fewer teachers lobbying for that money than construction contractors. Go figure",
            "title_similarity": "0.7759653",
            "sentiment_compound": -0.0276
        },
        {
            "id": "hxqwbsh",
            "score": 1,
            "text": "You don't understand, we need that second stadium",
            "title_similarity": "0.2869833",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqx9on",
            "score": 1,
            "text": "Thats nice for short term metrics, but I'm glad we moved classes out of the old asbestos filled high school to remodel it and repurpose it for another elementary/middle school with smaller class sizes.\n\nSometimes the new building is a good and necessary move even if it doesn't qauntify well.",
            "title_similarity": "0.7752787",
            "sentiment_compound": 0.819
        },
        {
            "id": "hxqxe9a",
            "score": 1,
            "text": "we have two high schools in our area that were built in the 50s and are literally falling apart.  they are dirty, old, have contaminated drinking water, are infested with bugs, have derelict athletic facilities, and are just really dark, terrible, depressing places to be.\n\ni don't care if physical plant upgrades improve test scores.  kids shouldn't have to go to places like that for school.",
            "title_similarity": "0.49342954",
            "sentiment_compound": -0.7888
        },
        {
            "id": "hxqyjsc",
            "score": 1,
            "text": "We already knew this though.",
            "title_similarity": "0.0699105",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxqzlsb",
            "score": 1,
            "text": "I mean as a kid who gives a damn how fancy the buildings look compared to the actual experience.",
            "title_similarity": "0.45105237",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hxr08yx",
            "score": 1,
            "text": "The US spends the most per student in the developed world and is way behind a large swath in scores. Spending billions with no ROI is ridiculous.",
            "title_similarity": "0.5966622",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hxr20yl",
            "score": 1,
            "text": "Big surprise, good teachers that are maintained by good pay works better than a polished floor for education",
            "title_similarity": "0.68882",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hxr2b7v",
            "score": 1,
            "text": "Somebody spent money to RESEARCH this?",
            "title_similarity": "0.3335474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxr2s88",
            "score": 1,
            "text": "So the new football stadiums for losing football programs don’t increase test scores? Huh. I’ll be damned.",
            "title_similarity": "0.61435854",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hxr3gut",
            "score": 1,
            "text": "Hahaha no I have less supplies, 500 dollars raisers a year, and countless less funding for so many things",
            "title_similarity": "0.5054369",
            "sentiment_compound": 0.34
        },
        {
            "id": "hxr3l3w",
            "score": 1,
            "text": "This guy sounds...questionable? \n\n> > Jason Baron: I became very interested in this question when I started reading and **was shocked at the fact that there was a big debate among economists about the effects of school funding**. \n\nHas he spent any time around economists?",
            "title_similarity": "0.63999665",
            "sentiment_compound": 0.2624
        },
        {
            "id": "hxr4fpt",
            "score": 1,
            "text": "There is some real weasel word usage of \"narrowly\" in this study. It seems he's associating the margin of victory of the funding passage with the outcomes? Anyone can elaborate or dispel me of that interpretation?",
            "title_similarity": "0.49509993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxr5ieo",
            "score": 1,
            "text": "This is just an attempt at making the public it’s an either or choice when it doesn’t have to be. We can fund enough teachers appropriately and make sure our schools aren’t falling apart.",
            "title_similarity": "0.67382026",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hxr5kb2",
            "score": 1,
            "text": "That's all fine and dandy but funding is hardly at the forefront of problems with the education system",
            "title_similarity": "0.6628466",
            "sentiment_compound": -0.4854
        },
        {
            "id": "hxr671q",
            "score": 1,
            "text": "But the crumbling buildings NEED fixed! Or closed and new ones built. The ventilation is terrible. Ceilings are literally falling in. Mold is everywhere. It’s appalling that children and their educators are treated this way and expected to learn in these conditions.\nOh, and educators need to be paid as the well educated, professionals they are.",
            "title_similarity": "0.5427635",
            "sentiment_compound": -0.7871
        },
        {
            "id": "hxr6t9e",
            "score": 1,
            "text": "I think the difference is not a clear as the title is making it out to be and ignoring the context.  It stands to reason, that the schools choosing to invest in capitol improvements are in quite a different situation than the schools choosing to spend their available funds on staff.  At a certain point, affluent schools will somewhat max out on the academic performance of their students.  They will build new facilities not for the intention of improving scores, but maintaining top scores, as well as being a competitive community for new homebuyers etc.",
            "title_similarity": "0.77520925",
            "sentiment_compound": 0.762
        },
        {
            "id": "hxr79in",
            "score": 1,
            "text": "So you're saying if we invest in education, there are actual benefits? Like better outcomes such as measurable student happiness, better quality of life for students and teachers? Higher quality of education? Color me shocked.\n\nSorry, I get angry about this because usually the first item slashed in a budget is education, and then people wonder why things keep getting worse.",
            "title_similarity": "0.7993234",
            "sentiment_compound": 0.6298
        },
        {
            "id": "hxr7bir",
            "score": 1,
            "text": "\"New research\", you mean all of europe for the past 20 years ?",
            "title_similarity": "0.36003706",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxr7dn3",
            "score": 1,
            "text": "Glad we have evidence that paying for better people is better than paying for better bricks.",
            "title_similarity": "0.594974",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hxr7q45",
            "score": 1,
            "text": "It’s simple, they want to invest into the monument that is the school campus.",
            "title_similarity": "0.45877558",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hxr7qpf",
            "score": 1,
            "text": "I sure wish they had figured this out years ago when I was in school. I remember (no joke) we had a few teachers who couldn't assign us homework because there were not enough books for all the students. As a kid it was great, but looking back as an adult... wow.",
            "title_similarity": "0.6928395",
            "sentiment_compound": 0.8968
        },
        {
            "id": "hxr7z8h",
            "score": 1,
            "text": "Pay attention to your local schools district spending. Mine is buying up land like its no ones business.",
            "title_similarity": "0.531099",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hxr8g7q",
            "score": 1,
            "text": "My high school had a 40+% truancy rate in 2013 and that was an improvement, I couldn't imagine how much of a hell it is during Covid",
            "title_similarity": "0.6675527",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hxr943v",
            "score": 1,
            "text": "Guess they missed that memo here in Arizona where public education seems to be an afterthought.",
            "title_similarity": "0.5414678",
            "sentiment_compound": -0.296
        },
        {
            "id": "hxr9c62",
            "score": 1,
            "text": "This article seems to be slightly off topic as it deals with scientific topics.  The US already had high spending per student at $14,100.  Source:\n\nhttps://nces.ed.gov/programs/coe/indicator/cmd\n\n> In 2017, the United States spent $14,100 per full-time-equivalent (FTE) student on elementary and secondary education",
            "title_similarity": "0.663542",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hxr9zt3",
            "score": 1,
            "text": "Is this really a study",
            "title_similarity": "0.18866803",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxra0md",
            "score": 1,
            "text": "It’s almost like higher pay attracts better workers",
            "title_similarity": "0.54701245",
            "sentiment_compound": 0.7698
        },
        {
            "id": "hxra2tq",
            "score": 1,
            "text": "Never ask \n...a woman her age\n...a man his salary\n...a teacher's union why they oppose performance based bonuses",
            "title_similarity": "0.4901386",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hxra4p5",
            "score": 1,
            "text": "So the renovation to get rid of the Mold had little impact on learning?",
            "title_similarity": "0.6472162",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxrauh7",
            "score": 1,
            "text": "So you're telling me that the walls don't teach kids?",
            "title_similarity": "0.36295086",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxrclco",
            "score": 1,
            "text": "That is why investing in a personal trainer will yield more results than investing in weights :)",
            "title_similarity": "0.66293234",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hxrcppt",
            "score": 1,
            "text": "To be fair, many buildings across the country can't exactly just hire new staff, because there's be nowhere to put them. As it is, we have students seeing their speech and language pathologists in the copy room in the back of the library. It's sort of a travesty",
            "title_similarity": "0.54868585",
            "sentiment_compound": -0.4005
        },
        {
            "id": "hxrctg2",
            "score": 2,
            "text": "Spending money on education produces better humans? Shocking!",
            "title_similarity": "0.6405995",
            "sentiment_compound": 0.126
        },
        {
            "id": "hxrd4mq",
            "score": 1,
            "text": "Wait, are you telling the 20 foot statue of a naked man sitting on a square rock that cost $200,000 didn't improve test scores?",
            "title_similarity": "0.42280775",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hxrdctg",
            "score": 2,
            "text": "Investing in education actually pays off? Who knew…",
            "title_similarity": "0.6494151",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxrdnhm",
            "score": 2,
            "text": "Today obvious science is on point.",
            "title_similarity": "0.2631095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxrdtta",
            "score": 1,
            "text": "Buildings don’t do the teaching, the teachers do.",
            "title_similarity": "0.3989544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxrexlc",
            "score": 1,
            "text": "It’s sad that someone had to do a study to prove the obvious…",
            "title_similarity": "0.3481621",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hxrgk58",
            "score": 1,
            "text": "Building renovations ≠ superior education\n\nPrimary exhibit is how developing countries students do better math than US.",
            "title_similarity": "0.7495662",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hxrhd69",
            "score": 1,
            "text": "And most spending was on new buildings, renovations, and administrators ran off with the rest of the \"covid-19\" funds.",
            "title_similarity": "0.5539116",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxri4zf",
            "score": 1,
            "text": "It's almost as if buildings don't educate children...",
            "title_similarity": "0.36709264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxrjbci",
            "score": 1,
            "text": "On the flip side, the students of the largest urban Public Schools systems in the US face significant environmental Harvard’s: Lead in drinking water, asbestos that’s not properly designated, reported or removed, mold, Legionella bacteria, indoor air quality issues, etc. Funds for maintenance and environmental issues are important to keep students and staff safe",
            "title_similarity": "0.6486083",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hxrjrrs",
            "score": 1,
            "text": "Cool but would be cooler if we didn't use test scores as a key metric",
            "title_similarity": "0.522748",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hxrkb2b",
            "score": 1,
            "text": "Almost all teachers have been saying that for decades.",
            "title_similarity": "0.26816502",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxrku28",
            "score": 1,
            "text": "Do you have to be a scientist to realize that there is a delay in seeing the results of deferred maintenance?",
            "title_similarity": "0.48653683",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hxrm052",
            "score": 1,
            "text": "So money improves test scores? Is it we need more teachers or do teachers teach better for more money? What if a school has enough teachers will money improve the scores?",
            "title_similarity": "0.78933924",
            "sentiment_compound": 0.8562
        },
        {
            "id": "hxrm2v9",
            "score": 1,
            "text": "One of the points that is never given enough attention is the need for resources for elective classes such as art, music, and shop classes. One of the most important ways to reduce dropouts is to ensure the non-college bound students have a reason to stay in school. If they are taking classes which interest them or which are building practical skills, they are more likely to stay in school than if all the classes are purely academic and don't offer much which the students view as valuable after graduation. \n\nBased on the author's very limited data set, the conclusion makes sense. Putting more money into the human resources that support the student is going to have a greater impact than updating the building, or even a new building.\n\nHowever, I feel like the study fails to get to what really matters. Having more well qualified and well compensated teachers is part of the issue. But you also have to make sure those teachers have adequate modern facilities with modern technology.",
            "title_similarity": "0.7606745",
            "sentiment_compound": 0.9184
        },
        {
            "id": "hxrm3u2",
            "score": 1,
            "text": "Wow! Thank you science!!",
            "title_similarity": "0.3020774",
            "sentiment_compound": 0.8007
        },
        {
            "id": "hxrmimm",
            "score": 2,
            "text": "Not here in Sarasota Florida...our legislature decided \"punishing\" School districts that installed a mask mandate at the beginning of the year to the tune of 200 million LESS dollars more important than educating kids.  Republicans...all for local rule and small government  and freedom...unless they disagree.",
            "title_similarity": "0.5973346",
            "sentiment_compound": -0.5734
        },
        {
            "id": "hxrpz7l",
            "score": 1,
            "text": "I can only speak to personal experience as a student the building being cold in winter and hot in summer definitely negatively impacted my scores.",
            "title_similarity": "0.52340597",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hxrqfjh",
            "score": 2,
            "text": "Who would’ve thought funding teachers would improve teaching. Crazy how that works, isn’t it?",
            "title_similarity": "0.6277942",
            "sentiment_compound": 0.128
        },
        {
            "id": "hxrqlsl",
            "score": 1,
            "text": "I’ve been a public school teacher for 16 years. Weird how my students do better when I don’t have to work a second job.",
            "title_similarity": "0.5968979",
            "sentiment_compound": 0.296
        },
        {
            "id": "hxrr517",
            "score": 1,
            "text": "What about when your Governor cuts your school’s funds when they have the audacity to try to keep students, teachers, and their families from dying?",
            "title_similarity": "0.5065861",
            "sentiment_compound": -0.296
        },
        {
            "id": "hxrsfnd",
            "score": 1,
            "text": "Problem is it will not go to teachers salaries and resources.   The Superintendents and other upper administrative staff like the principals all will get really nice raises.",
            "title_similarity": "0.7386333",
            "sentiment_compound": 0.4391
        },
        {
            "id": "hxrues0",
            "score": 2,
            "text": "Everyone who is against this should be required to watch HBO's The Wire, especially Season 04.\n\nNot saying I was like that, but it really opened up my eyes more than usual after I watched the school arc.",
            "title_similarity": "0.5708928",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hxrug5r",
            "score": 2,
            "text": "It’s almost like actually caring about human well-being results in better work output!",
            "title_similarity": "0.5498849",
            "sentiment_compound": 0.8093
        },
        {
            "id": "hxrvqv7",
            "score": 1,
            "text": "This is important. Buildings don’t improve education.",
            "title_similarity": "0.3969081",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hxrvwhp",
            "score": 2,
            "text": "I’m a teacher, I saw no raise.  If I did though, it would help me be a better teacher.  It’s easier to focus on teaching when I’m not counting the days until I get paid again so I can buy food.",
            "title_similarity": "0.7068211",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hxry4xs",
            "score": 1,
            "text": "Now how much red tape, and scratched palms does the money have to go thru before schools actually get it. Because you can say \" yeah, budget increased by 1 billion! , Then by the time it gets to the actual schools it's more like 50 million.",
            "title_similarity": "0.5808126",
            "sentiment_compound": 0.7495
        },
        {
            "id": "hxry6dh",
            "score": 1,
            "text": "I’m guessing no one here has ever even heard of school choice.",
            "title_similarity": "0.31199348",
            "sentiment_compound": -0.296
        },
        {
            "id": "hxryb81",
            "score": 1,
            "text": "Must be a different US from the one I'm in.",
            "title_similarity": "0.11100857",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxrydme",
            "score": 1,
            "text": "And Florida is trying to rip out 200mil from public schools who enforced mask policies.. Yay for private schools I guess?",
            "title_similarity": "0.41005173",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hxrz26m",
            "score": 1,
            "text": "This won’t change “conservatives’”minds on funding education. If anything, it will make them double down",
            "title_similarity": "0.793942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxrzlhy",
            "score": 1,
            "text": "Where I live new schools are usually built for just a handful reasons:\n\n* They neglected the living crap out of older schools so they could bring in engineers who would then write up a report condemning the school as not worth repairing. \n* They want to name a school after some old politician or social influence who's family has connections with the ruling party.\n* They want to hand a juicy construction project to their favourite contractor.\n* Politicians and senior bureaucrats think they are architects and love to spend 10s of millions on building things. It gives them a legacy even if it isn't their names on the buildings (maybe a library or gymnasium). They love the importance they feel overseeing these massive budgets even though the biggest construction project they oversaw was a kitchen renovation and they ended up picking tile and cupboard colours which induce a vague sense of nausea and the dishwasher is clear across the kitchen from where they store plates and other dishware.  \n* It makes them look like they are doing something. When people complain the education system is crap they can point to to 150 million they spent building various schools. I believe they call this rearranging the deckchairs on the titanic.\n* Stakeholders. For real educational reform and improvement you have to deal with a crapload of stakeholders. There are groups who want their thing taught. There are groups who don't want something taught. There are unions. There are people who just don't like change. There are consultants who have things like \"new math\" which will solve all problems (I think I have seen 4 \"new maths\"). There are textbook companies. The list goes on and on. \n\nThis last one means that by just building a new school you don't have to worry too much about too many stakeholders; most of the above BS doesn't change with a new building.\n\nThere are two horrible realities. Education reform is super easy to understand. People here and there have figured out fantastic things. Yet.... Education reform is super easy to screw up. One very interesting fact in education is classroom size better for every kid below a class size of 21. That is, 19 is way better than 21 and 17 is way better than 19. But 30 isn't much worse than 21 and 50 isn't really that much worse than 21 or 30. So, California mandated a class size of 25 at one point. Sounds great. Except it wasn't below 21 so it was mostly a waste of time. Even worse they had to bring in a massive horde of often unqualified teachers. Thus, the budget went up, average teacher quality went down. Other costs such as number of classrooms soared; and based on pretty solid science, nothing much could have been accomplished anyway.\n\nI really don't think most of the above \"stakeholders\" give two craps about the kids resulting educations (outcomes); they care about their own little kingdoms, issues, or pocketbooks.",
            "title_similarity": "0.6950155",
            "sentiment_compound": 0.9849
        },
        {
            "id": "hxs0l7s",
            "score": 1,
            "text": "There was a study that found every dollar invested in children under ten paid off 6x down the road.\n\nHow are we even still discussing whether or not we're spending too little? I imagine we have a long long way to go before we're \"wasting money\"\n\nEven if fiscally conservative (not a real thing in my opinion, just an excuse) this pays for itself.",
            "title_similarity": "0.72221696",
            "sentiment_compound": -0.34
        },
        {
            "id": "hxs16us",
            "score": 1,
            "text": "My LSD would rather pour their money into sports. Need new text books? Can't do it. Need to renovate the weight room and other sports facilities? No problem.",
            "title_similarity": "0.6035892",
            "sentiment_compound": 0.3855
        },
        {
            "id": "hxs2suo",
            "score": 1,
            "text": "They needed research this? Seems pretty obvious to anyone who has spent any time in a school.",
            "title_similarity": "0.48258325",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hxs3tnm",
            "score": 1,
            "text": "The problem is that 40 ish % of school funding comes from local tax payers. Which is why poor people make for poor schools. And rich people make for rich schools. A bi product of increasing poor peoples income is the natural increase in school funding as well.",
            "title_similarity": "0.72503734",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hxs3v4e",
            "score": 1,
            "text": "“New buildings and renovations had little impact” yet so many schools love to do thay",
            "title_similarity": "0.73598367",
            "sentiment_compound": 0.6666
        },
        {
            "id": "hxs3xb4",
            "score": 1,
            "text": "But then how will administrators feel like big shots???",
            "title_similarity": "0.34923732",
            "sentiment_compound": 0.5845
        },
        {
            "id": "hxs46dh",
            "score": 1,
            "text": "Did you say positive dropout rates?",
            "title_similarity": "0.532763",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hxs71xo",
            "score": 1,
            "text": "That's great and all but I wish that was happening when I was in school. Public school lunches still haunt me.",
            "title_similarity": "0.60154545",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hxs73hm",
            "score": 1,
            "text": "Lets be real. More money generally means more of everything. The problem is who's gonna pay for it?",
            "title_similarity": "0.5201696",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hxs7dip",
            "score": 1,
            "text": "Giving public schools more funding improves education??? Wow! Who would have guessed other than everyone and their mother..",
            "title_similarity": "0.7846631",
            "sentiment_compound": 0.8782
        },
        {
            "id": "hxs873d",
            "score": 1,
            "text": "In my JR and SR year of high school, they allocated a massive amount of funds to build a new expensive wing for the ticket booths and entrance to the indoor basketball courts.\n\nYears later, I talked with a coworker who’s now a senior there and asked her how much they use the new wing. It still isn’t used, and they primarily do ticket sales online than in person. She says the doors there are always locked. Meanwhile the music rooms and art classes are falling apart.",
            "title_similarity": "0.6039887",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hxs9vgt",
            "score": 1,
            "text": "You mean that the 6 million dollar gym built by the superintendents son, right next to the fully operational gym we already had, didn't make the school better for students? \n\nThen what was the point of us shutting down orchestra?",
            "title_similarity": "0.6135824",
            "sentiment_compound": 0.504
        },
        {
            "id": "hxsbbgc",
            "score": 1,
            "text": "Yeah, but how will we trick them to vote for awful politicians?",
            "title_similarity": "0.37166265",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hxsd94i",
            "score": 1,
            "text": "Oh weird, who knew if you paid your teachers more, they might be motivated to give more effort.",
            "title_similarity": "0.658867",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hxseplo",
            "score": 1,
            "text": "I know this isn't referring to florida, we do the opposite in the face of schools that required to wear masks for children's safety",
            "title_similarity": "0.4487875",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hxsflr3",
            "score": 2,
            "text": "Wow. Who would've thought being fairly compensated for a job you love, means you have less stress and a better educator/communicator?\n\nThe mind is boggled.",
            "title_similarity": "0.70262647",
            "sentiment_compound": 0.8553
        },
        {
            "id": "hxsg367",
            "score": 2,
            "text": "They really had to do research to figure that one out? Come on.",
            "title_similarity": "0.32397866",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxshhql",
            "score": 1,
            "text": "Gee, who woulda thunk?",
            "title_similarity": "0.04828116",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxshipp",
            "score": 1,
            "text": "Yes. More of this please. Schools are underfunded",
            "title_similarity": "0.50362396",
            "sentiment_compound": 0.6863
        },
        {
            "id": "hxshwac",
            "score": 2,
            "text": "But what about administrative bloat",
            "title_similarity": "0.15804082",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxsi6zr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.045050018"
        },
        {
            "id": "hxsiv4r",
            "score": 2,
            "text": "Probably still worth it to remove the rest of the asbestos and lead paint and replace all the lead piping though",
            "title_similarity": "0.49201363",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hxsjbzi",
            "score": 2,
            "text": "Only so much you can do when the families don’t believe education.",
            "title_similarity": "0.484672",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxsjkut",
            "score": 2,
            "text": "How about the football budget, lord knows every school I went to found a way to get every penny their teams wanted",
            "title_similarity": "0.45792127",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxsl1i4",
            "score": 1,
            "text": "You can teach people in a box, but can't teach 'em without teachers",
            "title_similarity": "0.5233942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxsmk3q",
            "score": 1,
            "text": "that all makes sense, but in my part of the country, our public schools have failing AC in the warm months, failing heat in the cold months, and crumbling walls. i think investing in that stuff would make a difference, at least in teacher retention if not also student success",
            "title_similarity": "0.7603379",
            "sentiment_compound": -0.9108
        },
        {
            "id": "hxsmmce",
            "score": 1,
            "text": "\"We found that putting money into something will make it work better!\"",
            "title_similarity": "0.58493924",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hxso48t",
            "score": 1,
            "text": "Does that mean they will finally teach proper sex education or are conservative men still terrified of learning about vaginas?",
            "title_similarity": "0.55343574",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hxss0bt",
            "score": 1,
            "text": "Wait, so increasing pay and making the field more competitive results in better teachers, and a more engaged tenured staff? Crazy.",
            "title_similarity": "0.6654414",
            "sentiment_compound": 0.5869
        },
        {
            "id": "hxssnqj",
            "score": 1,
            "text": "We have property tax supposedly going toward schools and lottery money supposedly going toward schools but the amount of money the schools want from parents keeps going up. When my mom was a kid the school supplied all the paper, pencils, books etc…. When I was a kid they had a boom free of charge for each subject and supplied a lot of worksheets etc… Now they expect you to buy all supplies and most of the time the kids doing even get books to take home. Also a huge amount of stuff is online so if you’re low income and don’t have internet you’re screwed. Where the hell is all the money going?",
            "title_similarity": "0.701849",
            "sentiment_compound": -0.7843
        },
        {
            "id": "hxsy9db",
            "score": 1,
            "text": "When the Lotto came back to California it was pitched as a way to double the budget of the schools. Once they passed it all that happened was the original was taken away leaving the schools in the same predicament as before but now there is the California State Lotto.",
            "title_similarity": "0.709921",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hxt0fni",
            "score": 1,
            "text": "Can i have the source plz ?",
            "title_similarity": "0.061627652",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hxt0n7v",
            "score": 1,
            "text": "It's almost like the building (assuming it's functional) isn't the part I interacted with the most.",
            "title_similarity": "0.44886824",
            "sentiment_compound": 0.2975
        },
        {
            "id": "hxt3kra",
            "score": 1,
            "text": " I really think that taking a look at where education funds are being spent is as important as raising funds.",
            "title_similarity": "0.5382965",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hxt83qa",
            "score": 1,
            "text": "Do you need researches to figure out this?? Kkkkkkkkk",
            "title_similarity": "0.23432305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxt8m1e",
            "score": 1,
            "text": "Nooooooo shiiiiiiiiiit.",
            "title_similarity": "0.049061865",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxtdvcf",
            "score": 1,
            "text": "I saw a post yesterday that said Florida pulled $200m in school funding as punishment for not following mask mandates.",
            "title_similarity": "0.49099064",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hxte1ns",
            "score": 1,
            "text": "Wow, that's crazy how that works! Who could've guessed that?",
            "title_similarity": "0.19009486",
            "sentiment_compound": 0.4003
        },
        {
            "id": "hxtf4jm",
            "score": 1,
            "text": "Those come from government contractors, like commercial construction companies.",
            "title_similarity": "0.4422046",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hxtgiub",
            "score": 1,
            "text": "oh wow who would have guessed this not anyone who has gone to public school in the last 20 or so years deffinatly.\n\nwhen I was in school I failed geometry twice because they gave me the same teacher both times and all she ever did was play movies off Netflix all day so when it came time for test no one was prepared unless they did homework and as someone with adhd I couldnt do it in class and after school I had homework from all of my classes I had no time to learn everything I had to pick and choose what I'd get a good grade in because I had to teach myself in high school!",
            "title_similarity": "0.55115056",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hxtjdpf",
            "score": 1,
            "text": "It just needs to be spent more efficiently.",
            "title_similarity": "0.40836778",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hxtjtc7",
            "score": 1,
            "text": "Wait, if teacher salaries affect so many things...all in?",
            "title_similarity": "0.50273776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hxtnnom",
            "score": 1,
            "text": "In our district an extraordinary amount of the pandemic emergency funds was spent on technology, smart boards for EVERY classroom, including the gym. $3,000 dollars a pop. Meanwhile the school board and teacher union are butting heads over health benefits and salaries. And the shortsighted board did not approve the first raise to substitute pay in 5 years until October 2021.",
            "title_similarity": "0.60336906",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hxtvtey",
            "score": 1,
            "text": "Wow who would’ve thought more money in education meant better education. Incredible find.",
            "title_similarity": "0.6842949",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hxu7wos",
            "score": 1,
            "text": "W-w-w-WHAT?! People who enjoy their job do it better?! Impossible!",
            "title_similarity": "0.4845644",
            "sentiment_compound": 0.8093
        },
        {
            "id": "hxurpv2",
            "score": 1,
            "text": "Seeing how China is overtaking US in certain tech disciplines, it should be a national security issue for the US to improve the education system.",
            "title_similarity": "0.6112603",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hxwxf0n",
            "score": 1,
            "text": "Didn’t need to do a study to figure that one out…",
            "title_similarity": "0.29975522",
            "sentiment_compound": 0.0
        },
        {
            "id": "hy0c5hz",
            "score": 1,
            "text": "My school (Canadian) thinks adding more new areas will distract us from a lead filled basement and crumbling classrooms and bathrooms",
            "title_similarity": "0.5317439",
            "sentiment_compound": -0.296
        },
        {
            "id": "i0hj4or",
            "score": 1,
            "text": "I find it funny that everyone is on about how the construction companies are lobbying to get all this construction money and how this article \"proves how useless most of that infrastructure improvement is\" when 2 things are true. The first thing is if you READ the article and what he says, he is suggesting he doesn't know enough about the impact renovations and buildings have on these statistics. He spoke even about the conditions of the buildings of his first schools here in America and how he is not sure what it's impact is on dropout rates because his was so nice.\n\nTake a bit more time to read past the misleading headline, he said there is the likelihood the renovations have more impact than he knows.\n\nSecond point, if in a school renovation project, it's all about lobbyists and their kickback, then why aren't more people up in arms about those same companies and many more that could be seen as larger lobbyists when it comes to Build Back Better? You can't scream lobbyist at one and ignore the much larger one.",
            "title_similarity": "0.7149383",
            "sentiment_compound": 0.8027
        }
    ]
}