{
    "Humans can't endure temperatures and humidities as high as previously thought. The actual maximum wet-bulb temperature is lower — about 31°C wet-bulb or 87°F at 100% humidity — even for young, healthy subjects. The temperature for older populations, is likely even lower.\n": [
        {
            "id": "hzfwelb",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue to be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.38530022",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hzfzlp5",
            "score": 2,
            "text": "Guess I'm fucked where I live in South France it easily gets 40 degrees Celsius in summer",
            "title_similarity": "0.43955773",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hzg07j4",
            "score": -16,
            "text": "Yet there are populations on Earth that live in more extreme conditions and have for millenia with no problems. \n\n It takes about a month to adapt to a new climate.  I have had to live in Arctic conditions and in heat and humidity conditions far more extreme than that.  The first few weeks to a month of transition is awful.  After that, its not a problem.\n\nReally what this study has proven, is that weather outliers are dangerous.  Ie sudden intense temperature spikes where there is no time or warning to be able to prepare and adapt for it.  We have seen this for years in places like Chicago that will have many temperate days intermixed with extreme heat/humidity conditions and people start to die.",
            "title_similarity": "0.58020985",
            "sentiment_compound": -0.5924
        },
        {
            "id": "hzg6a0u",
            "score": 10,
            "text": "Yeah, a couple things here. 1) Pennsylvania is dry as all get out, so if the subjects are from a dry place like PA, then they probably aren't acclimated to humidity.\n\n2) I wonder if it varies by elevation and region. When I lived on the second floor of a house in PA with no AC and 90 F outside, I got heat exhaustion symptoms. But when I played sports (soccer/futbol, softball) as a kid in Louisiana with 90 F and 80-90% humidity, I didn't experience any signs of heat exhaustion. But we also had AC at home and I drank water when possible.\n\nWithout an explanation of the methods of the study, I think it's difficult to determine what is actually happening here.",
            "title_similarity": "0.6682776",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hzg2ns7",
            "score": 1,
            "text": "They must have never been to southern Illinois in the summer then",
            "title_similarity": "0.4267866",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgb83n",
            "score": 0,
            "text": "Just to understand better. I have been in Florida outside all day while 100% humidity and over 87F. Was i hydrated enough? Was it that i did I not exert myself too much? What caused my survival?",
            "title_similarity": "0.64237857",
            "sentiment_compound": 0.533
        },
        {
            "id": "hzg2b1s",
            "score": 6,
            "text": "Tell that to the people in Houston, TX.",
            "title_similarity": "0.1426797",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzg1lhx",
            "score": 11,
            "text": "Have you even been to texas?",
            "title_similarity": "0.16448593",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzg4vps",
            "score": 2,
            "text": "Houstonian: “hold my beer”",
            "title_similarity": "0.24837703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzg6lpc",
            "score": 1,
            "text": "Central and south Florida would like a word.",
            "title_similarity": "0.14033487",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzhd50a",
            "score": 0,
            "text": "These people never lived in the Philippines, it’s 90f+ all year and always about 90% humidity too.",
            "title_similarity": "0.5357653",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgbx0e",
            "score": 4,
            "text": "I don’t think this study takes into a number of key factors including culture diversity location of clematized subjects. Did they randomly pull people out of equatorial regions around the world as they are used to living in hotter moisture climates? I personally live in Florida southern Florida to be exact I am constantly out in temperatures that far exceed that and I am perfectly fine as I’m acclimatized and used to it",
            "title_similarity": "0.5946281",
            "sentiment_compound": 0.743
        },
        {
            "id": "hzg6j1e",
            "score": 4,
            "text": "Don’t move to south central Texas or the gulf coast of Texas. Humidity and high temperatures are a norm.",
            "title_similarity": "0.48109692",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzg4rq6",
            "score": -1,
            "text": "Guess we will have to have mandatory lockdowns on days with 100% humidity than",
            "title_similarity": "0.6344449",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hzgdevv",
            "score": 0,
            "text": "I worked for 8 weeks in Papua New Guinea and it was 100% humidify and about 40-45*c. After living in the Uk for 15 years. It almost broke me",
            "title_similarity": "0.51291966",
            "sentiment_compound": -0.3626
        },
        {
            "id": "hzg3tnk",
            "score": 46,
            "text": "I survived two years in Caribbean Mexican summers, so I am a little skeptical -- what does \"endure\" mean in this context (and yes, I clicked through the link)? Is there some time limit or just \"can't live like that forever\"?",
            "title_similarity": "0.5436616",
            "sentiment_compound": 0.5012
        },
        {
            "id": "hzg6wgi",
            "score": 40,
            "text": "Pfft, that’s Singapore on a normal day",
            "title_similarity": "0.26978433",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgex7i",
            "score": -3,
            "text": "These people have never been to Louisiana or Texas during the summer. Shits 100% humidity and well over 90F.",
            "title_similarity": "0.56194115",
            "sentiment_compound": -0.25
        },
        {
            "id": "hzhd61c",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.2221661"
        },
        {
            "id": "hzgdhm3",
            "score": 1,
            "text": "So how many years till we are fucked.",
            "title_similarity": "0.3670334",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hzgrqkz",
            "score": 1,
            "text": "Having working in a Navy engine room, this is total bunk. 100-115°F @100%RH. Those are the standard underway, in all but the coldest waters.",
            "title_similarity": "0.40080965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgve2l",
            "score": 1,
            "text": "this is wrong i have worked in 95 f with 100 percent humidity. i was drinking  8-10 liters of water though",
            "title_similarity": "0.64269686",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hzh3iqr",
            "score": 13,
            "text": "So should no one be able to survive down here in Louisiana? There aren’t any days in the summer that cool and almost always above 90% humidity",
            "title_similarity": "0.6264846",
            "sentiment_compound": -0.046
        },
        {
            "id": "hzgi8dt",
            "score": 5,
            "text": "They only recruited 24 participants. Your skin and body changes over time to adapt to colder/hotter environments. Wouldn't that adaptation affect this study? They definitely don't seem to have controlled for it. Nor did they control for sunlight. I live in Central Florida and as long as I'm in the shade and not working out, I can stay out in 87 F wet bulb. Skin temperature remains above 90F for most people so as long as you're just existing and don't need extra cooling, as sweat can't evaporate, it seems like it should be possible to survive up to 90F temperatures.",
            "title_similarity": "0.7114365",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hzg10om",
            "score": 77,
            "text": "Honest question: doesn’t 100% humidity mean it’s raining?",
            "title_similarity": "0.56808555",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hzg8nve",
            "score": -3,
            "text": "\\*laughs in Houstonian*  \n...  \n\\*cries in Houstonian*",
            "title_similarity": "0.29295182",
            "sentiment_compound": 0.128
        },
        {
            "id": "hzga1ie",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.2221661"
        },
        {
            "id": "hzgb6r2",
            "score": -1,
            "text": "We must all die every summer here in Florida.  I have most certainly survived days of 87 degrees at 100 percent humidity, many of which were without Air conditioning as a child.  Nothing like a nice foggy day during the summer.",
            "title_similarity": "0.5967372",
            "sentiment_compound": -0.2664
        },
        {
            "id": "hzgcv7w",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.2221661"
        },
        {
            "id": "hzg4k58",
            "score": 4,
            "text": "Thankful I don’t live in the south, once again",
            "title_similarity": "0.39919055",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hzgfr3u",
            "score": 0,
            "text": "Everybody in Miami in the summer must be hearing otherwise",
            "title_similarity": "0.36590922",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzggm05",
            "score": 0,
            "text": "Huh. I worked in 80 F heat with 100% humidity last summer in long sleeves and pants. This would explain why I was so miserable.",
            "title_similarity": "0.6032866",
            "sentiment_compound": -0.6269
        },
        {
            "id": "hzghgfc",
            "score": 3,
            "text": "I’m curious to whether people from warmer climates acclimate to them and have a higher tolerance. PA is not a warm climate area, if they used local participants then they would not be acclimated to heat.  It’s well know that there are organisms that change certain enzymes at higher temps to better tolerate heat. People may as well.",
            "title_similarity": "0.7273998",
            "sentiment_compound": 0.9049
        },
        {
            "id": "hzgit5d",
            "score": 0,
            "text": "*laughs in Mississippi* It is usually upper 90s during the summer with heat indexes between 105-115 depending on humidity. I think at one point last year I saw an 80 degree dew point.",
            "title_similarity": "0.6040569",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzgk5ov",
            "score": 0,
            "text": "Says a researcher who’s never lived in Louisiana…",
            "title_similarity": "0.32477313",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgn8mr",
            "score": 0,
            "text": "This is everyday in Florida we have 100% humidity and over 87F",
            "title_similarity": "0.38755658",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgng74",
            "score": 0,
            "text": "Oh so that's why I always felt like I was going to die in Tennessee",
            "title_similarity": "0.250939",
            "sentiment_compound": -0.34
        },
        {
            "id": "hzgnvfz",
            "score": 0,
            "text": "Well. The south east US is a great place for old people to go and die then.\n\nSummers there are literally like 80s-90s with 100% humidity for most of the places...",
            "title_similarity": "0.57554597",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hzgnwxu",
            "score": 0,
            "text": "Is this suggesting we can’t live in 87 F with rain?\n\nOr what",
            "title_similarity": "0.59353477",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgot4n",
            "score": 0,
            "text": "This literally makes no sense, I've been outside for hours and hours and 100% humidity in 90-100 degree temps.",
            "title_similarity": "0.5621428",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzgp5b7",
            "score": 0,
            "text": "You just described Alabama in the Summer (on a normal day).",
            "title_similarity": "0.27651322",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgwls1",
            "score": 0,
            "text": "Yay. Here I've been fretting over 35C wet bulb, when in fact it is even lower!\n\nSo, does this mean that the entire Indian subcontinent will soon be uninhabitable?",
            "title_similarity": "0.67943025",
            "sentiment_compound": 0.3595
        },
        {
            "id": "hzgz5fh",
            "score": 0,
            "text": "I have literally lived for weeks in temps above 87f and humidity around 100%. Months at over 90f with humidity that averaged in the upper 80s. I was younger, but we living in cabins without power. Wierd.",
            "title_similarity": "0.6368583",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh10r1",
            "score": 0,
            "text": "As a Louisiana resident, I declare this one bunked we get those conditions in starting in April and it only gets hotter until October.",
            "title_similarity": "0.44310337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh1mng",
            "score": 0,
            "text": "Note that these results are not from a published, peer-reviewed paper. They are from a study carried out by a professor of kinesiology (kind of like physical therapy) at Penn State Universit, and publicized on the university's own news page.\n\nIts results are also highly dubious IMO. Temperature tolerance is going to vary widely based on the person's physiology, body shape, and activity level. The professor seems to justify this by criticizing the accepted thresholds as being \"based on theory and modeling and not real-world data from humans\". This is like saying the freezing point of water as 0 degrees C is based on theory and not real world data, and that their experiments show it might be significantly colder. (water with dissolved minerals has a lower freezing point so of course you'd measure it as lower than 0 you nitwit).",
            "title_similarity": "0.57289183",
            "sentiment_compound": -0.3582
        },
        {
            "id": "hzhdn53",
            "score": 0,
            "text": "I've been in higher wet temperatures than this and in full battle rattle. It wasn't an enjoyable experience but I didn't collapse.\nI'm not sure how to correlate less than 100% humidity with higher temperatures or if that even has an equivalency? But I've run marathons in 95 degree weather with pretty high humidity and been okay\n\nHaving said this, every year with our marathons there are always a dozen or so people is that collapse due to the heat. I have always attributed it to poor planning and inadequate hydration",
            "title_similarity": "0.6837606",
            "sentiment_compound": -0.7817
        },
        {
            "id": "hzhg60k",
            "score": 0,
            "text": "Move to Australia, you'll die or be conditioned to it.\n\nQueensland and Northern territories 32c+ and 100% humidity\n\nNSW currently around 30c + and 87% humidity\n\nThis is the way.",
            "title_similarity": "0.55188483",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hzidkhm",
            "score": 0,
            "text": "Is that for unconditioned white people? I'm sure people who have grown up in humid conditions would have more resilience?",
            "title_similarity": "0.5666788",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hzij70c",
            "score": 0,
            "text": "I wonder how hot a nuke is",
            "title_similarity": "0.3754068",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj16wn",
            "score": 0,
            "text": "I grew up in Florida where it’s nearly always 100% humidity and could get into the lower 100 degrees. Do I have a superpower now? It’s the on thing that cesspool gave me outside of a lifelong fear of cockroaches.",
            "title_similarity": "0.57941866",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hzj26ul",
            "score": 0,
            "text": "As someone raised in the heart of Heat and Humidity, this is a drop in the bucket. I’ve had more humid days than most, and I can handle the worst days of the summer months. \n\nOn the other side of that coin, I am a bundler when it comes to winter months. Anything below 40F and the thermals and multiple layers come out. It’s gross. I don’t like it.",
            "title_similarity": "0.7001417",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hzj8kc3",
            "score": 0,
            "text": "Humans can’t blah blah blah. Visit Houston and live. Humans can do a lot of unpleasant things and live. Especially in Houston.",
            "title_similarity": "0.43571877",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hzjabtl",
            "score": 0,
            "text": "*laughs in southern state of USA *",
            "title_similarity": "0.19960997",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzjau23",
            "score": 0,
            "text": "Must have never been to Louisiana in the summer.",
            "title_similarity": "0.41484642",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjqwcm",
            "score": 0,
            "text": " Bah come live here in the top end of Australia, can do that easy",
            "title_similarity": "0.28788567",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hzjtdn6",
            "score": 0,
            "text": "What nonsense is this.. I’m an Australian.. we see 40 C + days in summer. We survive",
            "title_similarity": "0.4514922",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hzrldyp",
            "score": 0,
            "text": "What the hell does “wet bulb” mean in this context?",
            "title_similarity": "0.3025233",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hzgjdkj",
            "score": 7,
            "text": "I hate when journalists read a paper and come up with their own title. At no point in the article did the authors make a reference to \"humans\" itself. At no point in the research paper did the authors did an anthropological study to see if they can generalize their findings to \"all humans\". The authors did a great job describing their findings and followed protocol, and their findings, given the small sample, most probably generalizes to \"Americans\" and not humans, given the assumption that most of their participants live in the US. What the journalist failed to acknowledge is that many people from other countries have a much higher tolerance to higher temperatures the same way that, let's say, Americans have a much higher tolerance to lower temperatures. The fact that the journalists chose the word \"humans\" makes it seem like it generalizes to all humans, pushing towards the boundaries of click-bait for me.",
            "title_similarity": "0.5739522",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hzgkfi1",
            "score": 61,
            "text": "If you're working on these environments, try not to drink water that is too cold. It turns your stomach into a heat sink, making you more hot. It's better to wash your arms and hands with cold water. Like, if you've got a cooler with ice and water? Dip your arms in for a little bit. It'll help cool you down. Also, remember to drink Gatorade, but twice as much water. \n\nDo you get headaches working in heat and humidity? Potassium and magnesium deficiencies are what's causing it. Eat at least one banana a day to combat this problem. \n\nGet a cooling rag. Get it wet, wring it out, snap it a few times and wash around your neck and head. This will help cool those areas.\n\nBut, most importantly, tell your boss to suck it and take extra breaks. Your job does not pay you enough to die for it and you'll be replaced the very next day. I've had a coworker die from being overworked in the heat. Died on the lunch room break floor while we were eating. Work didn't slow down a bit. They literally just carried him off as we went back to work and there was a new guy to replace him at 6am the next day.",
            "title_similarity": "0.5905651",
            "sentiment_compound": -0.9389
        },
        {
            "id": "hzg5qjn",
            "score": 1,
            "text": "So is it okay to live in the desert? 120 degree Phoenix in July?",
            "title_similarity": "0.35875893",
            "sentiment_compound": 0.3661
        },
        {
            "id": "hzg94ne",
            "score": 1,
            "text": "It was over 30c and at 90% humidity for a few days the other week here in Australia, definitely not fun especially without aircon",
            "title_similarity": "0.6092329",
            "sentiment_compound": -0.0005
        },
        {
            "id": "hzgdzng",
            "score": 1,
            "text": "*laughs in Al Udeid flightline*",
            "title_similarity": "0.20686306",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzgh08w",
            "score": -1,
            "text": "Wait, isn't 100% humidity water, like you're under water at that point",
            "title_similarity": "0.60402983",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzghtyy",
            "score": 1,
            "text": "Wouldn’t the tolerance for older people be higher? They’re always so cold",
            "title_similarity": "0.63242495",
            "sentiment_compound": 0.296
        },
        {
            "id": "hzghw43",
            "score": 1,
            "text": "Wet-bulb? I've never heard of this",
            "title_similarity": "0.31677762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgn9v6",
            "score": 1,
            "text": "So Houston every day in summer.",
            "title_similarity": "0.21313922",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgv57f",
            "score": 1,
            "text": "Ha! Visit Memphis in the summer!",
            "title_similarity": "0.17850828",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgvkot",
            "score": 1,
            "text": "idk about that title, as a resident of Louisiana, its extremely humid here and 87 sounds like a decent summertime day here",
            "title_similarity": "0.3945993",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hzhtorv",
            "score": 1,
            "text": "Yeah that’s why there aren’t any people living near the equator… oh wait\n\n\nWho knew the Reddit ‘science’ subreddit would be so chock full of bias confirmation and BS",
            "title_similarity": "0.51236475",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hziokyr",
            "score": 1,
            "text": "Isn’t 100% humidity rain? Sounds like a cold shower to me but I grew up in central Texas where it’s 115+ and above 85% humidity every summer. Did they only test Canadians?",
            "title_similarity": "0.568418",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hziold8",
            "score": 1,
            "text": "Strange the northern parts of Australia have had a population endur worse for 50,000 years plus",
            "title_similarity": "0.5968172",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hzis4s8",
            "score": 1,
            "text": "Counterpoint: Australia.",
            "title_similarity": "0.13343525",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzisaui",
            "score": 1,
            "text": "There's an awful lot of weasel words here...\n\n\"It has been widely believed **(by whom?)** that a 35°C wet-bulb temperature (equal to 95°F at 100% humidity or 115°F at 50% humidity) was the maximum a human could endure before they could no longer adequately regulate their body temperature, which would potentially cause heat stroke or death over a prolonged exposure.\" **define \"prolonged exposure.\"** A day? A week?",
            "title_similarity": "0.7067181",
            "sentiment_compound": -0.8638
        },
        {
            "id": "hzjaxpd",
            "score": 1,
            "text": "\"Can't endure\" is pretty strong wording. People have lived in hot conditions like that for a long time, be it swampy/jungle heat or desert heat. I've done both. It's not fun, but you can certainly endure.",
            "title_similarity": "0.58398014",
            "sentiment_compound": 0.5163
        },
        {
            "id": "hzjc8y7",
            "score": 1,
            "text": "Have they been to some of the hottest humid places?  Pretty sure it reaches those temps in places like the UAE and everyone there isn't dead yet.....",
            "title_similarity": "0.46167123",
            "sentiment_compound": 0.892
        },
        {
            "id": "hzjdq3s",
            "score": 1,
            "text": "This is horse manure, I live in Arkansas where temperatures hit over 100 degrees F every summer and it stays 100% humidity. I have worked many summers doing physical labor outside in these conditions. This is flat out wrong",
            "title_similarity": "0.5162254",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hzgcke8",
            "score": 23,
            "text": "It is neat that they are trying to get good test data to validate older models for this.\n\nThey just need to repeat the test with more than 24 people from Pennsylvania...",
            "title_similarity": "0.36453915",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hzg5eh7",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.212176"
        },
        {
            "id": "hzg9kv4",
            "score": 2,
            "text": "You can endure high temperatures in dry desert climate, but in humid climates, not so much.  \nI grew up in place where its common in summer to have 45C, but it's dry and windy, so you just stick to the shade to avoid direct sun, and its fine. Now I live in 30-35C summers with 80-90% humidity and it's hell",
            "title_similarity": "0.663048",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hzghy16",
            "score": -2,
            "text": "Alabama here.........87 at 100% is considered a break in the weather here",
            "title_similarity": "0.5206953",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgr3g9",
            "score": 2,
            "text": "I work in a paper mill that is over 100F in the summer and it is generally foggy in the building due to such high humidity. We are all able to endure it just fine. I will say however that I will be taking some humidity readings this summer to see what the actually humidity in the building is. Not sure if our circumstances are quite the same as what is being talked about here.",
            "title_similarity": "0.60253304",
            "sentiment_compound": -0.0418
        },
        {
            "id": "hzgysq4",
            "score": 28,
            "text": "We need to destroy the fossil fuel industry immediately to curb the devastating effects of anthropogenic climate change. Our lives depend on it. Seize all their assets without compensation and dismantle their operations.",
            "title_similarity": "0.35936427",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hzg6cuo",
            "score": -2,
            "text": "That's why places like Augusta Georgia suck so much. It's always 100% humidity there and over 95°F all summer.",
            "title_similarity": "0.51696265",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hzgdg7d",
            "score": 3,
            "text": "Question, wonder how adaptation plays in this? Since humans will adapt to the environment they are in.",
            "title_similarity": "0.23904943",
            "sentiment_compound": 0.25
        },
        {
            "id": "hzi7xl2",
            "score": 4,
            "text": "These scientists have never been to Missouri.",
            "title_similarity": "0.29729596",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzg9ucy",
            "score": 43,
            "text": "My teen son and I enjoy adventure-type vacations, often hitting the desert southwest in August.  We've learned we can fairly easily handle an 8 mile hike when it's 110F and dry, but 6 hours at a park in Orlando when it's 90 degrees at 80% humidity kicks our asses.",
            "title_similarity": "0.53103256",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hzgwxl2",
            "score": 26,
            "text": "It seems like those who claim the next generations will live to age 120+ don’t consider the climate factor. (Or disparities in access to healthcare, etc.)",
            "title_similarity": "0.637866",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzgzpsd",
            "score": 24,
            "text": "I totally support this. As a former distiller I was working in 90°f and 100% humidity during the summer. My sweat wasn't evaporating at all, and I was fighting constant dizzy spells. \n\nThe owners were very adamant about taking cooling breaks, but when you get into the work flow and suddenly everything goes grey... \n\nI was worried I would die in there.",
            "title_similarity": "0.5924187",
            "sentiment_compound": -0.8424
        },
        {
            "id": "hzg6qmb",
            "score": 77,
            "text": "So what this is saying is that at 100% humidity, your sweat won't evaporate and help to cool you and regulate your body temperature. It's a bit confusing, but that's the gist.",
            "title_similarity": "0.6760359",
            "sentiment_compound": -0.1101
        },
        {
            "id": "hzgmwv8",
            "score": 26,
            "text": "As a Floridian, I feel like science is telling me I should be dead...",
            "title_similarity": "0.37623698",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hzfwjan",
            "score": 627,
            "text": "As climate change nudges the global temperature higher, there is rising interest in the maximum environmental conditions like heat and humidity to which humans can adapt. New Penn State research found that in humid climates, that temperature may be lower than previously thought.\n\nIt has been widely believed that a 35°C wet-bulb temperature (equal to 95°F at 100% humidity or 115°F at 50% humidity) was the maximum a human could endure before they could no longer adequately regulate their body temperature, which would potentially cause heat stroke or death over a prolonged exposure.\n\nWet-bulb temperature is read by a thermometer with a wet wick over its bulb and is affected by humidity and air movement. It represents a humid temperature at which the air is saturated and holds as much moisture as it can in the form of water vapor; a person’s sweat will not evaporate at that skin temperature.\n\nBut in their new study, the researchers found that the actual maximum wet-bulb temperature is lower — about 31°C wet-bulb or 87°F at 100% humidity — even for young, healthy subjects. The temperature for older populations, who are more vulnerable to heat, is likely even lower.\n\nhttps://journals.physiology.org/doi/abs/10.1152/japplphysiol.00738.2021",
            "title_similarity": "0.7383071",
            "sentiment_compound": -0.7218
        },
        {
            "id": "hzfyyo0",
            "score": 37,
            "text": "[removed]",
            "title_similarity": "0.212176"
        },
        {
            "id": "hzgdtcz",
            "score": 14,
            "text": "Florida is going to have something like 30 days of wet bulb events a year in the future meaning you literally can’t go outside until the humidity and heat decline or you will probably die.\n\nThe implications of that type of weather have immense consequences.",
            "title_similarity": "0.62339056",
            "sentiment_compound": -0.34
        },
        {
            "id": "hzi4rhi",
            "score": 14,
            "text": "Let me describe what it's like to die from humidity. This happened during a trip to the Philippines. I was photographing a wedding in a church, and the building was badly designed with regard to airflow. It had no air conditioning, and large glass walls which let light in, but did not allow warm air to escape. Most people sat directly in front of large fans. The air felt warm to me, but not dangerously hot. What I didn't understand then, was that this building filled with about 150 people was reaching 100% humidity. It was a long Catholic service, about an hour, and I was so intently focused on my work, I forgot to do anything to cool down. I suddenly realized that I couldn't breathe. I tried to draw in breath, but it was like trying to fill a balloon by just holding it open. My lungs simply refused to pull in fresh air. The room seemed to be spinning about. I got a glimpse of myself in the glass. I was red - more than red - scarlet. I staggered outside, grabbed a cold 1 litre water bottle, and drank it all in one long gulp. If I hadn't been lean & fit, I'm sure I would have suffered cardiac failure at that point. \nWhat I know now is tnat wet-bulb temperature is poorly understood in the West, and its threat to life (all mammalian life, not just humans) is not appreciated. Around the equator, in places like India, they know when the WB temp goes over 30 degrees celsius, it's a mortal threat. Dying from heat doesn't actually take much heat at all, when the air is also moist. Our core is about 37 degrees, our skin about 34. That's a gradient that requires a lower temperature outside our body to shed our core temperature like a waterfall, or we overheat and die. This is what is going to kill the most people as a result of climate change. Not storms or floods or fires. It's just a subtle insidious slight rise in temperature in the humid regions of the earth, and millions of people and other animals are going to drop dead.",
            "title_similarity": "0.6044959",
            "sentiment_compound": -0.9763
        },
        {
            "id": "hzg6kdm",
            "score": 1027,
            "text": "[removed]",
            "title_similarity": "0.212176"
        },
        {
            "id": "hzgcsua",
            "score": 755,
            "text": "This thread is filled with people who are confused by humidity.",
            "title_similarity": "0.4027443",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hzg8hhb",
            "score": 1339,
            "text": "I work underground and we use the wet bulb system to verify if it's safe to work in those conditions if it's above 32.0 wet bulb we shut the job down and come up with a better solution to avoid I have found over the past 10 years of underground mining  I'm struggling with adjusting to the temp as I get older it gets harder to work in those conditions",
            "title_similarity": "0.6445034",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hzg7m4m",
            "score": 2957,
            "text": "Does that mean the maps that predict future inhabitable regions are way too optimistic?",
            "title_similarity": "0.42324495",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hzgfh94",
            "score": 221,
            "text": "Pretty sure we exceeded those temps in ultra deep gold mines in South Africa. Not officially of course but there was a lot of blind eyes turned amongst the ventilation officers. Used to get through 6 litres of water in 3-4 hours (taken down frozen) and never have to pee. Could have refilled the bottles from sweat filled  gum boots when taking them off.",
            "title_similarity": "0.5918556",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hzgeo2e",
            "score": 543,
            "text": "If this is the case, the environment of large swaths of South Asia and Middle East will soon become hostile to human life. First during heatwaves, then in entire summer, people will have to stay in air-conditioned spaces to actually **survive** instead of just feeling comfortable. Outdoor activities in summer will be restricted to night time and early morning. Keep in mind that India today already have heat waves reaching 50C and majority of the population doesn't even have air-conditioners in their homes. I guess those in hot countries who can afford moving will leave these places at that point. It really sucks to think about all of it.",
            "title_similarity": "0.6838474",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hzgaujc",
            "score": 517,
            "text": "Was anyone able to see the methods section? I'm curious if the subject sampling was mixed/random, or if they chose people already acclimated to very humid and hot environments to try and find the upper limit.",
            "title_similarity": "0.53710115",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hzg02re",
            "score": 9022,
            "text": "To help understand the consequences for a human: we generate heat while just living. All biological processes occur only between a range of temperatures, above which for example proteins get irreversibly damaged. We lose heat by sweating and then evaporation of water from the sweat. If it is too humid sweat would not evaporate, and the person overheats to death.",
            "title_similarity": "0.6152243",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hzg9afd",
            "score": 1,
            "text": "Nobody from the Midwest is surprised at this.",
            "title_similarity": "0.31840193",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hzgbn01",
            "score": 1,
            "text": "This is why summertime in Michigan is the worst season of all.",
            "title_similarity": "0.5056901",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hzgdopr",
            "score": 1,
            "text": "Would love to know how not having a thyroid gland and having dysautonomia would effect the upper limit.",
            "title_similarity": "0.60224944",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hzgdpcf",
            "score": 1,
            "text": "I have to work outside a lot in the warmer months (and the colder ones too, often enough), so I invested in some nice double wall canteens for cool water. I'm a sweater, so I tend to kill half a gallon of cold water just before lunch on the days we're outside in the heat. It's gross how muggy it gets in the Baltimore area during the summer. Stifling at times.",
            "title_similarity": "0.5920215",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hzgdugu",
            "score": 1,
            "text": "This is particularly frightening as a brewer living in one of the warmer parts of Australia.",
            "title_similarity": "0.5390871",
            "sentiment_compound": -0.3167
        },
        {
            "id": "hzgdxcu",
            "score": 1,
            "text": "Soooooo does that mean saunas and hot showers actually hurt us??? I'm actually confused now...",
            "title_similarity": "0.49800217",
            "sentiment_compound": -0.7383
        },
        {
            "id": "hzge695",
            "score": 1,
            "text": "I guess it's hard to get accurate data on this, I mean it's not like you can test it and see how many subjects die at what temperature...\n\nThat said, thanks to climate change, we're about to get some hard data on what it takes to kill a significant number this way.",
            "title_similarity": "0.6247119",
            "sentiment_compound": -0.8181
        },
        {
            "id": "hzger05",
            "score": 1,
            "text": "When I worked for a summer camp in Houston I would literally stick my head in a freezer for 5 minutes after an hour and a half of chasing kids outside.\n\nI was young, fit, and healthy.\n\nThis was two decades ago.",
            "title_similarity": "0.33620268",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hzgfuuq",
            "score": 1,
            "text": "Welcome to South Louisiana",
            "title_similarity": "0.109017946",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hzggfhv",
            "score": 1,
            "text": "Houston here. Challenge accepted.",
            "title_similarity": "0.16415691",
            "sentiment_compound": 0.34
        },
        {
            "id": "hzggwnw",
            "score": 1,
            "text": "“The wet-bulb temperature is defined as the temperature of a parcel of air cooled to saturation (100% relative humidity) by the evaporation of water into it, with the latent heat supplied by the parcel.”",
            "title_similarity": "0.5239099",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgh977",
            "score": 1,
            "text": "Yeah Um tell that to the Air Force",
            "title_similarity": "0.07441773",
            "sentiment_compound": 0.296
        },
        {
            "id": "hzghfcs",
            "score": 1,
            "text": "I'm a person who loves hot, dry temperatures. Give me a few bottles of water in even 120F heat, and I'm happy... like an iguana. Start adding humidity at anywhere above 75F, and I want to die.",
            "title_similarity": "0.4712137",
            "sentiment_compound": 0.743
        },
        {
            "id": "hzghofj",
            "score": 3,
            "text": "I know someone who participated in this study. They had them do constant light physical activity in a room where they raised either the temperature or humidity. Once their internal body temperature started to increase, they were considered no longer able to \"endure\" that temperature/humidity. They measured the environmental parameters at which the body could no longer maintain its normal internal temperature.\n\nThey were not allowed to consume water, change clothes, use a fan, or rest during the study.",
            "title_similarity": "0.58192116",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hzghrcz",
            "score": 1,
            "text": "Is it just me, or is it unsurprising that people studying the maximum possible wet bulb temperature compatible with human like would find a higher temperature than people looking for the point at which \"we should start to be concerned\"?",
            "title_similarity": "0.6964669",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzghrvb",
            "score": 1,
            "text": "I was doing a heat-stress analysis a few summers ago at a plastic moulding facility, where the wet bulb temperature was between 32 and 34.7 °C. It was unbearable standing there, and I was barely moving. Interesting perspective. In Brampton, ON.",
            "title_similarity": "0.56282854",
            "sentiment_compound": 0.3446
        },
        {
            "id": "hzgi6s8",
            "score": 1,
            "text": "Well come on down to missouri if you want a demo",
            "title_similarity": "0.17726079",
            "sentiment_compound": 0.34
        },
        {
            "id": "hzgi75o",
            "score": 1,
            "text": "I saw an article a few years back about how people in the tropics are dying in the shade. The humidity is so high with really high temps, that they’re unable to expel heat. This will/is leading to climate refuges as people are unable to survive in certain regions without manmade means.",
            "title_similarity": "0.6681884",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hzgiuu6",
            "score": 1,
            "text": "We are quite literally creating hell on earth",
            "title_similarity": "0.24693331",
            "sentiment_compound": -0.5244
        },
        {
            "id": "hzgj1aj",
            "score": 1,
            "text": "I can't wait to show this to all my hot yoga dorks and have them tell me I'm wrong.",
            "title_similarity": "0.36384472",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hzgj9gz",
            "score": 1,
            "text": "The highest ever humidity recorded was 95%. So I doubt 100% humidity in naturally possible.",
            "title_similarity": "0.6792039",
            "sentiment_compound": -0.4173
        },
        {
            "id": "hzgjau8",
            "score": 1,
            "text": "Dudes this was not the first article I wanted to see after finishing *Ministry For The Future*.",
            "title_similarity": "0.47365475",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgjtg6",
            "score": 1,
            "text": "That's odd, in Ireland we've had one off 33 degree 100% humidity days and didn't die in the last few years\n\nAm i missing something?",
            "title_similarity": "0.60201955",
            "sentiment_compound": -0.091
        },
        {
            "id": "hzgjuod",
            "score": 1,
            "text": "Gonna say this is not set in stone,  I spent many months in 90-110 degree temps with humidities over 90%  that equaled temperatures over 140 degrees.  Not a pleasant experience but we were functional. ( coast of Southern Bahrain).",
            "title_similarity": "0.6434785",
            "sentiment_compound": -0.2146
        },
        {
            "id": "hzgjxlv",
            "score": 1,
            "text": "Laughs in Alabama accent",
            "title_similarity": "0.1491268",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzgk9cb",
            "score": 1,
            "text": "Low key the worst (climate) news today. This guarantees mass death event in specific regions in the immediate future.\n\nEntire towns and villages wiped out type-thing",
            "title_similarity": "0.4409464",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hzgkdad",
            "score": 1,
            "text": "i pity the test subjects for this study",
            "title_similarity": "0.4197166",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzgkhft",
            "score": 1,
            "text": "So here is my extreme heat story: I was in SoCal in a single cab truck driving in 115 degree heat, I told my friend who was in the cab with me that I bet if we turn the heat on full blast for a while and go outside it will seem cooler. \n\nSo we blast the heat and the temperature in the cab gets up to 160 degrees, the windows in the truck fog up, mind you its 115 outside and my clothes including my jeans are soaked wet like I just jumped in the pool. I started to feel lightheaded after about 5 minutes so we get off of the freeway exit, park the car and go outside and guess what, it was cooler for a while!\n\nFelt like crap for the rest of the day but my experiment worked.",
            "title_similarity": "0.4560452",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hzgkm98",
            "score": 1,
            "text": "Its 80+ everyday in Florida at 100% humidity....",
            "title_similarity": "0.4636429",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgkpo6",
            "score": 1,
            "text": "It’s the wind that gets ya in the winter and the humidity that kills ya in the summer. It can feel physically gross to be in a place that’s 30 C with +80% humidity",
            "title_similarity": "0.67909276",
            "sentiment_compound": -0.765
        },
        {
            "id": "hzgks4e",
            "score": 1,
            "text": "no wonder I hate summer so much",
            "title_similarity": "0.44809163",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hzgle7o",
            "score": 1,
            "text": "These meat prisons we’re stuck in are pathetic.",
            "title_similarity": "0.39729434",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hzglzo2",
            "score": 1,
            "text": "The first I heard of wetbulb was in the book the Ministry For The Future. In it cities in India experienced prolonged wetbulb temperatures and everyone died even people trying to cool off in lakes were just cooked into soup. It sparked India into going solo and geoengineering reflective particles into the air. It's a really ghostly book. Fiction, but so close to reality that it seems non.",
            "title_similarity": "0.5006392",
            "sentiment_compound": -0.1655
        },
        {
            "id": "hzgm154",
            "score": 1,
            "text": "So working in an enclosed space, like say, a car wash in the middle of July, is bad for my health.  Got it.",
            "title_similarity": "0.5393558",
            "sentiment_compound": -0.25
        },
        {
            "id": "hzgm8rv",
            "score": 1,
            "text": "Yeah, no. South Carolina is 105°f at 99% for months. Everyone lives. This article is wrong.\n\nAlso, Florida would like a word.",
            "title_similarity": "0.5556558",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hzgn7db",
            "score": 1,
            "text": "Disney workers know this all too well.",
            "title_similarity": "0.15993166",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hzgndtm",
            "score": 1,
            "text": "I guess we’ll have to adapt and be naturally selected",
            "title_similarity": "0.12888545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgnekj",
            "score": 1,
            "text": "This is (part of) why I left Florida. I was fine, but the hubby couldn't take the humidity anymore. It's not so much the heat, but the humidity that is awful",
            "title_similarity": "0.6067991",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hzgnkj8",
            "score": 1,
            "text": "Tell that to Camp Lejeune…",
            "title_similarity": "0.061269775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgnxlr",
            "score": 1,
            "text": "The army is going to be the last group to understand this. “It’s just heat cat 5, unblouse your boots and cuff your sleeves, you’ll be fine”",
            "title_similarity": "0.47412688",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgo3eb",
            "score": 1,
            "text": "In my country there's a saying \"lo que mata es la humedad\" or \"humidity is what actually kills\". Never thought this popular phrase would be actually backed by science!",
            "title_similarity": "0.5583951",
            "sentiment_compound": -0.1134
        },
        {
            "id": "hzgo3oi",
            "score": 1,
            "text": "Clearly the sample doesn't include a student pilot and his instructor sitting shoulder to shoulder in a cessna 152 in the middle of august at 3 o'clock in the afternoon.",
            "title_similarity": "0.4427482",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hzgoaxq",
            "score": 1,
            "text": "This seems kinda dramatic. In Iowa in the summer the corn holds all the moisture down. Our weathermen love comparing our daily humidity to the rain forest that day and they lose it when we beat the rain forests. This just seems like making a bigger deal out of nothing. People from humid areas know how to take precautions and work around it.",
            "title_similarity": "0.49878004",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hzgopoj",
            "score": 1,
            "text": "Take a walk in key west in July when it’s only 87 degrees out.",
            "title_similarity": "0.34355825",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgopsv",
            "score": 1,
            "text": "Our wet sons can’t get as wet as we thought.",
            "title_similarity": "0.56419396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgorru",
            "score": 1,
            "text": "Sw Louisiana is like 100 degrees and 100% humidity for 10.5mos a year I could have told you this",
            "title_similarity": "0.5247994",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzgos0t",
            "score": 1,
            "text": "Special Forces Training: hold my beer!",
            "title_similarity": "0.2618786",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hzgpdjz",
            "score": 1,
            "text": "What's \"wet bulb\" I'm this situation?",
            "title_similarity": "0.2510063",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgpkbw",
            "score": 1,
            "text": "Sounds like down here in Florida",
            "title_similarity": "0.106492996",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzgpr6z",
            "score": 1,
            "text": "Well, we’re lucky that climate change doesn’t exist and isn’t a large problem. Oh wait.",
            "title_similarity": "0.50610316",
            "sentiment_compound": 0.296
        },
        {
            "id": "hzgprzu",
            "score": 1,
            "text": "Damn, I thought it was 95.  87 sounds low.",
            "title_similarity": "0.5335952",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hzgpv0a",
            "score": 1,
            "text": "Can't see how this will be important in the coming decades...\n\nOur inaction on climate change is going to lead to BILLIONS of people enduring mass migrations. That is if we actually make our stated goals, which is looking less and less likely... if things get worse it very well could be the next mass extinction. Life as a human on Earth will become incredibly difficult and unpleasant.",
            "title_similarity": "0.6578275",
            "sentiment_compound": -0.7943
        },
        {
            "id": "hzgpv7h",
            "score": 1,
            "text": "Watched people drop like flies when the bus stopped at Fort Benning...   \nI grew up in Phoenix, so I thought I was pretty heat-tolerant.  It's midnight and they have use hoppin' around until a few people went to the hospital.  Hell of an initiation.    \nFew weeks later, we went to a football game and people (public) are just dropping out from heat exhaustion... I've never seen anything like it. Humidity is the only thing worse than 115+ F desert heat, in my opinion.",
            "title_similarity": "0.54261243",
            "sentiment_compound": -0.8628
        },
        {
            "id": "hzgq4xl",
            "score": 1,
            "text": "I moved from Minnesota to Colorado and have never been happier",
            "title_similarity": "0.30404073",
            "sentiment_compound": -0.4168
        },
        {
            "id": "hzgq7sb",
            "score": 1,
            "text": "Which is why some older folks return ‘home’ from Florida after retirement. They literally can’t take the heat.",
            "title_similarity": "0.5485523",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgqaek",
            "score": 1,
            "text": "We had a heat dome event in my region this summer for the first time ever - up to 49C in some areas - and people were completely unaware of how much actual danger they were in that hundreds of people died. \n\nThere is a real gap in common knowledge among people who never had to deal with high temperatures that can be deadly when a freak heat wave wreaks havoc for a few days. Including those in public safety who are supposed to handle such things.",
            "title_similarity": "0.57944196",
            "sentiment_compound": -0.92
        },
        {
            "id": "hzgqc38",
            "score": 1,
            "text": "This is proven every summer when half the world population dies.",
            "title_similarity": "0.40883574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgqcge",
            "score": 1,
            "text": "It’s not the heat, it’s the humidity that kills you.",
            "title_similarity": "0.51173204",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hzgqfpd",
            "score": 1,
            "text": "That’s one hell of a run on sentence.",
            "title_similarity": "0.27161413",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hzgqpj2",
            "score": 1,
            "text": "cool maybe i can stop being laughed at when I say I cant stand temps above 78 F. Yes you can stay out in that for a while. I even worked in it for years of my life. You can bet your ass I was bitching the whole time, especially so when it was humid",
            "title_similarity": "0.54820645",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hzgqus8",
            "score": 1,
            "text": "I grew up in st. Louis dawg. This article saying humans can't live in those weather conditions is laughable.",
            "title_similarity": "0.5758034",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hzgqy2g",
            "score": 1,
            "text": "So…every summer in Jersey is deadly?",
            "title_similarity": "0.3991854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgre26",
            "score": 1,
            "text": "Yall never been to Florida",
            "title_similarity": "0.27246174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgrm62",
            "score": 1,
            "text": "Florida has known this for a long time.",
            "title_similarity": "0.13690591",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgrxku",
            "score": 1,
            "text": "As a pool technician in Florida where it’s often in the high 90s and 100% humidity during the summer… it’s a struggle not to die. Lots of Gatorade/water and breaks in the AC in between pools is a must.",
            "title_similarity": "0.52930605",
            "sentiment_compound": 0.2134
        },
        {
            "id": "hzgrxnh",
            "score": 1,
            "text": "This is why everyone in Houston, Texas is dead. Or they would be without air conditioning .",
            "title_similarity": "0.51595306",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hzgs23p",
            "score": 1,
            "text": "Sounds remarkably like coastal temperatures",
            "title_similarity": "0.2706071",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hzgs2h6",
            "score": 1,
            "text": "Doha Kuwait felt like what I imagine hell feels like. Just a hot sticky nasty area. 31°C was probably the low on a wet bulb.",
            "title_similarity": "0.54474646",
            "sentiment_compound": -0.743
        },
        {
            "id": "hzgs4pz",
            "score": 1,
            "text": "Welcome to the Green Hell, The Amazon Forest. The Spaniards learned that the hard way. Dying from hyperthermia, delirious.",
            "title_similarity": "0.47153538",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hzgs82v",
            "score": 1,
            "text": "Buying air conditioning stock",
            "title_similarity": "0.23785928",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgsaol",
            "score": 1,
            "text": "This entire thread makes me so happy to live in CA",
            "title_similarity": "0.1579122",
            "sentiment_compound": 0.6948
        },
        {
            "id": "hzgsemv",
            "score": 1,
            "text": "I live in Queensland Australia and yes temps and especially humidity can be awfull but compared to my visit to Singapore Queensland is a winter wonderland humidity wise.",
            "title_similarity": "0.48566303",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hzgsmwf",
            "score": 1,
            "text": "Tell that to the factory I work at",
            "title_similarity": "0.05033083",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgsof4",
            "score": 1,
            "text": "I live in Florida. The summers already told me this’. Pure misery.",
            "title_similarity": "0.36423218",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hzgssl5",
            "score": 1,
            "text": "Get fucked everyone who lives in Japan in the summer then I guess.",
            "title_similarity": "0.29322296",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hzgstf9",
            "score": 1,
            "text": "How did we err, how do they know?",
            "title_similarity": "0.11111169",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgstfz",
            "score": 1,
            "text": "This is great news for the Air Conditioning industry",
            "title_similarity": "0.31391263",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hzgt1zt",
            "score": 1,
            "text": "It’s typically in the 90s in FL during the summer with near 100% some of the time before and after summer storms, and I’m regularly outside doing yard work or exercise in those conditions. It’s miserable but normal to me now.",
            "title_similarity": "0.5462797",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hzgt2k1",
            "score": 1,
            "text": "I grew up in the Southern US. I'm pretty sure this is wrong.",
            "title_similarity": "0.4371651",
            "sentiment_compound": 0.34
        },
        {
            "id": "hzgt3my",
            "score": 1,
            "text": "Worked in power plants all my life.  Have worked in 125 F , 100% humidity areas.  Ice Vests help a lot.",
            "title_similarity": "0.42066547",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hzgt77q",
            "score": 1,
            "text": "Growing up in Louisiana, I feel like I was steeped in 87°F at 100% RH for my entire childhood.",
            "title_similarity": "0.38886386",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzgtbpa",
            "score": 1,
            "text": "Can someone explain how something like this relates to a 100°C sauna for example?",
            "title_similarity": "0.42879653",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzgtcg8",
            "score": 1,
            "text": "*climate change rubs its hands together menacingly and laughs maniacally*",
            "title_similarity": "0.35441726",
            "sentiment_compound": 0.128
        },
        {
            "id": "hzgtdde",
            "score": 1,
            "text": "Alternative title please stay hydrated in humid hot climates.",
            "title_similarity": "0.37370214",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hzgtdez",
            "score": 1,
            "text": "Makes sense.\n\n100 F dry windy west Texas heat is more bearable than 85 F Dallas / Ft Worth stagnant air heat.",
            "title_similarity": "0.6493318",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hzgtjmm",
            "score": 1,
            "text": "This can't be right otherwise the upper parts of Australia would see mass die offs every year. I grew up in regional north Australia and there would be weeks or months of 90-100% and +31°C.",
            "title_similarity": "0.60983115",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hzgtkaz",
            "score": 1,
            "text": "That's went China will goad Russia into failure. They need Siberia for the billion people this will effect later this century.",
            "title_similarity": "0.40660334",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hzgtldi",
            "score": 1,
            "text": "87f is nothing, [try 126f](https://i.imgur.com/8Z0OhWo.jpg)",
            "title_similarity": "0.4531446",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgty5g",
            "score": 1,
            "text": "I'm not surprised.  Weren't the original experiments to determine what was survivable done on astronaut candidates?  They are kind of the best of the best of the best, not exactly representative of the average human of average health.",
            "title_similarity": "0.54996884",
            "sentiment_compound": 0.8995
        },
        {
            "id": "hzgu2l8",
            "score": 1,
            "text": "I wonder what effect skin color has.",
            "title_similarity": "0.3005626",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgufj8",
            "score": 1,
            "text": "Surely the millions of people who live in the tropics invalidates the title?",
            "title_similarity": "0.54379475",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hzgulpk",
            "score": 1,
            "text": "Alls I know that 93 deg temp with 85% humidity here in the south “feels hotter” than 100 deg temps in an arid climate (say Az). I understand why. Southern summers can get miserable. I’m sure 115 in Az is just as bad.",
            "title_similarity": "0.6814749",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hzgurcn",
            "score": 1,
            "text": "Ah thank goodness I’m not crazy, it was a record breaking 40+ here and I thought I was going to be sick, pass out, or worse…",
            "title_similarity": "0.60448587",
            "sentiment_compound": 0.5
        },
        {
            "id": "hzgusfh",
            "score": 1,
            "text": "We’re going to see A LOT more applied science in this area rather than experimental real soon",
            "title_similarity": "0.4116136",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzguxnp",
            "score": 1,
            "text": "In Louisiana we call this, summer.",
            "title_similarity": "0.19053246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgv0df",
            "score": 1,
            "text": "This is particularly relevant for prisons in texas who refuse to provide air conditioning. Everyone talks about the lesson of the holocaust being to not kill the jews, but the lesson ought to also be about not being cruel to prisoners. The death rate in prisons in america is unacceptable.",
            "title_similarity": "0.51456",
            "sentiment_compound": -0.8727
        },
        {
            "id": "hzgv3qi",
            "score": 1,
            "text": "I’ve done landscaping work in south Alabama during the summer, this would be a good weather day",
            "title_similarity": "0.26956606",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hzgv75p",
            "score": 1,
            "text": "That explains the heat stroke",
            "title_similarity": "0.2727502",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgvbbr",
            "score": 1,
            "text": "It's already over 31C and 100% humidity all summer here in Australia.",
            "title_similarity": "0.43013206",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgvboc",
            "score": 1,
            "text": "I know the world is getting warmer but who tf is out here making it wetter",
            "title_similarity": "0.46529478",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hzgvl8y",
            "score": 1,
            "text": "Any fat person during high summer could have told you this.\n\nSource: Am fatass",
            "title_similarity": "0.48849803",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgvv9k",
            "score": 1,
            "text": "Two summers spent in the horn of Africa can anecdotally confirm this studies findings.",
            "title_similarity": "0.3660735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgwh6a",
            "score": 1,
            "text": "What is wet bulb temperature?",
            "title_similarity": "0.30244875",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgws5s",
            "score": 1,
            "text": "I had seen some of the numbers they were saying previously, and if you have ever been in high-humidity environments, I think you probably knew that number was absolutely ludicrous.",
            "title_similarity": "0.5398727",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hzgwtep",
            "score": 1,
            "text": "How come the title manage to use two different temperature units in the same sentence..",
            "title_similarity": "0.3800805",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hzgwu01",
            "score": 1,
            "text": "87 degrees F at 100% humidity\n\nSo August",
            "title_similarity": "0.473108",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgx1rf",
            "score": 1,
            "text": "The entirety of Houston: \"We know.\"",
            "title_similarity": "0.079807386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgx5t2",
            "score": 1,
            "text": "You hear that northern retirees? Coming to Florida will kill you.",
            "title_similarity": "0.42293152",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hzgxcc1",
            "score": 1,
            "text": "What the hell foes “wet-bulb” temperature mean? Weird jargon to put in a title…",
            "title_similarity": "0.4788061",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hzgxl7l",
            "score": 1,
            "text": "I know. I live in Charleston. Every year I want to die.",
            "title_similarity": "0.2421696",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hzgxrr2",
            "score": 1,
            "text": "Uuhm, i grew up in Alabama.  The relative humidity there is usually very close to 100% in the summer and the temperature is often higher than 87, like a lot higher.  I used to play basketball,  outdoors,  for hours in those conditions. I think the value of this statement above mostly applies to this who cannot acclimate or seek shelter during the hottest part of the day. Assessing the impact of conditions on those who are the most vulnerable seems, to me, to be misleading and kind of fear mongering.  I completely believe global warming,  and that it is human caused.  I also believe we are  resilient,  when healthy,  and that Gaia always works to drive down overpopulation/ overconsumption of resources in order to protect itself. 80 year old people,  the chronically unhealthy,  and other vulnerable people are at risk of being eliminated through processes that we,  almost ALL of we,  are contributing to through our everyday \"normal\" behavior. I'm sure I'm gonna catch bell for starting what seems to be the obvious,  but...",
            "title_similarity": "0.5938953",
            "sentiment_compound": -0.1056
        },
        {
            "id": "hzgxryz",
            "score": 1,
            "text": "I live in south FL this study does not apply to me",
            "title_similarity": "0.2857306",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgy2f3",
            "score": 1,
            "text": "Traumatizing flashbacks to my farmers market chapter: engage",
            "title_similarity": "0.23552927",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hzgybqc",
            "score": 1,
            "text": "Now I know why I hated living in Puerto Rico. That’s the average everyday weather there. Crazy uncomfortable. 100% humidity is a thing.",
            "title_similarity": "0.5683943",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hzgycxh",
            "score": 1,
            "text": "Was this experiment conducted on subjects of different races because that matters. Someone used to living in a place with high heat and humidity say a lot of places in the Southern Hemisphere would be able to tolerate more heat and humidity as compared to someone from Norway. I couldn’t find anything related to test subjects in the article so curious to know about it.",
            "title_similarity": "0.7039957",
            "sentiment_compound": 0.4751
        },
        {
            "id": "hzgyge0",
            "score": 1,
            "text": "Until recently, I lived in Bermuda, where temperatures in August hit a max of 90F but humidity approaches 100% regularly, pretty much exactly the conditions described above.  Any physical exertion can lead the being uncomfortably hot and if you don’t find a cool place you will be ill and I suppose possibly die.   Anecdotally, it fits with my experiences.\n\nI’ve walked the Vegas strip at 119F and played golf in 117F in Arizona and both were positively pleasant compared to golf on an August day in Bermuda at 89F.",
            "title_similarity": "0.6017183",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hzgyho1",
            "score": 1,
            "text": "I read somewhere sometime that meat starts to boil (i.e. proteins starting to break down) at 42C. I guess that's fever, add some bad humiditity... :-/\n\nI guess it's the same for [all kinds of meat?](https://blog.thermoworks.com/beef/cooking-low-slow-meat-doing/)",
            "title_similarity": "0.4483848",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hzgyhsz",
            "score": 1,
            "text": "How do people survive in places like Singapore where the average high is 31 C with a humidity of 80%, and that's not factoring in the fact that urban areas get even hotter?",
            "title_similarity": "0.76387453",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzgyqav",
            "score": 1,
            "text": "It’s strange to me considering our body temp\nIs 98.6F. I always thought (complete assumption)people died in heat because their temp\nWent above 104+(Same kind of temp that a fever might kill you.)",
            "title_similarity": "0.62888587",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hzgz2p7",
            "score": 1,
            "text": "Niceeeeeeeeee.\n\n[https://www.pnas.org/doi/10.1073/pnas.2117832119](https://www.pnas.org/doi/10.1073/pnas.2117832119)\n\nHow does that align with this paper showing the difference between Surface Air Temperature and Surface Equivalent Potential Temperature? Essentially when you factor in latent energy and increased evaporative cycle the average temperature's start to go haywire especially around the tropics. 24C in some grid boxes around the tropics by end of century............. That's a spicy desert.",
            "title_similarity": "0.5954884",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzgz3eb",
            "score": 6,
            "text": "What is Wet-bulb temperature?",
            "title_similarity": "0.3035693",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgz8um",
            "score": 1,
            "text": "Apparently you’ve not been to Florida",
            "title_similarity": "0.3055197",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzgzljw",
            "score": 2,
            "text": "I worked Ina greenhouse and the air was always incredibly thick with humidity and it was hot enough to make people faint with such frequency that we got used to seeing ambulances there in the summer time.\n\nWinter time wasn't as bad but still sucked",
            "title_similarity": "0.56252664",
            "sentiment_compound": -0.4723
        },
        {
            "id": "hzh09vd",
            "score": 1,
            "text": "Y’all ever been to Omaha? I feel like we get really close to those temps all the time 90%+ humidity with 90+ degrees",
            "title_similarity": "0.40201166",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzh0dny",
            "score": 1,
            "text": "*cries in southeast Georgia*",
            "title_similarity": "0.2760884",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hzh0gxn",
            "score": 1,
            "text": "Someone show this to my Drill Sergeants.",
            "title_similarity": "0.07824337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh16xs",
            "score": 1,
            "text": "Then they haven’t lived in Texas",
            "title_similarity": "0.3586029",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh17dw",
            "score": 1,
            "text": "We are up s#!t Creek without a paddle",
            "title_similarity": "0.3455932",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh1kqc",
            "score": 1,
            "text": "100% humidity is absolutely brutal though, can't say I'm surprised.\n\nWonder what the limit on would be with lower than average humidity",
            "title_similarity": "0.72853935",
            "sentiment_compound": -0.8052
        },
        {
            "id": "hzh1m9i",
            "score": 1,
            "text": "I live in the American south. In July and August it routinely gets above 100°F and 80% humidity. People die every year as a result. It is hard to describe the heat and humidity, it is like you can’t really breathe and since your sweat doesn’t evaporate it makes you feel trapped.",
            "title_similarity": "0.66006947",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hzh1qza",
            "score": 1,
            "text": "Does it make a difference if particular humans have spent their entire lives in high heat, high humidity environments?",
            "title_similarity": "0.4446124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh1vk1",
            "score": 1,
            "text": "Hello from NE Ga where half of summer is 90+ with 80-100% humidity.",
            "title_similarity": "0.54395354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh252i",
            "score": 1,
            "text": "Outside is the worst side.",
            "title_similarity": "0.40443036",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hzh29ju",
            "score": 1,
            "text": "Any kid reluctantly dragged through the heat stroke hellhole that is Florida on a summertime family vacation that was anything but, could've told you this.\n\nAsk me how I know.",
            "title_similarity": "0.36040515",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hzh2iz0",
            "score": 1,
            "text": "We're going to drown in the air",
            "title_similarity": "0.3712958",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hzh2mn2",
            "score": 1,
            "text": "Wasn't this already somewhat known? Or what was believed instead?\n\nI always thought temperatures of 35+ with 100% humidity without winds were insufferable for a longer time.\n\nBasically if you sweat, but your sweat cant evaporate you're essentially screwed? Even sub 30° are a pain at high humidity.",
            "title_similarity": "0.7622177",
            "sentiment_compound": -0.8831
        },
        {
            "id": "hzh2rmf",
            "score": 1,
            "text": "This tracks, at least for me. Every time my little Canadian butt has gone down to the US (California, Oregon, Florida) during the summer months, I notice I don’t function nearly as well. 30- ish is truly my limit. \n\nProps to all of you who live in that climate year round. As much as snow sucks, It is much easier to think/breathe in -40.",
            "title_similarity": "0.6340623",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hzh2utn",
            "score": 1,
            "text": "So what you're telling me is that my home country of Puerto Rico is almost inhospitable? 80>°F and ~80% humidity is pretty much average there.",
            "title_similarity": "0.6106382",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzh2wg5",
            "score": 1,
            "text": "So how have humans survived in very hot and humid tropical environments for millenia?",
            "title_similarity": "0.44170505",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hzh34ae",
            "score": 1,
            "text": "Does this explain Florida?",
            "title_similarity": "0.09459352",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh3an7",
            "score": 1,
            "text": "Don’t ask how they found out",
            "title_similarity": "0.2387051",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh3b2h",
            "score": 1,
            "text": "What is a \"professor of kinesiology\"? Is there a real science that is also called \"kinesiology\"?",
            "title_similarity": "0.22573072",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh46hh",
            "score": 1,
            "text": "Wow, completely butchered that title, eh mate?",
            "title_similarity": "0.24206874",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hzh475l",
            "score": 1,
            "text": "Have they been to the Deep South US in the summer??  I imagine it's worse in places like Vietnam and Thailand.",
            "title_similarity": "0.5458833",
            "sentiment_compound": -0.2406
        },
        {
            "id": "hzh4aq9",
            "score": 16,
            "text": "Floridans are pretty fucked, eh?",
            "title_similarity": "0.39923537",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzh4e0z",
            "score": 1,
            "text": "I feel like we do this all the time in New Orleans in the summers.",
            "title_similarity": "0.23471539",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzh4mvv",
            "score": 1,
            "text": "There was a documentary about 20 years ago that explained that the population in the south USA couldn't grow until A/C was invented.",
            "title_similarity": "0.48208892",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh4qd2",
            "score": 1,
            "text": "I have known this about myself for a while.",
            "title_similarity": "0.11187426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh52p0",
            "score": 1,
            "text": "I live in SOUTH Louisiana (way south of New Orleans). During the summers here everything just slooowwws down. You got no choice.",
            "title_similarity": "0.39324152",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzh56uk",
            "score": 1,
            "text": "I knew there was a reason I left Georgia.",
            "title_similarity": "0.10285866",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh5e7v",
            "score": 1,
            "text": "Whoever conducted this story has never lived with black women.",
            "title_similarity": "0.32412848",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh5h0q",
            "score": 1,
            "text": "This stuff gets posted from time to time when people try to sound the alarm on climate change. \n\nThe “wet bulb” temperature is just saying if you take away the means of how humans radiate away heat, they will overheat. It’s a stupid study and stupid headline.",
            "title_similarity": "0.56435996",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hzh5mir",
            "score": 1,
            "text": "A little heat shock is good for your body, which is why saunas at 170 degrees for 15 - 20 minuets improves cardio vascular health.",
            "title_similarity": "0.5109885",
            "sentiment_compound": 0.5233
        },
        {
            "id": "hzh5mis",
            "score": 1,
            "text": "Yeah... Humidity kills me",
            "title_similarity": "0.422956",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hzh5pp0",
            "score": 1,
            "text": "I don’t understand by all accounts me and my coworkers should be dead, in Texas I’ve worked outside since I was about 19  and for 4 months straight it’s not strange at all for us to be shoveling dirt in 99+ temps with 98-100% humidity for 2 or 3 hours straight twice a day.",
            "title_similarity": "0.4645423",
            "sentiment_compound": -0.5119
        },
        {
            "id": "hzh5w5f",
            "score": 1,
            "text": "Evolution: You are still a Savannah Ape right?\nCultural adaptations that allow us to enter other environments: ffs man hurry up",
            "title_similarity": "0.27761912",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hzh657t",
            "score": 1,
            "text": "As someone living in a place that some summers will never get below 80f even at 2 in the morning, I am entirely agreeing with this.",
            "title_similarity": "0.5189896",
            "sentiment_compound": 0.4005
        },
        {
            "id": "hzh6fkp",
            "score": 1,
            "text": "Wouldn't it possible in these situations to use a rag to absorb sweat in the regular so the body continues to sweat?",
            "title_similarity": "0.39982623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh6fsx",
            "score": 1,
            "text": "Save the best til last eh?",
            "title_similarity": "0.32576185",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hzh6h2y",
            "score": 1,
            "text": "Middle Easterns: puny humans",
            "title_similarity": "0.40601793",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh6i7y",
            "score": 1,
            "text": "Me and the rest of my DCI Drum corps rehearsing outside for 6 hours in 93F & 93% humidity mid-July Florida weather: “I don’t have such weaknesses”",
            "title_similarity": "0.34042674",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh7div",
            "score": 1,
            "text": "Omg, lived in Okinawa Japan for three years and they just live at 99%humidity all day, and when it rains it changes to 100% humidity. So brutal. I don’t think I ever recovered honestly",
            "title_similarity": "0.5656385",
            "sentiment_compound": -0.5009
        },
        {
            "id": "hzh7gtz",
            "score": 1,
            "text": "I'm a chef in NYC and last summer on our reopen during the hottest day of the year the kitchen spiked at an ambient temperature of 117°F, even hotter over the hot line. \n\nI was brick red, soaked all the way through my chef coat and quite possibly enduring a heat stroke. I don't look forward to this summer.",
            "title_similarity": "0.47116128",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh7iwz",
            "score": 1,
            "text": "So like…. Global warming *might* be an issue then",
            "title_similarity": "0.4311685",
            "sentiment_compound": 0.2177
        },
        {
            "id": "hzh7lk7",
            "score": 1,
            "text": "We overestimated our own survivability?!  Oh, the hubris!  Oh the humanity!",
            "title_similarity": "0.4503686",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh85gs",
            "score": 1,
            "text": "Now if only it was possible to buy a household wet bulb thermometer, since there is disagreement on how to even take a wet bulb temperature the last I looked it up 8 months ago.",
            "title_similarity": "0.6333443",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hzh8f7c",
            "score": 1,
            "text": "Which is why elderly people in Florida die every summer",
            "title_similarity": "0.43211943",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hzh8kmd",
            "score": 1,
            "text": "Now you see why the UK summer, such as it is, can be so deadly... We can hit that 31 degree wet bulb temp easily. And it suuuuuucks.",
            "title_similarity": "0.4621694",
            "sentiment_compound": 0.34
        },
        {
            "id": "hzh8kmf",
            "score": 1,
            "text": "This makes sense to me. Before the bug I used to work in a small butterfly house. Glass enclosed space with its own environment we used to keep at around 80F and 50-60% humidity to mimic the wet season in a dry tropical forest. \n\nA few times, the steam plant that powered the entire building’s HVAC would have to be turned off for maintenance or something, so we would have to manually control temps & humidity by turning fans & portable AC units on/off. One morning I came in and the humidity was reading 100% and the temp 82F. I was in my early 20s, relatively fit & healthy, and spending 30 minutes in that room to turn on fans/ac units and record temps made me feel sick and I had to go sit outside the room for 15 minutes with some water before going back in to finish my chores.",
            "title_similarity": "0.598324",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hzh8o9j",
            "score": 1,
            "text": "That’s because people are fatter than ever. And eating such bad food. Pretty easy to tolerate the heat when you’re not overeating and drinking.",
            "title_similarity": "0.612754",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hzh922i",
            "score": 1,
            "text": "Thank your HVAC tech for enduring your °145f attics in the summer people.\n\nFor real tho that kinda heat makes your brain work like oatmeal.",
            "title_similarity": "0.3734438",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hzh93fe",
            "score": 1,
            "text": "Do not, my friends, become addicted to air conditioning. It will take hold of you, and you will resent its absence!",
            "title_similarity": "0.5045569",
            "sentiment_compound": -0.5493
        },
        {
            "id": "hzh9oti",
            "score": 1,
            "text": "1)These temps don't make sense. You should be able to survive a HIGHER temp if it is dry, because sweating will cool you. Thats not what the article says, see quote.\n2)the length of time exposed is not discussed, and the readout for \"yer done\" is not here.\n\n\"After analyzing their data, the researchers found that critical wet-bulb temperatures ranged from 25°C to 28°C in hot-dry environments and from 30°C to 31°C in warm-humid environments — all lower than 35°C wet-bulb.\"",
            "title_similarity": "0.78026474",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hzh9qwb",
            "score": 1,
            "text": "So, as a Floridian, these numbers are mere suggestions, right?",
            "title_similarity": "0.29801992",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzh9ren",
            "score": 1,
            "text": "it's been unseasonably humid since *October* where I live and it's intolerable, I basically cannot function in it so it's been so horrible, nice to see that science is vindicating my struggle!",
            "title_similarity": "0.5335247",
            "sentiment_compound": -0.7274
        },
        {
            "id": "hzha1ua",
            "score": 1,
            "text": "I hate humidity so much. You're just sitting there doing nothing and sweating your ass off. Miserable.",
            "title_similarity": "0.49297068",
            "sentiment_compound": -0.886
        },
        {
            "id": "hzha4ip",
            "score": 1,
            "text": "Old people live in Florida and other hot ass places all the time",
            "title_similarity": "0.24821848",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hzha8rx",
            "score": 1,
            "text": "And yet for some reason people love living in what would be considered swampy regions.",
            "title_similarity": "0.26983774",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hzhaktj",
            "score": 1,
            "text": "This does so much to explain Florida.",
            "title_similarity": "0.15080981",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhau10",
            "score": 1,
            "text": "I work in a stone fabrication shop and the humidity meter reads around 85-95% in the summer",
            "title_similarity": "0.46832374",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhawq7",
            "score": 1,
            "text": "Laughs in South Carolina.",
            "title_similarity": "0.08630319",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzhb1wo",
            "score": 1,
            "text": "Somebody better tell the Middle East that they don’t really exist.",
            "title_similarity": "0.3418906",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hzhb8tf",
            "score": 1,
            "text": "I knew they tricked people into believing Arizona was livable",
            "title_similarity": "0.3863266",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hzhblh5",
            "score": 1,
            "text": "What is 100% humidity? Is that not just being underwater?",
            "title_similarity": "0.53201",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhbsz7",
            "score": 1,
            "text": "Floridian summers were brutal. 99F at 99% was horrid. AND THEN THAT TIME OUR AC WENT OUT IN THE MIDDLE OF SUMMER. Yep.",
            "title_similarity": "0.56823456",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hzhc3id",
            "score": 1,
            "text": "If you’re confused about humidity, imagine taking a hot shower minus the pleasure but all the time",
            "title_similarity": "0.58319795",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hzhc6e9",
            "score": 1,
            "text": "The real question is how hard the subject is working and how long they're in the environment though. Are these people running, standing, laying down? How long can they tolerate that temp before heat injury? It doesn't say.",
            "title_similarity": "0.58434504",
            "sentiment_compound": -0.5514
        },
        {
            "id": "hzhcb12",
            "score": 1,
            "text": "I don’t know, we get up to almost 90% humidity in the South in some places and hotter temperatures during the summers and it’s almost unlivable, but people do work outside still. Really high rates of skin cancer and kidney stones, indicating sun exposure and dehydration, but we can still do it. I’m not sure you’d die of exposure in August in Alabama because there’s ample shade and abundant water.",
            "title_similarity": "0.7037059",
            "sentiment_compound": -0.6513
        },
        {
            "id": "hzhcch4",
            "score": 1,
            "text": "Meanwhile in the Navy...",
            "title_similarity": "0.042293888",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhcl2i",
            "score": 1,
            "text": "Just another reason to never step foot in Georgia",
            "title_similarity": "0.33112073",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhcnr3",
            "score": 1,
            "text": "That's why I'm never going back to Singapore",
            "title_similarity": "0.27313134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhcte5",
            "score": 1,
            "text": "Science confirms Florida is uninhabitable.",
            "title_similarity": "0.29301476",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhcvai",
            "score": 9,
            "text": "This is the Earth's way of running a temperature to get rid of us.",
            "title_similarity": "0.2686553",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhd0if",
            "score": 1,
            "text": "Tell that to my drill sergeant at FT Knox in 2008, with the 100F and 100% humidity",
            "title_similarity": "0.41755414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhdbwi",
            "score": 2,
            "text": "As a kid I lived in the woods of Virginia for two years, then immediately moved to Phoenix for a few years. Virginia was much worse in summer. The humidity made 85 degrees feel worst then a 115 degree day in Phoenix. When you sweat in high humidity it doesn’t cool you down like it’s supposed to. It doesn’t evaporate.. it just stays there. So after a day full of sweating you’re just miserable. Then you lay in bed all sticky and sweaty.. it sucked. Unique living situation cause never got the reprieve of an AC but still. I’d take an afternoon in Phoenix over a day in the Virginia summer woods again anytime. That was brutal. Had to wear Capilene in summer to not feel gross.",
            "title_similarity": "0.68836474",
            "sentiment_compound": -0.8234
        },
        {
            "id": "hzhdmgq",
            "score": 1,
            "text": "These subjects clearly never grew up in Texas where it reaches 95 with 85-90% humidity",
            "title_similarity": "0.6056548",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hzhdp7b",
            "score": 1,
            "text": "They certainly didn’t test my old ass grandpa who can sit outside in the nastiest heats like it were a cool 70 degrees.",
            "title_similarity": "0.6329087",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hzhdvfw",
            "score": 1,
            "text": "*laughs in Floridian*\n\nWe shall inherent the earth with our Australian brothers and sisters",
            "title_similarity": "0.21098223",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzhe3kf",
            "score": 1,
            "text": "So what happens in a hot tub?",
            "title_similarity": "0.21414614",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhe3w8",
            "score": 1,
            "text": "Pfft, tell this to Missourians.",
            "title_similarity": "0.101975694",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhe96d",
            "score": 1,
            "text": " Now I have even more of a reason to live somewhere colder, because the humidity where I am is unbearably bad in the summers and most of the time it's over 35°C or 90 - 95°F and it SUCKS I just sit next to a fan with no energy just trying to not pass out",
            "title_similarity": "0.6266247",
            "sentiment_compound": -0.7389
        },
        {
            "id": "hzhebh4",
            "score": 1,
            "text": "Where these people naked or fully clothed? Imho it matters to see the limits.",
            "title_similarity": "0.35010242",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hzheir6",
            "score": 1,
            "text": "My grandparents would disagree.",
            "title_similarity": "0.42745495",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hzhescd",
            "score": 1,
            "text": "What about bikram yoga? What’s that wet bulb temp?",
            "title_similarity": "0.28921658",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhet7f",
            "score": 1,
            "text": "Should I not stay in my steam room at the gym for 10ish mins 3 times a week anymore?",
            "title_similarity": "0.5384644",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhf2x6",
            "score": 1,
            "text": "What were the ethnic breakdowns of this study? I personally thrive in 90 degree weather with full humidity. If I could live in a tropical climate year-round I would.",
            "title_similarity": "0.52983755",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhfafz",
            "score": 1,
            "text": "Wait how have generations managed to survive in Africa?",
            "title_similarity": "0.25499204",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhfopa",
            "score": 1,
            "text": "It looks like the study was done in an area where the people are already not living in a 100% humidity high temperature place. Would the results be vastly different if they ran the same study on the same age group in say, Japan in the summertime or in Southeast Asia like Vietnam, Malaysia and the Philippines?",
            "title_similarity": "0.73423684",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hzhghp4",
            "score": 1,
            "text": "As someone who lives in a very humid city especially in the summer...climate migration is starting to look like a reality. I don’t know if I can survive anymore summers",
            "title_similarity": "0.5099331",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzhghrb",
            "score": 1,
            "text": "People in the Philippines be like, \"wut?\"",
            "title_similarity": "0.19922447",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzhghye",
            "score": 1,
            "text": "If this was true, everyone in Houston would be dead already.",
            "title_similarity": "0.429582",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hzhgi8w",
            "score": 1,
            "text": "Bangkok was like walking around in a wet sauna",
            "title_similarity": "0.24147831",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzhgm8d",
            "score": 1,
            "text": "Welcome to a southern summer.",
            "title_similarity": "0.18345977",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hzhgnjz",
            "score": 1,
            "text": "To me it’s a death sentence at 30c no matter the humidity. 25 to 16c is where it’s at.",
            "title_similarity": "0.450024",
            "sentiment_compound": -0.5682
        },
        {
            "id": "hzhi2na",
            "score": 1,
            "text": "Then don’t move to NJ",
            "title_similarity": "0.26310673",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhi55v",
            "score": 1,
            "text": "That’s a lie. Go to Cuba and see the older population feel physically better because of the heat and humidity.",
            "title_similarity": "0.5922343",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hzhi9j1",
            "score": 1,
            "text": "100% humidity @ 87F. Welcome to Central Florida in June. It hasn’t really got hot yet.",
            "title_similarity": "0.567317",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hzhib9l",
            "score": 1,
            "text": "This will be a dumb question, but is there a potential for humans to adapt to the new environment?",
            "title_similarity": "0.47926462",
            "sentiment_compound": -0.2846
        },
        {
            "id": "hzhik62",
            "score": 1,
            "text": "87 degrees?….Laughs in Floridian",
            "title_similarity": "0.35624185",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhipg9",
            "score": 1,
            "text": "TIL southerners aren't human.",
            "title_similarity": "0.40042424",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhj422",
            "score": 1,
            "text": "I’ve had heat exhaustion multiple times in my life. As I have grown older, I have definitely become more heat intolerant. 75 F is about my max before the sweat starts pumping.",
            "title_similarity": "0.63002545",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hzhj7f2",
            "score": 1,
            "text": "Me laughing in houston weather",
            "title_similarity": "0.23681277",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzhjwwj",
            "score": 1,
            "text": "Magically, in the desert while deployed the wet bulb always stayed just below the point of us needing to stop working and take breaks.",
            "title_similarity": "0.504317",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzhjzss",
            "score": 1,
            "text": "Somebody needs to tell the Texas Gulf Coast this little tidbit.",
            "title_similarity": "0.20301506",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhk65x",
            "score": 1,
            "text": "Tell that to Marines at Camp Lejeune in the middle of summer.",
            "title_similarity": "0.2047475",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhk8gq",
            "score": 1,
            "text": "Some regions with be literally unlivable for a portion of the year ssoon.",
            "title_similarity": "0.5401878",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhkbpi",
            "score": 1,
            "text": "I dunno know about all that. Used to have pick up football games, or riding bikes in 100 f plus and 100% humidity all the time when I was younger",
            "title_similarity": "0.47100443",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhkd8d",
            "score": 1,
            "text": "Is this sustained? I feel it’s also dependent on the person’s fitness and time spent adapting to a warmer climate.\n\nI feel like I remember being in Hanoi and the humidity being 90+% and 90+F and people were fine. 87 seems low even at 100% humidity.\n\nI was sweating like a pig with my sweat having nowhere to go, but my Vietnamese friend and all the locals were chilling. I probably would have died of heat exhaustion or dehydration if I stayed outside, but people around me were walking around outside just fine.",
            "title_similarity": "0.71824324",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hzhkdaq",
            "score": 1,
            "text": "So when are we all dying?",
            "title_similarity": "0.30848676",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhkesp",
            "score": 1,
            "text": "Was this tested across human body types? As a N European male, of typical size (187cm, 90kg) I absolutely died of heat when I was living in Vietnam. My Vietnamese male colleagues, at an average of, say, 165cm and 65kg, were fine. I got better to some degree after living there for a year but could never take the heat in stride like locals.",
            "title_similarity": "0.6710057",
            "sentiment_compound": 0.486
        },
        {
            "id": "hzhkiyn",
            "score": 1,
            "text": "Is this just because it's saturated air? Would 100deg F DB and 80% relative humidity, which has the same ~87 deg F WB temperature and enthalpy, be any more or less endurable?",
            "title_similarity": "0.65416014",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhkkow",
            "score": 1,
            "text": "Uh, have you seen all the old people thriving in Florida?",
            "title_similarity": "0.274187",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhklz3",
            "score": 1,
            "text": "Well this is a little concerning",
            "title_similarity": "0.203865",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hzhkrlf",
            "score": 1,
            "text": "So if you live in Florida during rainy season you die? Got it",
            "title_similarity": "0.39186892",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hzhkze6",
            "score": 1,
            "text": "I'm assuming this study has never heard of the state of Florida.",
            "title_similarity": "0.3222488",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhl2nc",
            "score": 1,
            "text": "Interesting *writing notes in alien language *... Most interesting....",
            "title_similarity": "0.2567125",
            "sentiment_compound": 0.6901
        },
        {
            "id": "hzhl3cu",
            "score": 1,
            "text": "Not a scientist, I read that how the \"wet bulb\" thing works is because your own perspiration cannot dissipate heat from your body due to how it cannot dry and carry the heat away and thus you overheat and/or suffocate. Sound right, science bros?\n\nEDIT-nevermind I found my suspicions confirmed by another answer in this thread. Thanks",
            "title_similarity": "0.6332973",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hzhl53f",
            "score": 1,
            "text": "The state I live in has gotten to 128°F or 53.3°C but at least it's a dry heat",
            "title_similarity": "0.59341455",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhlaow",
            "score": 1,
            "text": "*Scientists did NOT visit Florida in August.",
            "title_similarity": "0.41271245",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhlcki",
            "score": 1,
            "text": "This is not a problem in Norway. We have had temperatures reaching 31C but not for long.",
            "title_similarity": "0.6115108",
            "sentiment_compound": 0.2568
        },
        {
            "id": "hzhlm4j",
            "score": 1,
            "text": "This could be important for people working in conditions from laboratory clean rooms (full body coverings) to sewers and outdoor work (clothing and gear worn to protect from adverse weather but restrict the body’s normal cooling)",
            "title_similarity": "0.388591",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hzhln88",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.2221661"
        },
        {
            "id": "hzhluqr",
            "score": 1,
            "text": "Humans DO condition themselves to temperature with frequent exposure however. Go to any normally hot humid place on a cool day (15C) and you’ll see a bunch of local folks wearing puffy jackets and fully covered up. Us northerner tourists are walking around in shorts and a T-shirt just enjoying the warm. The locals think we are crazy. \n\nI would suggest this study is flawed and needs to be redone in a warm humid environment with humans who are used to the heat. \n\nTake those same northerner tourists, move them to that hot climate for a year and they’ll condition themselves to that temperature as well.",
            "title_similarity": "0.58971477",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hzhlwi8",
            "score": 1,
            "text": "Hot take: we’re fucked!\n\nIn all seriousness, space PPE tech needs no more excuses to be ready for us when we get off this rock",
            "title_similarity": "0.3930835",
            "sentiment_compound": -0.68
        },
        {
            "id": "hzhm2iu",
            "score": 1,
            "text": "Well shoot, now I feel slightly better about feeling totally wiped after working in my indoor garden where the temps are 87F and 75%RH. I had to swap cargo shorts for board shorts and it's like straight to the shower 3 or 4 times a day. Makes me think of this:\n\n&#x200B;\n\nI tend to sweat heavily in warm climates. My clothes are soaking wet from dawn to dusk. This worried me at first, but when I went to a doctor and described my normal daily intake of booze, drugs and poison he told me to come back when the sweating stopped.\r  \n\r  \n\r  \nHunter S. Thompson",
            "title_similarity": "0.56964165",
            "sentiment_compound": -0.6628
        },
        {
            "id": "hzhmj73",
            "score": 1,
            "text": "Summer closing up where I live - have had a 75-80f due point all summer. Was absolutely unbearable.",
            "title_similarity": "0.5269451",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhn2j3",
            "score": 1,
            "text": "That’s weird because you find humans living in hot/humid conditions throughout history",
            "title_similarity": "0.4539087",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hzhn6hf",
            "score": 1,
            "text": "I don't understand: I've survived worse every single summer here in SW Florida, where it's frequently in the 90s with 99% humidity.",
            "title_similarity": "0.590937",
            "sentiment_compound": -0.7005
        },
        {
            "id": "hzhn7in",
            "score": 1,
            "text": "This doesn't make sense to me.  When I was young I came to the premonition that we are tropical creatures.  Little to no fur, sunlight is important, and seeing lush looking habitats gives us happy feelings.  I've always been a lot more comfortable in extreme heat than I have been in extreme cold, in fact, when I was an athlete l, I was always excited for 90°F+ temps.  It felt so heavenly to me.  There was a point in time in my life where I was rather heavy, though, and was surprised to find I was actually more comfortable when winter rolled around during that time of my life.   After losing weight again I've found the warmth to be more comfortable once again.",
            "title_similarity": "0.6820885",
            "sentiment_compound": 0.9755
        },
        {
            "id": "hzhna19",
            "score": 1,
            "text": "No wonder I hated South Florida in the Summer.",
            "title_similarity": "0.43369287",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hzhnetc",
            "score": 1,
            "text": "I work in the hardwood industry. Kilns are horrible to walk into. I walk into kilns daily that are 160F dry bulb and 150F wet bulb. Makes walking out of them on a 95F day feel like walking into a freezer.",
            "title_similarity": "0.40832484",
            "sentiment_compound": -0.25
        },
        {
            "id": "hzhnmpc",
            "score": 1,
            "text": "Everyone needs that big blanket + Ac unit combo to sleep comfy",
            "title_similarity": "0.38388973",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhnxap",
            "score": 1,
            "text": "I’ve always thought it was wild that old people keep retiring to Arizona and Florida like they’re asking for a heart attack",
            "title_similarity": "0.385436",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hzhnzx4",
            "score": 1,
            "text": "Clearly they have never been to the jersey shore",
            "title_similarity": "0.29185915",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hzhog2b",
            "score": 1,
            "text": "I live in Southeast Louisiana and it’s pretty uncomfortable most of the year",
            "title_similarity": "0.48207757",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hzhovdd",
            "score": 1,
            "text": "This is why, even in winter, I still have my ceiling fan on.",
            "title_similarity": "0.23474869",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hzhp0io",
            "score": 1,
            "text": "I live in a place where that temp is on the lower side , and 100% humidity is the norm.",
            "title_similarity": "0.5675962",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzhp659",
            "score": 1,
            "text": "The Great Lakes area would like to introduce the world to cold fronts. \nA gift from Canada every now and then that drops the humidity in half and gives us relief.",
            "title_similarity": "0.3509747",
            "sentiment_compound": 0.9118
        },
        {
            "id": "hzhpehn",
            "score": 1,
            "text": "And this is why global warming will end us.",
            "title_similarity": "0.40160143",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hzhpqfd",
            "score": 1,
            "text": "Then avoid the humid subtropic climate. Vietnam and Louisiana USA",
            "title_similarity": "0.44528747",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzhpr36",
            "score": 1,
            "text": "We're in the Anthropocene!\n\nAaaaand it's gone.",
            "title_similarity": "0.3562876",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhpu1w",
            "score": 1,
            "text": "r/collapse will love to see this",
            "title_similarity": "0.2010152",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hzhq7ml",
            "score": 1,
            "text": "Once worked in sub tropical Australia in a plany nursery, we often had to collect plants from the shade houses. During the heat wave it was like hell in there was like walking through hot spray. The feeling being outside in 40 degrees  after was a relief.",
            "title_similarity": "0.49393144",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hzhqjvm",
            "score": 1,
            "text": "Reduced from 35C to 31C. A difference of 4C or 7.2F \n\nThis is a lot and it definitely matters.",
            "title_similarity": "0.52990067",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hzhqmii",
            "score": 1,
            "text": "Anyone know how nasal high flow that delivers 37C dew point would be relevant to this?",
            "title_similarity": "0.45693892",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhqy7z",
            "score": 1,
            "text": "I worked in the cornfields as a kid.  Corn sweats, it transpires through pores, making the humidity higher than 100% sometimes.  The morning dew from the leaves wets your pants, and they may still be sopping wet at 3 or 4 in the afternoon, with your pants falling down because of the weight and your waist getting smaller due to dehydration.\n\nHard work, but as a teenagers, most of us could stand it, although a few had their skin turn an ugly blotchy red and white and had to leave.  Not hard to imagine a few degrees higher and more people would leave.  A few degrees higher yet and it would all have to be mechanized.",
            "title_similarity": "0.6527482",
            "sentiment_compound": -0.7432
        },
        {
            "id": "hzhqywa",
            "score": 1,
            "text": "Someone needs to tell OSHA this.",
            "title_similarity": "0.12257398",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhr8qa",
            "score": 1,
            "text": "Me being alive and living in New Orleans wjould say that a lie.",
            "title_similarity": "0.44410107",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hzhrbit",
            "score": 1,
            "text": "Well last summer it was 100% humidity and 102 degrees out and I worked outside all day.  I disagree.",
            "title_similarity": "0.533283",
            "sentiment_compound": -0.128
        },
        {
            "id": "hzhreck",
            "score": 1,
            "text": "How did I throw hay on my uncle’s farm in 95•F with 90% humidity?",
            "title_similarity": "0.42032737",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhribr",
            "score": 1,
            "text": "Where were the subjects from? I'd think people born and living in different places would react differently.",
            "title_similarity": "0.39909637",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhrjzc",
            "score": 1,
            "text": "*laughs/cries in SE Texan*",
            "title_similarity": "0.3089661",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhrwgj",
            "score": 1,
            "text": "*Laughs in Mississippi",
            "title_similarity": "0.15058878",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzhs2kq",
            "score": 1,
            "text": "Just as suspected, Florida is unlivable",
            "title_similarity": "0.32860428",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hzhsmze",
            "score": 1,
            "text": "Interesting how Okinawa has one of if not three longest Life expectancy and that island is hot and humid as hell. But even the military are fitter overall in Okinawa than other parts of the world. In Hawaii they don't get pushed as hard to exercise very generally speaking, so the benefits aren't gained I guess. But these places aren't 100% humidity, it just feels like it.\nEdit: doesn't seem like they took into account acclimatization. The body has to be conditioned for it to function properly. Their results are important for unexpected heat waves in otherwise not humid places, but dunno about Oki.",
            "title_similarity": "0.7578671",
            "sentiment_compound": 0.313
        },
        {
            "id": "hzhsnb0",
            "score": 1,
            "text": "I guess im superhuman or something.",
            "title_similarity": "0.302084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhsvnu",
            "score": 1,
            "text": "These scientist have never been to Paraguay in summer, it seems...",
            "title_similarity": "0.3753522",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzht27e",
            "score": 1,
            "text": "Dry heat is weird if you’re not used to it. I live in the UK where most of the time if it gets hot, it’s humid. Some years back I went on holiday to Egypt and spent several days in Luxor, real desert type climate. First morning I was there I stepped out of the shower and was astonished to find myself almost instantly dry. Bizarre.",
            "title_similarity": "0.5354001",
            "sentiment_compound": 0.3744
        },
        {
            "id": "hzhtder",
            "score": 1,
            "text": "Australians find this report odd and disingenuous",
            "title_similarity": "0.383466",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hzhtgfn",
            "score": 1,
            "text": "LAUGHS IN HOUSTONIAN. This southeast Texas heat & humidity ain't no joke.",
            "title_similarity": "0.37046152",
            "sentiment_compound": 0.6798
        },
        {
            "id": "hzhtrd2",
            "score": 1,
            "text": "And here I am in New Orleans. The AVERAGE high temp in both July and August is 93*F (34*C) and the average high humidity is 93% both months.\n\nThat's an AVERAGE heat index of 140*F (60*C).",
            "title_similarity": "0.5209069",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhue2x",
            "score": 1,
            "text": "Literally reading this as I’m about to step into a steam shower. Maybe I’ll do 10 mins instead of 15 today.",
            "title_similarity": "0.50984246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhuigc",
            "score": 1,
            "text": "Im from Mississippi, and we have high temps, and high humidity year round. \n\nJust to give you an idea of how awful it is, just consider that African Olympic marathon runners come FROM AFRICA, to our state, to train in our weather. \n\nOn a side note, I was watching \"Swamp People\" with my father, just this past week,  and the temps they were showing the day they were out alligator hunting was 106 degrees F, with 92% humidity.",
            "title_similarity": "0.41973704",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hzhuil5",
            "score": 1,
            "text": "Is this /r/gardening ?\n\nThe wet-bulb human form is unknown to me!",
            "title_similarity": "0.3470259",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhulfz",
            "score": 2,
            "text": "ELI5 how does this work with somewhere like Florida? I've lived here for 40 years (aka my whole life) and it's consistently above 90°F and 95% humidity during the summer. Does the 100% humidity make that much of a difference?",
            "title_similarity": "0.5017988",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hzhur6c",
            "score": 1,
            "text": "This post and comments made me rethink taking a vacation to Arizona next month",
            "title_similarity": "0.45332834",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhutx5",
            "score": 1,
            "text": "And I’ll be the first to make that evident if you put me in a 90° and 100% humidity day and try to make me to do anything other than lay in the shade or the water.",
            "title_similarity": "0.5094782",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhuyd9",
            "score": 1,
            "text": ">87°F at 100% humidity\n\nI lived in the Eastern Province of Saudi Arabia on the coast.  I guess we didn't get 100% humidity (what even is that? under water?)  But lots of days were 70% + and like 90-100F",
            "title_similarity": "0.7038219",
            "sentiment_compound": 0.5588
        },
        {
            "id": "hzhv4yp",
            "score": 1,
            "text": "When I was a child we didn't have air-conditioning or even fans and in summer it got up to 45 degrees Celsius. \n\nWe survived. \n\nNowadays if it is higher than 25 I need the air-conditioning on.",
            "title_similarity": "0.629459",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hzhv9sl",
            "score": 1,
            "text": "I work as an underground miner and this has been a known thing for quite some time now",
            "title_similarity": "0.22464535",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhvaqd",
            "score": 1,
            "text": "I worked under ground in Mt Isa. \nYou can.",
            "title_similarity": "0.16212973",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhvb3o",
            "score": 1,
            "text": "This is scary as someone who has family in Miami. The dew point exceeds 80 on occasion, and the windows fog up on the outside for half the year.",
            "title_similarity": "0.60411566",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hzhvwhj",
            "score": 1,
            "text": "So how much of the planet will be uninhabitable due to climate change and which areas?",
            "title_similarity": "0.5313928",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhw1mi",
            "score": 1,
            "text": "Not even a joke. Wouldn't you just need human shield wipers. Aka, just wipe down more often? Sweat still secretes, it just doesn't evap from the skin correct?\n\nWipe, twist, repeat?",
            "title_similarity": "0.572823",
            "sentiment_compound": -0.3459
        },
        {
            "id": "hzhw6ux",
            "score": 1,
            "text": "You guys have obviously never been to South Louisiana. Triple digits with heat index and a constant 100% humidity.",
            "title_similarity": "0.52535456",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhwclg",
            "score": 1,
            "text": "I don't know anywhere that has 100% humidity. The study would've been helpful to show more realistic humidities, like 90% or 85%, which is much more common and for greater numbers of people.",
            "title_similarity": "0.71268487",
            "sentiment_compound": 0.7943
        },
        {
            "id": "hzhwi9e",
            "score": 1,
            "text": "During the summer at work the inside of the shop hovers around 100 degrees, we're right next to marshland and the humidity is 80%+ most days in the summer\n\nI end up needing to duck into the lunch room for like 30 minutes at least once a shift because the heat and humidity makes it feel like I'm trying to breath through a wet rag",
            "title_similarity": "0.5320014",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hzhwtrn",
            "score": 1,
            "text": "That's roughly 130 deg.degrees. kuwait hot",
            "title_similarity": "0.5111893",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhx4y4",
            "score": 1,
            "text": "I have no idea what a wet bulb is but I’m sure it’s pretty sexy",
            "title_similarity": "0.46229511",
            "sentiment_compound": 0.9052
        },
        {
            "id": "hzhx6yl",
            "score": 1,
            "text": "Lytton British Columbia Canada, before burning to the ground, hit 49.6C last year. A Canadian record.",
            "title_similarity": "0.3924174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhx8fj",
            "score": 1,
            "text": "Err... but people live in the desert or Queensland Australia.",
            "title_similarity": "0.21288247",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhxc19",
            "score": 1,
            "text": "How exactly did they test this without harming people???",
            "title_similarity": "0.27480263",
            "sentiment_compound": 0.5368
        },
        {
            "id": "hzhxgpu",
            "score": 1,
            "text": "How have humans thrived in the tropics, if this is true? I’ve lived in the Amazon and Saudi Arabia and my personal experience says this study doesn’t pass the common sense test.",
            "title_similarity": "0.5615926",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hzhxr0b",
            "score": 1,
            "text": "I live in a desert area where humidity is ways very low. We are exposed to both freezing winters and very hot summers but we do okay. But the day it rains and we have to deal with the humidity nobody knows what to do to be comfortable",
            "title_similarity": "0.60043514",
            "sentiment_compound": 0.6959
        },
        {
            "id": "hzhxyr5",
            "score": 1,
            "text": "So people living in dry climates are screwed by climate change because these mega droughts and now people in wet climates are screwed by temperature and rising humidity. If only we saw this coming…",
            "title_similarity": "0.6079515",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hzhy862",
            "score": 1,
            "text": "Try a Texas summer, full Army uniform, Kevlar, etc. in the field, no shade for miles. The Army says YOU WILL endure.",
            "title_similarity": "0.31721824",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzhyed7",
            "score": 1,
            "text": "I work as a driver unloading cargo in raliegh. It’s routine way hotter than this and it’s unbearable. Every summer I tell myself this is the last year. No health insurance, little time off. I’ll die at work before I can retire. My little slice of the American dream I guess?",
            "title_similarity": "0.543585",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hzhyt8l",
            "score": 1,
            "text": "Reading this when my job gets to be 115 in the summer.",
            "title_similarity": "0.37595695",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhywav",
            "score": 1,
            "text": "Live in Darwin, Australia for a few yeats and gbtm",
            "title_similarity": "0.16420889",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhyy6k",
            "score": 1,
            "text": "Weird. I’ve definitely been in temperatures and humidity levels very close to that in the Philippines and Fiji. It was miserably hot for those in my group but you get used to it. Meanwhile the natives seemed to have no issues going about their business and doing manual labor jobs. Is it possible that the study only refers to individuals who have not adapted to such extremes?",
            "title_similarity": "0.61634904",
            "sentiment_compound": -0.5187
        },
        {
            "id": "hzhz0bz",
            "score": 1,
            "text": "This is hard to believe, many studies were done on military overseas. As I was one of them.\nThey found out we would operate with a core temp of over 100 F.\nThis didn't faze anyone due to the correct conditioning, even our boots would melt as we walked. I'm sure humidity will play a big role but as far as core temp of our body goes, we can handle more than you would think.",
            "title_similarity": "0.6392443",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hzhz1td",
            "score": 1,
            "text": "Used to work out on airport ramps. During the summer 100+ F with 90-100% humidity wasnt uncommon. It was pretty common for guys to shovel ice down their shirts, including myself. It was kind of like working in Hell.",
            "title_similarity": "0.5092937",
            "sentiment_compound": -0.0498
        },
        {
            "id": "hzhz5qt",
            "score": 1,
            "text": "At least there is some science to support the fact that every summer I spend in New Orleans makes me feel like death. Our weather is surprisingly good if we could just eliminate summer with 100F heat and 100% humidity.",
            "title_similarity": "0.6038548",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hzi07bl",
            "score": 1,
            "text": "I can, try fighting fires, someone always has a belt weather kit. Maybe it's the obese, sedentary type. And you obviously don't know about the south land, especially pre A/C",
            "title_similarity": "0.56188023",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hzi0cuo",
            "score": 1,
            "text": "It's regularly above that temp and 80 percent humidity in florida..",
            "title_similarity": "0.44670728",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi0feo",
            "score": 1,
            "text": "Checking for average humidity+temperature capacity for “humans” makes no sense since some like the Eskimo adapted to northern latitudes and some like Congolese adapted to tropics. \n\nIt’s like trying to account for average human height, it will vary wildly by region(Pygmy vs Dutch).",
            "title_similarity": "0.72426426",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hzi0hxt",
            "score": 7,
            "text": "I live in Australia and got heatstroke yesterday at 29 degrees but 75% humidity. I was cleaning up after the floods here and  spent less than 3 hours working (9am-midday). I drank 2l of water while doing it, stayed in the shade as much as possible and had a hydralite and still got home and passed out on the couch for the whole afternoon absolutely wrecked",
            "title_similarity": "0.5456414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi0o2j",
            "score": 1,
            "text": "We have been surviving this for a long time in South Texas, it's the same way others have been surviving -40 in Northern Canada.",
            "title_similarity": "0.3297363",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hzi1dmb",
            "score": 1,
            "text": "which is why so many people will die in india, central africa etc because of climate change.\n\nmigrations will be crazy.\n\n\"Number of days per year above lethal threshold in 2100 with +4C\"\n\nhttps://i.imgur.com/QaFOyVq.png",
            "title_similarity": "0.5649401",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hzi28t7",
            "score": 2,
            "text": "Link to the actual study not the useless press release what is this? Cannot get any info at all.",
            "title_similarity": "0.333773",
            "sentiment_compound": 0.3252
        },
        {
            "id": "hzi2b9q",
            "score": 1,
            "text": "I'm confused.  Older people can feel cold at 87F",
            "title_similarity": "0.54393446",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hzi2e4m",
            "score": 2,
            "text": "*nervously sweats in Georgia*",
            "title_similarity": "0.38048768",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hzi2gga",
            "score": 1,
            "text": "excuse me but i think this is bias\ni live in a region of my country where summer temperatures normally get up to 36°C (98F?), and get \"hot\" up to 42°C(108F?), and we carry on just normally, a lot of people dont even have a fan or AC, tey just endure it, \nby winter it gets nice and goes 0°C to 15°C but that only last about 2 months and we really suffer that \"cold\" as we are not used to it",
            "title_similarity": "0.70474046",
            "sentiment_compound": 0.0952
        },
        {
            "id": "hzi2keh",
            "score": 1,
            "text": "Meanwhile when my family from Malaysia visits me in Europe, they are freezing and wearing jackets when it's below 30 c/85 f.",
            "title_similarity": "0.46616536",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hzi2lcf",
            "score": 1,
            "text": "What about steam saunas?",
            "title_similarity": "0.25046527",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi2ymd",
            "score": 1,
            "text": "As a Floridian that works outside I question your results.",
            "title_similarity": "0.3158116",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi3i7s",
            "score": 1,
            "text": "I would liked to see this study in Iraq. 160 f in my tent 90% humidity in August.",
            "title_similarity": "0.5224537",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hzi4ihx",
            "score": 1,
            "text": "Sounds like summer in Kentucky",
            "title_similarity": "0.20348293",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzi4olu",
            "score": 1,
            "text": "Texan here , you get used to it",
            "title_similarity": "0.22212104",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi4qgh",
            "score": 1,
            "text": "I've had people look at me like I'm crazy when I've said I'd rather have 100°F Arizona weather than I would 80°F NYC weather. (Which I know isn't as humid as other places but still...)\n\nHumidity just kills me. I feel like my skin is literally suffocating me. I get dizzy and faint. It can literally feel painful internally.",
            "title_similarity": "0.7030437",
            "sentiment_compound": -0.8248
        },
        {
            "id": "hzi4ryx",
            "score": 1,
            "text": "My Houston, TX ass says otherwise. Heat + high humidity for 42 years.",
            "title_similarity": "0.6069401",
            "sentiment_compound": -0.0688
        },
        {
            "id": "hzi4ssb",
            "score": 1,
            "text": "Mean while the Australians living is Alice Springs:",
            "title_similarity": "0.33010805",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi4t82",
            "score": 1,
            "text": "I knew that. Put me in humid weather and I’m on my face",
            "title_similarity": "0.1900914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi4xj9",
            "score": 1,
            "text": "What is the max temp at say 90% humidity?",
            "title_similarity": "0.5098236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi5cp2",
            "score": 1,
            "text": "Then how are those living in Bangladesh still alive?",
            "title_similarity": "0.2546332",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hzi5fux",
            "score": 3,
            "text": "This is why San Diego is nicknamed America’s Finest City. The Mediterranean climate is considered the optimal climate for humans.",
            "title_similarity": "0.39326328",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzi5gii",
            "score": 1,
            "text": "That’s pretty much Florida 9 months a year",
            "title_similarity": "0.39040852",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzi5o1z",
            "score": 1,
            "text": "I live in SE Asia with temprature about 31° and humidity ranging between 97-98%. I'm living fine. It depends on people",
            "title_similarity": "0.544886",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hzi61s7",
            "score": 1,
            "text": "Idk man. Live during a Florida summer. Humans can handle it.",
            "title_similarity": "0.23753598",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hzi6iam",
            "score": 1,
            "text": "I mean the plants are gonna go first so there shouldn't be any humidity in the future.",
            "title_similarity": "0.40191332",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi6k4y",
            "score": 1,
            "text": "I guess these guys are not from the American south.  We live through 6 months of 90-100 degree days with humidity near 100% every day.  Often well into the 100s.  Then if you more south much of Central America and the South America are worse.  I spent a month in Panama in the army and it was in the 90s all day and most of the night with near 100% humidity the whole time.  With nothing but a ceiling fan and breeze.  You adapt and learn to drink a lot of water.",
            "title_similarity": "0.62946135",
            "sentiment_compound": 0.3506
        },
        {
            "id": "hzi6nd7",
            "score": 1,
            "text": "I've always wondered what the absolute limit would be for ambient air temperature to, lets say, walk through. I mean we can stick your head or hand in an 400 degree oven for like 10 seconds at least before it gets to hot to bear. What temp would your skin burn immediately. Just morbid curiosity",
            "title_similarity": "0.6126479",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hzi6orp",
            "score": 1,
            "text": "No wonder why so many people die in Ontario during throughout the summer",
            "title_similarity": "0.4218254",
            "sentiment_compound": -0.7479
        },
        {
            "id": "hzi6p5x",
            "score": 1,
            "text": "No sauna for you filthy human",
            "title_similarity": "0.35278845",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzi71ls",
            "score": 1,
            "text": "Welcome to the panhandle, where nature says leave but the people don’t listen.",
            "title_similarity": "0.34861702",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hzi75fa",
            "score": 1,
            "text": "That's a mild Iowa summer these last few years.   This summer will be drought conditions though since we've only gotten one good snow.  -40 to 110f with high humidity is our current temperature range.",
            "title_similarity": "0.6798004",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hzi7hoe",
            "score": 1,
            "text": "meanwhile in arkansas you can swim across the parking lot in summer with how humid it is",
            "title_similarity": "0.28289187",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi7zdv",
            "score": 1,
            "text": "Texan here begs to differ, summers are ridiculously humid",
            "title_similarity": "0.46027836",
            "sentiment_compound": -0.34
        },
        {
            "id": "hzi85ts",
            "score": 1,
            "text": "We had 26 degrees + 100% humidity for a few weeks this summer - including through the nights. It doesn't sound that bad but it was pretty hellish. I barely went outdoors at all, don't know how I would have got through it with my sanity intact without air conditioning. Many houses where I live are old and don't have air conditioning. This combo of heat and humidity was new for us.",
            "title_similarity": "0.67806196",
            "sentiment_compound": 0.1593
        },
        {
            "id": "hzi8gn2",
            "score": 1,
            "text": "Yeah... this doesn't seem remotely right.\n\nThis temperature and umidity are really common here in Brazil, even 40º with 100% umidity.",
            "title_similarity": "0.5750723",
            "sentiment_compound": 0.296
        },
        {
            "id": "hzi8pli",
            "score": 1,
            "text": "Can I still take a bath?...",
            "title_similarity": "0.19872591",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi8vg6",
            "score": 1,
            "text": "This is why San Diego is become too expensive for locals",
            "title_similarity": "0.5112479",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi9e7p",
            "score": 1,
            "text": "So Florida is a death trap, more than it already is?",
            "title_similarity": "0.4145429",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hzi9km6",
            "score": 1,
            "text": "I work on the beach in Florida….this does not bode well",
            "title_similarity": "0.39811414",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hzi9sd8",
            "score": 1,
            "text": "Let's just sit tight and assess for another decade or three.  We don't have to worry, or change anything until 2050, right?",
            "title_similarity": "0.47722983",
            "sentiment_compound": 0.3412
        },
        {
            "id": "hzi9u08",
            "score": 1,
            "text": "Laughs in Minnesotan. But seriously, growing up in the great plains (family is from MN) it was a fairly regular occurrence to have humidity near 100% with temps in the upper 80s. I do recall that on those days, we didn't go outside much because the humidity was outright oppressive. You would be dripping with sweat because it couldn't evaporate, and you felt the water in the air entering your lungs and making it hard to breathe. Even as a kid I would just sit on the porch in the shade before bailing to go back inside to the AC. My parents tell me it was awful growing up without AC in that weather.",
            "title_similarity": "0.65437126",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hzi9vxx",
            "score": 1,
            "text": "Tell that to the generations living in Rio de Janeiro.",
            "title_similarity": "0.11083048",
            "sentiment_compound": 0.0
        },
        {
            "id": "hziaj0b",
            "score": 1,
            "text": "Wet bulb. Dry bulb. No bulb. We’re fucked.",
            "title_similarity": "0.41528016",
            "sentiment_compound": -0.765
        },
        {
            "id": "hziaxrg",
            "score": 1,
            "text": "Hol' up. I'm in Chicago where in summer it routinely gets to 90s F and up with high - 100% for days at a time - humidity in the summer. And occasionally in the fall and spring, and once I can remember in winter because it's Chicago so why the hell not. \n\nDoes that mean I didn't actually survive all those years of busting my ass in the sweltering heat? Because I'm pretty depressed all the time, sure, but I can't pass through walls so I'm pretty sure I'm not a ghost. I may be in hell though, I'm not decided on that yet.",
            "title_similarity": "0.59848046",
            "sentiment_compound": -0.1219
        },
        {
            "id": "hzib74j",
            "score": 1,
            "text": "can someone do a ELI5? big words like wet bulb and stuff aren't making sense to me",
            "title_similarity": "0.58595836",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzibihg",
            "score": 1,
            "text": "Come to south alabama in august. It’s regularly above 100 with 80-90% humidity",
            "title_similarity": "0.46941286",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzibjrw",
            "score": 2,
            "text": "Where I live in Northern Aus, the last two weeks it has even over 33C (up to 36C) every day with humidity at 70-80%... Im freaken dying over here.",
            "title_similarity": "0.55235714",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzibkkp",
            "score": 1,
            "text": "If the humidity is 100% what is stopping people from using an atmosphere water generator and generating small amounts of freshwater? \n\n\nThis could solve the danger of wet bulb while providing water for people.",
            "title_similarity": "0.686237",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hziblev",
            "score": 1,
            "text": "*Cries in 55C at 100% Humidity in Dubai*",
            "title_similarity": "0.4608224",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hzibnxt",
            "score": 1,
            "text": "Well.\n\nWow.\n\nThat's...  Wow.  I've studied a lot of the science here.  This moves the acute consequences of climate change closer to us... by quite a bit.  We just lost about a century of transition time depending on which IPCC projection you believe.\n\nThis is dark.\n\nThis is \"We need to start a plan to gradually resettle the Persian Gulf population within our lifetime\" size news.  With a \"Not to Rio, or Atlanta, or Mumbai, because they're the next phase\" kicker.\n\nI really hope somebody fails to replicate this finding.",
            "title_similarity": "0.57966113",
            "sentiment_compound": 0.8191
        },
        {
            "id": "hzic51i",
            "score": 1,
            "text": "This contradicts the heaps of evidence that heat therapy e.g. sauna is extraordinarily good for human health.",
            "title_similarity": "0.57401603",
            "sentiment_compound": 0.128
        },
        {
            "id": "hzic83h",
            "score": 1,
            "text": "Isn't 100% humidity literally \"underwater\"?",
            "title_similarity": "0.5453656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzicfya",
            "score": 1,
            "text": "Yes I can and you people have obviously never been to Louisiana in the middle of August.",
            "title_similarity": "0.3811909",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hzicwpu",
            "score": 2,
            "text": "News @ 11: Humans can't take being slow-boiled.",
            "title_similarity": "0.5657387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzid5ix",
            "score": 1,
            "text": "\"Alabama summer weather\"",
            "title_similarity": "0.19608642",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzidxfg",
            "score": 1,
            "text": "*Me with allergies*: “ I could’ve freakin told you that.”",
            "title_similarity": "0.37542555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzie8fg",
            "score": 1,
            "text": "People in Panama: Adios",
            "title_similarity": "0.07466157",
            "sentiment_compound": 0.0
        },
        {
            "id": "hziec8n",
            "score": 1,
            "text": "So we're all gonna die...sooner.",
            "title_similarity": "0.3226659",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzieggj",
            "score": 2,
            "text": "Anecdotal experience :\n\nLiving in Australia, can indeed tolerate 40-50+ Celsius temperatures fine if it's dry and there's a breeze.\n\nBut when the temp goes over 30 and it's humid, I'm either turning on. The A/C or have a fan to circulate the air to help cool down... Ice blocks help",
            "title_similarity": "0.59525687",
            "sentiment_compound": 0.9011
        },
        {
            "id": "hzierkl",
            "score": 1,
            "text": "Used to live in Arkansas. Heat is just instantaneous in the daylight you just sweat and stay wet all day.",
            "title_similarity": "0.45683172",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzif6jc",
            "score": 1,
            "text": "Clearly they haven’t been in Puerta Vallarta during rain season.",
            "title_similarity": "0.4033535",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hzifk2j",
            "score": 1,
            "text": "Could someone please explain the ”wet-bulb” concept",
            "title_similarity": "0.21738109",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hzifo18",
            "score": 1,
            "text": "Sounds like every summer in Arkansas",
            "title_similarity": "0.24269599",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzig0n2",
            "score": 1,
            "text": "Very hard to believe living in Sevilla.",
            "title_similarity": "0.36811364",
            "sentiment_compound": -0.1761
        },
        {
            "id": "hzig3h5",
            "score": 1,
            "text": "I live in south Louisiana, we survive.",
            "title_similarity": "0.16370457",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzighzn",
            "score": 2,
            "text": "Australian businesses: \"LALALALALALALALALALALALA I CAN'T HEAR YOU!!\"\n\nFor the unaware: During summer, in my state/area, it frequently hits around 32-34 degrees around 9ish am lasting till about 4pm I'd say. In an office I'd argue that's nothing but in a factory it's basically hell on earth.",
            "title_similarity": "0.57930493",
            "sentiment_compound": -0.8774
        },
        {
            "id": "hzigkob",
            "score": 1,
            "text": "Oh hey, I know Daniel J. Vecellio",
            "title_similarity": "0.0469873",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzigzrz",
            "score": 2,
            "text": "I'm in Darwin, northern Australia. Currently it's the Wet season, humidity is regularly 85% +, average temp around 30-34C.\nOutside work, eg Gardening, landscaping. Start work at 0600, drink a litre of water, 1000 break in cool aircon if possible drink another litre min. 1200 as above break, add Gatorade or similar to 2 litres. Drink. 1500 knock off. Drink min of 2 litres on the way home.\n\nYes you get acclimatized, but even so if you start to get a headache or run a temp. Then you MUST stop, get in the aircon and keep sipping hydration enhanced.\nYou need to drink for the hours ahead not currently.\n\nBtw I love it here. Love the environment and the Wet",
            "title_similarity": "0.5891491",
            "sentiment_compound": 0.9231
        },
        {
            "id": "hzih5ib",
            "score": 1,
            "text": "The summers of deaths are coming.",
            "title_similarity": "0.34434503",
            "sentiment_compound": 0.0
        },
        {
            "id": "hziheg3",
            "score": 2,
            "text": "So sitting in my steam shower for 20min at 110f isn't good for me?",
            "title_similarity": "0.6264871",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hzihlqc",
            "score": 1,
            "text": "great. juuust great! first we heat up the planet, then we find out abt this!? great",
            "title_similarity": "0.2893437",
            "sentiment_compound": 0.9399
        },
        {
            "id": "hzihnw4",
            "score": 1,
            "text": "I am fairly certain there are some people in the Philippines who would challenge this. The few months we were there we hit Temps of 120F or more. With 100% humidity. The people there were making it. We made it. And in dry, arid places like the middle east, people have learned to adapt to ridiculous oven type heat. Hell, I come from Louisiana and we even go over 87 with 100% humidity. People there are doing alright. Who even told you this garbage?",
            "title_similarity": "0.5879017",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzihpkz",
            "score": 1,
            "text": "This is a generic and therefore useless",
            "title_similarity": "0.3478728",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hzii1wj",
            "score": 1,
            "text": "I'm fairly certain that a normal day here in VA.",
            "title_similarity": "0.27144375",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hziiin4",
            "score": 1,
            "text": "*laughs in Houston, Texas summers*",
            "title_similarity": "0.2998503",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hziilra",
            "score": 1,
            "text": "Some are more resilient than others so I think some can endure higher.",
            "title_similarity": "0.4582302",
            "sentiment_compound": 0.0
        },
        {
            "id": "hziimgc",
            "score": 1,
            "text": "As an HVAC tech in South Florida, this is not new.  Hottest attic I've been in was 160, and about 40% humidity (od humidity was near 75, but because it was so hot, the air could hold a lot more moisture, driving the relative humidity down).  3 minutes and I was done.",
            "title_similarity": "0.6682385",
            "sentiment_compound": 0.0
        },
        {
            "id": "hziish9",
            "score": 1,
            "text": "So when the weather man says its going to be 95°F out and 100% humidity, why am i not dead? Thats pretty common in the NE usa.",
            "title_similarity": "0.5557029",
            "sentiment_compound": 0.2057
        },
        {
            "id": "hziiu13",
            "score": 1,
            "text": "Carrying a rucksack, in full kit, an ammo box in one hand and one corner of a stretcher with the other, chewing on over 800 mg. Of caffeine gum from MRE’s while sporadically getting smoked by Drill SGT’s in 100% humidity and 90F temp. I would attest that you can very well endure temperatures and humidity.",
            "title_similarity": "0.47827414",
            "sentiment_compound": 0.6801
        },
        {
            "id": "hzij5wz",
            "score": 1,
            "text": "We're going to need space suits to go outside .  Simple fix.",
            "title_similarity": "0.25751972",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzijmkl",
            "score": 1,
            "text": "Can anyone recommend some podcasts/eps about this topic?",
            "title_similarity": "0.21841559",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzijo1x",
            "score": 1,
            "text": "That’s because they haven’t tested me. Hold my beer.",
            "title_similarity": "0.42429966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzikmhg",
            "score": 1,
            "text": "So, the folks living in Baton Rouge are inhuman?",
            "title_similarity": "0.3660817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzikrv8",
            "score": 1,
            "text": "n = 24 experiment, unclear how many replicates for each subject, clothing, airflow, etc. \n\n\"Additionally, the researchers added that because humans adapt to heat differently depending on the humidity level, there is likely not a single cutoff limit that can be set as the “maximum” that humans can endure across all environments found on Earth.\"\n\nMaybe try this with a bunch of roofers from central texas, see how they handle the heat?",
            "title_similarity": "0.7126547",
            "sentiment_compound": -0.25
        },
        {
            "id": "hzikzjz",
            "score": 1,
            "text": "> The temperature for older populations, is likely even lower.\n\nExtraneous comma--now I can't believe anything that was stated.",
            "title_similarity": "0.8116321",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzil1ez",
            "score": 1,
            "text": "Is this saying I cannot survive an 87 degree hot tub ?",
            "title_similarity": "0.59954274",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzil95l",
            "score": 1,
            "text": "So now the question is... Was this always true, or is some of this the result of people remaining in climate controlled environments for their entire life?.. never having to endure temperature extremes.",
            "title_similarity": "0.44585872",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hzile17",
            "score": 1,
            "text": "Those MTLs at Keesler AFB have some explaining to do!",
            "title_similarity": "0.16911083",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzilwic",
            "score": 9,
            "text": "*chuckles in Floridian*\n\nI'm in danger.",
            "title_similarity": "0.22859827",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hzim28j",
            "score": 2,
            "text": "Dry heat is much more tolerable. I’ve been in Greece where it’s been 40+ but extremely low humidity I didn’t even sweat much. I returned to London and humidity was horrendous high 20s & I felt like I could keel over.",
            "title_similarity": "0.71333724",
            "sentiment_compound": -0.7218
        },
        {
            "id": "hzimdrq",
            "score": 1,
            "text": "Have you ever been in South Florida in the summer?",
            "title_similarity": "0.1741226",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzin8q9",
            "score": 2,
            "text": "The study hasn’t taken into consideration a key element. Humans have to get acclimated to find the true maximum survivable wet bulb temperate. This isn’t really relevant for the elderly when power outages occurs in the rich world as they won’t be acclimated, but populations in regions without widespread ac should have significantly higher tolerances.",
            "title_similarity": "0.73087895",
            "sentiment_compound": 0.5647
        },
        {
            "id": "hzins5b",
            "score": 3,
            "text": "The only part of this that bothers me is that of course it is the poor and the desperate dying first, I've been waiting for realistic action on the environment for forty five years and I  still see nothing but rhetoric. As a race, we're idiots heading for a Darwin award and determined to take as much of the planet with us as we can. What a sorry spectacle, the humans, look how smart we all are, the greatest show on earth.",
            "title_similarity": "0.51842886",
            "sentiment_compound": 0.9398
        },
        {
            "id": "hzio2rw",
            "score": 1,
            "text": "I grew up in the Midwest and one time it was 100 degrees and 100% humidity at 10 o’clock at NIGHT. I went outside just to see what it was like and it was like walking into a sauna.",
            "title_similarity": "0.48416927",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hzioo6h",
            "score": 1,
            "text": "source: me every summer",
            "title_similarity": "0.18326114",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzip5jp",
            "score": 1,
            "text": "Huh. That explains why last year in one single day I almost felt like I was going to pass out. We have 100% humidity all year round and that one day we were reaching 32-33°C",
            "title_similarity": "0.5874101",
            "sentiment_compound": 0.4627
        },
        {
            "id": "hzip6qv",
            "score": 1,
            "text": "I did a ridge-line hike on Lantau Island in HK a few years back and was absolutely miserable, it was about 70% humidity at 90° F. I was not able to keep hydrated as fast as I was sweating through my clothing and we were exerting ourselves with the elevation change and some climbing over limbs/tree trunks that had fallen on the path. Me and my hiking partner had routinely done 10-20 mi. hikes (including one a few days before), this one was maybe 2.5 mis and we were completely out of energy.\n\nI have been kind of skeptical about wet-bulb temperature maximums based on this personal experience, just because a high humidity/high heat environment is technically survivable doesn't mean you don't succumb to longer term health issues from kidney damage or heat stroke.",
            "title_similarity": "0.66761994",
            "sentiment_compound": -0.8563
        },
        {
            "id": "hzipgoz",
            "score": 1,
            "text": "Houstonians will disagree",
            "title_similarity": "0.42090285",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hzipujh",
            "score": 1,
            "text": "*Laughs in New Orleanian*",
            "title_similarity": "0.26916593",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzipuly",
            "score": 1,
            "text": "Temperature is like 38 with 94% humidity today. Guess I'm going to die.",
            "title_similarity": "0.58332014",
            "sentiment_compound": -0.34
        },
        {
            "id": "hziq2wd",
            "score": 1,
            "text": "Yeah. No. In Hong Kong the temperature is 31-33C and 90-100% humidity half the year. Not a very credible study.",
            "title_similarity": "0.76600933",
            "sentiment_compound": 0.296
        },
        {
            "id": "hziqotm",
            "score": 1,
            "text": "Well the “feels like” (wet bulb???) temp here is currently 44C. So I don’t feel so bad about not wanting to mow.",
            "title_similarity": "0.58518744",
            "sentiment_compound": -0.6035
        },
        {
            "id": "hzir8n2",
            "score": 1,
            "text": "Wim Hoff would like a word....",
            "title_similarity": "0.1799415",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzirizf",
            "score": 1,
            "text": "From South Carolina, 89 and 90+ humidity during the south isn't that bad here compared to some other days so i feel like this sampling was wrong or the testing was on people who were \"young and healthy\"",
            "title_similarity": "0.7205899",
            "sentiment_compound": 0.6386
        },
        {
            "id": "hzirk50",
            "score": 1,
            "text": "I've done 40C 100 humidity, I would rather die then do that again. I'm from Canada.",
            "title_similarity": "0.44672945",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hzis1s6",
            "score": 1,
            "text": "I'll keep my coastal 75 most of the year, thanks. Not planning on going anywhere bad anytime soon",
            "title_similarity": "0.43912888",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hzisg11",
            "score": 1,
            "text": "Great. So we’re gonna literally die in native Earth atmosphere even sooner now.",
            "title_similarity": "0.39262038",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hzish28",
            "score": 1,
            "text": "Dude, in Georgia its over 87° and 100%humidity for like 4 months a year. Just constantly sweaty.",
            "title_similarity": "0.4971427",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzit2sa",
            "score": 1,
            "text": "They can’t endure them, but some do everyday? Huh?",
            "title_similarity": "0.5425186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzitga1",
            "score": 1,
            "text": "Welcome to Louisiana, where humidity under 100% is a rarity.",
            "title_similarity": "0.64196444",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hzitmo0",
            "score": 1,
            "text": "-cries in New England summers-",
            "title_similarity": "0.35860372",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hziu9nt",
            "score": 2,
            "text": "This is part of the reason we moved away from Florida. Summer is miserable.",
            "title_similarity": "0.47671038",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hziucum",
            "score": 1,
            "text": "Do experiments on 34 people? I want more than that.",
            "title_similarity": "0.44870633",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hziuhcd",
            "score": 1,
            "text": "So that’s why my life expectancy in Louisiana is so short. It’s not the large amounts of delicious food and copious alcohol beverages.",
            "title_similarity": "0.63971674",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hziutga",
            "score": 1,
            "text": "As a Floridian, I disagree.",
            "title_similarity": "0.33432916",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hziuyfm",
            "score": 1,
            "text": "Can someone translate this to American measurements. I’m to lazy.",
            "title_similarity": "0.40388072",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hziv2k4",
            "score": 1,
            "text": "Apparently these scientists have never been to Disney World  during the summer.",
            "title_similarity": "0.3781854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzivgfj",
            "score": 1,
            "text": "Tell that to Orlando Fl",
            "title_similarity": "0.08381036",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzivote",
            "score": 1,
            "text": "as a Houston, Texas native who insists it's been getting hotter and hotter since I was a kid, the high end quote here scares me.",
            "title_similarity": "0.50328857",
            "sentiment_compound": -0.34
        },
        {
            "id": "hziw1ml",
            "score": 1,
            "text": "That explains why everyone in Florida is dying",
            "title_similarity": "0.30508152",
            "sentiment_compound": 0.0
        },
        {
            "id": "hziw96m",
            "score": 1,
            "text": "Tibetan tomo meditation has proven this stuff wrong soooo many times. It has been documented and studied before",
            "title_similarity": "0.38979304",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hziwxko",
            "score": 1,
            "text": "Then there’s us military folk who would land in uk at 20F and in 10 hrs end up in a desert at 140F. Daytime 130 + night down to 100 but ridiculous humidity",
            "title_similarity": "0.5845336",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hzixgds",
            "score": 1,
            "text": "Ha. That’s funny. Tell that to all the people that live on the equator in the jungle.",
            "title_similarity": "0.13921866",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hzixnmw",
            "score": 1,
            "text": "Deep east Texas is horrible in the summer. High humidity and heat. And I worked outdoors for over a decade. It's a wonder I never had a heat stroke.",
            "title_similarity": "0.56346506",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hzixsd9",
            "score": 1,
            "text": "oh good. means our ideas about migration and climate change are once again too mild",
            "title_similarity": "0.54566634",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hziyvla",
            "score": 1,
            "text": "So I have a case against my gf gaslighting me when her apartment was 37C during that heatwave and as I was bordering on heatstroke told I'm a princess?",
            "title_similarity": "0.49437243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj03w2",
            "score": 1,
            "text": "It's over that in Louisiana May through August",
            "title_similarity": "0.30091622",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj1nhr",
            "score": 1,
            "text": "I mean. I live in goddamn Florida.",
            "title_similarity": "0.1093332",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hzj1sbu",
            "score": 1,
            "text": "I'm pretty sure the us army already knows this.  Since the data cites young healthy people I'm pretty sure it's using army data.",
            "title_similarity": "0.3529933",
            "sentiment_compound": 0.9136
        },
        {
            "id": "hzj1txi",
            "score": 1,
            "text": "Seems like a poorly worded title.  What do they mean by “endure”?  Of course humans can survive that temperature for a period of time.  So how long are we talking?",
            "title_similarity": "0.58259827",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hzj247x",
            "score": 1,
            "text": "In hong Kong you get used to it in the summer",
            "title_similarity": "0.3156349",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj25kk",
            "score": 1,
            "text": "These scientists have clearly never lived in Houston.",
            "title_similarity": "0.34861684",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hzj30lb",
            "score": 1,
            "text": "Well here in Florida it is regularly higher than that sooo….",
            "title_similarity": "0.39235413",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hzj33s7",
            "score": 1,
            "text": "South Floridians beg to differ",
            "title_similarity": "0.22352767",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj37c3",
            "score": 1,
            "text": "Whoever wrote this apparently doesn't live in the American Southeast...",
            "title_similarity": "0.40705615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj3igd",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.2221661"
        },
        {
            "id": "hzj45nd",
            "score": 4,
            "text": "Wet bulb temperature will be the death of billions around the equator. Literally can't expel heat through perspiration because of the ~~osmotic~~ **vapor** pressure from the atmosphere. Not good\n\nEdit: thank you for the correction, u/chemomechanics ! You are totally right. If osmotic pressure were the overlying phenomenon, then we would definitely be living in a different reality xD",
            "title_similarity": "0.69658136",
            "sentiment_compound": -0.4943
        },
        {
            "id": "hzj4b6l",
            "score": 1,
            "text": "Hence air conditioning",
            "title_similarity": "0.1974305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj4gah",
            "score": 1,
            "text": "What a terrible goddamn title.",
            "title_similarity": "0.3070389",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hzj5a6b",
            "score": 1,
            "text": "I knew I wasn’t tripping.  Humidity saps all my motivation to live.",
            "title_similarity": "0.41664547",
            "sentiment_compound": 0.34
        },
        {
            "id": "hzj5mji",
            "score": 1,
            "text": "Laughing in Floridian.",
            "title_similarity": "0.13168575",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzj5ps7",
            "score": 1,
            "text": "Given the way the world is going, that’s not great",
            "title_similarity": "0.42724547",
            "sentiment_compound": -0.5096
        },
        {
            "id": "hzj64i5",
            "score": 1,
            "text": "~~Take that, people defending the use of Fahrenheit~~",
            "title_similarity": "0.3076743",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj6ghg",
            "score": 1,
            "text": "As an Arab with pretty humid summers in my country, guess i’ll die huh?",
            "title_similarity": "0.4824009",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hzj6r9i",
            "score": 1,
            "text": "Dude here in Dubai temperature hit 40s in summer",
            "title_similarity": "0.4024884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj71pp",
            "score": 1,
            "text": "Welcome to Georgia, Alabama, Mississippi, and Louisiana, and non costal Florida.",
            "title_similarity": "0.17622237",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hzj79m4",
            "score": 1,
            "text": "I have a steam room. I've survived more than 87 degrees on hundreds of occasions.",
            "title_similarity": "0.37436146",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hzj7eyy",
            "score": 1,
            "text": "It gets hotter here on the Texas Coast with 100% humidity. It's rough",
            "title_similarity": "0.48669553",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj7myt",
            "score": 1,
            "text": "India In august is way hotter than that",
            "title_similarity": "0.4675287",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj7oo0",
            "score": 1,
            "text": "\"Hey Bob go in to the cryo cham...uhm storage and grab us a beverage in the far end of the room\"",
            "title_similarity": "0.1936",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj7q9b",
            "score": 1,
            "text": "I lived in South Alabama for 30 years. You don't get use to the heat and humidity. I live in the desert now and prefer the 100 degree days with no humidity to the 90 degree ones back home.",
            "title_similarity": "0.63620925",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzj7sfc",
            "score": 1,
            "text": "I guess with all the global warming going on this is good to know.",
            "title_similarity": "0.44087034",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hzj8mg7",
            "score": 1,
            "text": "That explains the endless exhaustion I was feeling in the Amazon",
            "title_similarity": "0.44947496",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hzj9245",
            "score": 1,
            "text": "100% humidity is essentially impossible to find in the environment without rain, which would provide a thermogenic cooling effect in an 87° temperature.",
            "title_similarity": "0.74188375",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj99af",
            "score": 1,
            "text": "[This](https://i.imgur.com/2cqxa77.png) has wet bulb temperatures for North Western Australia.\n\n31.5 at [Kununurra](https://en.wikipedia.org/wiki/Kununurra,_Western_Australia) Airport as I type this.",
            "title_similarity": "0.3609624",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj9ljv",
            "score": 1,
            "text": "I’m pretty sure we can endure that. The real question is for how long?",
            "title_similarity": "0.25006014",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hzj9x6z",
            "score": 1,
            "text": "87 degrees and 100% humidity is Kentucky in July.",
            "title_similarity": "0.44371763",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzja3ab",
            "score": 1,
            "text": "Wow we are so incredibly fucked, huh?",
            "title_similarity": "0.27979052",
            "sentiment_compound": -0.2895
        },
        {
            "id": "hzjau61",
            "score": 1,
            "text": "It’s not the heat, it’s the humidity.  \n\nI’ll hang up and wait for the awards to come rolling in…",
            "title_similarity": "0.40505105",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hzjb7ws",
            "score": 1,
            "text": "Every Houstonian reading this just took this as a challenge.",
            "title_similarity": "0.28722692",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hzjc6o7",
            "score": 2,
            "text": "It's been 45 C in my town all week...\nMy parents roll their eyes for me having my airfon on 18C",
            "title_similarity": "0.48750982",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjcgq8",
            "score": 2,
            "text": "Southern Asia has already experienced lethal summer conditions, for a few days per year. \n\nExpect that these conditions will expand a lot, by 2050.",
            "title_similarity": "0.5352601",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hzjcqhz",
            "score": 1,
            "text": "87f and 100% humidity? That’s Houston.",
            "title_similarity": "0.4750169",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjdm35",
            "score": 2,
            "text": "*laughs in Southern US*",
            "title_similarity": "0.19928655",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzjdqx3",
            "score": 2,
            "text": "South Louisiana in July and August is pure misery. The daily “feels like” temp is over 100. I’m a reptile, but the humidity makes it stultifying even for me.",
            "title_similarity": "0.62160695",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hzjdrvq",
            "score": 1,
            "text": "**flashbacks to when my high school marching band director made us set drill in 104 degree weather on the east coast with ungodly humidity**",
            "title_similarity": "0.39587232",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjdxko",
            "score": 1,
            "text": "Stay away from Southern Indiana then.",
            "title_similarity": "0.30073506",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjeflc",
            "score": 1,
            "text": "I work in a weld shop in MS. We stay wet from sweat. You just get used to it. It’s well beyond those temps and humidity regularly and we are in Kevlar capes, aprons and hard hats. You can make it.",
            "title_similarity": "0.39981627",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hzjf7vf",
            "score": 1,
            "text": "How common is 100% humidity? And where would be the most likely place for it to occur? Is this a problem that's exacerbated by climate change?",
            "title_similarity": "0.6043145",
            "sentiment_compound": -0.5007
        },
        {
            "id": "hzjfdy1",
            "score": 1,
            "text": "Me looking at my tropical Indian summers,maybe I AM DEAD.",
            "title_similarity": "0.43703052",
            "sentiment_compound": -0.7213
        },
        {
            "id": "hzjfgb0",
            "score": 1,
            "text": "I am not normal.  I live in north Florida.  I play an active sport (ultimate frisbee) in the year round.  My cars have only had AC for abou 4 of the past 33 years.  It isn’t that bad.",
            "title_similarity": "0.4447797",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hzjfryd",
            "score": 1,
            "text": "We need to use shorts and no-masks in the office",
            "title_similarity": "0.31330013",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjgbsh",
            "score": 1,
            "text": "These scientists have never been to Houston.",
            "title_similarity": "0.31698793",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjgv7m",
            "score": 1,
            "text": "It's getting close to that in summers in Japan. Visited in 2019 and there was a lot of info about heat stroke. Many older homes don't have ac or full house ac. Shops sometimes don't either.",
            "title_similarity": "0.60514814",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjgwvj",
            "score": 1,
            "text": "I think this study just disproved Miami's existence",
            "title_similarity": "0.3841685",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjgzpk",
            "score": 1,
            "text": "An average august day in Alabama is 102 and 90% humidity, we survive.",
            "title_similarity": "0.5466433",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjh0b4",
            "score": 1,
            "text": "I live in Florida and I am alive. So I'm gonna have to disagree with this one",
            "title_similarity": "0.2950568",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjig7l",
            "score": 1,
            "text": "I’m from the southeastern US and I’m dreading the end of winter. From May through September, I’m downright miserable due to the humid heat. Sweating just does not work to cool us down when it’s 85f and freaking humid.",
            "title_similarity": "0.6781427",
            "sentiment_compound": -0.885
        },
        {
            "id": "hzjisb6",
            "score": 1,
            "text": "Alabama laughs at y'all.",
            "title_similarity": "0.16159184",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzjjldv",
            "score": 1,
            "text": "As someone stationed in the Indian Ocean I don’t know if I believe this science…",
            "title_similarity": "0.3260646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjkvw2",
            "score": 1,
            "text": "Tell that to a roofer in Houston during the summer",
            "title_similarity": "0.23957707",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjld1c",
            "score": 1,
            "text": "Does this test take into account people who live in climates like Darwin or the Amazon? Surely there’s a difference between a person who grew up/adapted to life in humidity Vs someone who is just thrown into it",
            "title_similarity": "0.5267882",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hzjlfdj",
            "score": 1,
            "text": "High humidity situations are especially difficult for men because of sweaty balls,",
            "title_similarity": "0.51049215",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hzjlt0p",
            "score": 1,
            "text": "85f at 85% humidity  that’s mid spring in Louisiana.  *insert Cajun laughing noises.",
            "title_similarity": "0.47132272",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hzjlvzh",
            "score": 1,
            "text": "I live in Arkansas and that sounds just like the average summer day here, if not a little cooler.",
            "title_similarity": "0.46353072",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzjm08o",
            "score": 1,
            "text": "Yay! We’re going extinct!!! Just not soon enough.",
            "title_similarity": "0.4569206",
            "sentiment_compound": 0.6776
        },
        {
            "id": "hzjmw0y",
            "score": 1,
            "text": "When we were doing practice in 100% humidity with 90+ heat I remember getting bitched at for everyone being slow as hell. I’ve noticed growing up in humidity that when it’s really high with high temperature it’s harder to breath. Idk if someone can explain.",
            "title_similarity": "0.6845052",
            "sentiment_compound": -0.836
        },
        {
            "id": "hzjn14v",
            "score": 1,
            "text": "31 degrees/87 Fahrenheit at close to 100% humidity is spring in Houston.",
            "title_similarity": "0.534394",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjn3d9",
            "score": 1,
            "text": "Does anyone know if this study took into consideration the environment that the participants were acclimatised to?\n\nAs can be seen in the comments, specific acclimatisation would affect tolerance.",
            "title_similarity": "0.32986227",
            "sentiment_compound": 0.296
        },
        {
            "id": "hzjn8he",
            "score": 1,
            "text": "St louis person here, by this information I shouldn't be going outside in July or August then..",
            "title_similarity": "0.4268902",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjnbx0",
            "score": 1,
            "text": "As an older guy living in north east US, most of my friends have moved to Florida because they didn’t want to go out in the cold. So now they sit in their house, bar, or restaurant in the air conditioning and don’t go out because it’s too hot. Everyone I know that stayed up north is outside hiking, fishing, skiing, kayaking, golfing, etc. everyone I know who moved to Florida does nothing but eat and drink even if they used to do all those other things.",
            "title_similarity": "0.46775126",
            "sentiment_compound": 0.3252
        },
        {
            "id": "hzjnpq6",
            "score": 1,
            "text": "Didn’t read but I’m curious about the demographics of the sample population.",
            "title_similarity": "0.4248585",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hzjp13y",
            "score": 1,
            "text": "Living in nyc, during the summer, we go out in 90+ degrees and 100% humidity with Tims on. Light work.",
            "title_similarity": "0.4036572",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjq2vt",
            "score": 1,
            "text": "There goes most of southern Texas",
            "title_similarity": "0.22981824",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjqcyw",
            "score": 1,
            "text": "I use to work in 120F+ conditions no windows or ac during the summers in full gear. Use to literally feel like passing out but our employers told us to man up from their ac offices.",
            "title_similarity": "0.5616549",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hzjs4ni",
            "score": 1,
            "text": "Yo we had a heat dome in Vancouver last summer. Was unbearable. About 45 degrees and humid. More people died of that than covid at the time. I worked hard to cool the wild animals down and left water out for them. \n\nThen we had a cold snap and I had to help my birds survive. \n\n+45 to -10 in a year is rough. \n\nI grew up in -40 ti plus 40 range. The humidity is so much worse than dry heat.",
            "title_similarity": "0.6525128",
            "sentiment_compound": -0.5657
        },
        {
            "id": "hzjt8cn",
            "score": 1,
            "text": "Stands to reason.  I remember it being 106 f when I was a kid. on the farm in ND  It was crazy humid.  I remember going outside to play,  I only made it to the end of the walk (40 feet).  I turned around and went back inside and sat in the basement.   It was like I couldn't breath. 100 degrees isn't bad if it's dry out but add in the humidity and you can barely walk.",
            "title_similarity": "0.5199505",
            "sentiment_compound": 0.397
        },
        {
            "id": "hzju0wv",
            "score": 1,
            "text": "Great! We’re gonna be discussing cannibal mole ppl",
            "title_similarity": "0.21684572",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hzjv224",
            "score": 1,
            "text": "What the hell is wet-bulb",
            "title_similarity": "0.2815732",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hzjvd73",
            "score": 1,
            "text": "Ah reminds me of my first summer working in the greenhouse… outside stats were 90-100, ~70% humidity. Now get under a huge plastic film and water plants in that all day gaaaaawd. Acclimation sucked!",
            "title_similarity": "0.56614804",
            "sentiment_compound": -0.2481
        },
        {
            "id": "hzjwhqd",
            "score": 1,
            "text": "Yeah there is a difference with dry heat, so visit the desert will you.",
            "title_similarity": "0.34425312",
            "sentiment_compound": 0.296
        },
        {
            "id": "hzjyy4w",
            "score": 1,
            "text": "This makes sense. Even in relatively low humidity, after about 100°F I can only handle being in the elements for maybe an hour tops.\n\nI was in Phoenix AZ last summer and it hit 118°F outside, and I got dizzy and almost fainted, sitting in the shade, after being outside of a restaurant for maybe 15 minutes.\n\nI'm an Alaskan native. I hate these temps. Now I live here for the next year or two. FML",
            "title_similarity": "0.65459025",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hzk27c7",
            "score": 1,
            "text": "Well, thats not too surprising. We evolved for dry heat after all.",
            "title_similarity": "0.39642859",
            "sentiment_compound": 0.0736
        },
        {
            "id": "hzka5my",
            "score": 1,
            "text": "I grew up in Louisiana. Super-saturated humidity in the 90s. I even did roofing jobs with hot tar. We all survived, but I left that hellhole as soon as possible. Living from one air-conditioned space to another wasn't fun either.",
            "title_similarity": "0.5852361",
            "sentiment_compound": -0.3406
        },
        {
            "id": "hzkasyq",
            "score": 1,
            "text": "Been to Australia mate?",
            "title_similarity": "0.14048426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzki4rf",
            "score": 1,
            "text": "Given I've endured this so am highly suspicious, and reading the title of this post, not the article or comments, I'd like to question what the word 'endure' is supposed to mean. \n\nAlso, if you're thin with little body fat, are your still 'human' or is that word reserved for people who are large with a... noticeably greater skin fold measurement that typically signifies body fat?\n\nLastly, assuming you're thin, with less skin fat, but are constantly touching your skin, and so have capillaries and bloodflow that enable rapid cooling on air that passes moist skin, and are also are often moving, creating your own wind even in a still air condition, and have less hair so are cooled better at the scalp, and also have breath control so can cool through breathing, and have a will to persist, so move steady even with high external temperatures, is that human also, or do those in climate controlled places consider that subhuman or superhuman? Is there a time frame on 'endure'? How much water is available? Are you allowed to lick accumulated salts on skin? Can I rub my armpit sweat on my ribcage? Is this all under trees or in the shade? Under a roof? Does walking in circles or pacing while talking count as 'enduring' or is that considered 'clearly unable to endure - they've gone mad!' And what happens if you're movingfaster, or fasting as you go and are in ketosis, using stored fats from hips or belly or thighs? Is that movement, even where it might be a little like a trot, 'enduring' or could it become 'enjoying', creating a smile?\n\nSo many questions! Such a bad title!\n\nEdit: reread the title. 100% humidity.. I think I can 'endure' near 80 percent without issue. Isn't 100% where water spontaneously precipitates out, or at least, where evaporation ceases completely? Doesn't forced rythmic deep breathing still enable cooling as the humidity nears 100%?",
            "title_similarity": "0.70802844",
            "sentiment_compound": 0.9759
        },
        {
            "id": "hzl1fe4",
            "score": 1,
            "text": "Anyone living in Chennai India should be really nervous now. Global warming will make it uninhabitable.",
            "title_similarity": "0.5451543",
            "sentiment_compound": -0.2006
        },
        {
            "id": "hzl3ilh",
            "score": 1,
            "text": "Living in South Louisiana, just being alive during the summer is a struggle. Then you bring in the 100% humiditiy...",
            "title_similarity": "0.5716878",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hznig41",
            "score": 1,
            "text": "Want does wet-bulb refer to?",
            "title_similarity": "0.20882198",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hznpjyq",
            "score": 1,
            "text": "Humans will adapt, or we won’t.",
            "title_similarity": "0.30855346",
            "sentiment_compound": 0.0
        },
        {
            "id": "hznvg3o",
            "score": 1,
            "text": "Apparently, they never checked New Orleans. pretty sure it's wet bulb 92 for about 5 months every year. But hey that place defies many laws of physics. \n\nOn another note, air conditioned shirts are the future.",
            "title_similarity": "0.5984732",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hzszhqf",
            "score": 1,
            "text": "I hate dry heat. I become a saltine cracker",
            "title_similarity": "0.47776467",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i02kpsa",
            "score": 1,
            "text": "Someone should tell all those people living near the equator...",
            "title_similarity": "0.17991444",
            "sentiment_compound": 0.0
        },
        {
            "id": "i03pyh4",
            "score": 1,
            "text": "Subject is need for all",
            "title_similarity": "0.070952214",
            "sentiment_compound": 0.0
        }
    ]
}