{
    "Cancer-sniffing ants prove as accurate as dogs in detecting disease and can be trained in as little as 30 minutes. It can take up to a year to train a dog for detection purposes.\n": [
        {
            "id": "i06uake",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue to be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.46382967",
            "sentiment_compound": 0.7088
        },
        {
            "id": "i074rjn",
            "score": 0,
            "text": "Almost relevant perry bible fellowship https://pbfcomics.com/comics/the-ants-dance/",
            "title_similarity": "0.34526455",
            "sentiment_compound": 0.0
        },
        {
            "id": "i06xrjg",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i06xk1z",
            "score": 21,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i077hcj",
            "score": 0,
            "text": "quote - “Ants are thus equivalent to dogs”",
            "title_similarity": "0.42459166",
            "sentiment_compound": 0.0
        },
        {
            "id": "i098qtx",
            "score": 0,
            "text": "Cancer Ants, Cancer Ants\n\nEvery morning you greet me\r  \nSmall and black, clean and bright\r  \nYou look happy to meet me\r  \nBlossom of snow, may you bloom and grow\r  \nBloom and grow forever\r  \nCancer Ants, Cancer Ants\r  \nBless my homeland forever",
            "title_similarity": "0.60214853",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i075fw7",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i09cm6k",
            "score": -1,
            "text": "For a sub that talks about science and accuracy, the actual research papers themselves are mostly proof of concept for many of the posts.",
            "title_similarity": "0.49013883",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0an9bc",
            "score": -1,
            "text": "Now how many other of gods great creatures have we destroyed along the way that could ultimately provide help to humans in the harmony of all things?",
            "title_similarity": "0.425264",
            "sentiment_compound": 0.743
        },
        {
            "id": "i070v59",
            "score": 57,
            "text": "what is the accuracy? \n\n\"as good as dogs\" tells me nothing.",
            "title_similarity": "0.30810484",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i075sjm",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i0765op",
            "score": -2,
            "text": "Just had a moment where I realized I was lucky to not know about cancer sniffing dogs.",
            "title_similarity": "0.40305385",
            "sentiment_compound": 0.7443
        },
        {
            "id": "i071pe7",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i07xnlv",
            "score": -4,
            "text": "Why do we need to train animals to detect cancer? If you have a pet, they already know. Their sense of smell and observation skills are already a-tuned to your bio-rhythms. If they are looking at you with the worried face on a regular, call your doctor and get a physical.",
            "title_similarity": "0.5727951",
            "sentiment_compound": -0.765
        },
        {
            "id": "i087g7a",
            "score": 4,
            "text": "The tough part is getting those tiny \"Service Animal\" vests on all those ants",
            "title_similarity": "0.46367753",
            "sentiment_compound": -0.128
        },
        {
            "id": "i06vn0l",
            "score": 49,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i072phv",
            "score": 39,
            "text": "Ok, ok, the dogs sniffing out cancer has been around for at least 30 years.  Before you talk about ants, where's the local canine cancer screening clinic? Oh, there isn't one? But I thought it was such a great idea...",
            "title_similarity": "0.7310162",
            "sentiment_compound": 0.3839
        },
        {
            "id": "i06z6ak",
            "score": 92,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i086j03",
            "score": 8,
            "text": "Stuff like this isn’t great for my anxiety. Now when I’m having a picnic I won’t know if they’re after my potato salad or if I have stage four bowel cancer. Way to go science",
            "title_similarity": "0.4961508",
            "sentiment_compound": 0.128
        },
        {
            "id": "i087jo7",
            "score": 17,
            "text": "This makes a lot of sense. Ants communicate, navigate, and live most of their lives primarily via scent. They likely have entire complex languages we havent even begun to start digging into.\n\nAnts will sit and touch their antenna together with each other and exchange extremely complex combinations of pheromones for entire seconds. I have an ant colony myself and I love sitting and just watching them \"talk\" to each other.\n\nThe queen will sometimes sit and \"talk\" to one of her brood for an entire minute straight. I can't even imagine what they are communicating to each other.\n\nWhen I put out fresh food and one ant ventures out and finds it, they often rush back to nest soon and you can see them all wiggling antenna at each other, and soon enough 2-3 of them exit to go get the food.\n\nThat degree of communication is something that I can watch endlessly. There's without a doubt in my mind a sophisticated degree of intelligence these little creatures possess.\n\nSo yeah, I am not surprised in the least at how quickly these creatures were able to learn these scents, it makes a lot of sense.",
            "title_similarity": "0.67086816",
            "sentiment_compound": 0.9546
        },
        {
            "id": "i06wpjf",
            "score": 802,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i06xwk9",
            "score": 33,
            "text": "I didn't know ants can be trained! Now I'm wondering how!",
            "title_similarity": "0.32226706",
            "sentiment_compound": 0.0
        },
        {
            "id": "i06z069",
            "score": 298,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i07nblw",
            "score": 623,
            "text": "This article title, like most article titles, is HIGHLY sensationalist.  The actual science here is effectively proof-of-concept, simply showing that ants can detect the difference between a standardized healthy cell line, and a standardized cancer cell line.  That’s it.\n\nThe headline, and article, fail to cover a few things that trained dogs have that this study has not covered:\n\n1.  Trained dogs can sniff out multiple cancer lines without need for retraining for each one.  This study showed that an ant can be trained quickly to detect a single cancer line.  But what about other cancer lines?  It’d be problematic if every a patient needed to have multiple samples taken from every part of their body to try and detect cancer somewhere, which dogs do not need to have happen.\n\n2. The dogs work non-invasively.  No samples are needed from the patients, just their presence in a room with the dog.  The ants, in this proof-of-concept need samples from the patient, which means a possible invasive procedure depending on what type of cancer you are looking for.\n\n3.  The dogs can sense this through clothes/other scents.  The ants were not challenged to find the scent when it was mixed with anything significant (ie healthy cells, biologic secretions, etc...) meaning that even if patient samples were taken (as previously mentioned), there’s no guarantee they’d be attracted to the cancer line and not something else that the ants naturally are attracted to.\n\n4. Dogs can sense this from a distance.  As far as the study is concerned, ants need to be fairly close to the source to find it.  This makes it medically hard to implement as convincing a patient that dumping some ants on them to look for cancer I imagine is difficult at best.\n\n5. The longevity of the ants is unknown.  At the very least, the researchers mentioned that 9 trials were all it took for the ants to stop responding properly to stimuli.  In addition, they did not test waiting periods between conditioning and testing, meaning the ants, under this proof, would need to be retrained every time, and new ants would be needed regularly.\n\nOverall, this is an interesting jumping point for more research.  But until more data comes out that shows you can use these ants without invasive sampling, and without needing the patient to allow ants to crawl on them, I can’t see this being medically useful, and especially not more useful than the dogs.",
            "title_similarity": "0.7087207",
            "sentiment_compound": -0.9831
        },
        {
            "id": "i070v8a",
            "score": 1457,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i072pqw",
            "score": 2813,
            "text": "I see a lot of joking around which is cool and all but this is incredible and could be groundbreaking. I mean, considering how much less time is needed to invest, how quickly ants can reproduce, the relative ease of care in a contained colony. The only part that is unclear is how this works. I'm guessing they smell body fluids in a lab setting?",
            "title_similarity": "0.6239783",
            "sentiment_compound": 0.7992
        },
        {
            "id": "i06w3dv",
            "score": 4143,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i076v5r",
            "score": 14,
            "text": "Said they focused on two breast cancer cell types, so definitely sounds like it's just in vitro.  Would they still be able to detect them if they were in the body?",
            "title_similarity": "0.5270565",
            "sentiment_compound": 0.5354
        },
        {
            "id": "i077qbt",
            "score": 1,
            "text": "E. O. Wilson would be so happy to see this.",
            "title_similarity": "0.18658288",
            "sentiment_compound": 0.6948
        },
        {
            "id": "i079slk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i07a1bo",
            "score": 1,
            "text": "On a related note, bees are also exponentially greater than dogs at drug- and bomb-sniffing. However, their short lifespan makes it sort of impractical.",
            "title_similarity": "0.623037",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i07ahpq",
            "score": 1,
            "text": "Tomorrow’s headline: Ant army waging war putting thousands of dogs at risk of losing their jobs",
            "title_similarity": "0.5592779",
            "sentiment_compound": -0.8225
        },
        {
            "id": "i07axr1",
            "score": 1,
            "text": "Can you imagine getting diagnosed with cancer by an ant?",
            "title_similarity": "0.4781014",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i07bhhd",
            "score": 1,
            "text": "All fun and games until they get into someones pants",
            "title_similarity": "0.33729318",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i07bn0k",
            "score": 1,
            "text": "Where are all these cancer sniffing dogs/ants as my relatives are being diagnosed with cancer in giant scanning machines ? Like damn, where do I sign up for a dog to sniff my (possibly) cancerous colon ?",
            "title_similarity": "0.5714817",
            "sentiment_compound": -0.885
        },
        {
            "id": "i07cksk",
            "score": 10,
            "text": "If you didn't notice the link to the study's full text at the bottom, here it is: https://www.cell.com/iscience/fulltext/S2589-0042(22)00229-2",
            "title_similarity": "0.34090802",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07crcj",
            "score": 1,
            "text": "Saw some researcher for the department of defence give a presentation on how he trained bees to sniff out land mines in just 4 hours",
            "title_similarity": "0.67369485",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i07eb6z",
            "score": 1,
            "text": "Ants: I'm about to end this dog's whole career.",
            "title_similarity": "0.3699269",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07eewt",
            "score": 1,
            "text": "So all this time, the ants knew?",
            "title_similarity": "0.32297364",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07fzfe",
            "score": 1,
            "text": "How long do they live?",
            "title_similarity": "0.06879941",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07fzgc",
            "score": 1,
            "text": "What was the movie about cancer curing ants with sean Connery?",
            "title_similarity": "0.41449696",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i07gir8",
            "score": 1,
            "text": "*Slap a cigarette out of a friend's hand.*\n\nDo you want ants? Cause this is how you get ants!",
            "title_similarity": "0.37985504",
            "sentiment_compound": 0.6588
        },
        {
            "id": "i07hwxa",
            "score": 1,
            "text": "TIL Ants have noses and could snort cocaine",
            "title_similarity": "0.3292837",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07jnmg",
            "score": 1,
            "text": "Okay but you better not mix them up with the ants I brought from home.",
            "title_similarity": "0.29070538",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i07k4nb",
            "score": 1,
            "text": "So will this replace my mammogram?",
            "title_similarity": "0.24910453",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07kiik",
            "score": 2,
            "text": "So obviously there’s some kind of scent or pheromone people with cancer are emitting. I hope they’re trying to find it rather just the next critter that can sniff it out. A machine would probably be a little less terrifying.",
            "title_similarity": "0.5150096",
            "sentiment_compound": -0.6837
        },
        {
            "id": "i07lbla",
            "score": 1,
            "text": "Just need guide ants now the waiting list will drop by 6 months",
            "title_similarity": "0.5562403",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i07ln87",
            "score": 2,
            "text": "I remember this was on a QI episode. Except with pigeons?",
            "title_similarity": "0.16710411",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07lu6z",
            "score": 2,
            "text": "What is that a school for ants! This building would have to be at least 3 times bigger to fit a human.",
            "title_similarity": "0.46248746",
            "sentiment_compound": 0.4199
        },
        {
            "id": "i07mrsp",
            "score": 1,
            "text": "Bees too, right? Or was that Parkinson's?",
            "title_similarity": "0.33731157",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07pdq0",
            "score": 1,
            "text": "Someone has been reading Children of Time",
            "title_similarity": "0.19435751",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07pfu1",
            "score": 1,
            "text": "How many ants per treatment? I hope it's just one any that starts at your head and runs to the closest cancer site.",
            "title_similarity": "0.6336422",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i07pyll",
            "score": 1,
            "text": "What does cancer smell like",
            "title_similarity": "0.20361233",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i07qfor",
            "score": 1,
            "text": "Let’s do it already. I keep hearing about all these animals and insects able to do amazing medical things. Rats, dogs, bees and now ants. Where are they??",
            "title_similarity": "0.5437044",
            "sentiment_compound": 0.6322
        },
        {
            "id": "i07s0jw",
            "score": 1,
            "text": "“You hold still Debbie we’re gonna stick these ants up your ass and see what they find”",
            "title_similarity": "0.41981184",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i07s8wm",
            "score": 1,
            "text": "Yeah but who wants ants crawling on your nut sack",
            "title_similarity": "0.2593811",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i07sq7m",
            "score": 1,
            "text": "What's the co-pay on that?",
            "title_similarity": "0.065182336",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07u7if",
            "score": 1,
            "text": "Another superpower for antman",
            "title_similarity": "0.3196881",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07uevu",
            "score": 1,
            "text": "1) cool\n\n2) this sounds horrifying\n\n3) I kinda wanna shower now",
            "title_similarity": "0.17634588",
            "sentiment_compound": -0.34
        },
        {
            "id": "i07vw0m",
            "score": 1,
            "text": "So how does one train ants?",
            "title_similarity": "0.27912062",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07w60s",
            "score": 1,
            "text": "So ants are smarter than dogs??",
            "title_similarity": "0.473396",
            "sentiment_compound": 0.5609
        },
        {
            "id": "i07yi7z",
            "score": 1,
            "text": "If ants can do that for me I wouldn’t mind if I’m covered in them.",
            "title_similarity": "0.39513543",
            "sentiment_compound": 0.0
        },
        {
            "id": "i07ys2x",
            "score": 1,
            "text": "So these ants recognize certain smells (Volitile organic compounds, VOCs). This article also mentions they've analysed these VOCs in massspec. Why the in-between step of using ants then? Can't we just run samples through mass-spec and use software to detect known cancer-related VOCs?",
            "title_similarity": "0.52064943",
            "sentiment_compound": 0.3527
        },
        {
            "id": "i07yyp5",
            "score": 1,
            "text": "Don't worry just lay here covered in honey, and when the ants are done there thing we'll let the ant eaters clean you",
            "title_similarity": "0.35908604",
            "sentiment_compound": 0.6256
        },
        {
            "id": "i07zmln",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i07zn8a",
            "score": 1,
            "text": "I'm starting to think my school careers advisor didn't know as much as he thought he did.\n\nI could have trained ants for a living",
            "title_similarity": "0.55761015",
            "sentiment_compound": 0.0
        },
        {
            "id": "i080eew",
            "score": 1,
            "text": "*Day 38 of Cancer Detection Ant Research Trials:*  \n\n*Still struggling with the fine-tuning of the entire process.  Training the ants to detect the volatiles produced by cancer cells was relatively easy; getting the ants to simply point to the cancer instead of directly trying to burrow to the cancer itself has been... difficult.  Trial candidate 36 with colon cancer now in induced coma after ants sought path of least resistance to cancerous rectal polyps.  Subject still occasionally screams about \"Ants in the pants\" and \"No, not in there, not in there!\"*  \n\n*May have to limit ant detection therapy to skin lesions only.*",
            "title_similarity": "0.6804923",
            "sentiment_compound": -0.981
        },
        {
            "id": "i080k4l",
            "score": 1,
            "text": "Idk about anyone else but this is SO cool to me. This could just be the beginning of what this could lead to.",
            "title_similarity": "0.25564662",
            "sentiment_compound": 0.732
        },
        {
            "id": "i080klk",
            "score": 1,
            "text": "Another benefit for ants, if you have cancer, they will burrow into your brain and kill you instantly. All completing painless of course",
            "title_similarity": "0.5923576",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i080msw",
            "score": 1,
            "text": "We've been hearing about animals sniffing out diseases like cancer and COVID for years now.\n\nIs this actually being used, anywhere?",
            "title_similarity": "0.63105273",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i080qnn",
            "score": 1,
            "text": "I already thought ants were cool\n\nThis is just the icing on the cake",
            "title_similarity": "0.40235138",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i081qs0",
            "score": 1,
            "text": "Can you train  an ant to sit and bark?i think not",
            "title_similarity": "0.31981054",
            "sentiment_compound": 0.0
        },
        {
            "id": "i08252i",
            "score": 1,
            "text": "This is very interesting.\n\nSo do you need an antfarm in your doctors office for that to work, or do you send people to Antlabs to be examined?",
            "title_similarity": "0.4968356",
            "sentiment_compound": 0.4576
        },
        {
            "id": "i082yqu",
            "score": 1,
            "text": "You have cancer.\n\nNo wait. You have melted chocolate on your thumb.",
            "title_similarity": "0.38085657",
            "sentiment_compound": -0.765
        },
        {
            "id": "i083vbn",
            "score": 1,
            "text": "how do they pick what animal to train? ant seems like such a random choice.",
            "title_similarity": "0.33969876",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i08467j",
            "score": 1,
            "text": "Dogs last longer, aren't gross, and you need just one or a few for accuracy vs a colony to be manipulated.",
            "title_similarity": "0.53994405",
            "sentiment_compound": -0.0119
        },
        {
            "id": "i084cwd",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.15109365"
        },
        {
            "id": "i084e0q",
            "score": 1,
            "text": "Look this may be serious and I just want to be safe,  NURSE BRING IN THE ANTS",
            "title_similarity": "0.35685116",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i084gus",
            "score": 1,
            "text": "One day there will be cancer sniffing colonoscopy snakes, the real trick is teaching them English so the doctor understands the results",
            "title_similarity": "0.56844777",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i084l4x",
            "score": 1,
            "text": "Can anyone explain why this \"revolutionary technique\" is bs and the title is misleading",
            "title_similarity": "0.17090183",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i0861b0",
            "score": 1,
            "text": "So the next question is how to put tiny lab coats on ants without harming their exoskeleton. And goggles. Maybe fashion some tiny beeper for emergencies?",
            "title_similarity": "0.49517897",
            "sentiment_compound": 0.4449
        },
        {
            "id": "i0868kz",
            "score": 1,
            "text": "I don't get it. Why would cancer cells have a different smells than normally growing cells?",
            "title_similarity": "0.2871211",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i086b84",
            "score": 1,
            "text": "I’ll take dog over this ,please.",
            "title_similarity": "0.19133635",
            "sentiment_compound": 0.3869
        },
        {
            "id": "i0879p3",
            "score": 1,
            "text": "Imagine having them check for throat cancer, \"open wide!!\"",
            "title_similarity": "0.41229248",
            "sentiment_compound": -0.717
        },
        {
            "id": "i087c6z",
            "score": 1,
            "text": "This is interesting, and weird.",
            "title_similarity": "-0.02194749",
            "sentiment_compound": 0.25
        },
        {
            "id": "i087sm4",
            "score": 1,
            "text": "It makes sense in that ants are \"simpler\" systems than dogs. Ants have very little personality and complexity when compared to dogs with their own motivations and whatnot.\n\nI'd be interested in seeing where else we could \"accelerate\" systems like this with simpler organisms.",
            "title_similarity": "0.5097003",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i087xen",
            "score": 1,
            "text": "Ha! Take that dogs, you’re not that amazing! Just kidding. You’re incredible and a gift to mankind.",
            "title_similarity": "0.33982176",
            "sentiment_compound": 0.2676
        },
        {
            "id": "i088142",
            "score": 1,
            "text": "Random person on the street smoking: …\n\nMe: Do you want ants!? Because that’s how you get ants!!",
            "title_similarity": "0.29292858",
            "sentiment_compound": 0.2905
        },
        {
            "id": "i088b0v",
            "score": 1,
            "text": "Yes, I could have sworn they were avoiding me at the mailbox yesterday",
            "title_similarity": "0.42401507",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i088jov",
            "score": 1,
            "text": "I didnt see this twist coming when thinking about sci fi",
            "title_similarity": "0.14077526",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0897je",
            "score": 1,
            "text": "This is crazy. The wonders of science. Worker ants don't live as long as dogs, and they don't seem to retain the conditioning long-term, so I wonder if the trade-off is worth it. Granted, being able to train them within 3 days is still pretty dang handy. I also wonder if the ant species would make a difference, with some being more efficient than others, or retain the training longer.",
            "title_similarity": "0.7319012",
            "sentiment_compound": 0.7778
        },
        {
            "id": "i089cna",
            "score": 1,
            "text": "Walk past the cancer smelling training room. Aww look at all these cute puppies and they love me! And then a horde of ants covers your entire body and a doctor says you have cancer",
            "title_similarity": "0.5522535",
            "sentiment_compound": -0.4389
        },
        {
            "id": "i089qyg",
            "score": 1,
            "text": "what, what is the accuracy of that kind of detection?",
            "title_similarity": "0.1280608",
            "sentiment_compound": 0.0
        },
        {
            "id": "i089vq0",
            "score": 1,
            "text": "Wait... I'm certain that the 99th precinct in Brooklyn did this with flies and it turned out to be a scam. The guy in charge of the program just kept the lie going for his own selfish reasons until a detective, who was already highly suspicious of the validity of the claim, debunked it and shamed the guy.",
            "title_similarity": "0.4361803",
            "sentiment_compound": -0.902
        },
        {
            "id": "i08bn06",
            "score": 1,
            "text": "This reminds me of the book children of time where intelligent spiders use ants for computation!",
            "title_similarity": "0.50366867",
            "sentiment_compound": 0.5093
        },
        {
            "id": "i08cvbq",
            "score": 1,
            "text": "The comparison in the title seems unfair\n\n\"as little as\" vs \"up to\"",
            "title_similarity": "0.118590176",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i08dhy7",
            "score": 1,
            "text": "Apparently machine learning is outdated, let's go bio-learning",
            "title_similarity": "0.30090502",
            "sentiment_compound": 0.0
        },
        {
            "id": "i08fnby",
            "score": 1,
            "text": "I told my wife about this and she asked,” how in the world do you train an ant?”   I said, “simple, you reward it when it does what you want and if not, you smack it”. I said you’re really training the ants that are watching!",
            "title_similarity": "0.5939396",
            "sentiment_compound": 0.6476
        },
        {
            "id": "i08frms",
            "score": 1,
            "text": "Currently reading the paper and I have a question. Did scientists use the same specific Formica fusca ants for the trials and memory tests?",
            "title_similarity": "0.53653955",
            "sentiment_compound": 0.0
        },
        {
            "id": "i08hgzj",
            "score": 1,
            "text": "From the article where they can train 1 ant to sniff out breast cancer cells it says this\n\n> ants could be used to detect cancerous cells up to nine times before their conditioned responses begin to lapse.\n\nWhat does the last part mean?",
            "title_similarity": "0.6882522",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i08jauy",
            "score": 1,
            "text": "I wonder what the ants interpretation of what's going on must be like...being manipulated by beings far larger and more advanced than they could imagine for reasons they cant know. They find certain smells and are rewarded with luxurious treats by giant fast trees",
            "title_similarity": "0.4571397",
            "sentiment_compound": 0.6115
        },
        {
            "id": "i08kk4k",
            "score": 1,
            "text": "A dog can still perform its job with an external stimulus around such as food. I doubt they could control an ant to ignore a food source because its got a job to do. Thats the difference between lab and real world conditions.",
            "title_similarity": "0.5333661",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i08ks5p",
            "score": 1,
            "text": "So what, do they form words with their little ant bodies to tell you whether your going to die or not!?",
            "title_similarity": "0.40804517",
            "sentiment_compound": -0.636
        },
        {
            "id": "i08ku72",
            "score": 1,
            "text": "This is cool and all, but personally, if I'm sitting in a hospital bed waiting to find out if my cancer is gone, I'd be a little put out if the dude in the room next door got a visit from Dr. Lassie, while I had to endure Nurse Ratched pour ants all over my bed...",
            "title_similarity": "0.49277124",
            "sentiment_compound": -0.7543
        },
        {
            "id": "i08mu5p",
            "score": 1,
            "text": "Well, they just beat out the training time of the HERO Rats by a factor of seven months. \n\n(The rats were trained to sniff out tuberculosis, not cancer, but the same principles apply I'm sure.)",
            "title_similarity": "0.7575798",
            "sentiment_compound": 0.8139
        },
        {
            "id": "i08nchg",
            "score": 1,
            "text": "Literally have had a fear of ants all my life, and cancer for most of my life (father passed from it when I was young, and his mother as well.) Now my greatest fear could save me from my other greatest fear. What a world.",
            "title_similarity": "0.642663",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i08r223",
            "score": 1,
            "text": "So they also bark when detecting something?",
            "title_similarity": "0.25102693",
            "sentiment_compound": 0.0
        },
        {
            "id": "i08r5rv",
            "score": 1,
            "text": "Love the headline that compares the min of one species to the max of another.  Why?",
            "title_similarity": "0.34563133",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i08rq23",
            "score": 1,
            "text": "Are dogs even used for this with actual patients? I've known, sadly, many people who have had to be evaluated for possible cancer and not one of them were diagnosed with anything like this. So is this actually being applied somewhere? (I know the article is about ants as a proof of concept but since the comparison is to dogs I'm curious about this.) I mean if dogs can actually smell if there is cancer inside you why they not at every annual physical?",
            "title_similarity": "0.6801985",
            "sentiment_compound": -0.8196
        },
        {
            "id": "i08rzay",
            "score": 1,
            "text": "While this is amazing, there's something medieval-sounding about dumping a bunch of ants on me and watching how they move in order to detect an omen.",
            "title_similarity": "0.4239899",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i08so7v",
            "score": 2,
            "text": "if it can be \"sniffed out\", why can't they use one of those \"electronic nose\" devices that I assume is some sort of filter+spectrometer? seems like if there are detectable particles there'd be a more easily repeatable and distributable solution than ants or dogs (at least you can probably mail ants more easily than dogs... so that's an improvement)",
            "title_similarity": "0.5965338",
            "sentiment_compound": 0.9091
        },
        {
            "id": "i08u5l1",
            "score": 1,
            "text": "So what’s stopping adding dogs or ants to regular checkups?",
            "title_similarity": "0.41833127",
            "sentiment_compound": -0.2212
        },
        {
            "id": "i08vok1",
            "score": 1,
            "text": "Nope. I don’t want ants crawling on me.",
            "title_similarity": "0.12955809",
            "sentiment_compound": -0.0572
        },
        {
            "id": "i08wcem",
            "score": 1,
            "text": "Time for my annual trip to the Antcologist.",
            "title_similarity": "0.4514944",
            "sentiment_compound": 0.0
        },
        {
            "id": "i08yrdv",
            "score": 1,
            "text": "As someone battling cancer i really dont want ants sniffing me",
            "title_similarity": "0.35870615",
            "sentiment_compound": -0.7906
        },
        {
            "id": "i08zisn",
            "score": 1,
            "text": "If you can train an ant to sniff out disease, I pretty sure you can train a person to do the same",
            "title_similarity": "0.6143874",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i090o38",
            "score": 1,
            "text": "30 mins for an ant is like an year in dog years.",
            "title_similarity": "0.62947845",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i094jjg",
            "score": 1,
            "text": "Mr. Philips, we regret to inform you that the ants we covered you in were fire ants and as such, of no medical use whatsoever.",
            "title_similarity": "0.320811",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i096056",
            "score": 2,
            "text": "Emotional support ants coming soon.",
            "title_similarity": "0.24089867",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i096p1d",
            "score": 2,
            "text": "*Doctor help! I've got ants in my pants!*\n\n**Doctor:** It's testicular cancer. Sorry about your boys. They gotta go.",
            "title_similarity": "0.47163388",
            "sentiment_compound": -0.555
        },
        {
            "id": "i09740s",
            "score": 2,
            "text": "Do you want ants? This is how you get ants",
            "title_similarity": "0.2612964",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i097c4o",
            "score": 2,
            "text": "This is the type of research we need to be doing instead of those silly experiments or ones sponsored by companies to promote their products. \nAnts and other animals are not pests. They can help us if we Just let them.",
            "title_similarity": "0.47605205",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i0984cf",
            "score": 2,
            "text": "You want ants? cause that's how you get ants",
            "title_similarity": "0.25227726",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i098j7l",
            "score": 2,
            "text": "After losing my mother to ovarian cancer, I welcome research like this.",
            "title_similarity": "0.5440614",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i098p3x",
            "score": 2,
            "text": "I can imagine the horror movie now. Ants that have been trained to smell out colon/prostate cancer, but the crawl up your bum and eat you from the inside out.",
            "title_similarity": "0.515312",
            "sentiment_compound": -0.6187
        },
        {
            "id": "i099thk",
            "score": 2,
            "text": "*doctor watches as patient is slowly covered by ants rushing over their body*\n\n\"Dont panic. They are screening you for cancer.\"\n\n*patient is frozen in fear*\n\nWhat happens when then find it?\n\n*doctor lights a cigarette*\n\n\"Then things get complicated.\"",
            "title_similarity": "0.5109672",
            "sentiment_compound": -0.7094
        },
        {
            "id": "i09bwqa",
            "score": 1,
            "text": "Yea the one main downside is you have to convince patients to let you cover them in ants instead of playing with a dog.",
            "title_similarity": "0.43317103",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i09c9t2",
            "score": 4,
            "text": "Colonoscopies will never be the same\nAgain",
            "title_similarity": "0.18764478",
            "sentiment_compound": 0.0
        },
        {
            "id": "i09cwb4",
            "score": 1,
            "text": "Ok I’ll bite, how do you train an ant to detect cancer in 30 min. I got some in my back yard and my balls are the size of watermelons",
            "title_similarity": "0.67114496",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i09cy1o",
            "score": 2,
            "text": "The performance of the antmills allowed them to dialogue with prophets (peace be upon them).",
            "title_similarity": "0.25896603",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i09go3q",
            "score": 1,
            "text": "aren't dogs wildly inaccurate?",
            "title_similarity": "0.122355945",
            "sentiment_compound": 0.0
        },
        {
            "id": "i09incq",
            "score": 2,
            "text": "Remind me what the life expectancy of an ant is?",
            "title_similarity": "0.303891",
            "sentiment_compound": 0.0
        },
        {
            "id": "i09iuza",
            "score": 2,
            "text": "I wonder what cancer smells like.",
            "title_similarity": "0.23372945",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i09lues",
            "score": 2,
            "text": "Scientists in 1925's \"I wonder what the future of medicine will look like?\"\n\nDoctor in 2025 staring at his state of the art cancer detection instruments \"It's okay, Antonio. You go when you feel like it\"",
            "title_similarity": "0.5353225",
            "sentiment_compound": 0.128
        },
        {
            "id": "i09pu18",
            "score": 1,
            "text": "The picture it pulled is terrifying. \n\nYay for ants though, they can now get jobs.",
            "title_similarity": "0.53964317",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i09rkks",
            "score": 2,
            "text": "It’s an Ant’s Life and we’re all just living in it",
            "title_similarity": "0.28429687",
            "sentiment_compound": 0.0
        },
        {
            "id": "i09xdit",
            "score": 1,
            "text": "This gave me some hope for the future. I love ants!",
            "title_similarity": "0.37670586",
            "sentiment_compound": 0.8122
        },
        {
            "id": "i09xy8c",
            "score": 1,
            "text": ">Cancer-sniffing ants prove as accurate as dogs in detecting disease and can be trained in as little as 30 minutes.\n\nPeople who study animal behavior have been rather slow at understanding the importance of finding out a species' perceptual systems and their ranges.  (Such errors with rats and elephants, for instance, should have been--or must have been--a real wakeup call.)\n\nNice to see that some researchers do understand this and *are* making these discoveries!",
            "title_similarity": "0.832095",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i09yejt",
            "score": 2,
            "text": "Once again, life starts beating fiction.",
            "title_similarity": "0.24725232",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i0a9bs7",
            "score": 2,
            "text": "They also don’t need walking, cheaper to feed, don’t take up much space on the sofa, they don’t get fleas* AND you don’t get a ‘hot handful’ picking up their poop.\n\n*Do they?",
            "title_similarity": "0.38541502",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0acan6",
            "score": 2,
            "text": "I would like an ant farm filled with these ants.",
            "title_similarity": "0.41065234",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i0ahxyv",
            "score": 1,
            "text": "Well, what are we waiting on?",
            "title_similarity": "-0.10326545",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i0b1tbj",
            "score": 1,
            "text": "Ok but they still don't get to crawl on me.",
            "title_similarity": "0.010206014",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i0b3pno",
            "score": 1,
            "text": "Dogs live way longer than ants",
            "title_similarity": "0.5203943",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0bco89",
            "score": 1,
            "text": "Neat. Do it with bees next!",
            "title_similarity": "0.34700704",
            "sentiment_compound": 0.5093
        },
        {
            "id": "i0bfiy4",
            "score": 1,
            "text": "But do they play fetch?",
            "title_similarity": "0.10871952",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i0bgxfc",
            "score": 1,
            "text": "‘What is this, cancer for ants?!’",
            "title_similarity": "0.29483512",
            "sentiment_compound": -0.7609
        },
        {
            "id": "i0bo0py",
            "score": 1,
            "text": "Do they use positive reinforcement?",
            "title_similarity": "0.047382005",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i0c3c5z",
            "score": 1,
            "text": "You know the way we actually tested the ants was crazy. We're making unbelievable leaps and strides in ant technology.\n\nYe see we took 9 people with cancer and 1 without and put em in a 5by5 room.\n\nSo after everyone was properly briefed we dumped nearly 18 pounds of fire ants straight into the room. All trained in our special cancer detection technique. \n\nYour not gonna guess what happened. Thr ants had a 90% success rate  successfully diagnosing all cancer affected individuals.\n\n***I love my job.***",
            "title_similarity": "0.72336304",
            "sentiment_compound": -0.7003
        },
        {
            "id": "i0cymeb",
            "score": 1,
            "text": "Train the ants for COVID? Eliminate the pandemic",
            "title_similarity": "0.43761262",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0ee82c",
            "score": 1,
            "text": "It would be pretty great if this could be carried over to drug detection. Ants seem less likely to be as easily conditioned as dogs to trigger positively based on their handlers' biases",
            "title_similarity": "0.5459431",
            "sentiment_compound": 0.9201
        },
        {
            "id": "i0k2wrq",
            "score": 1,
            "text": "Why do cancer cells have a different smell, and what it is exactly that is being emitted that creates this smell?",
            "title_similarity": "0.2577296",
            "sentiment_compound": -0.5106
        }
    ]
}