{
    "Utah's DWR was hearing that hunters weren't finding elk during hunting season. They also heard from private landowners that elk were eating them out of house and home. So they commissioned a study. Turns out the elk were leaving public lands when hunting season started and hiding on private land.\n": [
        {
            "id": "i12mzxd",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue to be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.50131",
            "sentiment_compound": 0.7088
        },
        {
            "id": "i12p4mx",
            "score": 20,
            "text": "[removed]",
            "title_similarity": "0.0052316934"
        },
        {
            "id": "i13aprg",
            "score": 1,
            "text": "Sounds like these intelligent creatures shouldn’t be hunted for sport.",
            "title_similarity": "0.38594806",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i13gtp6",
            "score": 6,
            "text": "Hunting as a bloodsport is distasteful and primitive. Those who kill for fun are sick.\n\nI am sure there are better ways to solve deer overpopulation.",
            "title_similarity": "0.66643804",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i13dbcj",
            "score": 0,
            "text": "Humans terrorize everything for gain and sport.",
            "title_similarity": "0.26802707",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i12ts95",
            "score": 29,
            "text": "[removed]",
            "title_similarity": "0.0052316934"
        },
        {
            "id": "i13f410",
            "score": 0,
            "text": "Good. Let them live. Introduce natural predators back if needed and reduce issuance of gun permits. Stop the slaughter for sport.",
            "title_similarity": "0.6010037",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i12w2vv",
            "score": -13,
            "text": "I love all these suburbanites and city dwellers thinking this means elk are Einstein. \n\nThe fact is animals go where there isn’t pressure. During hunting season public land is high pressure, private land isn’t.  That’s it. It’s that’s simple. Even a vegan could probably figure this out.",
            "title_similarity": "0.6055193",
            "sentiment_compound": 0.128
        },
        {
            "id": "i13363l",
            "score": 7,
            "text": "Because they don't like being killed for no reason",
            "title_similarity": "0.35245246",
            "sentiment_compound": 0.0721
        },
        {
            "id": "i13idd3",
            "score": -6,
            "text": "What a shock, they don't want to die. Leave them alone.",
            "title_similarity": "0.30773392",
            "sentiment_compound": -0.2206
        },
        {
            "id": "i13hdfg",
            "score": 3,
            "text": "It’s almost like the elk don’t like being murdered.",
            "title_similarity": "0.5451585",
            "sentiment_compound": -0.1761
        },
        {
            "id": "i12tv13",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "0.0052316934"
        },
        {
            "id": "i14zxpr",
            "score": 0,
            "text": "Why the hell do people hunt elk and deer anyways?",
            "title_similarity": "0.68892634",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i13ukv8",
            "score": -2,
            "text": "Animals that smart deserve to not be killed",
            "title_similarity": "0.24180782",
            "sentiment_compound": 0.7423
        },
        {
            "id": "i12vdt9",
            "score": 3,
            "text": "I live on 2 acres and we see way more deer during hunting season. We have an apple tree and 2 pear trees, hunting season is in the winter, so they wait until then to come eat the fruit. They know what's up. Unfortunately for them we let our neighbor bow hunt on our land once or twice a season. He shares the meat obviously.",
            "title_similarity": "0.7682996",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i13j7t4",
            "score": -3,
            "text": "When wildlife is smarter than your average hunter.",
            "title_similarity": "0.23234053",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i12qqnx",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.0052316934"
        },
        {
            "id": "i134dgs",
            "score": 2,
            "text": "Huh, almost like they're alot smarter than we give them credit for...",
            "title_similarity": "-0.007452557",
            "sentiment_compound": 0.7787
        },
        {
            "id": "i132i9m",
            "score": 1,
            "text": "I’ve always wondered why people have fancy gear to hunt animals I see chilling by the road every day. I could reach out the window of my car and touch an elk, yet these dudes are out here in full camo with high powered rifles to try to kill one. Maybe they just know when hunting season is and find good hiding spots.",
            "title_similarity": "0.772473",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i136543",
            "score": 5,
            "text": "I’d be interested to see if any other animals exhibit a similar aversion to being shot and killed by high-powered rifles.",
            "title_similarity": "0.55982184",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i12ynkv",
            "score": 5,
            "text": "Um, I thought just about every experienced hunter had figured this out a long time ago.",
            "title_similarity": "0.28613168",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13gi1l",
            "score": 3,
            "text": "Seems wrong to hunt and kill an animal actively hiding in fear for its life.",
            "title_similarity": "0.5995176",
            "sentiment_compound": -0.8979
        },
        {
            "id": "i131vdu",
            "score": 4,
            "text": "If the private land owners allowed hunting, the elk would be less inclined to concentrate there and there should be no problem. If hunting is not allowed (which is completely up to the landowner) there should be no complaint about damage from animal concentration. The elk were there first, after all.",
            "title_similarity": "0.7289019",
            "sentiment_compound": -0.0139
        },
        {
            "id": "i13sud3",
            "score": 2,
            "text": "It is almost as if they don't want to be participating in this \"sport\".",
            "title_similarity": "0.25779662",
            "sentiment_compound": -0.0572
        },
        {
            "id": "i13v8qg",
            "score": 4,
            "text": "And not one of these people will say, “oh maybe this means they care about continuing to live; I should leave them alone and get a new hobby.”",
            "title_similarity": "0.39295802",
            "sentiment_compound": 0.25
        },
        {
            "id": "i13bxyd",
            "score": 1,
            "text": "Damn. Reason no#420 for me to stop eating meat",
            "title_similarity": "0.5510699",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i13ea3m",
            "score": 1,
            "text": "Wow it’s almost like they prefer living and aren’t as stupid as we think",
            "title_similarity": "0.1486687",
            "sentiment_compound": 0.3832
        },
        {
            "id": "i13mct2",
            "score": 0,
            "text": "Proves that elk are smart. Big brain.",
            "title_similarity": "0.12888926",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i135u4l",
            "score": 3,
            "text": "And we think we're the smart ones....",
            "title_similarity": "-0.19979644",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i12z89r",
            "score": 2,
            "text": "Nah, they could just smell Joe from a mile away.",
            "title_similarity": "0.21171191",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i13qa10",
            "score": 2,
            "text": "Aww, poor hunters. The animals were finding a refuge elsewhere? How terrible for you! Don’t get me wrong, I am not an anti-hunter. These populations can get out of control and need to be thinned. However, these animals are trying to protect them selves. Apparently they’re doing a pretty good job of it.",
            "title_similarity": "0.6411278",
            "sentiment_compound": -0.2244
        },
        {
            "id": "i134vbi",
            "score": -3,
            "text": "My brother is an avid hunter.  Doesn't take any vacation any other time of year so he can use it all for white tail season.\n\nHe brags that he bow hunts because it's he doesn't want it to be easy yet buys 1000'of dollars in gear to make it easier.\n\nJust admit that you only bow hunt because it gets you out hunting a few weeks earlier ...",
            "title_similarity": "0.71236765",
            "sentiment_compound": 0.8165
        },
        {
            "id": "i132nry",
            "score": -4,
            "text": "They weren't hiding on private land. The owners of private land host their own pushes on public land and push the animals onto private property.",
            "title_similarity": "0.49758506",
            "sentiment_compound": 0.2235
        },
        {
            "id": "i138sr6",
            "score": 1,
            "text": "Same for our ducks on opening day easy to get your limit then not see a duck for the rest of the season, seems they go to city parks and private property to chill out on there lakes and ponds.",
            "title_similarity": "0.6410159",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i13qep7",
            "score": 1,
            "text": "They know what they’re doing. I’ve commonly heard my entire life that white tail deer will virtually disappear the night before opening day of deer season in many places. \nWe own land and we do hunt but it’s maybe one deer per year at most that gets taken normally. \nToo many nearby people shoot at them or even poach them too much so a big part of our purpose for our land is to give those animals a refuge. Once they come into our property they are generally safe.",
            "title_similarity": "0.777713",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i13rvrf",
            "score": -1,
            "text": "They did a study? Hunters everywhere have observed this behavior for years.",
            "title_similarity": "0.44879517",
            "sentiment_compound": 0.0
        },
        {
            "id": "i14n8mx",
            "score": -1,
            "text": "Easy solution. Private land owners issue a license to hunt on their land.",
            "title_similarity": "0.50028574",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i13murl",
            "score": -5,
            "text": "This is yet another reason why human hunters are not good population control for herbivores compared to native predators.",
            "title_similarity": "0.5866095",
            "sentiment_compound": -0.3412
        },
        {
            "id": "i13qs2x",
            "score": -4,
            "text": "Maybe this is a sign. If they're smart enough to hide from your guns, you gotta stop hunting them.",
            "title_similarity": "0.5406455",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i12vzqd",
            "score": 12,
            "text": "That’s why it’s called hunting and not catching.",
            "title_similarity": "0.41164872",
            "sentiment_compound": 0.0
        },
        {
            "id": "i138124",
            "score": -1,
            "text": "Excellent, good on them.",
            "title_similarity": "-0.28543413",
            "sentiment_compound": 0.765
        },
        {
            "id": "i13mih6",
            "score": -2,
            "text": "I thought this was always known? I live in utah and remember my uncles talking about this when I was a kid in the 80s.",
            "title_similarity": "0.40403277",
            "sentiment_compound": 0.0
        },
        {
            "id": "i132kzc",
            "score": 6,
            "text": "This should tell people something.",
            "title_similarity": "-0.20455633",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1323lf",
            "score": -4,
            "text": "Thanks….. this made my day….. hell ya",
            "title_similarity": "0.0068564927",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i138sta",
            "score": -4,
            "text": "Animals are smarter than humans",
            "title_similarity": "0.011205274",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i136uy8",
            "score": 16,
            "text": "After a lifetime of hunting I am absolutely convinced animals can, and do, read the hunting regulations and adjust accordingly. They are also extremely aware of property lines. Can't tell you how many times I've seen game lounging about on posted property.",
            "title_similarity": "0.61925113",
            "sentiment_compound": 0.4576
        },
        {
            "id": "i14gnhw",
            "score": 7,
            "text": "Pack animals learning to avoid local predators is simply culture.",
            "title_similarity": "0.5094304",
            "sentiment_compound": -0.296
        },
        {
            "id": "i13v4ey",
            "score": 1,
            "text": "I'm old now, but I remember elk hunts that occurred in Montana, near the northern border of Yellowstone Park. Elk were allowed to be shot at sunrise of the hunting season. and Montana bars were allowed to be open into the morning wee hours.\n\nPeople staggered out of bars at 3 AM, and lined up along the tree line that defined the northern park borders. At sunrise, the firing line commenced. There were a number of hunters killed annually, when entering the firing zone while attempting to tag a downed elk. Fun times.\n\nI think that the Montana laws were changed (I have been gone for a while), but I have warm memories of when incoming \"hunters\" experienced actual risks to their own lives.",
            "title_similarity": "0.7329613",
            "sentiment_compound": -0.8338
        },
        {
            "id": "i14a682",
            "score": -1,
            "text": "Good. Those dumb fucks should just take pictures. Imagine believing killing an animal made you honorable if your intent is to make a trophy out of it",
            "title_similarity": "0.5054611",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i12xorn",
            "score": 468,
            "text": "[removed]",
            "title_similarity": "0.0052316934"
        },
        {
            "id": "i12qacb",
            "score": 250,
            "text": "[deleted]",
            "title_similarity": "0.06106301"
        },
        {
            "id": "i13eot6",
            "score": 15,
            "text": "Good for them! (The elk)",
            "title_similarity": "0.16225508",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i133rpr",
            "score": -9,
            "text": "The US needs \"Freedom to Roam Laws\". It wouldnt be impossible to modify them so that hunters/hikers were better able to move about without such an absolute hegemony belonging to private landowners.\n\nhttps://en.wikipedia.org/wiki/Freedom_to_roam\n\nhttps://gokcecapital.com/freedom-to-roam/",
            "title_similarity": "0.51657546",
            "sentiment_compound": 0.7964
        },
        {
            "id": "i14pnxy",
            "score": -2,
            "text": "As a hunter...... why is this “news” and who did a study on this.... any amateur hunter can tell you elk/deer will go to low pressure areas when they get hunting pressure on them",
            "title_similarity": "0.7537787",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i13arx5",
            "score": 10,
            "text": "Where do I go to get eaten out by an elk? Now that seems like an experience I’d pay for",
            "title_similarity": "0.5814204",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i12zovd",
            "score": 3,
            "text": "You know if they had looked in Estes Park Colorado 25 years ago they would have seen exactly this behavior...jus sayin..",
            "title_similarity": "0.34819713",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13qmov",
            "score": -2,
            "text": "My grandfather knew that fact in 1950. They waste so much money \"studying\" common sense stuff its ridiculous",
            "title_similarity": "0.50330245",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i13w7xo",
            "score": 2,
            "text": "They just want to live",
            "title_similarity": "0.002668636",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i135o0i",
            "score": 13,
            "text": "My parents have about 40 acres of woods.  They don't hunt, deer would always congregate there during hunting season.  We'd regularly find deer stands when we'd go for walks and we'd destroy them.",
            "title_similarity": "0.8171692",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i139xqz",
            "score": 4,
            "text": "Hold up.\n\nDoes that mean animals are aware of the passage of calendar time???",
            "title_similarity": "0.2594369",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13wtrd",
            "score": 4,
            "text": "Smart Elk. Now they need to move somewhere safe and far away from humans.",
            "title_similarity": "0.42495146",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i12yexm",
            "score": 203,
            "text": "I think that as we as our ability to evaluate animal behavior continues to develope, we will see a lot more studies like this.\n\nThey're smarter than we give them credit for being, and conversely, we aren't as smart or special as we think we are.",
            "title_similarity": "0.2630974",
            "sentiment_compound": 0.8785
        },
        {
            "id": "i13esx1",
            "score": -5,
            "text": "We’ve pushed them so far to the brink of adaptation in their evolutionary process to change or they will be extinct from humans",
            "title_similarity": "0.4498722",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13pb4j",
            "score": 6,
            "text": "It's always fascinating to see how much more intelligent many animals are when compared to how intelligent most people think animals are",
            "title_similarity": "0.15310259",
            "sentiment_compound": 0.8687
        },
        {
            "id": "i12zxhv",
            "score": 24,
            "text": "This is well studied. It's called risk allocation hypothesis. More natural resource graduates need to pay attention to ecology. It's amazing how many people in these management positions don't know the basics.",
            "title_similarity": "0.4496468",
            "sentiment_compound": 0.7346
        },
        {
            "id": "i1323gv",
            "score": -7,
            "text": "heck yea! go nature! eff you silly hoomans!",
            "title_similarity": "0.12811585",
            "sentiment_compound": 0.2444
        },
        {
            "id": "i13367d",
            "score": -9,
            "text": "Proving that the elk are smarter than the hunters...or something.",
            "title_similarity": "0.38910612",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i13ikfd",
            "score": 47,
            "text": "There's 2 huge military training bases near me. Every hunting season the bases are swarming with elk and there's nothing to be found anywhere else.\n\nSo one year the military worked with fish and games to create 25 new elk tags that could only be used on base and used a lottery to hand them out to military members that went hunting. There was a huge outrage about military only hunting tags and how unfair that was to civilian hunters in the area. It didn't matter that no civilians were allowed in the training areas and these tags were only legal on base, nope, totally wasn't fair. \n\nSo the tags got revoked the next year, and a 100 soldier task force with hunting rifles went in and culled 200 elk between the two bases. The kills were documented with a fish and wildlife liason, and all the meat was burned in a giant pile so it wasn't \"unfair.\" Such a massive waste to placate a bunch of whiny assholes.",
            "title_similarity": "0.757418",
            "sentiment_compound": -0.3716
        },
        {
            "id": "i12w797",
            "score": 10,
            "text": "I used to live in an area where herds of 80-90 elk would pass through most days.  Hunting season even the crickets were quiet. Hiding on private land wouldn't work, because the farmers had no problem with hunters.  I have no idea where they went, but end of the season and they were back.",
            "title_similarity": "0.83815074",
            "sentiment_compound": -0.1459
        },
        {
            "id": "i14atr4",
            "score": 9,
            "text": "People acting like things don’t want to live. Well congratulations Elk want to live.",
            "title_similarity": "0.5092031",
            "sentiment_compound": 0.8442
        },
        {
            "id": "i12zt9v",
            "score": 65,
            "text": "*Now there’s antelope grazing in range of my gun*\n\n*But come opening weekend, you won’t see a-one*\n\n*They’ll vanish like ghosts, ‘cause somehow they know*\n\n*But now they’re up to the fence in the early dawn.*",
            "title_similarity": "0.721165",
            "sentiment_compound": 0.3716
        },
        {
            "id": "i12quye",
            "score": 145,
            "text": "This isn’t news to anyone that is part of the hunting community. And it’s not like we think they are dumb, they know what’s going on. Just look at the wildlife in Yellowstone. They know they are safe and act like it.",
            "title_similarity": "0.6495811",
            "sentiment_compound": -0.0026
        },
        {
            "id": "i131ce2",
            "score": 18,
            "text": "[deleted]",
            "title_similarity": "0.06106301"
        },
        {
            "id": "i138ou9",
            "score": 253,
            "text": "When I was little and we lived in the countryside, we had a cat who was an amazing hunter. He caught mice, birds, rabbits, or easier prey (like fish or meat on the barbecue), and you barely had to feed him. Throughout all of summer, he just came to say hi from time to time (mostly to our dog who grew up with him) and was basically living in the wild on his own.\n\nBut as soon as French hunting season started, when the first rifle shot was heard, he rushed back inside and became a couch potato until it stopped in spring.",
            "title_similarity": "0.7025999",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i12y0j4",
            "score": 46,
            "text": "I will save them money on another study, the deer are doing it too.  I live in the foothills and can always tell when hunting season has started by the massive increase of deer hanging out in my yard.",
            "title_similarity": "0.61661345",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i12xdye",
            "score": 217,
            "text": "Happens with deer in Oregon all the time.\n\nJust because they are animals does not mean they are dumb animals.",
            "title_similarity": "0.55670995",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i12uagr",
            "score": 137,
            "text": "The turkeys have spilled the beans",
            "title_similarity": "0.47085324",
            "sentiment_compound": 0.0
        },
        {
            "id": "i12vh5m",
            "score": 746,
            "text": "[removed]",
            "title_similarity": "0.0052316934"
        },
        {
            "id": "i138uu9",
            "score": 255,
            "text": "I work at a lumber company, we have a herd that roams on our property. People will gawk from the road and some will radio where the herd is at for hunters on the other side of the hill where pur property line ends. Occasionally we have to chase the hunters off our property. The cow that leads the herd right now is pretty smart and keeps them on our property through the majority of hunting season. Mind you this is a herd of almost 200 elk.",
            "title_similarity": "0.77338886",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i12rxqb",
            "score": 1033,
            "text": "This effect is so well-established in Beaverhead County, MT, that the DNRC warns new homeowners outside of town each season. Disturbingly, enough of the elk move into towns that it's caused a few problems, as neither the elk nor people are habituated to each other (unlike, say, Gardiner, MT).",
            "title_similarity": "0.7564458",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i134lx1",
            "score": 637,
            "text": "[removed]",
            "title_similarity": "0.0052316934"
        },
        {
            "id": "i130mxa",
            "score": 2338,
            "text": "[removed]",
            "title_similarity": "0.0052316934"
        },
        {
            "id": "i12td2u",
            "score": 3465,
            "text": "[removed]",
            "title_similarity": "0.0052316934"
        },
        {
            "id": "i12te8d",
            "score": 8191,
            "text": "[removed]",
            "title_similarity": "0.0052316934"
        },
        {
            "id": "i12z81b",
            "score": 1,
            "text": "Not surprising, don’t the game wardens go out and read the rules to the elk just before hunting season?",
            "title_similarity": "0.75064874",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i12zp1b",
            "score": 1,
            "text": "The deer are kind of doing the same thing around Cinci.\n\nStill was surprised rocking up to my MIL's house and finding deer in her backyard on Mt. Storm.",
            "title_similarity": "0.7187109",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i12zqu4",
            "score": 1,
            "text": "This hardly surprises me.\nWhen duck season opens here, there is quite a substantial, local migration of various species outward from game reserves to private land. Happens every year.",
            "title_similarity": "0.42760783",
            "sentiment_compound": 0.399
        },
        {
            "id": "i13057n",
            "score": 1,
            "text": "Is anyone really all that surprised?",
            "title_similarity": "-0.027512047",
            "sentiment_compound": 0.2878
        },
        {
            "id": "i131le3",
            "score": 1,
            "text": "Sounds like the Elk have figured out when hunting season starts.",
            "title_similarity": "0.50069577",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i132d1i",
            "score": 1,
            "text": "evolution at work baby.",
            "title_similarity": "-0.041069716",
            "sentiment_compound": 0.0
        },
        {
            "id": "i132w5k",
            "score": 1,
            "text": "Not really suprised, I've seen pheasants do similar things.  Animals are pretty clever.",
            "title_similarity": "0.2553916",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i133k7j",
            "score": 28,
            "text": "I don't think the behavior is new. As a kid in the 70s I remember attending summer camp and it overlapped with the early California deer season. The amount of deer running around that camp when the season started increased dramatically. There might have been some early victims who didn't have a calendar but the rest figured it out fast.\n\nEarly season versus late season quail is a different hunt too. Late in the season they flush really early.",
            "title_similarity": "0.62163675",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i133wlx",
            "score": 2,
            "text": "Smart guys! You’re not the only type of conscious being you know",
            "title_similarity": "-0.06351204",
            "sentiment_compound": 0.4574
        },
        {
            "id": "i13407d",
            "score": 6,
            "text": "Keystone SD is full of deer during hunting season and people are in the forest year round.",
            "title_similarity": "0.5614743",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1342w3",
            "score": 1,
            "text": "Welcome to hunting in the east. White tail know exactly what land is safe and what land will land them in a freezer.",
            "title_similarity": "0.42530566",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i1344r2",
            "score": 1,
            "text": "Happens in Saskatchewan too. Moose won't venture (or don't as much) onto land that's used for hunting where I work. You can literally see them on one side of a road that isn't used and the land that is, is empty.",
            "title_similarity": "0.6934937",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i134ccx",
            "score": 1,
            "text": "Well look at that. Evolution at work.",
            "title_similarity": "-0.13311389",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i134w5c",
            "score": 1,
            "text": "My parents and their neighbors to the side and back don't permit hunting in their woods (about 15 acres), and every fall, there are deer friggin everywhere. It gets to absurd levels pretty quick.",
            "title_similarity": "0.79552543",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i1358og",
            "score": 1,
            "text": "GPS studies on whitetail deer showed this and more several years ago. The suburbs hold the largest populations nowadays.",
            "title_similarity": "0.42887276",
            "sentiment_compound": 0.0
        },
        {
            "id": "i135se0",
            "score": 1,
            "text": "I dont know why this is news per say.. When I was stationed at tobyhanna army depot the deer would come in the east gate +200 at a time each morning. This started a week before hunting season and they would leave after it was over.\n\nIt is kinda kewl that this generational information is passed down.",
            "title_similarity": "0.68434274",
            "sentiment_compound": 0.204
        },
        {
            "id": "i135ycd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0052316934"
        },
        {
            "id": "i1373rc",
            "score": 1,
            "text": "My dad told me about a time the deer season opened where he was at, all the deer would go to the hospital because they knew they were safe on their grounds. Deer are cool.",
            "title_similarity": "0.712272",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i1374uv",
            "score": 1,
            "text": "This is a fact about deer and elk that hunters have all known for a long time. Literally common knowledge in the hunting world.",
            "title_similarity": "0.4993257",
            "sentiment_compound": 0.0
        },
        {
            "id": "i137f29",
            "score": 1,
            "text": "That's absolutely amazing.  I've heard similar stories of elk in Yellowstone.  Apparently they couldn't care less about people when they're in the national park, but once they leave the park area and move into land where they can be hunted, they're skittish as can be.",
            "title_similarity": "0.78218865",
            "sentiment_compound": 0.111
        },
        {
            "id": "i137v2b",
            "score": 1,
            "text": "None of those land owners are willing to let people hunt on their land though unless you bribe them $$$$$$",
            "title_similarity": "0.65395916",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i137wqd",
            "score": 1,
            "text": "So pretty much California. No more hunting on public land, to speak of.  All of the best grazing and migration routes are in the hands of private clubs which charge ridiculous fees to hunt.",
            "title_similarity": "0.6768843",
            "sentiment_compound": 0.6115
        },
        {
            "id": "i137yos",
            "score": 1,
            "text": "I’ve noticed this. A herd 100 head strong always comes onto the property during hunting season. Sticks around from autumn to mid winter",
            "title_similarity": "0.47543442",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i138p7j",
            "score": 1,
            "text": "The solution is for Utah wildlife, fish and game or whatever liscencing agency to pay these farmers to allow land access to private individuals. Wyoming has a similar program that is mostly funded through voluntary donations from hunters.",
            "title_similarity": "0.65680957",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i138x8t",
            "score": 3,
            "text": "They do that here in Montana too. Smart animals... Unless it's staying off the road... Then they are dumbasses",
            "title_similarity": "0.4926295",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i139ic9",
            "score": 2,
            "text": "This is pretty well known to anyone with land in the mountain west.",
            "title_similarity": "0.084754",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i139io1",
            "score": 1,
            "text": "Eating them out of house and home! Elk literally eating their homes! Come on.",
            "title_similarity": "0.64247215",
            "sentiment_compound": 0.0
        },
        {
            "id": "i139qpi",
            "score": 1,
            "text": "I work at a gold mine in New Zealand and we have a few large ponds around the site. Normally we have around 50-75 residents ducks (mallard and paradise plus some black swans and canadian geese). Every year about 2 weeks before duck season starts the duck population swells to 300-400 until duck season finishes. There are no guns allowed on the mine site.",
            "title_similarity": "0.6249781",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i139r93",
            "score": 1,
            "text": "They had to commission a study for this?",
            "title_similarity": "0.19298738",
            "sentiment_compound": 0.0
        },
        {
            "id": "i139v2c",
            "score": 1,
            "text": "Yeah they know what’s up",
            "title_similarity": "-0.25313827",
            "sentiment_compound": 0.296
        },
        {
            "id": "i139xfl",
            "score": 1,
            "text": "Some of it has to deer with hunting pressure, sure, but more than likely it is availability of food sources on curated private land versus wild public lands at different times of year. Why would an elk compete with other critters for forage on wild lands when they can simply walk over to some private land owners agricultural field, garden, or landscaping and feast away without repercussions?",
            "title_similarity": "0.79203737",
            "sentiment_compound": 0.0129
        },
        {
            "id": "i13a66l",
            "score": 1,
            "text": "Same phenomenon with moose in Norway",
            "title_similarity": "0.24322027",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13a68r",
            "score": 1,
            "text": "Dudes just want to live man.",
            "title_similarity": "0.17475641",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i13a8cr",
            "score": 1,
            "text": "Been happening in every state I’ve ever lived? This is new to people?",
            "title_similarity": "0.23623979",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13ahth",
            "score": 1,
            "text": "I mean isn’t elk season also in the fall/winter? That’s when agricultural fields are cut and there’s tons of wheat/corn/whatever lying in the dirt for free. It’s also when food in their normal areas would be at its most scarce. I bet there’s lots of motivating factors.",
            "title_similarity": "0.623189",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i13ahup",
            "score": 1,
            "text": "I wonder if it's the gun powder smell.",
            "title_similarity": "0.20854309",
            "sentiment_compound": -0.34
        },
        {
            "id": "i13amkd",
            "score": 1,
            "text": "Heard from my friend that’s a hunter that there was an uptick of jerks trying to herd the elk toward their hunting expedition clients with 4wheelers. \n\nThey effectively over time just herded the elk out of the public lands.",
            "title_similarity": "0.8258462",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i13b86g",
            "score": 1,
            "text": "In Colorado there are elk everywhere till hunting season. I think they hide in our aspen foliage.",
            "title_similarity": "0.6652693",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i13bqdh",
            "score": 1,
            "text": "Good for the smart elk. The deer do they same thing at my mountain cabin. The bucks live on the golf course.",
            "title_similarity": "0.59389263",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i13bqik",
            "score": 1,
            "text": "I thought this was common knowledge",
            "title_similarity": "-0.13298342",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13bvw0",
            "score": 1,
            "text": "Anybody else read this and see the hunters as Elmer Fudd?",
            "title_similarity": "0.39028013",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13bwhm",
            "score": 3,
            "text": "Whoa...animals have a sense of self-preservation?!  Who saw *that* coming?",
            "title_similarity": "0.3254299",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13bwnn",
            "score": 1,
            "text": "gasp.... how shocking.",
            "title_similarity": "-0.084953494",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i13c05o",
            "score": 1,
            "text": "Next season, the Elk hunt the hunters.",
            "title_similarity": "0.68377376",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13c1wn",
            "score": 1,
            "text": "Wow, look at that! Behavior can be learned!\n\nQuick! Someone tell Kanye",
            "title_similarity": "0.004347332",
            "sentiment_compound": 0.6884
        },
        {
            "id": "i13c2p1",
            "score": 1,
            "text": "The white tail in Northern Maine have been doing the same thing for years.",
            "title_similarity": "0.10590057",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13ckh0",
            "score": 1,
            "text": "Is this actually newsworthy? I see this every season. These animals aren’t stupid.",
            "title_similarity": "0.17602284",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i13cl7p",
            "score": 1,
            "text": "Fair play to Elk. They win.",
            "title_similarity": "0.25179714",
            "sentiment_compound": 0.8176
        },
        {
            "id": "i13cr02",
            "score": 1,
            "text": "To quote Pearl Jam: “It’s evolution, baby.”",
            "title_similarity": "0.06596572",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13cuq1",
            "score": 1,
            "text": "This actually happens a lot, with many species.",
            "title_similarity": "-0.06488238",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13cyq4",
            "score": 1,
            "text": "Why are they hunted? Are they a pest? Just curious.",
            "title_similarity": "0.3945083",
            "sentiment_compound": 0.3939
        },
        {
            "id": "i13d3h4",
            "score": 1,
            "text": "Back when Zimbabwe was a haven for elephant poachers, the elephants learned to stay on the Zambia side of the Zambezi river, so as to avoid them. They also learned to avoid Dinka tribesmen (who made up a large percentage of the poachers in the area around South Sudan), based upon their distinctive accents (by contrast they were quite fond of the ex-Royal Marines with their UK-based accents, and who were paid to protect them).\n\nNot sure how smart elk are in comparison to elephants, but animals in general are a lot smarter than many people give them credit for.",
            "title_similarity": "0.65552413",
            "sentiment_compound": 0.7817
        },
        {
            "id": "i13d4fj",
            "score": 1,
            "text": "I laughed *way* too hard at this because we’ve talked about it with white tail deer in WV where my folks have a cabin. It backs up to a huge state park/wildlife reserve, and the deer population in the area EXPLODES as soon as the first rifle shot rings out every fall",
            "title_similarity": "0.6795038",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i13dbj9",
            "score": 1,
            "text": "Hahahahahahaa.. for the win!!",
            "title_similarity": "-0.13119097",
            "sentiment_compound": 0.658
        },
        {
            "id": "i13de8i",
            "score": 1,
            "text": "As a rabid hunter myself, I can appreciate the play, elk. In addition to large game doing it, I swear small game does it to some extent too. Birds mainly. \n\nI’ve been seeing this for YEARS. Hey, good on them, I say.",
            "title_similarity": "0.58560693",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i13dh9b",
            "score": 1,
            "text": "They are intelligent beings.",
            "title_similarity": "-0.21486644",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i13dhlw",
            "score": 1,
            "text": "Well it's not like they can't check were hunting is and isn't allowed. It's all publicly available info right there on the internet.",
            "title_similarity": "0.4197685",
            "sentiment_compound": -0.0026
        },
        {
            "id": "i13dis7",
            "score": 1,
            "text": "The elk fear dying. Who knew?",
            "title_similarity": "0.61008596",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i13dk5j",
            "score": 1,
            "text": "It’s almost like they don’t want to be killed. Wild.",
            "title_similarity": "0.35795057",
            "sentiment_compound": -0.4576
        },
        {
            "id": "i13dk5n",
            "score": 1,
            "text": "I work at a park that allows hunting and by anecdotal evidence it seems the deer move to the center most used part of the park during hunting season. They know how to not die easily",
            "title_similarity": "0.6706199",
            "sentiment_compound": 0.2755
        },
        {
            "id": "i13dkdc",
            "score": 1,
            "text": "Used to see deer do it too. Worked on the gates of a military reservation and knew when it was hunting season when they started walking in",
            "title_similarity": "0.680277",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13dl84",
            "score": 1,
            "text": "Good luck explaining that to elk.",
            "title_similarity": "0.27779934",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i13dotm",
            "score": 1,
            "text": "Hunted animals totally know where they are safe. I used to work at a national park. Come hunting season we suddenly had quadruple the numbers of deer, bighorn sheep, and pronghorn  we normally had. Wildlife ain’t dumb.",
            "title_similarity": "0.60655665",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i13ds5t",
            "score": 1,
            "text": "Well that could be concerning for population/disease control.",
            "title_similarity": "0.08082787",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i13e7xo",
            "score": 1,
            "text": "Wow! It's almost like they don't want to get shot.",
            "title_similarity": "0.258066",
            "sentiment_compound": 0.725
        },
        {
            "id": "i13e86f",
            "score": 1,
            "text": "No kiddin. We have the same thing in Ontario with Turkeys. I swear they keep the calendar somewhere bc as soon as season starts they all disappear. As soon as season is done they come back next day.",
            "title_similarity": "0.60877794",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i13eai0",
            "score": 1,
            "text": "This has been the case for a very long time.",
            "title_similarity": "-0.077274054",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13ej7n",
            "score": 8,
            "text": "Deer season is specially during mating/the rut. During this time makes leave their territory looking for mates. In theory this makes them easier to hunt because of the activity, though perhaps it’s working the opposite here? I also believe these animals are not as dumb as believed, they hear that first shot at 5 am and know what’s up",
            "title_similarity": "0.6990175",
            "sentiment_compound": 0.6488
        },
        {
            "id": "i13f1ug",
            "score": 1,
            "text": "Modern problems require modern solutions.  Animal behavior evolving to meet predation pressure makes sense evolutionarily.  Cool to see it operating in real time.",
            "title_similarity": "0.14908774",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i13f2dp",
            "score": 1,
            "text": "Interesting. This is known among the CO hunting community. The elks go as soon as they hear gunshots.",
            "title_similarity": "0.658535",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i13f4c2",
            "score": 1,
            "text": "Improvise adapt overcome",
            "title_similarity": "-0.118838064",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13f4ib",
            "score": 1,
            "text": "this doesn’t surprise me at all, i’m a duck hunter on the potomac river near dc and we often hunt right on the bottom of the legal hunting area. when we pack up we kayak down river thru non-hunting areas and that area is always packed with ducks and geese. i had 350-400 fly over me at one time. they know where they get shot and where they can chill",
            "title_similarity": "0.5675538",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i13f8x1",
            "score": 1,
            "text": "It's almost like the Elk don't want to be hunted and killed",
            "title_similarity": "0.65039676",
            "sentiment_compound": -0.5446
        },
        {
            "id": "i13fa78",
            "score": 1,
            "text": "My parents had a huge woods surrounding the house, growing up.  Dad was probably the only man in the area that wasn’t a hunter.  When hunting season started, the forest around us would suddenly be full of deer.  You couldn’t walk anywhere without seeing a group of 6 deer bolt away from you.  So many people begged my dad to let them hunt on his land, but he never budged.",
            "title_similarity": "0.79255104",
            "sentiment_compound": 0.25
        },
        {
            "id": "i13fcqj",
            "score": 1,
            "text": "White tail deer have done the same thing in NJ",
            "title_similarity": "0.2904031",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13fe4g",
            "score": 1,
            "text": "Wow, adapting to their environment.  Good job, elks",
            "title_similarity": "0.25198707",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i13fevq",
            "score": 1,
            "text": "Turns out, Elk are no dummies. Good for them.",
            "title_similarity": "0.4169434",
            "sentiment_compound": -0.5583
        },
        {
            "id": "i13fhrp",
            "score": 1,
            "text": "Makes sense that they don’t want to get killed.",
            "title_similarity": "0.1819802",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i13fib1",
            "score": 1,
            "text": "My dad and his friend would go hunting for turkeys during the season and he wouldn’t find them for hours until they stumbled upon them… just on the other side of a fence with a fence saying private property. They swear that they heard them laughing at them",
            "title_similarity": "0.8032643",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i13fkf7",
            "score": 1,
            "text": "Living beings want to live. Shocking.",
            "title_similarity": "0.07317443",
            "sentiment_compound": -0.34
        },
        {
            "id": "i13flhp",
            "score": 1,
            "text": "Deer do the same thing, I have a facility that has about 30 acres. Off season I see them maybe every so often, hunting season and we are now the deer sanctuary. \n\nLocals know the company will prosecute if you trespass or shoot into their land.",
            "title_similarity": "0.7310878",
            "sentiment_compound": -0.6249
        },
        {
            "id": "i13fm9o",
            "score": 1,
            "text": "I'm willing to bet it's similar to cicadian rythms, or however thats spelled. Animals know when winter is coming based on environmental signs, exposure to the actual world not a synthetic ecosystem like ours, so in other words, hunting \"seasons\" have been going on for so long, and in particular time frames  that it's now part of the organisms *natural environment* - just like the coming of winter, or the biological responses towards the spring time.",
            "title_similarity": "0.54967093",
            "sentiment_compound": 0.7579
        },
        {
            "id": "i13frqf",
            "score": 1,
            "text": "Improvise. Adapt. Overcome. Wr have the technology.",
            "title_similarity": "-0.101789944",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13fue6",
            "score": 1,
            "text": "Growing up and still today, my dad and I would go pheasant hunting on opening weekend in Kansas. The day before the season opened you’d find birds by the dozen anywhere you looked. Fields, ditches, middle of the road, everywhere. On the day the season opened you couldn’t find any of them on public lands. They flew to private farm land and waited it out",
            "title_similarity": "0.76825666",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i13fybc",
            "score": 1,
            "text": "One hunt for antelope the night before hunt starts we’re driving in to find a camp and and antelope literally pauses on the driving path in front of our truck and just stared at us for like a full minute. Next three days we didn’t even see another one.",
            "title_similarity": "0.75145453",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i13fyl5",
            "score": 1,
            "text": "Deer and other large ungulates learn to migrate during different seasons for a multitude of reasons.  If human predation is the primary selective factor I could see a hunting season migration becoming a evolutionary behavioral adaptation quite easily.",
            "title_similarity": "0.52713335",
            "sentiment_compound": 0.4005
        },
        {
            "id": "i13g33e",
            "score": 1,
            "text": "Smarter than some humans I know.",
            "title_similarity": "-0.14714167",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i13g6to",
            "score": 1,
            "text": "In the memoir \"West with the night\", elephant herds that have had only a single encounter with ivory hunters would from that point on try to hide the bull's tusks.",
            "title_similarity": "0.66968536",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i13ga5r",
            "score": 1,
            "text": "Good for them! Smart animals.",
            "title_similarity": "-0.11887845",
            "sentiment_compound": 0.7088
        },
        {
            "id": "i13gsk1",
            "score": 2,
            "text": "I swear animals are way more intelligent than we give them credit for",
            "title_similarity": "0.122301124",
            "sentiment_compound": 0.6901
        },
        {
            "id": "i13guaf",
            "score": 1,
            "text": "My sister lives in rural Ontario. She says the deer move into her town at the begging of hunting season.",
            "title_similarity": "0.696828",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13h4sk",
            "score": 1,
            "text": "This reminds me of Raised By Wolves. >!It shows that sometimes, animals can be better at survival than humans.!<",
            "title_similarity": "0.43763483",
            "sentiment_compound": 0.5399
        },
        {
            "id": "i13h5ju",
            "score": 1,
            "text": "I live in a town with TONS of elk in the area. When it’s hunting season, they’re standing in our yard and many of the yards around town. They milk around in the ditches on the sides of the roads. When the season is over, the vanish back into the woods. I love it.",
            "title_similarity": "0.6987412",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i13ha6u",
            "score": 1,
            "text": "Hunted animals are evolving. In the winter, pheasants being hunted by farmers would inhabit the woodland on our land. We see more return each year!",
            "title_similarity": "0.6340098",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13hhho",
            "score": 1,
            "text": "Good. If they are smart enough to do this, they are smart enough that shooting them is unethical.",
            "title_similarity": "0.21543184",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i13hnvj",
            "score": 1,
            "text": "Animals are very smart, I don’t know why people haven’t realized this yet",
            "title_similarity": "0.18912794",
            "sentiment_compound": 0.4576
        },
        {
            "id": "i13ho4o",
            "score": 1,
            "text": "I lived in Telluride Colorado a couple years back and the elk knew exactly when it was hunting season and would start hanging out all over the golf course and ski in ski out runs too it was hilarious.",
            "title_similarity": "0.6258006",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i13ho4q",
            "score": 1,
            "text": "Wouldn’t you do the same if you were an elk?",
            "title_similarity": "0.34090486",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13hqhl",
            "score": 1,
            "text": "I remember this happening when I lived on a ranch in western Montana.  They somehow knew 2 days before hunting season and they came down from the mountains and stayed for the next 2-3 weeks.  It was cool to see a herd of anout 1-200 every morning going to school!",
            "title_similarity": "0.5593382",
            "sentiment_compound": 0.3802
        },
        {
            "id": "i13hswe",
            "score": 1,
            "text": "This took a study?\n\nAnybody who's ever set foot in the woods during hunting season could tell you big game animals do this.",
            "title_similarity": "0.64920354",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13hv99",
            "score": 1,
            "text": "So does this mean the solution is to make hunting legal year round? or create longer seasons?",
            "title_similarity": "0.39766657",
            "sentiment_compound": 0.644
        },
        {
            "id": "i13i2yr",
            "score": 1,
            "text": "Sounds like an opportunity for private landowners to make some money.",
            "title_similarity": "0.17001271",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i13i6gv",
            "score": 1,
            "text": "How is this news? There's a whole industry around billionaires buying land specifically to facilitate this and then charge ridiculous sums for less wealthy people to come shoot docile wildlife in a barrel.",
            "title_similarity": "0.6236891",
            "sentiment_compound": -0.4005
        },
        {
            "id": "i13ihfk",
            "score": 1,
            "text": "One could say they were... Gaming the system...",
            "title_similarity": "-0.00977236",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13ihk1",
            "score": 1,
            "text": "really?\n\nhow old or new is this study?\n\nthis is something that has been known for decades not only for elk in the west but for just about the whole country.\n\narchery season they stick to their general patterns, but once the first lead starts to fly it gets quite and the move to private. Bucks/bulls will also go completely nocturnal",
            "title_similarity": "0.67058563",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13ilv5",
            "score": 1,
            "text": "I used to do landscape maintenance and every year I had a 6 point buck camp out in the yard I took care of for those 2 months deer season was open, soon as it ended that buck was gone. You can't tell me they aren't smart and know where to hide.",
            "title_similarity": "0.76858675",
            "sentiment_compound": 0.0624
        },
        {
            "id": "i13iorc",
            "score": 1,
            "text": "Nature is so absolutely lit!",
            "title_similarity": "-0.20673324",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13iqfe",
            "score": 1,
            "text": "It is the same for TN. What is boils down to is over hunting in areas. Animals are not stupid as we think. They learn to adapt.  If they closed off hunting areas every other year or so and switch within 5 to 10 years it'll change their patterns",
            "title_similarity": "0.6493659",
            "sentiment_compound": 0.4168
        },
        {
            "id": "i13iqhs",
            "score": 1,
            "text": "Evolution at its finest. The elk who don't know where to go during hunting season get killed by hunters, increasing the percentage of elk who know where to go to be safe. These elk reproduce and have offspring that learn where to go during hunting season because their parents did it.",
            "title_similarity": "0.79675245",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i13itxs",
            "score": 1,
            "text": "Happens in Montana as well.  Even the deer get in on it.",
            "title_similarity": "0.48090357",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i13iup7",
            "score": 1,
            "text": "I always wonder how much money went into a finding that any hunter could’ve told the researchers. If they’d asked nicely anyway",
            "title_similarity": "0.54180664",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i13iw2g",
            "score": 1,
            "text": "As an elk hunter in Montana this is a well known thing.",
            "title_similarity": "0.38809085",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i13izqz",
            "score": 1,
            "text": "Fish and game found grizzlies following behind elk hunters and were potentially attracted by the gunshots.\nhttps://www.google.com/amp/s/www.fieldandstream.com/blogs/field-notes/gps-study-how-closely-do-grizzly-bears-follow-hunters/%3famp\nhttps://www.google.com/amp/s/www.outdoorhub.com/news/2018/10/10/watch-elk-hunters-study-shows-grizzly-bears-follow-lot-closer-want-know/amp/",
            "title_similarity": "0.66954863",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i13j0xc",
            "score": 1,
            "text": "Typical elk, always trying to take the credit for themselves. Everyone knows they stole the idea from the moose.",
            "title_similarity": "0.6026271",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i13j2se",
            "score": 1,
            "text": "Humans being animals that is the reason. They don’t want their lands living with ferocious animals.",
            "title_similarity": "0.5131972",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i13j7nm",
            "score": 1,
            "text": "r/AnimalsBeingGeniuses",
            "title_similarity": "0.009119149",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13j7v5",
            "score": 15,
            "text": "My dad lives in the country and is one of the few property’s that nobody hunts on.  Deer always seemed to know during hunting season they could come to our house and chill for a while.  During the spring time, the does would bring their little fawns and chill in the front yard.  There would always be 2-4 little ones a year running around the front yard.",
            "title_similarity": "0.7509124",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13j9cu",
            "score": 1,
            "text": "Everyone that hunts or farms knew that without a study.",
            "title_similarity": "0.48912698",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13jleg",
            "score": 1,
            "text": "I read something similar on r/gardening, where deer avoid but elk muscle into urban areas",
            "title_similarity": "0.68295765",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i13jlx6",
            "score": 1,
            "text": "Wow, it’s almost like they don’t enjoy being shot in the face.",
            "title_similarity": "0.31143653",
            "sentiment_compound": 0.8484
        },
        {
            "id": "i13joub",
            "score": 1,
            "text": "> elk were eating them out of house and home.\n\nA headline so bad, I had to click to see what that meant. Luckily it is an .edu news page...quite refreshing.",
            "title_similarity": "0.72589415",
            "sentiment_compound": -0.294
        },
        {
            "id": "i13jwir",
            "score": 1,
            "text": "I mean animals aren't dumb. \n\n\"Huh.. the homies keep dying in this specific region after I hear a loud boom... probably should stay away from there.\"",
            "title_similarity": "0.61558664",
            "sentiment_compound": 0.4023
        },
        {
            "id": "i13jyb4",
            "score": 1,
            "text": "I saw this happen when I was at Fort Leonard Wood, MO! They’d gather around the base and when the hunters were out, they’d go on the Post and hide!!",
            "title_similarity": "0.6167796",
            "sentiment_compound": -0.3769
        },
        {
            "id": "i13k1ua",
            "score": 1,
            "text": "My dads mid life crisis as a red blooded mid western American man was to get REALLY into the idea of being an elk hunter. All his free time was spent researching his elk hunting trips. Hundreds of hours of  YouTube, practicing elk calls in the basement (which did nothing to dampen that noise) was fine when we thought it was a phase. Now my mom won’t allow him to elk call in the house. THIS MAN WOULD WALK AROUND MY CITY WITH A BACKPACK FULL OF ROCKS AND A FULL CAT LITTER PAIL IN EACH HAND to prepare himself for his pack weight in the wilds of Wyoming. 5 years of round the clock obsession, that equates to 2 weeks stumbling around the woods out west. \n\nPoor guy has never come close to bagging one. This article is gonna be like balm on his little elk obsessed soul.",
            "title_similarity": "0.8142257",
            "sentiment_compound": 0.3424
        },
        {
            "id": "i13k3kk",
            "score": 1,
            "text": "I have about 160 acres and this is exactly what about 100+ head of elk do every fall. Hang out, eat the hay, hide in the trees, and then when hunting season is over they move on. It’s pretty funny.",
            "title_similarity": "0.66073877",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i13kae2",
            "score": 1,
            "text": "May all beings be free of suffering.",
            "title_similarity": "0.020694159",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i13kd5o",
            "score": 1,
            "text": "Is this because most predators, wolves big cats, are territorial? Being able to recognize and leave predator territory seems like evolution 101 for a herd/prey animal.",
            "title_similarity": "0.5804317",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i13kex1",
            "score": 1,
            "text": "Yep, the animals stay away from game areas",
            "title_similarity": "0.3976358",
            "sentiment_compound": 0.296
        },
        {
            "id": "i13kfxi",
            "score": 1,
            "text": "If they can show a slightly higher level of communication I’d go vegan. \n\nIf they level up to posting tiktok videos that happen to then show up in my YouTube algorithm, it’s right back to the bbq.",
            "title_similarity": "0.46369037",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13km14",
            "score": 32,
            "text": "Ha! It wouldn't stop our hunters in France. They regularly end on private land, nearly killing people, and then they say \"maybe the people should stop being outside during hunting season\". \n\nI'm being just a little sarcastic.",
            "title_similarity": "0.77216643",
            "sentiment_compound": -0.7725
        },
        {
            "id": "i13kna5",
            "score": 1,
            "text": "I mean, ***can you blame them?*** (The elk, obviously.)\n\nMother Nature ain't stupid.",
            "title_similarity": "0.49398994",
            "sentiment_compound": 0.0966
        },
        {
            "id": "i13koft",
            "score": 1,
            "text": ">While this is fascinating animal behavior, it’s actually quite problematic for the Utah Division of Wildlife Resources. That’s because dense **elk populations can be harmful to habitats throughout the state**, even disrupting farming operations as they are prone to steal food from livestock grazing on private lands and cause damage to farming infrastructure.\n\nWhich is why we need to allow wolf populations to return, because they are the best elk control out there, allowing habitat to revert to its natural state, and (contrary to popular opinion) livestock predation by wolves is very minimal.",
            "title_similarity": "0.7844527",
            "sentiment_compound": 0.6494
        },
        {
            "id": "i13kr4s",
            "score": 1,
            "text": "I live in an area where elk are abundant. They aren't stupid. As long as they are calm they'll look both ways before crossing a road. They know when hunting season is and deliberately stay in areas that they know they won't be harmed. They are wild and you need to be careful near them, but they are more docile than you might expect. But only as long as it isn't mating season and something hasn't spooked them. If they feel threatened they can and will kill people.\n\nThere was one time a few years ago. I needed to leave for work and an elk was standing in my driveway 3 feet away from my car door munching on some grass. I set off my car alarm and the damn elk looked at me standing on my porch instead of the car and ignored the alarm. So, I said, \"guess this is how it ends\" and locked eyes with him as I walked to my car. I could hear him breathing and munching. He just watched me get into my car and leave.",
            "title_similarity": "0.72591394",
            "sentiment_compound": -0.9692
        },
        {
            "id": "i13ksi0",
            "score": 1,
            "text": "Next step is the dolphin episode of the Simpsons.",
            "title_similarity": "0.17818037",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13kyzy",
            "score": 1,
            "text": "I have seen this with deer and pheasant. They can be smarter than you think!",
            "title_similarity": "0.399441",
            "sentiment_compound": 0.5093
        },
        {
            "id": "i13l1ia",
            "score": 1,
            "text": "I've witnessed them do this every season where I live",
            "title_similarity": "0.0688195",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13l4by",
            "score": 1,
            "text": "It's true for deer too. Lots of deer in my yard during hunting seasons",
            "title_similarity": "0.5669308",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i13l56l",
            "score": 1,
            "text": "Even doves will do that kind of thing. Way back, the guy that owned the land next to me planted millet to attract mourning doves to his property. When hunting season started, he'd go out before dawn and sit and wait to see doves - but wouldn't see any on his place.\n\nDriving by my farm, he'd see the doves - hundreds of them lined up on the power lines, scratching around on the ground, hanging out on the fences. One day he called and asked if he could hunt on my property. With visions of him shooting up the power lines, I said \"NO!\"\n\nSame for the white tailed deer - they'd come hang out on my place during the day where they knew they were safe. At night they'd go over to his farm to graze. I never told him about that since it would have frustrated him even more. I don't think his hunting was ever successful. He sold the land a few years later and it's now a subdivision.",
            "title_similarity": "0.7805911",
            "sentiment_compound": 0.784
        },
        {
            "id": "i13lca9",
            "score": 1,
            "text": "Hey you know what's better than hunters? RESTORING THE WOLF POPULATION!",
            "title_similarity": "0.5006227",
            "sentiment_compound": 0.729
        },
        {
            "id": "i13li9m",
            "score": 1,
            "text": "This happens everywhere, with every species.",
            "title_similarity": "-0.0809157",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13lima",
            "score": 1,
            "text": "Wonderful! Do you mind sharing pictures of your house and the landscape around it? From your story it sounded i teresting...",
            "title_similarity": "0.377346",
            "sentiment_compound": 0.7777
        },
        {
            "id": "i13lkbd",
            "score": 1,
            "text": "Like hunters haven’t figured this out 50 years ago. Haa elk know how to read no hunting/trespassing signs",
            "title_similarity": "0.71044874",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i13ll71",
            "score": 1,
            "text": "Like hunters haven’t figured this out 50 years ago. Haa elk know how to read no hunting/trespassing signs",
            "title_similarity": "0.71044874",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i13ls7v",
            "score": 1,
            "text": "This is part of the reason on the east coast we have introduced “urban archery season” for select counties. Wild game are super smart animals.",
            "title_similarity": "0.40441042",
            "sentiment_compound": 0.765
        },
        {
            "id": "i13m1k9",
            "score": 1,
            "text": "The ducks are doing that down here in Illinois. Duck hunters are complaining that there aren’t any ducks around, yet the protected wetlands, flooded fields, and state park fishing lakes are flush with ducks. Nature finds a way.",
            "title_similarity": "0.72730494",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i13m2h8",
            "score": 1,
            "text": "So you’re saying that elk have an in with someone in the city to understand which land is public vs private? Damn. Elk’sizz is smart.",
            "title_similarity": "0.52077",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13m34z",
            "score": 1,
            "text": "It's it legal to kill deer on your own property?",
            "title_similarity": "0.61000156",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i13m5bh",
            "score": 1,
            "text": "Animals are always smarter then we assume as humans. It’s why you can damn near walk up to many deer when it’s out of season, but in season they vanish.",
            "title_similarity": "0.57209796",
            "sentiment_compound": 0.0387
        },
        {
            "id": "i13m8zy",
            "score": 1,
            "text": "Bizarre to think a being has adapted to this extent that it adds a bit more weight to the morality of killing this species imo",
            "title_similarity": "0.43474877",
            "sentiment_compound": -0.7717
        },
        {
            "id": "i13mfgz",
            "score": 1,
            "text": "Deer are smart! We'd see them all over our property all year long, then when hunting season hit, they'd vanish.",
            "title_similarity": "0.7108478",
            "sentiment_compound": 0.4574
        },
        {
            "id": "i13mt91",
            "score": 1,
            "text": "Estes Park Colorado does not allow hunting in the city and that’s why you see elk there all the time. They know they’re safe.",
            "title_similarity": "0.7269926",
            "sentiment_compound": 0.3036
        },
        {
            "id": "i13myoi",
            "score": 1,
            "text": "Time for a nuisance permit.",
            "title_similarity": "0.05035218",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13n0rh",
            "score": 1,
            "text": "This is why we need wolves.",
            "title_similarity": "0.34998706",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13n2rp",
            "score": 1,
            "text": "You see this on military bases too, Fort Knox always had oodles of deer because they knew they couldn't be hunted there.",
            "title_similarity": "0.78183925",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13n5a0",
            "score": 1,
            "text": "That's normal of any roamimg nocturnal animal.   Hunting deer in north east PA, they all disappear during hunting season.  Hunt all day see nothing, then drive home and see a 12 pointer laying on your neighbors lawn.",
            "title_similarity": "0.806166",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i13nbsm",
            "score": 1,
            "text": "\"watch out Ned it's comin right for us!\"",
            "title_similarity": "-0.11009917",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13nivd",
            "score": 21,
            "text": "It’s not particularly remarkable. On public land, even if the animals are not being actively shot at, they are displaced and pushed around by numerous hunters in cars and on foot. They constant pressure pushes them where hunters can’t go.",
            "title_similarity": "0.6261686",
            "sentiment_compound": -0.7433
        },
        {
            "id": "i13nmqf",
            "score": 1,
            "text": "And 14 of them are still hiding here... Just laying out in the lawn!",
            "title_similarity": "0.36510313",
            "sentiment_compound": -0.3595
        },
        {
            "id": "i13o144",
            "score": 1,
            "text": "The animals become conditioned to the hunting season because it's the same time every year.  Adapt and overcome.",
            "title_similarity": "0.448478",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13o2rk",
            "score": 1,
            "text": "A study? Once they had the first two bits of info what alternate theories could there be",
            "title_similarity": "0.19859672",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13oc7h",
            "score": 1,
            "text": "It parts of Canada hunting season increases traffic incidents involving animals, because hunters aren't allowed to hunt within a certain distance of roads",
            "title_similarity": "0.75149703",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i13od9m",
            "score": 1,
            "text": "Reminds me of the botanical gardens in the central area of Dunedin, New Zealand. A day before hunting season starts several hundred ducks all show up from the country side and take refuge. How they figure it out I have no idea.",
            "title_similarity": "0.638358",
            "sentiment_compound": -0.296
        },
        {
            "id": "i13opob",
            "score": 1,
            "text": "In CT, deer do this during hunting season.  They leave the forests and hunting grounds and spend more time near houses",
            "title_similarity": "0.6688877",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i13oqgr",
            "score": 1,
            "text": "I swear to God I see this with Turkeys in CT",
            "title_similarity": "0.34949777",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i13p4x3",
            "score": 1,
            "text": "They're smarter then the pricks who hunt them.",
            "title_similarity": "0.14831173",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i13p52v",
            "score": 1,
            "text": "Not sure how that equates age-wise to human intelligence but they made it this long through adaptation such as this, really should give animals more respect as thinking beings",
            "title_similarity": "0.35839272",
            "sentiment_compound": 0.7318
        },
        {
            "id": "i13p5ue",
            "score": 1,
            "text": "Animals are smart. But sex is usually what gets them harvested. Thinking with the second head puts animals in danger",
            "title_similarity": "0.3900026",
            "sentiment_compound": -0.5789
        },
        {
            "id": "i13p6lu",
            "score": 1,
            "text": "Good for the elk I’m happy for them and wish them long and healthy and happy lives",
            "title_similarity": "0.26854402",
            "sentiment_compound": 0.9403
        },
        {
            "id": "i13p710",
            "score": 1,
            "text": "The deer here get smart quick too. After the first shot is fired they disappear into another dimension only to return after hunting season in the middle of the road late at night",
            "title_similarity": "0.6599404",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i13p92j",
            "score": 1,
            "text": "Elk are smart little bastards. Like the ninja’s of the forest, amazing how something so huge can sneak right past you. Doesn’t surprise me at all.",
            "title_similarity": "0.4303266",
            "sentiment_compound": 0.8444
        },
        {
            "id": "i13p9vb",
            "score": 1,
            "text": "That lady going about the deer crossing signs might have been on to something…",
            "title_similarity": "0.41717848",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13phte",
            "score": 1,
            "text": "My ass is grass on the other side!!",
            "title_similarity": "0.04791905",
            "sentiment_compound": -0.6229
        },
        {
            "id": "i13pkok",
            "score": 1,
            "text": "Excellent example of a species adapting to the requirements of life.",
            "title_similarity": "-0.0781915",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i13pnhv",
            "score": 1,
            "text": "About happens every year with and during White Tail season.",
            "title_similarity": "0.11871875",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13pq3g",
            "score": 1,
            "text": "George! George!! It’s the 1st of the month!!! Come over HERE!! NOW!!!",
            "title_similarity": "0.04404933",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13pqx6",
            "score": 1,
            "text": "This is a very strange version of Big Buck Hunter that I haven't played before?",
            "title_similarity": "0.42926458",
            "sentiment_compound": -0.4817
        },
        {
            "id": "i13q2e7",
            "score": 1,
            "text": "I mean it make sense. It’s just the territory of another seasonal predator.",
            "title_similarity": "0.27875504",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13qb03",
            "score": 1,
            "text": "I notice this where I live on the Oregon coast. During hunting season there’s “trophy” bull elk grazing next to the main highway where you’d never see them any other time of the year. Obviously they don’t understand land borders, but they must understand that they’re safer near more people than they are left to their typical grazing territory.",
            "title_similarity": "0.74557614",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i13qify",
            "score": 1,
            "text": "Animals can’t talk. If they could most likely they would garner human respect. With that they would say “stop hunting us, we don’t like that”. With this respect and information we would stop. \n\nAnimals can’t talk, yet Elk have been shown to be intelligent enough to determine what is private and public property and avoid public during hunting season to avoid death. To me this is an obvious sign that the animals don’t want to be hunted, yet our lack of respect for them makes their obvious wish go un-granted.\n\nI fear for the day I’m reincarnated as a precious life we humans chose to torment. \n\nOne day we will create the change and be better.\n\n#unpopularopinion",
            "title_similarity": "0.75551915",
            "sentiment_compound": 0.9006
        },
        {
            "id": "i13qsny",
            "score": 1,
            "text": "Nobody wants to be killed",
            "title_similarity": "0.28672773",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i13qz3l",
            "score": 1,
            "text": "It makes people feel like destroying life is inconsequential, possibly desirable.",
            "title_similarity": "0.32504195",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i13rhm8",
            "score": 1,
            "text": "We all knew this in Montana in 1981!",
            "title_similarity": "0.09481287",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13s19v",
            "score": 1,
            "text": "Animals migrate every year to Yellowstone to escape hunting.",
            "title_similarity": "0.6653254",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i13scmx",
            "score": 1,
            "text": "Elk go where hunters aren't?  Shocking findings.",
            "title_similarity": "0.60760784",
            "sentiment_compound": 0.3089
        },
        {
            "id": "i13sh1n",
            "score": 1,
            "text": "Finally some good news in the world.",
            "title_similarity": "-0.1137268",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i13slam",
            "score": 8,
            "text": "Hunters have known this for a very long time. In fact, deer and other game can commonly be seen hanging out on the other side of the fence of the game preserve during hunting season.",
            "title_similarity": "0.6170241",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13t648",
            "score": 1,
            "text": "I don’t even hunt and I already knew this",
            "title_similarity": "0.23892693",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13trsq",
            "score": 1,
            "text": "Deer and elk are smart there is a reason you see a ton of deer during elk season and vice versa.. years of being hunted the same time every year for years and years and they know when hunting season is and they are either only out at night or down on farmer johns apple tree farm living the dream.",
            "title_similarity": "0.6616397",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i13u0x3",
            "score": 8,
            "text": "I live near a lot of state land where hunting is permitted. The entirety of hunting season is a deer party at my place.",
            "title_similarity": "0.58531535",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i13u4oj",
            "score": 5,
            "text": "My family is full of hunters and they all swear that someone has taught the wild game how to read the hunting gudiesnthe outline the seasons.",
            "title_similarity": "0.7097059",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i13u5lt",
            "score": 1,
            "text": "You see this in Hawaii. There are marine reserves like haunama bay flush with fish. However just around the corner it's desolate. The reason? Fish that have survived being caught by speaefisherman have learned where the danger areas and boundaries are to not die.",
            "title_similarity": "0.52876425",
            "sentiment_compound": 0.6753
        },
        {
            "id": "i13ub0r",
            "score": 1,
            "text": "Ducks have been doing this since the refuge system was created.",
            "title_similarity": "0.32208502",
            "sentiment_compound": 0.25
        },
        {
            "id": "i13usii",
            "score": 1,
            "text": "If large meat creatures are going and eating people's food crops, why are these people just not eating the meat creatures?\n\nYou're trying to grow food, something eats your food. That something is edible. Eat it.",
            "title_similarity": "0.6487063",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13v8x2",
            "score": 1,
            "text": "I’d wager what was really going on is the elk got wise to the Sasquatch in the area.",
            "title_similarity": "0.5235402",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i13vfg0",
            "score": 1,
            "text": "The elk are not deciding one day to move. No notes from riot years are reviewed. Elk are harassed and move until not harassed. The land where they are not harassed might be private it a national park or a no hunting zone in an urban area. Elk n ed shelter, water and food so once they find that they stay until weather forces them to move, the food and water are not as good or are harassed.",
            "title_similarity": "0.8446241",
            "sentiment_compound": -0.8935
        },
        {
            "id": "i13vfql",
            "score": 1,
            "text": "Do the evolution baby!",
            "title_similarity": "-0.10970738",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13vlck",
            "score": 1,
            "text": "It doesn't help that once elk are on private land, the owners are fencing them in.",
            "title_similarity": "0.71641994",
            "sentiment_compound": -0.3089
        },
        {
            "id": "i13vuq0",
            "score": 1,
            "text": "Hunting on public land is extremely difficult in my state. I'm not sure about elsewhere but you can be out all day and not spot a single tail, then come dark, they start coming across the property line by the dozens.",
            "title_similarity": "0.707745",
            "sentiment_compound": -0.3351
        },
        {
            "id": "i13w3te",
            "score": 2,
            "text": "Doesn't this just mean the elk that didn't hide got killed?  An entire generation of hiding elk survived.",
            "title_similarity": "0.7121628",
            "sentiment_compound": 0.7358
        },
        {
            "id": "i13w4po",
            "score": 1,
            "text": "The obvious solution is to make all private land public so they can't hide",
            "title_similarity": "0.25778294",
            "sentiment_compound": 0.4734
        },
        {
            "id": "i13w4vb",
            "score": 1,
            "text": "*Nature, hum, finds a way*",
            "title_similarity": "-0.055405393",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13wcrc",
            "score": 12,
            "text": "This isn't anything new, Elk and deer always migrate into areas they can't be hunted. I work at a mine, every hunting season they go right into the mine boundary where they can't be hunted. Once the season ends they leave. Same thing happens at the military bases in Canada anyway.",
            "title_similarity": "0.7606083",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i13wdit",
            "score": 1,
            "text": "Any hunter knows this, prey are far smarter then they are give credit for,and know a safe zone when they find one.",
            "title_similarity": "0.204115",
            "sentiment_compound": 0.8176
        },
        {
            "id": "i13wg2r",
            "score": 1,
            "text": "Further proof that animals aren't stupid",
            "title_similarity": "0.026790904",
            "sentiment_compound": 0.4168
        },
        {
            "id": "i13wkjv",
            "score": 1,
            "text": "Life uh…. Finds a way",
            "title_similarity": "-0.16297168",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13wr6p",
            "score": 1,
            "text": "I've watched ducks and geese turn mid-air with the contours of the reserve they were feeding in.  They know.  They may not know calendar dates, but they figure out safe from unsafe pretty fast.",
            "title_similarity": "0.5886868",
            "sentiment_compound": 0.8462
        },
        {
            "id": "i13wy5o",
            "score": 1,
            "text": "Wow I can’t imagine being eaten out by an elk.",
            "title_similarity": "0.5622963",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i13xapg",
            "score": 1,
            "text": "I’m shocked that an animal would avoid hunting pressure.",
            "title_similarity": "0.4045439",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i13xcjp",
            "score": 1,
            "text": "Maybe stop shooting wolves ya dumb rednecks",
            "title_similarity": "0.6111691",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i13xd14",
            "score": 1,
            "text": "I grew near the south rim of Grand Canyon National Park which borders the Kaibab National Forest. Every hunting season the elk usually hang around in the park or in the town of Tusayan nearby.",
            "title_similarity": "0.6236913",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i13xo8m",
            "score": 2,
            "text": "I could've told them that for free. Joking aside, on my wife's deer hunt, we took pictures of all the legal deer in the town. Bucks were literally laying in people's front yards. We saw lots of does in the woods, but not a single legal buck. They're smart critters.",
            "title_similarity": "0.7789316",
            "sentiment_compound": 0.7045
        },
        {
            "id": "i13y0wm",
            "score": 1,
            "text": "They do that here on the Oregon Coast. We live in Gearhart, and the elk herd is usually around town in October and November",
            "title_similarity": "0.5056224",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13y67f",
            "score": 1,
            "text": "Adapt and survive, nature always a finds a way.",
            "title_similarity": "-0.04179382",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13yd3x",
            "score": 1,
            "text": "As a Ojibway who studies science I’ve gotta just say this doesn’t surprise me",
            "title_similarity": "0.26118627",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i13yiq3",
            "score": 1,
            "text": "Whoever mated around private land survived and passed on said behaviorism",
            "title_similarity": "0.28392205",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i13z2ll",
            "score": 1,
            "text": "Used to live in Utah and this is no surprise deer basically we’re always in my backyard",
            "title_similarity": "0.55112755",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i13z534",
            "score": 1,
            "text": "In a few thousand years they will outsmart us.",
            "title_similarity": "0.2544456",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13zjhj",
            "score": 1,
            "text": "Eating them out of house?",
            "title_similarity": "0.49646232",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13zmk0",
            "score": 1,
            "text": "\"YOU CAN'T HUNT HERE!  THIS IS PRIVATE LAND!\"\n\n\"oshit\"",
            "title_similarity": "0.30903155",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13zou3",
            "score": 1,
            "text": "It wouldn’t have taken some fancy study, literally just walk the fence line between public and private land and you’ll see every hunter hoping for elk to hop the fence.",
            "title_similarity": "0.7196832",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i13zr2w",
            "score": 1,
            "text": "In the voice of David Attenborough... *And so new migratory patterns were introduced to the species.*",
            "title_similarity": "0.17815307",
            "sentiment_compound": 0.0
        },
        {
            "id": "i13ztpr",
            "score": 1,
            "text": "I’ve known about this activity in elk for years. I’ve worked for a private land owner for close to ten years up Provo Canyon. During the hunting season starting at the end of September we get large herds of elk that come from the public land over to our private side. It became such a problem during the elk hunt that some hunters get frustrated and desperate and they tried to sneak on our private property and risk get caught trespassing. The private land owner got so frustrated with it that he asked us to patrol his property to during the hunt to push of these hunters off his property. These elk knew when and where they got pressure from hunters and over the years we would get massive mature elk bedding down on his property year after year. I got so use to seeing elk that easily could score over 350 in size during the hunt and just watching these creatures was absolutely beautiful. I’d sometimes even bring an elk call the call these big boys in to get a closer to get a better look at these monsters. Sorry not sorry hunters.",
            "title_similarity": "0.83162594",
            "sentiment_compound": -0.5929
        },
        {
            "id": "i140bm0",
            "score": 1,
            "text": "Almost like they don’t like being hunted",
            "title_similarity": "0.34857038",
            "sentiment_compound": 0.5729
        },
        {
            "id": "i140duz",
            "score": 1,
            "text": "Animals are smart motherfuckers. I grew up near a river in Maine where one side was a big game preserve, the other side was not. Those sly bastards would camp out in the preserve during the day and cross over at night.",
            "title_similarity": "0.63756704",
            "sentiment_compound": 0.7114
        },
        {
            "id": "i140f2o",
            "score": 1,
            "text": "I wonder if this would be considered a migratory pattern…",
            "title_similarity": "0.08265303",
            "sentiment_compound": 0.0
        },
        {
            "id": "i141pwx",
            "score": 1,
            "text": "They do this is Arizona, too. The town of Pine will be flooded with herds of elk come hunting season. They'll also congregate on golf courses in Payson. Another tactic I've seen is that they'll invade Grand Canyon NP. The park service had to put fencing around all the young trees because they'd strip them clean. The elk are also all over Mather campground and Grand Canyon village near Maswik. My friends would get elk tags and come back empty. I'd have to chase them away from my campsite.",
            "title_similarity": "0.81725323",
            "sentiment_compound": 0.875
        },
        {
            "id": "i141tmc",
            "score": 1,
            "text": "Turns out they don’t like getting killed.",
            "title_similarity": "0.30368668",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i1425zf",
            "score": 1,
            "text": "Kinda makes sense. \n\nThose that stay. Get dead and don’t produce young.\n\nThose that migrate. Produce young and pass along their migratory habits.",
            "title_similarity": "0.54782224",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i1426i4",
            "score": 1,
            "text": "This is part of the problem with inflexibility of people's mindsets. Animals have pretty strict behaviors, but they adapt. Humans could do the same, but we make rules and laws that kinda don't encourage adapting.\n\nHopefully they can find a way to compromise between the 2 sides (private land owners, and hunters), so that way all sides can benefit",
            "title_similarity": "0.5770185",
            "sentiment_compound": -0.1956
        },
        {
            "id": "i142fj3",
            "score": 1,
            "text": "In MN I've heard many say anecdotally that it's really uncommon to see a buck with antlers out and about in the daytime. Not bc there aren't any around, they've just shifted their active hours mostly to nighttime when there's less hunting going on.",
            "title_similarity": "0.72661567",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i142gbo",
            "score": 1,
            "text": "I was hearing that too. So I read this article. Turns out I talk like this now.",
            "title_similarity": "0.12624946",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i142ge3",
            "score": 1,
            "text": "Its the same in Colorado. Main reason why I haven't hunted in recent years.",
            "title_similarity": "0.53126323",
            "sentiment_compound": 0.0
        },
        {
            "id": "i142qnx",
            "score": 1,
            "text": "Most hunters know this. I'm surprised others do not.",
            "title_similarity": "0.2984455",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i142tcn",
            "score": 1,
            "text": "Humans are depressing",
            "title_similarity": "0.07987777",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i1432ab",
            "score": 1,
            "text": "I used to see wild turkeys on the side of the highway where it would be illegal to hunt them every year during hunting season. Animals aren't as dumb as people think they are.",
            "title_similarity": "0.80163264",
            "sentiment_compound": -0.2259
        },
        {
            "id": "i143dzq",
            "score": 1,
            "text": "Maybe this should indicate the intelligence of the animal and lead to NOT shooting intelligent beings … but what do I know,",
            "title_similarity": "0.41952193",
            "sentiment_compound": 0.0798
        },
        {
            "id": "i143p1c",
            "score": 1,
            "text": "Just remembered this grey squirrel a friend of mine was trying to get. The squirrel was always raiding his plum tree. So one day while I'm there, he grabbed a pellet gun and spooks out around the house to come back on the other side. Then when I started to scan the trees in order to spot the squirrel, he got upset at me for spooking the squirrel. I was supposed to just keep working on cleaning a carb and not look up & that squirrel would've come back for another plum. It was hours before the squirrel came back",
            "title_similarity": "0.7525665",
            "sentiment_compound": -0.1406
        },
        {
            "id": "i143rmk",
            "score": 1,
            "text": "Hiding!!!! These r beings! Don’t kill them!!!!",
            "title_similarity": "0.18942086",
            "sentiment_compound": -0.8429
        },
        {
            "id": "i1445t8",
            "score": 1,
            "text": "Ducks adapt to hunting pressure also. Very few flying during the day but thousands come into the same marsh 5 minutes after local shooting time. It is both impressive and maddening.",
            "title_similarity": "0.6051558",
            "sentiment_compound": -0.1154
        },
        {
            "id": "i144fqq",
            "score": 2,
            "text": "Switch up the hunting season time.",
            "title_similarity": "0.31999415",
            "sentiment_compound": 0.0
        },
        {
            "id": "i144lh0",
            "score": 1,
            "text": "I work at a state park in Pennsylvania with a high population of Elk. Damn if this doesn't confirm what I observe daily in my park.\n\nThe herd moves to areas where hunters are not allowed to hunt during the hunting season, then I swear to God, they move back into hunting zones as soon as the season closes. They're smarter than we think.",
            "title_similarity": "0.78719205",
            "sentiment_compound": 0.296
        },
        {
            "id": "i144z71",
            "score": 1,
            "text": "Proof that humans are not the smartest animals in the zoo.",
            "title_similarity": "0.44309014",
            "sentiment_compound": -0.4973
        },
        {
            "id": "i14558o",
            "score": 1,
            "text": "And the labs owners who allow hunting ( for a fee) are just out ' checking fence' in thier aircraft and not actively herding the elk onto private land.    \n\nDoes hunting pressure cause movement? Yes. But assholes (like those on a large ranch in Douglas Wyoming)  cheat the system.",
            "title_similarity": "0.8708675",
            "sentiment_compound": -0.7738
        },
        {
            "id": "i145l57",
            "score": 1,
            "text": "This is common knowledge. No study necessary.",
            "title_similarity": "-0.025359657",
            "sentiment_compound": -0.296
        },
        {
            "id": "i145ng7",
            "score": 1,
            "text": "To everyone wondering how the deer know. It's primarily gun shot noise. Gunshot is loud and it travels far. The experienced bucks move out when the first few rounds go off.\n\nThat's why there are earlier bow hunting seasons.",
            "title_similarity": "0.60964674",
            "sentiment_compound": -0.34
        },
        {
            "id": "i1463fq",
            "score": 1,
            "text": "My dog is like this on bath day. \n\nMonday through Saturday she’s always up underneath my feet. Sunday she is nowhere to be found.",
            "title_similarity": "0.50145376",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i1464vt",
            "score": 1,
            "text": "So the hunters are not killing the elks because they’re more intelligent than the hunters thought. Pretty good reason not to kill animals for sport.",
            "title_similarity": "0.625173",
            "sentiment_compound": 0.9489
        },
        {
            "id": "i1465ow",
            "score": 1,
            "text": "survival of the fittest.  The ones that do not leave public land are the ones that get shot. After a while the ones not getting shot are the ones who prefer to be on private land.",
            "title_similarity": "0.5093425",
            "sentiment_compound": 0.0382
        },
        {
            "id": "i146cz1",
            "score": 1,
            "text": "In Colorado, big horn sheep hunting season is in September or October. Getting a permit is like a once in a lifetime thing, and hunters can get special access on Pikes Peak to hunt. But they all disappear off the mountain into lower elevations, including garden of the gods & Glen eyrie which are off limits hunting. Makes me smile.",
            "title_similarity": "0.73686916",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i146ru0",
            "score": 1,
            "text": "I went deer hunting in Montana and saw this! The deer knew they were safe on the private lands.",
            "title_similarity": "0.67888737",
            "sentiment_compound": 0.4926
        },
        {
            "id": "i1476fk",
            "score": 1,
            "text": "People are surprised by this? Happens with deer too in many places.",
            "title_similarity": "0.5191659",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i147h8r",
            "score": 1,
            "text": "I always root for the animals.",
            "title_similarity": "0.18000795",
            "sentiment_compound": 0.0
        },
        {
            "id": "i147vc6",
            "score": 1,
            "text": "There are towns/cities in ND that have legalized bow hunting in city limits to reduce deer populations.",
            "title_similarity": "0.69592094",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1480eo",
            "score": 1,
            "text": "Life uh-uh-uh finds a way.",
            "title_similarity": "-0.14975315",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1482uc",
            "score": 1,
            "text": "They’re just now figuring that out!?!?!?",
            "title_similarity": "-0.11934615",
            "sentiment_compound": 0.0
        },
        {
            "id": "i148rud",
            "score": 1,
            "text": "It's been that way ever since ranchers started charging 12000 dollar \"access fees\" so rich hunters can pay for canned hunts on private land. Then winter rolls around and the elk are chowing down the ranchers hay so he moans at FWP to get them off so his cows dont starve. \n\n20 years ago ranchers would beg hunters to drive the elk off their place so the cows wouldnt be competing for browse, now they wonder why they have 400+ head herds of elk eating them out of house and home.",
            "title_similarity": "0.85025716",
            "sentiment_compound": 0.695
        },
        {
            "id": "i149h1w",
            "score": 1,
            "text": "Also lots are getting hoof rot from different herbicides and pesticides",
            "title_similarity": "0.39973328",
            "sentiment_compound": 0.0
        },
        {
            "id": "i14agyd",
            "score": 1,
            "text": "Every animal that gets hunted does this. That’s why opening weekend of any season is so very popular.",
            "title_similarity": "0.2823509",
            "sentiment_compound": 0.5222
        },
        {
            "id": "i14aj64",
            "score": 1,
            "text": "so, you're telling me that animals are smarter than humans thought. shocker....",
            "title_similarity": "0.20329656",
            "sentiment_compound": 0.34
        },
        {
            "id": "i14b41e",
            "score": 1,
            "text": "Survival of the smartest",
            "title_similarity": "-0.11545083",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i14bm71",
            "score": 1,
            "text": "I am a contractor on a lockheed martin site, during a certain time of year the elks entire herd is chilling out on site. Other times they are nowhere to be found. I never thought about this being a reason but it makes total sense.",
            "title_similarity": "0.68781537",
            "sentiment_compound": 0.128
        },
        {
            "id": "i14cl2o",
            "score": 1,
            "text": "Smart animals, makes sense though.",
            "title_similarity": "-0.07785162",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i14cqqf",
            "score": 1,
            "text": "We were in Yellowstone during the elk hunting season six years ago. So many elk came into the park, specifically into the campgrounds. They weren't tame, they didn't try to interact with humans. They would get anxious if humans came too close in fact. But they stayed in the campgrounds. We thought at the time that they came to Yellowstone to escape hunters and they came into campgrounds to escape the grizzlies and wolves.",
            "title_similarity": "0.8843143",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i14cv0c",
            "score": 1,
            "text": "Flagstaff AZ we would see all types of deers, bucks even antelope come down our street during hunting season. I miss that town.",
            "title_similarity": "0.65820944",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i14e85j",
            "score": 1,
            "text": "This has been known amongst hunters for several years now. The deer do the same thing. Theyve learned through generations of seasonal hunting. Its why you see celebrities with big bulls on private land, the owners of the property will scout them out and sell their resident bulls to the highest bidder.",
            "title_similarity": "0.7356436",
            "sentiment_compound": 0.0
        },
        {
            "id": "i14efqg",
            "score": 2,
            "text": "Herbivores survive by recognizing predators and their patterns, then adjusting accordingly.  This is not at all surprising.",
            "title_similarity": "0.28499484",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i14es08",
            "score": 1,
            "text": "News: animals don’t want to die",
            "title_similarity": "0.41473436",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i14etli",
            "score": 1,
            "text": "Maybe we need to issue less damn tags.",
            "title_similarity": "0.19314985",
            "sentiment_compound": -0.3415
        },
        {
            "id": "i14f81d",
            "score": 1,
            "text": "They didn’t need to commission a study to know that. Everyone that hunts elk knows that you’ve got to hunt adjacent to private land and hope you can catch them crossing public. \n\nI encourage everyone to make a drive through Rocky Mountain National park during September.",
            "title_similarity": "0.72793734",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i14fx52",
            "score": 1,
            "text": "Good for them  , hunting equals killing for fun.",
            "title_similarity": "0.3514963",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i14g6kt",
            "score": 1,
            "text": "Wow they migrate to save themselves from humans",
            "title_similarity": "0.34227335",
            "sentiment_compound": 0.7906
        },
        {
            "id": "i14gllj",
            "score": 1,
            "text": "Noticed a few years ago pheasant hunting with a friend they will go over on private land where no hunting is allowed.",
            "title_similarity": "0.7987544",
            "sentiment_compound": 0.25
        },
        {
            "id": "i14guss",
            "score": 1,
            "text": "They learn. Saw this with birds. Shoot one or two down and they start associating it with a certain time . They even recognize guns and hunters and call them out so other birds flee.",
            "title_similarity": "0.5085224",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i14h92y",
            "score": 1,
            "text": "The elk indeed tell you they are related to deer! That's the same thing they do. However, there are so many deer, that they are easily seen once the leaves fall.",
            "title_similarity": "0.5557047",
            "sentiment_compound": 0.4003
        },
        {
            "id": "i14ho05",
            "score": 1,
            "text": "Seems pretty simple. Make all land public. Problem solved. Like Norway with their “Right To Roam?”.",
            "title_similarity": "0.2743641",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i14hrvs",
            "score": 1,
            "text": "When you are an animal but still gotta find loopholes in laws to survive.",
            "title_similarity": "0.32812738",
            "sentiment_compound": 0.0
        },
        {
            "id": "i14ic8r",
            "score": 1,
            "text": "Goes to show how severely we underestimate the intelligence of other animals.",
            "title_similarity": "0.403531",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i14ip5g",
            "score": 3,
            "text": "And people say animals aren't smart.",
            "title_similarity": "0.34957927",
            "sentiment_compound": -0.3089
        },
        {
            "id": "i14j8d7",
            "score": 1,
            "text": "Bold of them to think hunters would honor private property borders.",
            "title_similarity": "0.4300565",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i14jasx",
            "score": 1,
            "text": "We have acreage and during duck hunting season they turn up here by the dozens, head off straight after it finishes. We don’t hunt them on our land so seems like they know it’s a safe spot.",
            "title_similarity": "0.70743227",
            "sentiment_compound": 0.7635
        },
        {
            "id": "i14jhcz",
            "score": 1,
            "text": "Elk are smart creatures. But Deer… them motherfuckers stupid AF. Object permanence or cause and effect are not things for them so your shoot them and they go, “what’s that sound? Oh Bucky fell over to take a nap huh” and then you shoot another then they may run because the sounds spook them.",
            "title_similarity": "0.75176346",
            "sentiment_compound": -0.8851
        },
        {
            "id": "i14kxr2",
            "score": 1,
            "text": "They're not stupid.\n\nThey're Looney.",
            "title_similarity": "-0.17085595",
            "sentiment_compound": 0.4168
        },
        {
            "id": "i14l93g",
            "score": 1,
            "text": "How did they learn to read?",
            "title_similarity": "0.09149831",
            "sentiment_compound": 0.0
        },
        {
            "id": "i14m6lk",
            "score": 1,
            "text": "It’s not really “hunting”, is it, with modern rifles. More like mass murder. Hunting weapons should be limited to a knife - you’d maybe get my respect then.",
            "title_similarity": "0.5901925",
            "sentiment_compound": -0.5955
        },
        {
            "id": "i14muho",
            "score": 1,
            "text": "Smart animals. Good on them.",
            "title_similarity": "-0.13163236",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i14n3rc",
            "score": 1,
            "text": "This is a classic tale in the mountains of Colorado for (mule) deer.  You can see them congregate on large tracts of private land and munch on the shrubs with no water source.  Once the season has ended, they are in your back yard and everywhere else.",
            "title_similarity": "0.7684542",
            "sentiment_compound": -0.296
        },
        {
            "id": "i14n5mo",
            "score": 2,
            "text": "elk have been doing this for decades. \n\nOnce hunted the Tetons outside Cody, Wyoming and found a literal highway near the rim rocks of the mountains where hundreds of elk exited the hunting area within the first day of hunting season. \n\nDrive to a new place and you see them grazing in low country fields everywhere. Wild that scientists finally took note.",
            "title_similarity": "0.7317072",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i14nd06",
            "score": 9,
            "text": "It’s like…. They don’t want to be hunted?",
            "title_similarity": "0.38670713",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i14nspm",
            "score": 7,
            "text": "I mean, that's what I'd do",
            "title_similarity": "-0.25175375",
            "sentiment_compound": 0.0
        },
        {
            "id": "i14nwb5",
            "score": 7,
            "text": "If I were an elk that is exactly what I would do",
            "title_similarity": "0.26818103",
            "sentiment_compound": 0.0
        },
        {
            "id": "i14ojgf",
            "score": 3,
            "text": "Tldr: Elk ain't stupid",
            "title_similarity": "0.16308577",
            "sentiment_compound": 0.4168
        },
        {
            "id": "i14p8fy",
            "score": 3,
            "text": "Animals are so much smarter than we ever thought. All the animals communicating through use of buttons is solid proof.",
            "title_similarity": "0.1554313",
            "sentiment_compound": 0.5965
        },
        {
            "id": "i14q94h",
            "score": 1,
            "text": "Smart elk.  I applaud you.",
            "title_similarity": "0.06153531",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i14quzj",
            "score": 1,
            "text": "The deer and roe deer inn our area migrate from the woods closer to residential areas when hunting season starts. They know hunters don't shoot towards residential areas around here.",
            "title_similarity": "0.81761837",
            "sentiment_compound": 0.2584
        },
        {
            "id": "i14qv71",
            "score": 1,
            "text": "Elk were 'eating them out of house and home.'\n\nWhat. Like barging in one herd at a time rummaging for cheeze its in the cupboards?",
            "title_similarity": "0.7349471",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i14r6p0",
            "score": 1,
            "text": "I’ve seen deer in gated communities in Florida, where they are permanent residence.",
            "title_similarity": "0.4534021",
            "sentiment_compound": 0.0
        },
        {
            "id": "i14r7vm",
            "score": 1,
            "text": "Elk have been in North America for 1 million years, and there are fossil record progenitors of elk from 25 million years ago. The didn’t get where they are, living among fierce mega fauna predators, all those millennia, by being STUPID. Of course they’re clever at survival!",
            "title_similarity": "0.6969557",
            "sentiment_compound": -0.3453
        },
        {
            "id": "i14ri5n",
            "score": 1,
            "text": "The very beginning of hunting season, I'm going to start shooting the ground to scare all the animals away",
            "title_similarity": "0.59851134",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i14s1xa",
            "score": 1,
            "text": "They also heard from private landowners that elk were eating them out of house and home.\n\nI'm stuck on that sentence. What does it mean? Elk were eating who?",
            "title_similarity": "0.8712748",
            "sentiment_compound": -0.264
        },
        {
            "id": "i14scmq",
            "score": 1,
            "text": "Why do humans think they are so much smarter than every other species????",
            "title_similarity": "0.08194287",
            "sentiment_compound": 0.6415
        },
        {
            "id": "i14sikg",
            "score": 1,
            "text": "Heard the same from Sweden. Hunting season for elks is like a day a year in that region, of course, no elk is to be seen on this day.",
            "title_similarity": "0.7157481",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i14slgl",
            "score": 1,
            "text": "I wonder what they learn from exactly. The sight / smell of dead brethren? A call the dying deer puts out when dying? The sound of the gunshot? Could be a mixture.",
            "title_similarity": "0.68967557",
            "sentiment_compound": -0.7041
        },
        {
            "id": "i14srjw",
            "score": 1,
            "text": "So they are smart, resourceful and beautiful. Lucky those hunters figured it out so they can go have fun killing them. #hunters are so cool.",
            "title_similarity": "0.29333895",
            "sentiment_compound": 0.8899
        },
        {
            "id": "i14ubw4",
            "score": 1,
            "text": "Good, they're smarter than we give credit for",
            "title_similarity": "-0.0801975",
            "sentiment_compound": 0.8176
        },
        {
            "id": "i14uiqn",
            "score": 1,
            "text": "My grandparents had a place near shady cove Oregon (outside of Medford) and I'd visit all the time. During non hunting seasons deer were everywhere.\n\nBut come hunting season deer would disappear except for my grandparents land. They weren't hunters and had a fountain that several deer used daily. They're not totally dumb animals",
            "title_similarity": "0.72057784",
            "sentiment_compound": 0.367
        },
        {
            "id": "i14utbp",
            "score": 1,
            "text": "It's as if they're beings with autonomy who don't want to be murdered",
            "title_similarity": "0.2280604",
            "sentiment_compound": -0.683
        },
        {
            "id": "i14vpnd",
            "score": 1,
            "text": "I'm in Wyoming. There is an elk herd that lives on coal mine and coal power plant's lands. Summer they're at the mine and winter they're at the power plant. Can't be hunted at either location.",
            "title_similarity": "0.7008953",
            "sentiment_compound": 0.0
        },
        {
            "id": "i14x47a",
            "score": 1,
            "text": "It’s like they don’t want to die.",
            "title_similarity": "0.21005014",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i14xgme",
            "score": 1,
            "text": "This is like Loony Toons cartoon. Perhaps this has been happening for a long, long time.",
            "title_similarity": "0.15579021",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i14y4c5",
            "score": 1,
            "text": "In my town the rabbits have learned to cross out the signs that say “rabbit season” and write in “duck season”. This has led to quite a few arguments.",
            "title_similarity": "0.61495095",
            "sentiment_compound": -0.4522
        },
        {
            "id": "i14ydzf",
            "score": 1,
            "text": "Why do people hunt for sport? Don't get me wrong, I know there are ecological reasons for deer hunting but I just don't see the appeal of shooting them.",
            "title_similarity": "0.6934597",
            "sentiment_compound": 0.1967
        },
        {
            "id": "i14ztw5",
            "score": 1,
            "text": "They had to do a study to figure this out? Pretty common knowledge",
            "title_similarity": "0.17709702",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i1509fh",
            "score": 1,
            "text": "Isn't it more likely that hunters flood public land during hunting season and all that scent pushes the elk out",
            "title_similarity": "0.7158788",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1509wf",
            "score": 1,
            "text": "And some private land owners are now charging stupid amounts of money for the ultra wealthy for canned hunts.",
            "title_similarity": "0.62889147",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i1515y9",
            "score": 1,
            "text": "Basically stupid wild cows figured out a system and coordinated with their peers to accomplish what it took humans studies to figure out was even happening. Are we REALLY the smartest animals on the planet?",
            "title_similarity": "0.535063",
            "sentiment_compound": 0.6569
        },
        {
            "id": "i151evm",
            "score": 1,
            "text": "I have been a deer hunter all of my life. For most the most part, I hunt areas that experience heavy hunting pressure. After the first couple of days of hunting season, it seemed all of the deer would disappear.\n\nThis frustrated me, and so I made it a mission to find out where they went. After two seasons of scouting and talking to landowners, I found the answer. They start hanging out behind people's houses. Hunters can't hunt around houses.\n\nI also hunt another patch of land that abuts private property. During hunting season, the deer seem to migrate to the private property.",
            "title_similarity": "0.833217",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i152j0s",
            "score": 1,
            "text": "Of course,  let someone shoot at you and see if you behave the same, now let's up the ante and have 500 people shooting at you.  During deer hunting in public land, you have opener morning or a day after. They're gone after day 2 or very scattered.",
            "title_similarity": "0.67778534",
            "sentiment_compound": -0.34
        },
        {
            "id": "i152tu9",
            "score": 1,
            "text": "This does not supervise me, in VT I see Turkey and deer, except round hunting season when they all sod off",
            "title_similarity": "0.7963872",
            "sentiment_compound": 0.0
        },
        {
            "id": "i153opd",
            "score": 1,
            "text": "As a hunter this is how it goes. Deer season? You'll see every single turkey, that you didn't know existed. Turkey season? Deer basically eating in your lap.",
            "title_similarity": "0.7201408",
            "sentiment_compound": 0.0
        },
        {
            "id": "i153utg",
            "score": 1,
            "text": "I grew up on a cattle farm and my parents would let one of their friends come onto the property to hunt. Each hunting season the deer would hangout with the cows and hide in the center of the herd, never did that any other time of the year.",
            "title_similarity": "0.76103246",
            "sentiment_compound": 0.34
        },
        {
            "id": "i154jci",
            "score": 1,
            "text": "Elks did a little trolling, it's called the elks do a little bit of trolling",
            "title_similarity": "0.5716437",
            "sentiment_compound": 0.0
        },
        {
            "id": "i154mrz",
            "score": 1,
            "text": "Its almost like they want to live.",
            "title_similarity": "-0.05999626",
            "sentiment_compound": 0.3057
        },
        {
            "id": "i1558ne",
            "score": 1,
            "text": "Hunter here.  I could of told them that…no need to spend money on a study that observation already told hunters.",
            "title_similarity": "0.5872531",
            "sentiment_compound": 0.0
        },
        {
            "id": "i155f79",
            "score": 1,
            "text": "Seems like there's a pretty obvious solution to this problem.",
            "title_similarity": "-0.15659317",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i1565q0",
            "score": 1,
            "text": "There must be an observant deer which discovered these seasonal magical barriers which can protect their lives and passed this knowledge to their children.",
            "title_similarity": "0.5742068",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i156jll",
            "score": 1,
            "text": "Life, uh, uh, finds a way.",
            "title_similarity": "-0.16751765",
            "sentiment_compound": 0.0
        },
        {
            "id": "i156mag",
            "score": 1,
            "text": "When I was in a rural area of Alaska where the caribou runs routinely passed through, the locals would get extremely upset by people who didn't live there coming and hunting. There were plenty of caribou - that wasn't the problem. The problem was the visitors would hunt and kill the caribou but leave the blood in ways that the caribou would smell and remember - resulting in the caribou changing their routes, leaving a community that relied on the caribou for generations to have none. There were techniques the locals used in hunting to prevent the caribou from smelling the blood and kills, which kept the caribou runs using the same route every year.",
            "title_similarity": "0.8361866",
            "sentiment_compound": -0.8725
        },
        {
            "id": "i1578k9",
            "score": 1,
            "text": "This is what happens when hunting is seasonal, the second they hear the first gun shot they’re like “welp, I’m a head out for about 2 weeks”",
            "title_similarity": "0.53779435",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i157gpn",
            "score": 1,
            "text": "They had to commission a study to find out what anyone who hunts public land has known forever.",
            "title_similarity": "0.5380652",
            "sentiment_compound": 0.0
        },
        {
            "id": "i158pge",
            "score": 1,
            "text": "\"Guys, we did a study and turns out the elk are onto us.\"",
            "title_similarity": "0.5891454",
            "sentiment_compound": 0.0
        },
        {
            "id": "i15aabs",
            "score": 1,
            "text": "I've been telling my husband this for years. He would see deer out of season all the time. They'd like taunt him (we'd joke) and the like and as soon as hunting season opened, zero deer. I told him they go on vacation to areas we cannot hunt.",
            "title_similarity": "0.8232323",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i15aqcz",
            "score": 1,
            "text": "Wow it’s as if animals are sentient. Who would’ve thought.",
            "title_similarity": "0.15536492",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i15arli",
            "score": 1,
            "text": "Stop hunting elk. They apparently are smart enough to know the difference between private and public land.",
            "title_similarity": "0.6014186",
            "sentiment_compound": 0.128
        },
        {
            "id": "i15b5cu",
            "score": 1,
            "text": "And the ones who don’t figure it out get killed. We’re essentially expediting the evolution process.",
            "title_similarity": "0.43894255",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i15bdhl",
            "score": 1,
            "text": "One of the things I still can't get a handle on living here in UT is....for such a sanctimonious culture, they sure do love killing animals...and why not...they have some of the most lenient animal cruelty law in the country.",
            "title_similarity": "0.5831228",
            "sentiment_compound": -0.1706
        },
        {
            "id": "i15bvkh",
            "score": 1,
            "text": "Gotta go knock on some doors",
            "title_similarity": "0.07311519",
            "sentiment_compound": 0.0
        },
        {
            "id": "i15c2wz",
            "score": 1,
            "text": "Theres a place in Western Australia called coral bay and its part of the ningaloo marine park, now you cant fish inside the main bay but you can a couple hunder meter down the beach, there are a bunch of spangled emperor that are huge 1.5meters atleast, never see them in the part of the reef where you can fish but will swim straight up to you on the main snorkelling beach",
            "title_similarity": "0.49099863",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i15ca4d",
            "score": 1,
            "text": "They’re evolving. We are a predator species.",
            "title_similarity": "0.2316387",
            "sentiment_compound": 0.0
        },
        {
            "id": "i15dl79",
            "score": 1,
            "text": "Well… I work at one of the private properties where a giant herd of elk comes every fall/winter. For Utah I think it is more accurate to say that the private land Has just overrun where the natural elk habitat is. Specifically northern Utah county on traverse mountain. The population has exploded in the last 10 years here.",
            "title_similarity": "0.63162935",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i15do6u",
            "score": 1,
            "text": "It amazes me when animals amaze people by doing sensible things.",
            "title_similarity": "0.18348773",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i15doj6",
            "score": 1,
            "text": "Why did you have to blow their cover for? Elks:1 humans:0",
            "title_similarity": "0.5189674",
            "sentiment_compound": 0.0
        },
        {
            "id": "i15eq8u",
            "score": 1,
            "text": "It’s as though the deer don’t want to be killed…weird",
            "title_similarity": "0.5528432",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i15gyfp",
            "score": 1,
            "text": "Hunting, I just don't get it.  Yes when we were Hunter gatherers.  But then we also didn't have scoped rifles to hit at 100 meters or more.\n\nIf you want to show prowess of hunting, take a small hand knife and go out alone in foot....",
            "title_similarity": "0.7353301",
            "sentiment_compound": 0.4618
        },
        {
            "id": "i15h658",
            "score": 1,
            "text": "Good. I dunno why people feel the need to hunt them. There's gotta be less than a handful of people who actually need to hunt to provide for themselves and their families, everyone else is just doing it for the fun of it.",
            "title_similarity": "0.6421597",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i15h9a8",
            "score": 1,
            "text": "These animals know what’s ip",
            "title_similarity": "-0.05061734",
            "sentiment_compound": 0.0
        },
        {
            "id": "i15huoe",
            "score": 1,
            "text": "I’ve always wondered if they know this time of year is dangerous",
            "title_similarity": "0.32014263",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i15iqbd",
            "score": 1,
            "text": "My parents have not allowed hunting for about 50 yrs. This effect is obvious on their land",
            "title_similarity": "0.6908992",
            "sentiment_compound": 0.0
        },
        {
            "id": "i15ju20",
            "score": 1,
            "text": "Female elk that live past 9 are pretty much bullet proof and impossible to get to. A 2017 study also studied elk and their sneaky behavior. \n\nHunters pretty much killed all the dumb or skiddish females. The more intelligent and cunning ones are the only ones left now\n\nMales are lucky to make it to 5. But average is like 10 years for them. while it's not uncommon for females to reach the age of 25.",
            "title_similarity": "0.70458245",
            "sentiment_compound": 0.6482
        },
        {
            "id": "i15ju4c",
            "score": 1,
            "text": "Animals aren’t stupid",
            "title_similarity": "-0.038420923",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i15ka9t",
            "score": 1,
            "text": "Evolutionary pressure?",
            "title_similarity": "-0.023557259",
            "sentiment_compound": -0.296
        },
        {
            "id": "i15kd4u",
            "score": 1,
            "text": "That's a no brainer. Someone got paid to study that animals avoid predators. AMAZING!!!",
            "title_similarity": "0.58667684",
            "sentiment_compound": 0.4605
        },
        {
            "id": "i15keu4",
            "score": 1,
            "text": "There are neighborhoods near Austin that are crammed with deer.  They are protected there, but it's definitely bringing in ticks and grandma saw a jaguar from her patio.",
            "title_similarity": "0.7144736",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i15ltpi",
            "score": 1,
            "text": "Whitetail deer in Pennsylvania do the same thing",
            "title_similarity": "0.38375273",
            "sentiment_compound": 0.0
        },
        {
            "id": "i15miar",
            "score": 1,
            "text": "It’s almost like these prey animals are adapting defenses to a new form of predator. Crazy, bet that’s never happened before.",
            "title_similarity": "0.48454186",
            "sentiment_compound": 0.1298
        },
        {
            "id": "i15nj8u",
            "score": 1,
            "text": "I have always said the damn deer get the hunting regs before we do.  They know the dates and go on vacation.",
            "title_similarity": "0.64991164",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i15ovgu",
            "score": 1,
            "text": "Maybe hunting is just a bad thing that we don't need to do.",
            "title_similarity": "0.46879226",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i15pofq",
            "score": 1,
            "text": "My professor was one of the leads on this study. The year that before the study was commissioned when they were having the most complaints they helicopter surveyed almost DOUBLE the target population for that management unit. The elk were way beyond growth targets because of this.",
            "title_similarity": "0.5544014",
            "sentiment_compound": -0.101
        },
        {
            "id": "i15q10a",
            "score": 1,
            "text": "They realise what a disease the human ape is",
            "title_similarity": "0.19417688",
            "sentiment_compound": 0.0
        },
        {
            "id": "i15qgdb",
            "score": 1,
            "text": "Just let the god damn Elks live",
            "title_similarity": "0.4673564",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i15womx",
            "score": 1,
            "text": "Hunters have known this for a long time",
            "title_similarity": "0.16404402",
            "sentiment_compound": 0.0
        },
        {
            "id": "i163ghs",
            "score": 1,
            "text": "If there’s one thing animals have it’s survival instinct and it gets honed very quickly. If you’ve ever gone bird hunting late in the season it’s amazing how much more intelligent and elusive they are compared to early season.",
            "title_similarity": "0.3715678",
            "sentiment_compound": 0.796
        },
        {
            "id": "i16bufr",
            "score": 1,
            "text": "Congrats on your study confirming something that anyone who hunts already knew.",
            "title_similarity": "0.26264983",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i16cep1",
            "score": 1,
            "text": "I work on a farm. There are geese every day. Except the day after hunting opens. They just go to the other side of the lake for a week.",
            "title_similarity": "0.5913876",
            "sentiment_compound": 0.0
        },
        {
            "id": "i16elwj",
            "score": 1,
            "text": "It’s funny I wish in Colorado fishing with some guides a few years ago and they said the fish know the exact line where it goes from catch and release to being able to keep your catch. If you fish on the catch and release side you will get fish all day because no one usually fished over there. Can’t remember the name of the river unfortunately",
            "title_similarity": "0.6807847",
            "sentiment_compound": 0.25
        },
        {
            "id": "i16ewnh",
            "score": 1,
            "text": "It's almost as if prey animals are capable of learning when & where predators come around. #ShockedPikachuFace",
            "title_similarity": "0.36581314",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i16hakn",
            "score": 1,
            "text": "My dog even knows days of the week, and times of day.\n\nHe knows when it's Tuesday, Friday and Sunday because that's when my partner comes over.",
            "title_similarity": "0.40162295",
            "sentiment_compound": 0.0
        },
        {
            "id": "i16hha9",
            "score": 1,
            "text": ">Turns out the elk were leaving public lands when hunting season started and hiding on private land.\n\nHard to believe that only a brief time ago--the span of a lifetime--\"experts\" only believed that animals, other than humans, were simply autotoms.  They didn't learn, think or even feel!",
            "title_similarity": "0.8194713",
            "sentiment_compound": -0.4389
        },
        {
            "id": "i16l0jz",
            "score": 1,
            "text": "Survival of the adaptable.",
            "title_similarity": "-0.16996956",
            "sentiment_compound": 0.0
        },
        {
            "id": "i16o9k8",
            "score": 1,
            "text": "I feel this is slightly common sense. Don't mean to sound how this is going to sound, but obviously animals will adapt to survive. If they're dying left and right during a certain time of year in a specific area, of course they will begin to avoid that place. I've assumed this was likely since I was little and hunting in Oregon.",
            "title_similarity": "0.6901916",
            "sentiment_compound": -0.0387
        },
        {
            "id": "i16swtc",
            "score": 1,
            "text": "I swear even squirrels do the same thing. Squirrels will get within 10 feet during turkey season, but seemingly vanish during squirrel season.",
            "title_similarity": "0.6491922",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i16v07d",
            "score": 1,
            "text": "Some hunting outfitters are known to use a pack of dogs and push elk out of public lands onto private lands so that they can sell more hunting trips",
            "title_similarity": "0.80123127",
            "sentiment_compound": 0.0
        },
        {
            "id": "i16w3li",
            "score": 1,
            "text": "Evolution in action. Adaptation and survival of the fittest (in this case smartest). Crazy how human social constructs (like hunting season) effect wildlife’s physical/social evolution.",
            "title_similarity": "0.39889267",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i16xo4x",
            "score": 1,
            "text": "Similar behavior here in the American South from white-tailed deer. They know when to take a staycation on Corps of Engineer property where hunting is verboten. All it takes is a few deer generations and it becomes virtually instinctual.",
            "title_similarity": "0.68590367",
            "sentiment_compound": 0.0
        },
        {
            "id": "i171w2r",
            "score": 1,
            "text": "Since the Elk have demonstrated the ability to learn and private land owners want to keep them off their land and that is the purpose of \"managing the Elk / issuing hunting licences\" wouldn't it make sense to only allow hunting on the private land thereby keeping the Elk on public land?  Might not mean much availability for hunters but so what, the rationale behind allowed hunting is always \"management\", not trophy/food sources.",
            "title_similarity": "0.784247",
            "sentiment_compound": 0.3071
        },
        {
            "id": "i176i9w",
            "score": 1,
            "text": "Natural instinct can have value.",
            "title_similarity": "-0.10162525",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i17aelk",
            "score": 1,
            "text": "How does an elk eat you out of house and home?",
            "title_similarity": "0.7227266",
            "sentiment_compound": 0.0
        },
        {
            "id": "i17jvfc",
            "score": 1,
            "text": "Wow.  Learned micro \nmigration pattern due to non environmental factors.",
            "title_similarity": "0.20671546",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i19uddi",
            "score": 1,
            "text": "Elk: Not just another pretty face.",
            "title_similarity": "0.1875396",
            "sentiment_compound": -0.3875
        },
        {
            "id": "i1arxfx",
            "score": 1,
            "text": "I suppose that, over time, evolution would tend to reward elk that consistently migrated to hunter-free areas during hunting season, for whatever reason.",
            "title_similarity": "0.56201917",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i1k7967",
            "score": 1,
            "text": "Almost like they don't want to die...",
            "title_similarity": "0.18465696",
            "sentiment_compound": 0.6287
        },
        {
            "id": "i25ta0a",
            "score": 1,
            "text": "Smart elk and deer!  Yay for them!",
            "title_similarity": "0.33981913",
            "sentiment_compound": 0.7707
        },
        {
            "id": "i2vrkvg",
            "score": 1,
            "text": "Good, serves them right for posting their land.",
            "title_similarity": "-0.010581244",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i61fdub",
            "score": 1,
            "text": "Well on the bright side Orin Hatch is dead!",
            "title_similarity": "0.19837761",
            "sentiment_compound": -0.1511
        }
    ]
}