{
    "A physicist has designed an experiment – which if proved correct – means he will have discovered that information is the fifth form of matter. His previous research suggests that information is the fundamental building block of the universe and has physical mass.\n": [
        {
            "id": "i28kfx7",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue to be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.51269984",
            "sentiment_compound": 0.7088
        },
        {
            "id": "i290eqg",
            "score": 1,
            "text": "We're in a simulation",
            "title_similarity": "0.3667394",
            "sentiment_compound": 0.0
        },
        {
            "id": "i28zcgo",
            "score": 4,
            "text": "*sigh*\n\nThis isn't news. You can treat information as energy, and all energy has an equivalent mass and effect on space-time.",
            "title_similarity": "0.48126462",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i28qqyf",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.051757585"
        },
        {
            "id": "i28qp6q",
            "score": 7,
            "text": "What is information here exactly? Information can be theoretically conveyed in infinite ways, it just depends on how the consious beings observing it define that information. And regardless, it's all just matter. Even the consious being is just matter, in the same way that a rock is just matter. Why do we have to call it a different \"state\" of matter?",
            "title_similarity": "0.5435019",
            "sentiment_compound": 0.1926
        },
        {
            "id": "i2933dd",
            "score": 2,
            "text": "Thank you OP for contributing interesting content and not these trash political clickbaits",
            "title_similarity": "0.31517044",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i28ufmh",
            "score": 10,
            "text": "This is very interesting.\n\nOne of the things that happens when you make an observation of something, is that you gain information....and observation also collapses states....",
            "title_similarity": "0.4440472",
            "sentiment_compound": 0.6361
        },
        {
            "id": "i28waw7",
            "score": 1,
            "text": "In this paper his definition of information is somewhat wrong I believe. Maybe he should invent another term.",
            "title_similarity": "0.4016193",
            "sentiment_compound": -0.4228
        },
        {
            "id": "i28ui37",
            "score": 12,
            "text": "So is false information anti-matter?",
            "title_similarity": "0.23832288",
            "sentiment_compound": 0.0
        },
        {
            "id": "i28nk86",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "0.03543123"
        },
        {
            "id": "i296len",
            "score": 4,
            "text": "When physics were Newtonian, the universe was clockwork. Then Einstein came along and showed us the power of the atom. Then the universe was Atomic. How Atomic? Very Atomic! Now that computers have become ubiquitous household appliances, it turns out the universe is a simulation. Stay tuned for the next big breakthrough when it turns out the whole universe is a bioengineered blockchain.",
            "title_similarity": "0.7075389",
            "sentiment_compound": 0.0
        },
        {
            "id": "i28lm4y",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "0.03543123"
        },
        {
            "id": "i290g7l",
            "score": 1,
            "text": "Pretty sure Bose Einstein condensate is the 5th state of matter, with quite a few more after.",
            "title_similarity": "0.6736947",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i2935bb",
            "score": 1,
            "text": "So if matter cannot be create nor destroyed… does that mean information has always been there?! Like the universe already knew everything there’s is to know?!?!?!\n\nEdit: I realize I meant to say “energy” not matter, still a curious question as to if all information that has been or will be is and has always been available if this is true?!",
            "title_similarity": "0.51980376",
            "sentiment_compound": 0.8488
        },
        {
            "id": "i28sgx9",
            "score": -4,
            "text": "“Information” literally is a: change of state.\n\n^ This is how I interpret it.\n\nIt seems like it should be a dimension of it’s own..?",
            "title_similarity": "0.35856718",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i297lqg",
            "score": 7,
            "text": "So, I read most of it... It's, interesting.\n\nBasically, they believe that there's an equivalency between matter, energy, and information.\n\nSo if they annihilate a positron with an electron, it should emit two ir photons as well as the two gamma photons it usually emits (the ir photons would be associated with the energy of the information that's being destroyed).\n\nThe information would be different depending on temperature, so if you did the experiment at a higher temperature, the ir photons would have a higher energy.\n\nInformation might exist, but what is information made of? If you keep asking what something is made of, you basically reach the conclusion that everything should be made of one thing. And that one thing would probably be space itself. For example, we currently believe that mass bends space, but what if it's the other way around, and a bend in space creates mass. if a particle is a wave on the surface of space, then it explains relativity pretty well. If you clump a bunch of waves together, you get a bigger wave, bigger wave = higher mass. I wish I were better at math, because it's easy for me to visualize, but a proof is much more difficult.\n\nI would love to see a spacetime curvature/matter/energy equivalency.",
            "title_similarity": "0.6316636",
            "sentiment_compound": 0.9801
        },
        {
            "id": "i28x4p6",
            "score": 13,
            "text": "I am thinking I might read this paper, but on the other hand I might not read this paper. I skimmed a few dozen line segments but had difficulty paying attention . . . maybe tomorrow or the next day . . .",
            "title_similarity": "0.43474668",
            "sentiment_compound": 0.296
        },
        {
            "id": "i297v96",
            "score": 1,
            "text": "Good! Maybe this will mean Mazda will have no choice but to replace the infotainment system in my car, because they act like warranty doesn't cover an issue simply because the problem is related to software.\n\nIf information has physical mass, then that takes away their asinine argument.",
            "title_similarity": "0.4719383",
            "sentiment_compound": -0.5411
        },
        {
            "id": "i298aze",
            "score": 14,
            "text": "It’s not an understatement to say that verification of the ideas presented here would undoubtedly indeed present the biggest and most profound change in our understanding of fundamental physics in the 21st century. However, I’m not convinced for more than a number of reasons… here’s two…\n\n“Since the physical mass of the material under test does not change with the temperature” is not true. Conventionally, temperature is associated with a bulk object where-in there is a bunch of small particles moving and wiggling about. As you pump heat into something the wiggling gets faster, the ME equivalence tells you that this translates into a larger rest mass object… and although this could be misspeak, and isn’t directly related to the claims in the paper, my other issue has to do with adding extra photons to the decay\n\nThe detection paradigm seems simple enough but conserving momentum with a four photon out process is possible to lose the requirement from the conservation of momentum that the particles travel out anti-parallel with each other pairwise. Three photon decays in pair annihilation are totally possible, but you need a fast beam where the particles have enough kinetic energy to facilitate the creation of the third photon. Experiments similar to the LHC are in constantly, constantly looking at processes like these and a minutia of angle offset in the two photon mode would stand out like a sore thumb. \n\nSo yeah, I’ll wait to watch for the data and sort of pray that I’m wrong.",
            "title_similarity": "0.6217505",
            "sentiment_compound": -0.2055
        },
        {
            "id": "i29d6pn",
            "score": 3,
            "text": "?\n\nWouldn't it just be more accurate to say, \"all things that have mass carry infromation\"\n\nAnd isn't that just...obvious?",
            "title_similarity": "0.36124438",
            "sentiment_compound": 0.0
        },
        {
            "id": "i28zkuk",
            "score": 8,
            "text": "This is literally the main plot line of one of Stanisław Lem sci-fi novels. The punchline, when main character is trying to prove that information has a mass, collects too much of information it is reaching critical mass and collapse into “information black hole”… leaving humanity at pre Stone Age level of technology.",
            "title_similarity": "0.6473997",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i290i3a",
            "score": 8,
            "text": "1) Solid\n\n2) Liquid\n\n3) Gas\n\n4) Ionized Plasma\n\n5) Bose-Einstein condesate\n\n6) Quark-gluon plasma\n\n7) Fermionic Condensate\n\n8) Degenerate matter\n\n[Etc etc etc](https://en.wikipedia.org/wiki/List_of_states_of_matter)\n\nThe _WHAT_ now??",
            "title_similarity": "0.59983766",
            "sentiment_compound": 0.6072
        },
        {
            "id": "i28rn9z",
            "score": 0,
            "text": "Intriguing hypothesis.",
            "title_similarity": "0.2753879",
            "sentiment_compound": 0.0
        },
        {
            "id": "i28sroz",
            "score": -4,
            "text": "Aha!!!  I’m smart therefore that is the reason I’m fat!  Its information!",
            "title_similarity": "0.32189858",
            "sentiment_compound": 0.5951
        },
        {
            "id": "i28v4zy",
            "score": 0,
            "text": "I suppose that could be true, considering how knowledge is stored in our brains",
            "title_similarity": "0.45051745",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i28vg3j",
            "score": 4,
            "text": "Interesting write-up, I love hearing about these kind of things because normally people would dismiss it. There is still so much about the universe we don’t understand, which is crazy because you’d think we are pretty technologically advanced already. Thanks for sharing OP.",
            "title_similarity": "0.5760927",
            "sentiment_compound": 0.9371
        },
        {
            "id": "i28wo6w",
            "score": 0,
            "text": "Wow. This is amazing. If only I wasn’t hung over I’d may be able to understand this better",
            "title_similarity": "0.3371601",
            "sentiment_compound": 0.8995
        },
        {
            "id": "i290088",
            "score": 0,
            "text": "So, we’re living in a simulation?",
            "title_similarity": "0.4372755",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2908d7",
            "score": 0,
            "text": "Ha, so that explains why I'm overweight. I'm just smart af /j",
            "title_similarity": "0.28209844",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i291ed4",
            "score": 0,
            "text": "There's a sci-fi book called \"Light\" about this theory that's pretty good",
            "title_similarity": "0.48267066",
            "sentiment_compound": 0.7269
        },
        {
            "id": "i291hyj",
            "score": 0,
            "text": "This explains my scale this morning after I finished my book the other day.",
            "title_similarity": "0.42027307",
            "sentiment_compound": 0.0
        },
        {
            "id": "i291ihs",
            "score": 0,
            "text": "Modern physics catching up with Friendbirdianism.",
            "title_similarity": "0.61836183",
            "sentiment_compound": 0.0
        },
        {
            "id": "i292zj4",
            "score": 0,
            "text": "So like OOO (object oriented ontology) - or is this just science reflecting the zeitgeist of our current era.  At the heart of all matter may or not be information but deeper than that is rhetoric- how we talk about it is how we manifest it in the world.",
            "title_similarity": "0.632301",
            "sentiment_compound": 0.5494
        },
        {
            "id": "i293nnn",
            "score": 0,
            "text": "So I'm not fat - I just have a lot of information mass.",
            "title_similarity": "0.29388565",
            "sentiment_compound": 0.0
        },
        {
            "id": "i293rgv",
            "score": 0,
            "text": "I hope it's not Rahool. I want some good drops from those engrams",
            "title_similarity": "0.2946635",
            "sentiment_compound": 0.6786
        },
        {
            "id": "i293sra",
            "score": 0,
            "text": "interesting but seems too philosophical and highly unlikely",
            "title_similarity": "0.23518044",
            "sentiment_compound": 0.2144
        },
        {
            "id": "i294aiw",
            "score": 0,
            "text": "Douglas Adams was close when he postulated it was 42 but it was actually 411.",
            "title_similarity": "0.5194119",
            "sentiment_compound": 0.0
        },
        {
            "id": "i294ko6",
            "score": 0,
            "text": "How to shut down the simulation, roll a billion 20 sided dice all at the same time, and try to capture all of the results with HD cameras.",
            "title_similarity": "0.3897761",
            "sentiment_compound": 0.0
        },
        {
            "id": "i294qtg",
            "score": 0,
            "text": "So we're about this close to proving the collective consciousness exists.",
            "title_similarity": "0.43104494",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2954xf",
            "score": 0,
            "text": "For “this” to exist, there must been an “if.” The Great If. And that “if” must be connected to the “this.”\n\nSo that “if that, then this.” The “that, then” is a fundamental building block of the universe.",
            "title_similarity": "0.5664034",
            "sentiment_compound": 0.296
        },
        {
            "id": "i295clo",
            "score": -4,
            "text": "he's going to prove something biologist have known for ages. \n\nThe most obvious example of this is genetic information, DNA is a physical object and can be manipulated, read, or broken. \n\nTo be honest, it's hard to think of a kind of information that isn't requiring some kind of mass to exist.",
            "title_similarity": "0.60246766",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i295gbg",
            "score": 0,
            "text": "Living in the matrix confirmed",
            "title_similarity": "0.34158427",
            "sentiment_compound": 0.0
        },
        {
            "id": "i295is1",
            "score": 0,
            "text": "so a simulation, got it thanks",
            "title_similarity": "0.26206252",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i297smc",
            "score": 0,
            "text": "The other four being earth, fire, water,air.",
            "title_similarity": "0.32526857",
            "sentiment_compound": -0.34
        },
        {
            "id": "i297t47",
            "score": 0,
            "text": "Is this one of the building block of building teleporters?",
            "title_similarity": "0.5335396",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i29cb2p",
            "score": 0,
            "text": "You don’t prove things correct with experiments.",
            "title_similarity": "0.29442307",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29e1an",
            "score": 0,
            "text": "How is designing an experiment news?",
            "title_similarity": "0.3958337",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2akl9i",
            "score": 0,
            "text": "I'll piggy back off your comment to ask, the experiment here seems to be extremely straightforward, just suggesting that two particles annihilating will result in extra photons due to conservation of information.\n\nUh, my question is, don't we already have extremely detailed understanding of particle decay and annihilation products and all that jazz? Is the suggestion really that we've just never seen a couple of low energy photons sneaking by as we've been so focused on the high energy products?",
            "title_similarity": "0.6151019",
            "sentiment_compound": 0.4812
        },
        {
            "id": "i2bafvs",
            "score": 0,
            "text": "ok,  so ... how bout telling us what \"information\"  is defined as . thanks",
            "title_similarity": "0.32255942",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2bsujf",
            "score": 0,
            "text": "Weighing hard drives to measure information seems misguided and a side effect of Landauers.  I is not equivalent, it is embedded and holographic as a change between systems like heat.  Reworded, information is how one system affects another rather than a simple bit which is just data.  The word is an antique like time and needs refinement and more specific terms....ironic that the word information communicates no information at all.  In terms of a fundamental limit, the Planck distance squared creates an area which is 2 dimensional like the horizon of a black hole which will expand or contract as it's mass changes.  Circle or triangle take your pick.  Sorry for rambling and please don't ban me. I was perma banned from ask science for saying that there is gravity in Earth's core, just without a strong direction and that dilation would still occur.",
            "title_similarity": "0.5815259",
            "sentiment_compound": 0.7595
        },
        {
            "id": "i28ld6s",
            "score": 101,
            "text": "How can information have mass when information can be created and destroyed? Or can it only be changed or corrupted?",
            "title_similarity": "0.43721938",
            "sentiment_compound": -0.3736
        },
        {
            "id": "i28qvcn",
            "score": 152,
            "text": "Can we get a tldr? Does this have any real world value or is it more of a though experiment like people are doing in the chat?",
            "title_similarity": "0.47991127",
            "sentiment_compound": 0.644
        },
        {
            "id": "i28slm3",
            "score": 1,
            "text": "What gives information mass? Wouldn’t its mass simply come from something that already existed just in a some other form. \n\nEverything that is created is created from something that exists in some other form.\n\nThose “ingredients” have mass of their own and when combined together their mass becomes shared.",
            "title_similarity": "0.48805892",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i28tqpu",
            "score": 1,
            "text": "Where does Reddit fit in this equation?",
            "title_similarity": "0.32688603",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i28wmxk",
            "score": 1,
            "text": "Is it too simplistic to say that, if this proves correct, entropy would have negative mass? Or just that full(?) entropy is the absolute zero of mass?",
            "title_similarity": "0.40349862",
            "sentiment_compound": -0.6416
        },
        {
            "id": "i28ywb8",
            "score": 1,
            "text": "So, is  information the code of the universe? Wouldn't that prove a simulation?",
            "title_similarity": "0.5851271",
            "sentiment_compound": 0.0
        },
        {
            "id": "i28z5tr",
            "score": 1,
            "text": "This research is both quite extraordinary and at the same time disturbing/eerie...\n\n'all states of matter can be converted to information/energy'\n\nWhy does it feel we are slowly creeping toward making 'Altered Carbon' a reality?  How long before we see transference of human intelligence/consciences/soul become a reality?",
            "title_similarity": "0.68211263",
            "sentiment_compound": 0.1179
        },
        {
            "id": "i2906q8",
            "score": 1,
            "text": "This sounds huge if proven. Also, hard to understand.",
            "title_similarity": "0.29346788",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i293bax",
            "score": 1,
            "text": "In the beginning was the word…",
            "title_similarity": "0.19881156",
            "sentiment_compound": 0.0
        },
        {
            "id": "i293ih9",
            "score": 1,
            "text": "In the beginning, there was information.",
            "title_similarity": "0.26419201",
            "sentiment_compound": 0.0
        },
        {
            "id": "i293szu",
            "score": 1,
            "text": "This is really interesting as I just finished the book Fine Structure by Sam Hughes, which has this as a premise.",
            "title_similarity": "0.49007967",
            "sentiment_compound": 0.5849
        },
        {
            "id": "i2972r1",
            "score": 1,
            "text": "I don't really understand it, but it's probably more proof that we're living in a simulation.",
            "title_similarity": "0.5504771",
            "sentiment_compound": 0.0
        },
        {
            "id": "i297duy",
            "score": 1,
            "text": "This would mean thoughts come from somewhere and have weight",
            "title_similarity": "0.2578304",
            "sentiment_compound": 0.0
        },
        {
            "id": "i297m7b",
            "score": 1,
            "text": "Knew I had a big head for a reason",
            "title_similarity": "0.26156464",
            "sentiment_compound": 0.0
        },
        {
            "id": "i297x35",
            "score": 1,
            "text": "I’m not heavy I’m just intelligent",
            "title_similarity": "0.1693027",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i299o6x",
            "score": 1,
            "text": "Love is the fifth element",
            "title_similarity": "0.50927126",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i29h5s4",
            "score": -1,
            "text": "This makes sense to me and seems to correlate with Terence McKenna's view that the physical world is made of language.",
            "title_similarity": "0.32440847",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29i6iy",
            "score": 1,
            "text": "It’s not \"matter\", it’s \"Dark Energy\". Our brains output Dark Energy.",
            "title_similarity": "0.42527467",
            "sentiment_compound": 0.4812
        },
        {
            "id": "i29ktr1",
            "score": 1,
            "text": "Information is some theoretically measurable value attributed to a particle. Basically, by virtue of having information imbues the particle with physical properties. I don't see how this is any different than measuring the properties of a particle within a given system unless it says you can influence the particle to change behavior and thereby create a new system. So for example use a magnetic field to modify the particles in a system and get a system that literally has greater mass than the system you started with. That would be interesting.",
            "title_similarity": "0.70409846",
            "sentiment_compound": 0.8885
        },
        {
            "id": "i29nqo5",
            "score": 1,
            "text": "I believe it, weigh a brand new hard drive and record the weight of it. Weigh that same hard drive after you have filled 90 percent of its capacity and it actually weighs more …",
            "title_similarity": "0.49653015",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i29zwqg",
            "score": 1,
            "text": "We're getting so close to that \"we're in a simulation\" hypothesis and philosophical debate on what is information and is it God?",
            "title_similarity": "0.59413743",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2a7ege",
            "score": 1,
            "text": "I always knew that my phone felt lighter after a factory reset..",
            "title_similarity": "0.36258543",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bajkj",
            "score": 1,
            "text": "We're using the same vocabulary, but different dictionaries. \"Information\" has a very narrow definition in this theory.",
            "title_similarity": "0.3643059",
            "sentiment_compound": 0.0
        },
        {
            "id": "i28z2ck",
            "score": 9,
            "text": "Ahh, it’s a good time to be an information major. *Forehead swells*",
            "title_similarity": "0.36448187",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i28ts5w",
            "score": 2,
            "text": "If found to be true, could this be the dark mater that scientists are looking for?",
            "title_similarity": "0.56011814",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i294kug",
            "score": 2,
            "text": "Far from being a physicist-  Is this in any way related to the finding that there’s information on the “brim” of a black hole/wormhole? I’d have to dig for the paper/article, and could (likely) be way off, but thought I’d ask those here smarter than I am!",
            "title_similarity": "0.6123534",
            "sentiment_compound": 0.6476
        },
        {
            "id": "i296rw8",
            "score": 2,
            "text": "Anyone else not so low key worried we're about to prove we're living in a simulation?",
            "title_similarity": "0.4876582",
            "sentiment_compound": -0.0452
        },
        {
            "id": "i297w6e",
            "score": 2,
            "text": "Very interesting that it can actually be tested. I've wondered about this kind of thing before and compression algorithms come to mind. Because you can often take a set of data and compress it to less data with a set of rules. So any fundamental particles would have to be described by an in-compressible data set. Interestingly this also could have some implications for quantum entanglement. Because two interacting particles could use less information to describe them both together than them alone.",
            "title_similarity": "0.61954635",
            "sentiment_compound": 0.5709
        },
        {
            "id": "i29fwud",
            "score": 2,
            "text": "Imagine doing all this work just to be known as “a physicist”",
            "title_similarity": "0.642255",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a8zww",
            "score": -2,
            "text": "Would this have to do with the existence of a soul? Moreover the weight that leaves a body when an individual passes away?",
            "title_similarity": "0.40001437",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2aw1m2",
            "score": 2,
            "text": "This is a very highly specialized form of assertion that is going to be immediately misinterpreted by people and lead to endless, and endlessly stupid, conversations among the slightly stoned or inebriated.\n\nI need to become a hermit in some isolated place.",
            "title_similarity": "0.31318426",
            "sentiment_compound": -0.7906
        },
        {
            "id": "i2flnew",
            "score": 2,
            "text": "This is one of the more ridiculous papers I have ever read. Immediately, I had several notes to take.\n\n**1\\.** Their assumption of creation of two additional photons in electron-positron annihilation is never explained. If information inside elementary particles added to their masses I would assume the mandatory two photons would simply have higher energies to compensate for the \"loss\" of information. I say \"loss\" because they never touch on the fact that photons have the same internal states than electrons (polarization vs spin) and should therefore themselves have the same information added to them. They do attempt to save themselves in the end by saying:\n\n> It is important to recognize that we make a strong assumption that the transfer of the information mass content of the annihilating particles takes place via conversion into IR photons. However, other mechanisms of conversion are possible, including the gamma photons becoming carriers of this excess information energy. Hence, even if the information conjectures are correct, the proposed experiment is, therefore, not totally guaranteed to succeed. \n\n**2\\.** They said that neutrons and protons are made of three quarks, completely neglecting the quarks of the sea within protons and neutrons of which there are an infinite number of and which are a core component in Quantum Field Theory description of neutrons and protons.\n\n**3\\.** They say that mass of the individual elementary particle changes with temperature because information changes with temperature, never explaining what they mean by the temperature of a single particle. Temperature of a particle is usually associated with it's kinetic energy, which would by mass-energy equivalence of Einstein's already add to the mass, without the need of additional information mass gain. They never touch on that.",
            "title_similarity": "0.6137233",
            "sentiment_compound": 0.9114
        },
        {
            "id": "i28rxvb",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.03543123"
        },
        {
            "id": "i28zbk4",
            "score": 4,
            "text": "A couple questions:\n\n1. I thought we already knew this due to e=mc^2? Energy has mass, a ticking clock technically has more mass then a broken one even if they had the same number of atoms. Information requires energy(I thought), so I kinda thought this was inferred. \n\n2. When they say new state of matter, are they referring to gas, liquid, solid, plasma? I thought there were at least a dozen of other unique states of matter like bose-einstein condensate.",
            "title_similarity": "0.69655144",
            "sentiment_compound": 0.4515
        },
        {
            "id": "i293abh",
            "score": 4,
            "text": "this made my brain more heavy",
            "title_similarity": "0.2214194",
            "sentiment_compound": 0.0
        },
        {
            "id": "i299aw4",
            "score": 3,
            "text": "Experiments are not proved correct. Hypotheses are proved correct.",
            "title_similarity": "0.38576996",
            "sentiment_compound": 0.0
        },
        {
            "id": "i28x2ia",
            "score": 76,
            "text": "[removed]",
            "title_similarity": "0.03543123"
        },
        {
            "id": "i28nqmg",
            "score": -13,
            "text": "Certain crystals are said to be able to have information stored in them because of their inherent chrysaline structure, maybe has something to do with this?",
            "title_similarity": "0.5664772",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i29dcrj",
            "score": 5,
            "text": "This vaguely sounds like Platonic/Aristotelian forms. The governing principles that give order to matter, but not artifacts (i.e. manufactured things like a computer, or a hatchet)",
            "title_similarity": "0.4155084",
            "sentiment_compound": 0.6187
        },
        {
            "id": "i28m8zw",
            "score": 29,
            "text": "[removed]",
            "title_similarity": "0.035431255"
        },
        {
            "id": "i2a6jsg",
            "score": 16,
            "text": "His claim being valid is improbable and here's why:\n\n**Physical conceptual considerations:**\n\n1. The type of information he is talking about is NOT quantum information. He is conflating digital information with quantum information, and his absurd conclusion that uploading tweets is increasing Earth's mass is ENTIRELY based on this simple conflation of two literally unrelated things called \"information\". \"Quantum information\" is the description of a particle's quantum states (like energy level, momentum, spin, etc). You can basically think of it as a measure of entropy, with the quantum states being analogous to microstates. Even with this simplified description, you can see how this is COMPLETELY SEPARATE from \"information\" in the sense of digital data.\n\n2. Quantum information cannot be created or destroyed. This is a law which is about as fundamental as causality and charge parity time symmetry. Fun fact: this is why black holes must evaporate via Hawking radiation. (An intuitive but non-rigorous way of thinking about this is to continue the analogy between quantum information and entropy: it is a fundamental law of thermodynamics that total entropy cannot decrease. Similarly, quantum information cannot be erased.) His proposition that electron-positron collisions can eliminate the electron's \"informational mass\" by converting it into two photons would violate this fundamental law. In actual fact, the quantum information of the electron and positron would be transferred to the photons, which adopt their spin and polarization.\n\n\n3. Similarly, even if it was true that quantum information can be converted into photons, why would it manifest in the form of two EXTRA photons on top of the first two that result from electron-positron annihilation, instead of just manifesting as a property of the two photons we would expect to observe? To illustrate this point: If we increase the energy with which the electron and positron collide, the two resulting photons would simply have higher energy. It doesn't result in extra photons being generated. Even if you don't know anything about electron-positron collisions, you can think about how an electron relaxing from an excited state to the ground state only produces one photon, the energy of which changes depending on the gap between the two energy levels. You wouldn't expect it to suddenly produce multiple photons.\n\n\n**Intuitive conceptual considerations:**\n\n1. He is essentially positing that you are creating matter out of nothing every time you post a reddit comment. This violates simple conservation of mass. This isn't one of those cases where there's a weird quantum-mechanical exception to it; he's just wrong.\n\n2. If we apply this same principle to information rather than mass: You're not creating actual information by uploading a tweet to YT. You're creating digital information, sure. But the information, in the general layman's sense of \"stuff that people know\", already exists (say, in your head, or wherever you got it from), and you're just publicizing it. So even if \"information\" really did increase the mass of earth, this wouldn't apply to uploading a tweet...But, again, this is a meaningless thought exercise because QUANTUM INFORMATION IS A SPECIFIC THING that is absolutely UNRELATED to what we usually mean when we use the word \"information\" in colloquial speech!\n\n3. No description of the mechanism by which uploading a tweet would affect electron mass. Like, which electrons are even involved in this? Why is this localized to earth?\n\n**More specific physics considerations**\n\n1. There is zero mathematical/quantum-mechanical treatment of his idea by this paper. The basis of his theory (scattering, which includes the electron-positron annihilation) is a quantum-mechanical phenomenon, and must be described in terms of quantum field theory. . Instead of doing any math or invoking any relevant physics, he just loosely describes his idea in words with zero attempt at formalization/proof.  \n\n2. Zero attempt is made to even justify why/how quantum information = mass all of a sudden. This is not an accepted theory anywhere; this is something he made up, and did not bother proving.\n\n3. The case he's proposing where four photons result from electron-positron collision (rather than two) is SIGNIFICANTLY more improbable than the two-photon system. About 18769 times less likely. (This can be thought of as a consequence of introducing more components to the collision.) You can't just propose that a four-photon system can happen just as well as the two-photon system.\n\n\n4. We would actually be able to observe this if it was the case, because the introduction of these two extra photons (supposedly resulting from quantum information) would alter the trajectory (of the photons resulting from the collision) compared to what we would expect in the two-photon case. This method is actually how we discovered neutrinos. But no one has observed such a thing.\n\n\n**misc**\n\n1. This is an article in a 1.5 impact-factor journal with basically no citations. You'd think a paper reporting, for the first time, such a serious threat to mankind would get picked up by other scientists. Similarly, his only rererences for the nonsense he proposes in this paper link back to HIS OWN previous work.\n\n\n2. It's written like a high-school essay. What's with the random exposition about Shannon's biography in the middle of the paper?\n\n\n3. 5th state of matter??? No one beyond the high-school level of physics would describe matter like this. It's a term that just becomes meaningless and vague once you start doing quantum stuff.\n\n\n4. This guy is not even in quantum field theory, the field to which this sort of content belongs.\n\n\n5. This author is an assistant lecturer who has had a few legitimate papers with some citations and then, it appears, just went off the deep end, authoring these crackpot end-is-nigh papers about stuff he doesn't understand. His recent stuff has been rightfully ignored by the scientific community.",
            "title_similarity": "0.60322237",
            "sentiment_compound": -0.9164
        },
        {
            "id": "i298td9",
            "score": 4,
            "text": "I don't understand this title. The article is about the hypothesis that information carries mass. It has nothing to do with information being a form of matter",
            "title_similarity": "0.3377749",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i28xpyl",
            "score": 5,
            "text": "So how much does the internet weigh?",
            "title_similarity": "0.33489063",
            "sentiment_compound": 0.0
        },
        {
            "id": "i28ypq0",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.051757585"
        },
        {
            "id": "i294vg1",
            "score": 6,
            "text": "A better way to put it would be \"matter can't exist in indeterminate states\" as the state matter was in, such as atomic speed position and spin, would inherently exist.\n\nBut given that this kind of information can't exist on its own, the premise is put badly and the test doesn't prove the existance of any new form of matter.",
            "title_similarity": "0.51142037",
            "sentiment_compound": -0.4497
        },
        {
            "id": "i28r5on",
            "score": 585,
            "text": "I'm probably wrong, but I was under the impression that information was linked to entropy and was a quality of mass/energy, not something that existed independently. Solid --> Plasma are states of matter with higher entropy levels, right? So how does that translate into a different form?\n\nI mean, I could design an experiment that if proven correct would show that if your aunt had wheels she'd be a tea cart. Doesn't make it true.",
            "title_similarity": "0.62440825",
            "sentiment_compound": -0.2519
        },
        {
            "id": "i28tfwi",
            "score": 21,
            "text": "[removed]",
            "title_similarity": "0.03543123"
        },
        {
            "id": "i29acs7",
            "score": 7,
            "text": "Does a hard drive get heavier when it is full?",
            "title_similarity": "0.3505919",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i28yylk",
            "score": 331,
            "text": "Cunningham's law: activate.\n\nI am not sure why the author chose to call this the \"fifth form (state) of matter\".  It is quite different from the solid, liquid, gas, plasma states.  The analogy does not make sense to me.\n\nI do not know anything about quantifying the information of an electron (or positron) with bits, but I do know that there is more information to describe an electron and positron at their center of mass than there is to describe the two photons they annihilate into.  To look at it simply, consider the fact that a muon and an anti-muon could also annihilate into two photons, but a muon and positron could not.  Thus, the \"electron-ness\" or \"muon-ness\" of the particles prior to annihilation is erased.  You might argue that the energy of the photons can be used to calculate whether it was electron-positron annihilation or another type of lepton since we know lepton masses.  That seems like sketchy logic to me - but I will let someone else address it since I'm mostly guessing.\n\nI am confused as to why the information mass would have to be converted into another pair of photons rather than slightly amplifying the predicted energy of the two photons that are already produced in electron-positron annihilation.",
            "title_similarity": "0.712045",
            "sentiment_compound": 0.3333
        },
        {
            "id": "i29dnre",
            "score": 8,
            "text": "If information has mass, how come stupid people are more dense?\n\nYour move, science.",
            "title_similarity": "0.5390208",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i28ldv0",
            "score": 3373,
            "text": "I'm wary of anything that only one person has touched, intellectually speaking.",
            "title_similarity": "0.26561314",
            "sentiment_compound": 0.34
        },
        {
            "id": "i29ank0",
            "score": 201,
            "text": "[removed]",
            "title_similarity": "0.03543123"
        },
        {
            "id": "i28lugj",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "0.03543123"
        },
        {
            "id": "i28qz3r",
            "score": 1847,
            "text": "[deleted]",
            "title_similarity": "0.051757585"
        },
        {
            "id": "i29f81c",
            "score": 27,
            "text": "This is a really interesting experiment, and great if it works, but I'm pretty skeptical. The end of the paper states essentially my objection to this experiment. Instead of the information mass of the electron/positron pair annihilating into two *separate* 50 um photons, \"other mechanisms of conversion are possible, including the gamma photons becoming carriers of this excess information energy.\" If this is true, then the gamma ray photon energy is perturbed by \\~50 parts per billion by the information energy, which seems *very* hard to differentiate from other noise sources in the system (kinetic energy and so forth). I hope this works! Would be very cool.",
            "title_similarity": "0.64701337",
            "sentiment_compound": 0.9719
        },
        {
            "id": "i28s9ru",
            "score": 63,
            "text": "Form of matter like a 'state' of matter?",
            "title_similarity": "0.37940073",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i292plk",
            "score": 472,
            "text": ">The experiment is highly achievable using current technologies and it provides a few control tools to ensure that the detection is indeed due to information erasure. The main control tool is the fact that the wavelength of the information energy IR photons must shift with the temperature of the sample. By performing the experiments at different temperatures, the detection of the wavelength shift of the IR photons would be an ultimate confirmation of this hypothesis.\nIt is important to recognize that we make a strong assumption that the transfer of the information mass content of the annihilating particles takes place via conversion into IR photons. However, other mechanisms of conversion are possible, including the gamma photons becoming carriers of this excess information energy. Hence, even if the information conjectures are correct, the proposed experiment is, therefore, not totally guaranteed to succeed.\n\nNice that they proposed a testable experiment. Hopefully, it is performed to determine the plausibility.",
            "title_similarity": "0.58865297",
            "sentiment_compound": 0.9659
        },
        {
            "id": "i28pv73",
            "score": 11158,
            "text": "It's important to note that \"information\" in this sense doesn't mean \"how to use a lathe\" or \"what's the tallest horse that ever lived\"",
            "title_similarity": "0.32621187",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i29603x",
            "score": 1698,
            "text": "Okay I’m not familiar with physics much can someone water this down into a ELI5?",
            "title_similarity": "0.49504668",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i28w6fm",
            "score": 1,
            "text": "Reality source code leak",
            "title_similarity": "0.3288747",
            "sentiment_compound": -0.34
        },
        {
            "id": "i28ydmd",
            "score": 63,
            "text": "To this day I don't know what Information is, people always use the same burnt paper to ash analogy that makes no sense to me, or analogies that are so far removed from what it literally is that it still makes no sense. So far from all the videos and articles I can only conclude that information is essentially information about what properties something had, like the spin or position of its atoms/particles/whatever, what electromagnetic radiation it may have emitted at the time, basically a snapshot of its state and things we could measure about it. \n\nI don't know how that would be a \"fifth form of matter\" so my understanding of what information could be is probably still off",
            "title_similarity": "0.6254549",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i28zmu2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.03543123"
        },
        {
            "id": "i28zz1s",
            "score": 1,
            "text": "I'd like to throw a physics textbook into a black hole, see what happens.\n\nSince there are multiple copies and no information is lost, I don't accidentally destory the galaxy.",
            "title_similarity": "0.6001257",
            "sentiment_compound": 0.0093
        },
        {
            "id": "i291r86",
            "score": 1,
            "text": "I thought the smallest particles known to us were that information so this sounds redundant i guess? Can someone elaborate on this?",
            "title_similarity": "0.3996008",
            "sentiment_compound": 0.0
        },
        {
            "id": "i292kol",
            "score": 1,
            "text": "I always say to my gf, blackholes are nothing more than information and anything that it spews out. She prolly still doesn't understand",
            "title_similarity": "0.3444868",
            "sentiment_compound": 0.0
        },
        {
            "id": "i292nw7",
            "score": 1,
            "text": "Was thinking about this today",
            "title_similarity": "0.20587172",
            "sentiment_compound": 0.0
        },
        {
            "id": "i293vey",
            "score": 1,
            "text": "Only the fifth? I thought they had at least 7 by now. What happened to the bose Einstein condensate?",
            "title_similarity": "0.59604216",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2947bm",
            "score": 1,
            "text": "So my take is when an electron-positron  is destroyed or aniliates 2 new low level particles should appear. These are the data? The building blocks essentially if this is proven correct?",
            "title_similarity": "0.6217101",
            "sentiment_compound": -0.7622
        },
        {
            "id": "i294ft0",
            "score": 1,
            "text": "The Hungarian physicist Laszlo has promoted this thesis for twenty years (see his 2004 work, Science and the  Akashi Field: an Integrated Theory of Everything) in information is the fundamental substance.",
            "title_similarity": "0.6080342",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i294pmz",
            "score": 1,
            "text": "The weight of the world.",
            "title_similarity": "0.20036647",
            "sentiment_compound": 0.0
        },
        {
            "id": "i295hvm",
            "score": 1,
            "text": "Yeah, but does it have any weight to it?",
            "title_similarity": "0.20872518",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i295k13",
            "score": 1,
            "text": "What’s the difference between “energy” and “information”?",
            "title_similarity": "0.3585667",
            "sentiment_compound": 0.0
        },
        {
            "id": "i296bj5",
            "score": 1,
            "text": "And data in the future will be weighed.",
            "title_similarity": "0.29233474",
            "sentiment_compound": 0.0
        },
        {
            "id": "i296rxt",
            "score": 1,
            "text": "I thought we already had five \"forms\" of matter, Bose-Einstien Condensate, Solid, Liquid, Gas, Plasma",
            "title_similarity": "0.6104417",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i2973af",
            "score": 6,
            "text": "If information has mass does that mean that a massless particle like a photon has no information?",
            "title_similarity": "0.42785087",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i2976h4",
            "score": 1,
            "text": "I thought Bose-Einstein condensates were already considered the fifth form of matter?",
            "title_similarity": "0.71444225",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i297tfq",
            "score": 1,
            "text": "We need Daniel and Jorge to explain this to us. At least I do. This is way outside of my education.",
            "title_similarity": "0.42185438",
            "sentiment_compound": 0.0
        },
        {
            "id": "i298qcd",
            "score": 1,
            "text": "Can I get an ELI5 of this?",
            "title_similarity": "0.3621525",
            "sentiment_compound": 0.0
        },
        {
            "id": "i298u1e",
            "score": 1,
            "text": "Information is a panchreston",
            "title_similarity": "0.3386209",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2992zm",
            "score": 1,
            "text": "Seems like a bunch of hooey to me.",
            "title_similarity": "0.21710703",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2993ss",
            "score": 1,
            "text": "Thanks\nMost interesting thing I’ve read in a while",
            "title_similarity": "0.37871027",
            "sentiment_compound": 0.7089
        },
        {
            "id": "i2998zm",
            "score": 1,
            "text": "This is pretty heavy, it’s gonna take me a minute to process this information",
            "title_similarity": "0.3447234",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i299jmb",
            "score": 2,
            "text": "Great. The Universe is a giant SQL database. \n\nF*ck!!",
            "title_similarity": "0.46501845",
            "sentiment_compound": 0.6892
        },
        {
            "id": "i299ndj",
            "score": 3,
            "text": "Is this \"information\" the same as the physical quantities limited by Heisenberg's Uncertainty Principle (position and momentum), or are there other such quantities?",
            "title_similarity": "0.5796503",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i299ohc",
            "score": 1,
            "text": "Can someone explain like I am five?",
            "title_similarity": "0.43585593",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i299oku",
            "score": 1,
            "text": "The information dimension soon to be confirmed. Nice.",
            "title_similarity": "0.31103888",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i299sse",
            "score": 1,
            "text": "This is what \"engram\" is in the Destiny universe - distilled information in the form of physical matter.  That's kinda surreal.",
            "title_similarity": "0.5981669",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i29ajjg",
            "score": 1,
            "text": "Bf just leaned over and said: “Well first off you can’t *prove* anything correct. So it sounds like billshit right off the bat.”",
            "title_similarity": "0.38023698",
            "sentiment_compound": 0.4144
        },
        {
            "id": "i29ajjo",
            "score": 1,
            "text": "So..  education matters",
            "title_similarity": "0.23975684",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i29ap3n",
            "score": 1,
            "text": "But but but...I often use information as an example of something that is not a form of matter when I teach about matter in my colleges chemistry classes.",
            "title_similarity": "0.569605",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i29b0ke",
            "score": 1,
            "text": "As  a physicist, his is a really arbitrary paper to post, it's from someone who, to be honest, I've never heard of at all. This is really not fitting for this sub where most people are just casual readers of science in general.",
            "title_similarity": "0.42143542",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i29b0vz",
            "score": 1,
            "text": "Sounds like he's trying to prove Panpsychism.",
            "title_similarity": "0.5764172",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i29ba1d",
            "score": 1,
            "text": "Isn't it technically supposed to be the 6th? I mean, Bose-Einstein condensate is technically the fifth form of matter even though it's just theory for now, right?",
            "title_similarity": "0.7158592",
            "sentiment_compound": 0.1179
        },
        {
            "id": "i29bags",
            "score": 1,
            "text": "My head hurts, gonna go lie down a bit.",
            "title_similarity": "0.2280852",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i29bb6y",
            "score": 1,
            "text": "So Plato was right all along?!?",
            "title_similarity": "0.3242817",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29bb84",
            "score": 1,
            "text": "The Laundry will want to vet his future papers.",
            "title_similarity": "0.39864245",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i29bku3",
            "score": 1,
            "text": "Me vibing in my house made of information",
            "title_similarity": "0.40619087",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29c9px",
            "score": 1,
            "text": "Makes sense I keep my information on an SSD",
            "title_similarity": "0.25209767",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29cg3a",
            "score": 2,
            "text": "Seems kind of silly. Information, to my understanding, is a way of describing properties. Math is a form of information, our way of understanding the way things work, and it’s an indispensable tool that we use to great effect, but that doesn’t make it a real thing like a particle. Not in the way energy and matter truly affect their surroundings.\n\nBut then, didn’t they decide time is no longer just a human concept and is altered by physics? How could information be affected other than by beings describing it?",
            "title_similarity": "0.6441392",
            "sentiment_compound": 0.8407
        },
        {
            "id": "i29cn0o",
            "score": 1,
            "text": "To the extent this is true, it's just a bit of math around an entropy calculation. Right? This doesn't sound at all interesting.",
            "title_similarity": "0.3393173",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i29cqsp",
            "score": 1,
            "text": "This is some heavy knowledge.",
            "title_similarity": "0.22347237",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29ct9y",
            "score": 1,
            "text": "So the girl that I went to school with that said a full ipod feels heavier than one with no songs on it was, in a way, right?",
            "title_similarity": "0.3517104",
            "sentiment_compound": -0.296
        },
        {
            "id": "i29cykv",
            "score": 1,
            "text": "This is going to confuse people even more then when you see idiots say something is only a theory",
            "title_similarity": "0.32296735",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i29cz16",
            "score": 1,
            "text": "I thought we already knew this from the beam split entangled photon experiment… It showed that information alone caused a physical, measurable difference.  At least I think it did.  I think it showed that information alone changed the state of the system.  Or reversed time…",
            "title_similarity": "0.6467737",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i29d1hp",
            "score": 1,
            "text": "This guy just did a thing and he just changed every thing",
            "title_similarity": "0.3454852",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29d92t",
            "score": 1,
            "text": "Is that a matter of fact?.... I will see myself out.",
            "title_similarity": "0.17266777",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i29dbee",
            "score": 1,
            "text": "You exist as the result of a quantum entangled world on the edge of a black whole. We saved our world by entanglement. Unfortunately it requires time dilation and resulted in the world you see today. A Many thousands of years in the past reflection of a world entering the event horizon. Fortunately you see, you do survive the current evolution. Barely.",
            "title_similarity": "0.6618292",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i29dbxc",
            "score": 1,
            "text": "Holographic universe theory confirmed?",
            "title_similarity": "0.5278197",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29dfgl",
            "score": 1,
            "text": "This is how we invent Engrams.",
            "title_similarity": "0.38494903",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29dfrq",
            "score": 1,
            "text": "Leeloo Dallas Multipass",
            "title_similarity": "0.24724263",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29dj9l",
            "score": 1,
            "text": "so if he's right it basically proves we're living in a simulation? cool, im gonna enable noclip/godmode and float around the map for a while",
            "title_similarity": "0.5293523",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i29dmzm",
            "score": 1,
            "text": "Isn’t data going over an internet connection electricity or something and doesn’t that electricity have mass? \n\nOr does an internet cable communicate more in the way of signalling?",
            "title_similarity": "0.37750113",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29dn4u",
            "score": 1,
            "text": "Proud to say Melvin was my lecturer for advanced solid state physics at Portsmouth for my Physics degree! \n\nHe did a research project with a fellow student to do with this theory last year on using information theory on predicting new covid variants from my understanding",
            "title_similarity": "0.6521914",
            "sentiment_compound": 0.7177
        },
        {
            "id": "i29dsim",
            "score": 1,
            "text": "Does this mean we live in a simulation",
            "title_similarity": "0.45243865",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29dvno",
            "score": 1,
            "text": "I'm fat because I'm smart",
            "title_similarity": "0.2638161",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i29dw6l",
            "score": 1,
            "text": "He’s taking “extracting information” out of something literally I suppose.",
            "title_similarity": "0.39852154",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29dwf6",
            "score": 1,
            "text": "\"The substance of the universe is consciousness\"",
            "title_similarity": "0.47394383",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29dyd0",
            "score": 1,
            "text": "We getting engrams boys",
            "title_similarity": "0.30186084",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29e47l",
            "score": 1,
            "text": "Phillip Pullman conceptualized this thought in \"His Dark Materials\" (*The Golden Compass*, *The Subtle Knife*, and *The Amber Spyglass* - Young Adult SF books written in the 90s) and then Nick Harkaway gave it the name \"Disney Dust\" in his book *The Gone-Away World*.",
            "title_similarity": "0.53750134",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29e8ls",
            "score": 1,
            "text": "Everything is just waves dog. Once you understand that, you unlock your third eye and can see the flat earth...",
            "title_similarity": "0.23323303",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29ef0t",
            "score": 1,
            "text": "I'm not overweight, just really smart.",
            "title_similarity": "0.18892208",
            "sentiment_compound": 0.6253
        },
        {
            "id": "i29ek34",
            "score": 1,
            "text": "Boosts the argument for the universe being a simulation I would think but I am not qualified to comment.",
            "title_similarity": "0.54309916",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i29eo14",
            "score": 1,
            "text": "Information... what exactly are we talking about here. I've heard that word thrown around in physics, and it just sounds confusing. Is it things like particle spin? That's only information when we write it down, it's simply a physical property in reality. Information used in this sense seems to imply every particle is sentient. I think we need a better word. Stats would be better",
            "title_similarity": "0.69942474",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i29ep4t",
            "score": 2,
            "text": "“Knowledge equals power...\nThe string was important. After a while the Librarian stopped. He concentrated all his powers of librarianship.\nPower equals energy...\nPeople were stupid, sometimes. They thought the Library was a dangerous place because of all the magical books, which was true enough, but what made it really one of the most dangerous places there could ever be was the simple fact that it was a library.\nEnergy equals matter...\nHe swung into an avenue of shelving that was apparently a few feet long and walked along it briskly for half an hour.\nMatter equals mass.\nAnd mass distorts space. It distorts it into polyfractal L-space.\nSo, while the Dewey system has its fine points, when you're setting out to look something up in the multidimensional folds of L-space what you really need is a ball of string.” - Terry Pratchett",
            "title_similarity": "0.46533528",
            "sentiment_compound": -0.8171
        },
        {
            "id": "i29eqqn",
            "score": 1,
            "text": "When someone can explain this to me in simple terms, i will try to read this again.",
            "title_similarity": "0.32744694",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29erol",
            "score": 1,
            "text": "If they have an experiment that can prove a revolutionary theory why not simply collaborate with researchers able to conduct the experiment?  I mean great you made an experiment that could prove it, why not demonstrate it?  They value lies in doing it, not describing it.",
            "title_similarity": "0.5461457",
            "sentiment_compound": 0.6199
        },
        {
            "id": "i29f4y6",
            "score": 1,
            "text": "It’s a pretty in depth research.   They printed out a tiny sheet of paper with a complex mathematical formula stamped into the paper surface with no ink.  Then they compared the mass of that sheet of paper to another identical sheet with a less complicated formula as well as a third sheet with nothing at all (as a baseline).  The implications are huge.   In Nascar alone this could mean a dramatic weight reduction in cars with no sponsor text on the surface adding information to the mass.",
            "title_similarity": "0.47147617",
            "sentiment_compound": 0.296
        },
        {
            "id": "i29fdug",
            "score": 1,
            "text": "If I am understanding the paper correctly, isn’t the described matter-antimatter erasure process sort of building on the Hawking radiation theory?",
            "title_similarity": "0.6726693",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29fect",
            "score": 1,
            "text": "This sound far out to me on first thought.\n\nLike it make me remember that Ender's Saga book where they space traveled using their minds. \n\nLike if information is a form of matter and affects the universe maybe we can gossip ourselves into some crazy time travel mess.",
            "title_similarity": "0.67355216",
            "sentiment_compound": -0.128
        },
        {
            "id": "i29fen7",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.051757585"
        },
        {
            "id": "i29fgjm",
            "score": 1,
            "text": "I can't handle the weight of this knowledge",
            "title_similarity": "0.18907425",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29filr",
            "score": 1,
            "text": "This smells like nonsense.\n\n\"Fifth form\" of matter?? What does that even mean? What are the other four?\n\nSurely they don't mean \"state\" because there are already at least 5...",
            "title_similarity": "0.5224183",
            "sentiment_compound": 0.5803
        },
        {
            "id": "i29fja7",
            "score": 1,
            "text": "One step closer, Devs seeing all past and futures!",
            "title_similarity": "0.29596108",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29fl7p",
            "score": 1,
            "text": "\"In the beginning was the word...\" Maybe that's what they meant.",
            "title_similarity": "0.30858094",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29fqm9",
            "score": 1,
            "text": "About time humans glommed on to that.",
            "title_similarity": "0.1890791",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29fr8s",
            "score": 1,
            "text": "Someone jokingly suggested to measure information by weighing a digital storage device before and after storing info. Funnily enough, this author seems to have already suggested that. \n\nhttps://aip.scitation.org/doi/full/10.1063/1.5123794",
            "title_similarity": "0.5659288",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i29fwr5",
            "score": 1,
            "text": "Really? Even wrong information? What defines information",
            "title_similarity": "0.22319357",
            "sentiment_compound": -0.5773
        },
        {
            "id": "i29fwz4",
            "score": 1,
            "text": "My head is so light you have no idea",
            "title_similarity": "0.1874651",
            "sentiment_compound": -0.296
        },
        {
            "id": "i29fx3s",
            "score": 1,
            "text": "What would the 5th state of matter feel like?",
            "title_similarity": "0.48659402",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i29g25t",
            "score": 1,
            "text": "Imagine the matter memes we could do with this information",
            "title_similarity": "0.3710778",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i29g3at",
            "score": 1,
            "text": "So this is an experiment to try and prove the it from bit hypothesis?",
            "title_similarity": "0.50209975",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29g5zx",
            "score": 1,
            "text": "Information is memory?",
            "title_similarity": "0.27833688",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29g7rt",
            "score": 1,
            "text": "The information\nA theory\nA flood\nA history\n\nGreat book. Something of the such.",
            "title_similarity": "0.50419617",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i29g86u",
            "score": 1,
            "text": "This doesn’t do much to dispel the idea that we’re all living in a matrix-like simulation.",
            "title_similarity": "0.4377824",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29gacq",
            "score": 1,
            "text": "Information is not a building blocks but the source of the matter. Building blocks are Plank particles, except they're square and not triangles, but roughly the size that Plank has stated.",
            "title_similarity": "0.3918429",
            "sentiment_compound": -0.2185
        },
        {
            "id": "i29gb5v",
            "score": 1,
            "text": "Anyone know if and when this experiment will be conducted? How expensive/practical is it to conduct? Is there any reason to expect a positive result?",
            "title_similarity": "0.4768912",
            "sentiment_compound": 0.6298
        },
        {
            "id": "i29gnaw",
            "score": 1,
            "text": "Can memetic hazards be real?",
            "title_similarity": "0.35445523",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29gntp",
            "score": 1,
            "text": "On the one hand, why can't the mass-energy *and* the information-energy of the two particles be combined into just the two photons?  Why must it be separate?\n\nOn the opposite hand, an electron and a positron would accelerate towards each other just prior to annihilation, classically at least.  Accelerating charge radiates.  So there could be one or more lower-energy photons from that effect.  I'd think any such \"acceleration-energy\" photons wouldn't have a well-defined peak, but I'm not convinced the information-energy photons would either.  Plus, they'd have to have accurate measurements of these low-energy photons to distinguish the two possibilities anyway.",
            "title_similarity": "0.60253716",
            "sentiment_compound": 0.1712
        },
        {
            "id": "i29gye2",
            "score": 1,
            "text": "Quick perusing seems to indicate the author took a lot of mathematical representations for fluid dynamics and radiative transfer to describe “information”.  Instead of having these equations describe a parcel of atmospheric air, this paper seems to use them to instead represent  “information”. Seems sketch, especially since atmospheric scientist know these fundamental equations can’t represent any perturbations that ultimately create a bias in predictably for modeling. If technology and math isn’t capable of perfectly modeling the atmosphere for given any point in time, I have strong reservations for seeing a different outcome when applying those same fundamentals toward “information”.",
            "title_similarity": "0.55267",
            "sentiment_compound": 0.9169
        },
        {
            "id": "i29gze4",
            "score": 1,
            "text": "Costar told me my heart is a 404 file not found, maybe there’s something to it xD",
            "title_similarity": "0.44120944",
            "sentiment_compound": 0.8402
        },
        {
            "id": "i29h57c",
            "score": 1,
            "text": "If something can't store information it does not experience time.",
            "title_similarity": "0.22718993",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29h6yg",
            "score": 1,
            "text": "So, 1kg of copper has 372 500 000 exabytes",
            "title_similarity": "0.4190386",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29h754",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.03543123"
        },
        {
            "id": "i29hesy",
            "score": 1,
            "text": "The paper is fine but this post sucks.",
            "title_similarity": "0.16370535",
            "sentiment_compound": -0.431
        },
        {
            "id": "i29hfr3",
            "score": 1,
            "text": "Is the 5th phase... turkey gravy? Is it the phase sticky candy gets when its all up in your teeth?",
            "title_similarity": "0.35988995",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29hrvx",
            "score": 1,
            "text": "Isn't there an actual limit to the amount of information that can be packed into a given area of space?",
            "title_similarity": "0.44939667",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29huem",
            "score": 1,
            "text": "Uh information was built into the 5th element's DNA.",
            "title_similarity": "0.5303807",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29hxoy",
            "score": 1,
            "text": "This is a really good sentence",
            "title_similarity": "0.18845463",
            "sentiment_compound": 0.5819
        },
        {
            "id": "i29hxry",
            "score": 1,
            "text": "Is this similar to Plato’s forums in which every object has an essence that gives off information that gives it its physical characteristics that our brains assemble while also keeping ourselves ourselves and not a part of the physical world we believe we are interacting with?",
            "title_similarity": "0.48347455",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29i1id",
            "score": 1,
            "text": "I kept reading it as pharmacist and I was like damn, dude got so bored filling prescriptions who went off to mess with physics.",
            "title_similarity": "0.43883002",
            "sentiment_compound": -0.6642
        },
        {
            "id": "i29i5ax",
            "score": 2,
            "text": "\"I'm not fat, I'm knowledgeable!\"",
            "title_similarity": "0.19413622",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29i60s",
            "score": 1,
            "text": "this info blew my mind",
            "title_similarity": "0.2747318",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29i702",
            "score": 1,
            "text": "I'm glad I didn't give up on the information age; now the internet has given us more matter to work with; by that, I mean the global contributions via the internet has given us more matter and time to save our planet from our own great filter event.",
            "title_similarity": "0.45217955",
            "sentiment_compound": 0.9019
        },
        {
            "id": "i29i9hg",
            "score": 1,
            "text": "This is really cool! If it's true, it would mean that information is a really important part of the universe.",
            "title_similarity": "0.51755166",
            "sentiment_compound": 0.7768
        },
        {
            "id": "i29ic8v",
            "score": 1,
            "text": "a philosopher called Gurdjieff said the same thing 100 years ago",
            "title_similarity": "0.46801633",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29irum",
            "score": 1,
            "text": "Isn’t this kinda like Phillip Pullman’s idea of Dust? Consciousness solidified?",
            "title_similarity": "0.47231096",
            "sentiment_compound": 0.3751
        },
        {
            "id": "i29j2qz",
            "score": 1,
            "text": "&#x200B;\n\nTake a guess as to why that's not possible. You know, just a running, wild stab in the dark...  \nPoor paper.",
            "title_similarity": "0.24479845",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i29j3lb",
            "score": 1,
            "text": "Is that why my brain is so damn heavy",
            "title_similarity": "0.27880564",
            "sentiment_compound": -0.541
        },
        {
            "id": "i29j52u",
            "score": 1,
            "text": "we have known for a while now that smashing sub atomic particles together gives non additive results. it was described something like: imagine taking two toys and smashing the together, in the resulting debris we find interesting things like broken toy, broken pieces of toy that wasn't used in the collision, and also new toys.",
            "title_similarity": "0.5793711",
            "sentiment_compound": -0.25
        },
        {
            "id": "i29j8gm",
            "score": 1,
            "text": "and this will further be willfully misinterpreted and reinforce new afe beliefs in manifesting thoughts into reality (\"see information is matter\").  I surely cannot wait for my woowoo family to latch onto this",
            "title_similarity": "0.44476473",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i29j8rw",
            "score": 1,
            "text": "This would put Terrence McKenna's psychedelic musings in a whole new light. \"The universe is made of language...\"\nWay cool.",
            "title_similarity": "0.40513948",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i29j98j",
            "score": 1,
            "text": "Now the earth was formless and void, and darkness was over the surface of the deep. And the Spirit of God was hovering over the surface of the waters.  And God said, “Let there be light,” and there was light.",
            "title_similarity": "0.27362674",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i29jb7r",
            "score": 1,
            "text": "It’s packing foam peanuts",
            "title_similarity": "0.27974838",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29jffg",
            "score": 1,
            "text": "> Science Subreddit\n\n> “Proved Correct”",
            "title_similarity": "0.4648205",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29jh4s",
            "score": 1,
            "text": "That's why my hard drives get heavier",
            "title_similarity": "0.2656079",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i29jjab",
            "score": 1,
            "text": "I think I'm the thousandth comment",
            "title_similarity": "0.2784722",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29jpcj",
            "score": 1,
            "text": "This was proven already. If you take a high memory kindle and fill it's memory to capacity it will weigh more.\n\nhttps://www.businessinsider.com/a-fully-loaded-kindle-is-heavier-than-an-empty-one-2011-10",
            "title_similarity": "0.47243926",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29k30r",
            "score": 1,
            "text": "As long as he doesn’t try and throw out commonly accepted facts that the Fifth Element is a MultiPass I’m fine with this expansion pack.",
            "title_similarity": "0.47601545",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i29ka7m",
            "score": 1,
            "text": "I believe Warren Ellis already covered something like this in the \"Planetary\" series.. always fun when science catches up to science fiction.",
            "title_similarity": "0.6242542",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i29kfqe",
            "score": 1,
            "text": "I want to see the horrific eldritch mass of accumulated information. I am declaring myself ready.",
            "title_similarity": "0.37687805",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i29kh8k",
            "score": 1,
            "text": "Okay, let us know when he proves it.",
            "title_similarity": "0.32349733",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i29kizg",
            "score": 1,
            "text": "Information has a very different meaning in physics",
            "title_similarity": "0.48888415",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29knui",
            "score": 1,
            "text": "If anyone has ever done magic mushrooms, you'll know that they somehow have so much information to offer.",
            "title_similarity": "0.48679376",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29kolv",
            "score": 1,
            "text": "This should not be a surprise ever since Claude Shannon published his paper in the 40s. if I understand what it tells us.",
            "title_similarity": "0.5017984",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i29kp28",
            "score": 1,
            "text": "Written information definitely has mass.  <snicker>",
            "title_similarity": "0.26327407",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i29kse5",
            "score": 2,
            "text": "Wouldn't this mean that the universe progressively gains mass since information is preserved and the history of the universe can be read off of the current state (but not vise versa due to quantum indeterminacy)?",
            "title_similarity": "0.6681545",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i29kvve",
            "score": 1,
            "text": "Is this connected to the idea of the akashic records??  Anyone???",
            "title_similarity": "0.5344296",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29kzv2",
            "score": 1,
            "text": "It's funny but I've had thoughts about this for a while, specifically, can information have any physical properties?  And if so, I've also wondered if Information (big 'I') as a fundamental building blocks of reality, can it account for unexplained properties, can information actually be what dark matter or even dark energy are predicted as/fill in that theoretical gap?  Since information may differ from other forms of matter, in that it doesn't follow the law of Conservation of Mass, perhaps it is able to be created and destroyed freely. thus accounting for the roughly 26-ish% of 'Dark matter' or even the approximately 68% of 'Dark Energy'.\n\nCan Information as a physical state also somehow provide a quantum theory of gravity, unifying Quantum Physics and General Relativity?\n\nDisclosure: article is pretty dense, have not read it in detail yet.",
            "title_similarity": "0.6589284",
            "sentiment_compound": 0.905
        },
        {
            "id": "i29l5o1",
            "score": 1,
            "text": "“In the beginning was the word” y’all \n\nI just love when stuff like this overlaps. Were the ancients so wise and we’re just catching up? Is it all a comical coincidence? Who knows! Are these just different ways of looking at and understanding the same things? Maybe..",
            "title_similarity": "0.48606795",
            "sentiment_compound": 0.9104
        },
        {
            "id": "i29lcrb",
            "score": 1,
            "text": "It isn’t going to work",
            "title_similarity": "0.08545811",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29lddm",
            "score": 1,
            "text": "\\*Takes another hit from blunt\\*\n\nI'm sure there's some interesting physics underlying this, but the title reeks of science that was poorly interpreted by a journalist at some point",
            "title_similarity": "0.6462006",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i29lejt",
            "score": 1,
            "text": ">time, which we also move through, though only in one direction.  \n\nThat's a popular (though inaccurate) expression we use. Time is the concept we apply to ongoing change.   \nIn science, that change comes in the form of entropy - energy/matter always moving from order to disorder - hence our idea of time moving forward.    \n\nThe problem there is that entropy isn't a dimension. It's an aspect ocurring in 3d space.  I doubt there is a fourth or fifth dimension (unless you chose to include a metaphysical realm).  \n\n  I like the concept, but what manner information manifests itself in the physical laws of the universe is still totally speculative.",
            "title_similarity": "0.6715331",
            "sentiment_compound": 0.0617
        },
        {
            "id": "i29llmm",
            "score": 1,
            "text": "So he has discovered 'L' Space?",
            "title_similarity": "0.59734815",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29lmnt",
            "score": 1,
            "text": "wE LiVe iN a SiMuLaTiOn",
            "title_similarity": "0.4020977",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29lpoo",
            "score": 1,
            "text": "You can't \"prove correct\" science. You can only try to disprove and fail. That is why the Theory of gravity and the theory of evolution, etc are still called theory. Science is built on the idea of always testing",
            "title_similarity": "0.55349743",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i29luee",
            "score": 1,
            "text": "This is contrary to the concept of somebody being dense",
            "title_similarity": "0.14788415",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29m3xf",
            "score": 1,
            "text": "Does that mean this is just a simulation? The information would be the rules on how things work in a dimension?!?!",
            "title_similarity": "0.50841564",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29mcs3",
            "score": 1,
            "text": "The headline reminds me of the time heat was thought to be a substance that flows inside other things.",
            "title_similarity": "0.46406722",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29mdu8",
            "score": 2,
            "text": "Information is literally the directions and paths any portion of matter travels. If you were to burn a piece of paper, you could take the ashes, the light produced, the heat, and the energy that went into that entire conversion and put it all back to its original state and read whatever was written on that piece of paper.",
            "title_similarity": "0.43698525",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i29mf03",
            "score": 1,
            "text": "I might be high right now, but this is blowing my mind.\n\nAlso, does this mean the fifth element got it wrong? \n\nAlso, has anyone openly talked about the link between this and the simulation theory? Because if information is truly a form of matter, we really have to start considering that we may be living in a simulated reality.",
            "title_similarity": "0.71170235",
            "sentiment_compound": -0.1306
        },
        {
            "id": "i29mgui",
            "score": 1,
            "text": "“If” doing heavy lifting",
            "title_similarity": "0.22636189",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29n1xw",
            "score": 1,
            "text": "Woah. That’s heavy.\n\nLiterally.",
            "title_similarity": "0.15763955",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29n4g4",
            "score": 1,
            "text": "So disinformation has negative mass and travels faster than the speed of light?",
            "title_similarity": "0.35276192",
            "sentiment_compound": -0.6077
        },
        {
            "id": "i29n85s",
            "score": 1,
            "text": "I think therefore I am.",
            "title_similarity": "0.11581238",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29nb1z",
            "score": 1,
            "text": "Ripley’s Believe it or not definitely has mass.",
            "title_similarity": "0.35045663",
            "sentiment_compound": -0.3089
        },
        {
            "id": "i29nd2o",
            "score": 1,
            "text": "> The relevant equation is: Knowledge = power = energy = matter = mass; a good bookshop is just a genteel Black Hole that knows how to read\n[](/GNU Terry Pratchett)",
            "title_similarity": "0.5111636",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i29nn2s",
            "score": 1,
            "text": "This can only be true in the world of computing. And is really an argument of semantics. \n\nAnd is honestly pretty stupid. Information is infinite and cannot be traded. Once given, you still have said information. So it defies all basic principles of matter...\n\nJust because it can \"written\" into electronic or even atomic form does not mean it is in of itself matter. \n\nIs the ink information? Or is the word it is used to write? The word... Ink can whatever you make it, it is not information until you make it into a concept. \n\nThis entire idea is incredibly egocentric and foolish. This is basically a human trying to say they're ideas are somehow more than ideas. While thought is powerful and useful, it is not something that can be \"worth it's weight in gold\" even if you find a way to weigh it. It's still weighing whatever the idea is \"written\" on. Not the idea itself.",
            "title_similarity": "0.4106192",
            "sentiment_compound": 0.8233
        },
        {
            "id": "i29nq96",
            "score": 3,
            "text": "So what is a unit of information?",
            "title_similarity": "0.24154773",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29nr0f",
            "score": 1,
            "text": "Philosophy is pseudo-science.\nThe fact that entropy may be described as information doesn't mean that information can participate in thermodynamics.\nInformation is our subjective description of physical objects and events. Quantum properties as information do not add up for macro-level, so there is no \"law of conservation of information\", there is universally growing entropy which is decaying of information in that \"equivalence\".\nSo if you have \"weighed the soul\", recheck your experiment before claiming for Nobel prize.",
            "title_similarity": "0.56908035",
            "sentiment_compound": -0.0422
        },
        {
            "id": "i29nual",
            "score": 1,
            "text": "living in a simulation got it...",
            "title_similarity": "0.4014687",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29nvch",
            "score": 1,
            "text": "I will not pretend to understand any of this.",
            "title_similarity": "0.11510253",
            "sentiment_compound": 0.0762
        },
        {
            "id": "i29ogka",
            "score": 1,
            "text": "Gotta say here strictly as a layperson this theory has a strong, a very strong odour of unnecessary bs, aside from the current an admitted obvious fact that measuring such a theory is either non existent or e extremely difficult, that aside, they committed the blatant crime of ommission that the universe is expanding exponentially!, meaning that our ideas, or thoughts or bits be accounted for by the economic  principles of expansion, it's totally prosperous nee stupidity in its laudable form to hypothesise that,space, empty space, nothing that we see or touch, can actually make a tangible difference to our physical space, I mean its total total shite, nothings gonna change my world said a guy who sang ditties",
            "title_similarity": "0.5100966",
            "sentiment_compound": 0.4256
        },
        {
            "id": "i29oip9",
            "score": 1,
            "text": "Much more stimulating theory than most people are giving it credit for here.",
            "title_similarity": "0.41757843",
            "sentiment_compound": 0.8155
        },
        {
            "id": "i29ojbg",
            "score": 1,
            "text": "No wonder my brain is so light",
            "title_similarity": "0.20180291",
            "sentiment_compound": -0.296
        },
        {
            "id": "i29ok7g",
            "score": 1,
            "text": "It all depends on definition. I’d say information could defined as what is left behind when matter is subtracted.",
            "title_similarity": "0.30403462",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i29ovdt",
            "score": 1,
            "text": "Another day, another headline worded ambiguously for clicks",
            "title_similarity": "0.2720062",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29owvh",
            "score": 1,
            "text": "Wow! I love all the nerd comments.",
            "title_similarity": "0.24978538",
            "sentiment_compound": 0.7959
        },
        {
            "id": "i29ox1h",
            "score": 1,
            "text": "I thought there were already like 20+ forms of matter already? Bose Einstein Condensate for example?…",
            "title_similarity": "0.46482265",
            "sentiment_compound": 0.4515
        },
        {
            "id": "i29oxaj",
            "score": 1,
            "text": "I remember reading something a while back, on how our digitally stored information/data could be increasing the weight/mass of Earth. Related?",
            "title_similarity": "0.6199689",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29oza7",
            "score": 1,
            "text": "At the moment I'm not putting sufficient thought into this, but for what it's worth, AIP Advances is a legit, but not spectacular physics journal. Its impact factor is low but it's professional at least. Not trash.\n\nHe seems like a solid researcher, a senior lecturer who was cited several hundred times over the past decade.\n\nI guess this is worth some thought. It's kind of this middle ground where the credentials are good enough not to immediately reject, but not really good enough to amaze me off the bat. So... cool?\n\n>ABSTRACT\r  \nThe mass–energy–information equivalence principle proposed in 2019 and the information content of the observable matter in the universe estimated in 2021 represent two important conjectures, called the information conjectures. Combining information theory and physical principles of thermodynamics, these theoretical proposals made specific predictions about the mass of information as well as the most probable information content per elementary particle. Here, we propose an experimental protocol that allows for empirical verification of the information conjectures by confirming the predicted information content of elementary particles. The experiment involves a matter–antimatter annihilation process. When an electron–positron annihilates, in addition to the two 511 keV gamma photons resulting from the conversion of their rest masses into energy, we predict that two additional low energy photons should be detected, resulting from their information content erasure. At room temperature, a positron–electron annihilation should produce two ∼50 μm wavelength infrared photons due to the information erasure. This experiment could, therefore, confirm both information conjectures and the existence of information as the fifth state of matter in the universe.",
            "title_similarity": "0.5439242",
            "sentiment_compound": 0.975
        },
        {
            "id": "i29p1xw",
            "score": 1,
            "text": "Wouldn't this help support the idea of reincarnation? I'm not Buddhist or anything, but I have had hypotheses that could support it.\n\nBasically, the information/ energy signature that constitutes you as a person is released upon death. Sometimes instead of dissipating entirely, some of that *stuff* is carried into another's life force creation.\n\nThat's more or less my idea on how reincarnation may have some actual basis.",
            "title_similarity": "0.5966455",
            "sentiment_compound": 0.0624
        },
        {
            "id": "i29pcoj",
            "score": 1,
            "text": "Would this discovery negate the concept of dark matter and dark energy?  Or just redefine dark matter/energy as information?",
            "title_similarity": "0.5513437",
            "sentiment_compound": 0.3736
        },
        {
            "id": "i29pfqa",
            "score": 1,
            "text": "I don’t understand “information” in the physics sense.",
            "title_similarity": "0.48346472",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29pn89",
            "score": 1,
            "text": "Does it have mass if it’s bad information?",
            "title_similarity": "0.31813353",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i29ptag",
            "score": 1,
            "text": "Give us... the information",
            "title_similarity": "0.20450836",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29q58w",
            "score": 1,
            "text": "Remember to back up your universe.",
            "title_similarity": "0.42276925",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29ql23",
            "score": 1,
            "text": "Physicists always have the best drugs....",
            "title_similarity": "0.4553237",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i29qt3k",
            "score": 3,
            "text": "Can someone explain this to me like I'm five?",
            "title_similarity": "0.48071066",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i29qxm4",
            "score": 1,
            "text": "I always wondered if consciousness was hard-coded in the universe, so maybe someday someone could run a recovery routine on the cosmos and find every consciousness which ever existed and load them into a virtual reality world, essentially bringing all past lives back to life as a way to study the history of the universe.",
            "title_similarity": "0.67906225",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29r4h6",
            "score": 1,
            "text": "Not going to read the article. So I’m just doing to assume that dude is referring to WiFi.",
            "title_similarity": "0.32111925",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29ric2",
            "score": 2,
            "text": "Terry Pratchett wrote about this in hogfather I believe. There's a group of creatures called the accountants who keep track of all the information in the universe, such as who any two particles relate to each other. He says that the missing mass in the universe is all the information describing the known mass.",
            "title_similarity": "0.6196818",
            "sentiment_compound": -0.296
        },
        {
            "id": "i29rn4f",
            "score": 2,
            "text": "Man, imagine being so smart you dedicate your life to wildly abstract and improbable concepts",
            "title_similarity": "0.39783105",
            "sentiment_compound": 0.541
        },
        {
            "id": "i29rusx",
            "score": 1,
            "text": "I'd wondered if dark matter was somehow related to information.",
            "title_similarity": "0.42384565",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i29s19t",
            "score": 1,
            "text": "TL;DR\n\nThey want to shoot a sodium laser into some tin foil and prove information is just as real as the chair you're sitting on.",
            "title_similarity": "0.5714367",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i29s65t",
            "score": 1,
            "text": "So the code to the simulation?",
            "title_similarity": "0.39047563",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29s6ic",
            "score": 1,
            "text": "So in theory if proved correct, they state that a electron positron annihilation should both release two 511 KeV photons (the rest mass of an electron is 511 KeV) as well as two lower energy infrared photons  (\\~0.0248 eV).  I'm a nuclear engineer and while not knowing much about radiation detection (not my field) this seems to me like the two lower energy photons would have been detected at some point before this. \n\nAnybody with physics background able to explain why we aren't able to already disprove this? \n\nFor context in my undergraduate labs we always look at the peak at 1.22 MeV to prove that there was annihilation present but there was never any mention of low energy peaks.",
            "title_similarity": "0.71884096",
            "sentiment_compound": 0.296
        },
        {
            "id": "i29s9sr",
            "score": 1,
            "text": "That would mean facebook is a black hole",
            "title_similarity": "0.25853014",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29sers",
            "score": 1,
            "text": "DNA is basically encoded information. So a fifth state of matter is definitely possible in universe too.",
            "title_similarity": "0.68717915",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i29sner",
            "score": 1,
            "text": "So DNA for matter.  \n\nInstructions for operating within the matrix of a “Universe”",
            "title_similarity": "0.5460945",
            "sentiment_compound": 0.0935
        },
        {
            "id": "i29sny7",
            "score": 1,
            "text": "So are you telling me that Albert Einstein was dummy thicc?",
            "title_similarity": "0.5335146",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29sq98",
            "score": 2,
            "text": "This is not quantum, and so suggests to me that it cannot be an accurate description of atomic and nuclear physics. \n\nInformation associated to a quantum state is a ubiquitous concept in modern, *collaborative*, theoretical physics. This paper does not address it.",
            "title_similarity": "0.49710637",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29sxvn",
            "score": 1,
            "text": "Well that is now the reason I will tell my doctor i am 15 lbs overweight…. I know too much.",
            "title_similarity": "0.43156248",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i29tbyp",
            "score": 1,
            "text": "I'm not fat, I'm just very well informed",
            "title_similarity": "0.17807698",
            "sentiment_compound": 0.3384
        },
        {
            "id": "i29tjhb",
            "score": 1,
            "text": "If you had trouble grasping understand basically someone decided to ask why measuring of digital storage works & if it happened to be detectable in a similar way down to the subatomic.",
            "title_similarity": "0.6063006",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i29tonu",
            "score": 1,
            "text": "First of all Simulation. Second- What happens when we creat more data than atoms in 350 years? Will be be globally out of hard drive space? Guess I’ll hold on to all those no longer used flash drives",
            "title_similarity": "0.55420303",
            "sentiment_compound": -0.4515
        },
        {
            "id": "i29tuke",
            "score": 1,
            "text": "there are already more than four phases of matter.\n\ni can think of six off the top of my head",
            "title_similarity": "0.4781003",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i29txp3",
            "score": 1,
            "text": "But doesn’t it require infinite energy for any kind of mass to move at the speed of light?",
            "title_similarity": "0.45304585",
            "sentiment_compound": 0.3919
        },
        {
            "id": "i29tytq",
            "score": 1,
            "text": "A full kindle is heavier than an empty one.",
            "title_similarity": "0.26364726",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i29tznf",
            "score": 2,
            "text": "If this pans out, i'm excited for the memes.",
            "title_similarity": "0.2653808",
            "sentiment_compound": 0.34
        },
        {
            "id": "i29u4z1",
            "score": 1,
            "text": "Can someone please ELI5",
            "title_similarity": "0.24073173",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i29ufbh",
            "score": 1,
            "text": "Leeloo Dallas multipass.",
            "title_similarity": "0.2523641",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29uggl",
            "score": 1,
            "text": "Every BI dashboard developer afterwards: \n- I'm something of a physicist myself",
            "title_similarity": "0.60338825",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29upqa",
            "score": 1,
            "text": "Perhaps this explains why particles behave differently when being observed? Aka when we are collecting information from them and thus taking it away? That was always a topic that fascinated me when I took physics in undergrad",
            "title_similarity": "0.65480316",
            "sentiment_compound": 0.5362
        },
        {
            "id": "i29uqxs",
            "score": 1,
            "text": "What ever happened to Bose-Einstein condensates????? Does that not count anymore?",
            "title_similarity": "0.50467163",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29uykm",
            "score": 1,
            "text": "I have a feeling this refers to genetic information and gene coding",
            "title_similarity": "0.41262144",
            "sentiment_compound": 0.128
        },
        {
            "id": "i29veyx",
            "score": 1,
            "text": "So you're saying it only transports matter?  I don't know.",
            "title_similarity": "0.3066144",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i29vmn8",
            "score": 1,
            "text": "\"fifth form of matter\" implies that there have only been four discovered before. This is not the case. There are so many forms of matter that numbering them all doesn't even make sense. There's the four most people are familiar with, gas, solid, liquid, plasma. But there's also Bose-Einstein condensates, fermionic condensates, super fluids, super conductors, quark plasmas and probably more that I can't think of off the top of my head. Most of which have been well studied and well documented for well over a hundred years.",
            "title_similarity": "0.6670688",
            "sentiment_compound": 0.9692
        },
        {
            "id": "i29vocn",
            "score": 1,
            "text": "I'm not a physicist. But doesn't this make it look like we're aliving in some sort of simulation? Plus, the way quantum physics \"breaks\" at a point as if the \"computer\" isn't made to render information in such detail.",
            "title_similarity": "0.5648277",
            "sentiment_compound": 0.5023
        },
        {
            "id": "i29w0r2",
            "score": 1,
            "text": "This is so cool and I'm so excited",
            "title_similarity": "0.1443964",
            "sentiment_compound": 0.7276
        },
        {
            "id": "i29wn5v",
            "score": 1,
            "text": "ELI5:\n\nIf information has mass, how could information travel at the speed of light?",
            "title_similarity": "0.47621667",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29xb9i",
            "score": 1,
            "text": "We created computers based on the knowledge that information does not take up mass. This is a scientists pipe dream and a catchy title. \n\nBe awesome if it were true, I’m not hopeful though.",
            "title_similarity": "0.64488924",
            "sentiment_compound": 0.8019
        },
        {
            "id": "i29xbdw",
            "score": 1,
            "text": "One more step towards time travel.",
            "title_similarity": "0.38614744",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29xd6t",
            "score": 1,
            "text": "Are we in a simulation?",
            "title_similarity": "0.37567237",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29xhvu",
            "score": 1,
            "text": "Question, does this open the door for teleportation?",
            "title_similarity": "0.5182195",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29xih3",
            "score": 1,
            "text": "See, this is why im overwreight. Im not big bonef or fat. Im just super smart, heavy with all this informatoin in my head!",
            "title_similarity": "0.35792288",
            "sentiment_compound": 0.784
        },
        {
            "id": "i29xx23",
            "score": 1,
            "text": "I’ll be sure to pass this news along to Bose Einstein condensate",
            "title_similarity": "0.4744858",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i29xxrm",
            "score": 1,
            "text": "Scientists aren't the best at creative names.",
            "title_similarity": "0.32317656",
            "sentiment_compound": -0.12
        },
        {
            "id": "i29xyoz",
            "score": 1,
            "text": "There is proven 5 states,  liquid ,gas, solids, plasma, and the Bose einstein condensate",
            "title_similarity": "0.62536526",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29y2xu",
            "score": 1,
            "text": "I might be way off here, but could this be the identity of dark matter?",
            "title_similarity": "0.41640076",
            "sentiment_compound": 0.0387
        },
        {
            "id": "i29y623",
            "score": 1,
            "text": "Ok so we’re all living in a simulation, got it",
            "title_similarity": "0.43057454",
            "sentiment_compound": 0.296
        },
        {
            "id": "i29y8i5",
            "score": 1,
            "text": "I've heard the theory that ideas actually come from somewhere (just not sure where). Could this actually play into that?",
            "title_similarity": "0.5207309",
            "sentiment_compound": 0.1124
        },
        {
            "id": "i29y9ko",
            "score": 1,
            "text": "I wonder if information can be interpreted as a ‘soul’",
            "title_similarity": "0.37836146",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29ytl8",
            "score": 1,
            "text": "that header sounds amazing! totally agree. i'll wait for the netflix doc. to learn more",
            "title_similarity": "0.47326487",
            "sentiment_compound": 0.7836
        },
        {
            "id": "i29yzx6",
            "score": 1,
            "text": "Can't wait for the religious zealots to see this. I can hear them now, \"Where do you think that information came from?\" The only possible source is sky daddy.",
            "title_similarity": "0.48130992",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i29z4k8",
            "score": 1,
            "text": "He hasn't done the experiment then? Why are we writing headlines when he could just, ykno, run the test?",
            "title_similarity": "0.4708184",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29z5pl",
            "score": 1,
            "text": "You are more board than I am.",
            "title_similarity": "0.23116803",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29z6a3",
            "score": 1,
            "text": "I imagine it like binary, metaphorical 0s and 1’s make up “system information” of everything",
            "title_similarity": "0.41683972",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i29z6uv",
            "score": 1,
            "text": "From a physics PhD: Papers like this come and go. I've seen hundreds of papers being promoted like this with insanely click-baity titles, but it usually doesn't mean anything.",
            "title_similarity": "0.5683489",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i29zh3z",
            "score": 1,
            "text": "Welp. This is beyond my understanding but cool.",
            "title_similarity": "0.2065933",
            "sentiment_compound": 0.4497
        },
        {
            "id": "i29zy4o",
            "score": 1,
            "text": "If it's proved correct, what would he call it?",
            "title_similarity": "0.33566642",
            "sentiment_compound": 0.0
        },
        {
            "id": "i29zzsz",
            "score": 2,
            "text": "So THAT'S why I'm so heavy.",
            "title_similarity": "0.2139374",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a01t4",
            "score": 1,
            "text": "Which form of information? I believe there are several. Hopefuly his experiment is proven correct because I would really like to know.",
            "title_similarity": "0.48869306",
            "sentiment_compound": 0.4201
        },
        {
            "id": "i2a07e9",
            "score": 1,
            "text": "I dislike this title because it isn't accurate to describe any experiment as \"proving x is true\".\n\nLike Einstein said \"no amount of experiments can prove me right, one experiment can prove me wrong\"\n\nScience is subtractive not additive. This scientists experiments could prove *other* theories wrong. It won't prove anything about his own theory though. It is just data. If it looks to be conclusive about his theory it may very well be, but we can't know that because of the nature of science. More data will arise and his theory will eventually become outdated. \n\nJust like Newton, and then Einstein. Science is subtractive. A more accurate title would always always be \"new experiment *suggests*\" but that is not click baity enough.",
            "title_similarity": "0.56135917",
            "sentiment_compound": 0.4012
        },
        {
            "id": "i2a10bt",
            "score": 1,
            "text": "An issue with this is not that there could be some extra dimension we assign to objects but that using the term 'information' you're going to get epistemological consequences which will render the choice of calling it 'information' redundant - similar to how quantum 'spin' is not spin in the classical sense.",
            "title_similarity": "0.4832224",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a1dlh",
            "score": 1,
            "text": "But everything is described through information. All the universe is, is information. It's just manifested in different ways that we perceive through qualia. This almost seems both like a tautology and an absurdity.",
            "title_similarity": "0.49280193",
            "sentiment_compound": 0.4319
        },
        {
            "id": "i2a2m49",
            "score": 1,
            "text": "*”Two information conjectures have been recently proposed: (a) the mass–energy–information equivalence principle,11 stating that information transcends into mass or energy depending on its physical state and (b) the existence of an intrinsic information underpinning the fundamental characteristics of elementary particles in the universe, implying that stable, non-zero rest mass elementary particles store a fixed and quantifiable value of information about themselves. The two conjectures also imply that the information is a form of matter, called the fifth state of matter or the fifth element.”*.  \n  \nSo…Leeloo?",
            "title_similarity": "0.8015499",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i2a2qae",
            "score": 2,
            "text": "As a comp instructor, I have to say that the dashes in this title are a blatant foul. My disapproval has physical mass and is the sixth form of matter.",
            "title_similarity": "0.46032053",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i2a2sxz",
            "score": 1,
            "text": "can someone give me an ELI5",
            "title_similarity": "0.33533853",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a2xn0",
            "score": 1,
            "text": "Welp if so, souls probably exist then.",
            "title_similarity": "0.34651574",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a322e",
            "score": 1,
            "text": "Soooo... engrams could be made real?! I want a yellow one.",
            "title_similarity": "0.27482504",
            "sentiment_compound": 0.1511
        },
        {
            "id": "i2a34jn",
            "score": 1,
            "text": "\"When an electron–positron annihilates, in addition to the two 511 keV gamma photons resulting from the conversion of their rest masses into energy, we predict that two additional low energy photons should be detected, resulting from their information content erasure.\"\n\nWow that seems pretty straightforward and testable.",
            "title_similarity": "0.6317221",
            "sentiment_compound": 0.8442
        },
        {
            "id": "i2a37ur",
            "score": 1,
            "text": "This proves we are indeed in a simulation.",
            "title_similarity": "0.41578838",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a3bf6",
            "score": 1,
            "text": "“Does it live in the world? Or in the mind?” -Savathun",
            "title_similarity": "0.37262174",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a3eb7",
            "score": 1,
            "text": "Ooblek. Its ooblek guys",
            "title_similarity": "0.2524988",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a3em1",
            "score": 1,
            "text": "Quantum mechanics is fascinating.",
            "title_similarity": "0.55312526",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i2a3i4u",
            "score": 1,
            "text": "If the answer 42 by any chance?",
            "title_similarity": "0.37451488",
            "sentiment_compound": 0.25
        },
        {
            "id": "i2a3nwm",
            "score": 2,
            "text": "Science got way too complicated way too quickly",
            "title_similarity": "0.33454734",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a3ykr",
            "score": 1,
            "text": "If information ends up having mass, it would make the fact that information can't exceed the speed of light make a little more sense to me, physically speaking. That was always hard for me to understand in college.",
            "title_similarity": "0.543061",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i2a505n",
            "score": 1,
            "text": "So this is all just a simulation",
            "title_similarity": "0.27808753",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a51ok",
            "score": 1,
            "text": "But if I don’t mind, does any of it really matter?",
            "title_similarity": "0.21183905",
            "sentiment_compound": 0.1505
        },
        {
            "id": "i2a560v",
            "score": 2,
            "text": "What does “information” mean in this context? \n\nDoes it mean communicating an idea, and how it’s processed & stored by biological organisms? Or does it imply an event simply occurring anywhere in the universe, ie matter interacting somehow?",
            "title_similarity": "0.5858958",
            "sentiment_compound": 0.163
        },
        {
            "id": "i2a5akh",
            "score": 1,
            "text": "*snowcrash intensifies*",
            "title_similarity": "0.20612223",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a5wxz",
            "score": 1,
            "text": "Based on the title alone, this is a big portion of how my fictional setting’s magic system works. Upon reading further it’s not comparable and entirely different.",
            "title_similarity": "0.5023837",
            "sentiment_compound": -0.25
        },
        {
            "id": "i2a5ygi",
            "score": 1,
            "text": "Brings a whole new meaning to the response of, \"Wow man, that's heavy.\" when given a super in-depth explanation about something.",
            "title_similarity": "0.4169535",
            "sentiment_compound": 0.8271
        },
        {
            "id": "i2a5zmv",
            "score": 1,
            "text": "can fancy science people stop re-using terms we already have for new discoveries. it just confuses everyone. call it Dave or something",
            "title_similarity": "0.44681373",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2a62ym",
            "score": 1,
            "text": "I am not a physcyscyscsut, but I've made up an experiment which proves  that I am superior to all you untermenchen. Sheeeee",
            "title_similarity": "0.50993145",
            "sentiment_compound": 0.6956
        },
        {
            "id": "i2a64si",
            "score": 1,
            "text": "So we are in a simulation?!",
            "title_similarity": "0.40581024",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a66aj",
            "score": 2,
            "text": "If information is the \"fifth form of matter\" where are my information particles? Where's the information quantum field? I thought information was something that applies to all fields, it doesn't make sense to exist devoid of the context of another field. Its like saying \"I have a new type of physical object, length!\" Like, what? Thats a property of physical objects, sure, but... it isn't an object in and of itself.",
            "title_similarity": "0.7066172",
            "sentiment_compound": 0.6164
        },
        {
            "id": "i2a6em3",
            "score": 1,
            "text": "This is how the Guilty Gear timeline starts",
            "title_similarity": "0.4130416",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2a7clc",
            "score": 2,
            "text": "\"Are you dense?\" Is now a compliment",
            "title_similarity": "0.25379962",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i2a7d8f",
            "score": 1,
            "text": "This explains why I’m having trouble losing weight….I’m just really informed about food.",
            "title_similarity": "0.36610758",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i2a7ioe",
            "score": 1,
            "text": "ELI5? Information is non tangible right?",
            "title_similarity": "0.23047195",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a7mjo",
            "score": 1,
            "text": "Intelligence has matter - not a new concept for many",
            "title_similarity": "0.3178289",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i2a7o3k",
            "score": 1,
            "text": "r/ExplainLikeImFive please",
            "title_similarity": "0.23791967",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i2a827r",
            "score": 1,
            "text": "Is this why I have been gaining weight lately? I’m just gathering a lot of information?",
            "title_similarity": "0.40135384",
            "sentiment_compound": 0.4871
        },
        {
            "id": "i2a8e2t",
            "score": 1,
            "text": "I remember this novel plot",
            "title_similarity": "0.31541818",
            "sentiment_compound": 0.3869
        },
        {
            "id": "i2a9lxd",
            "score": 1,
            "text": "This sounds like one of those things that don't translate well between crazy deep math and language.",
            "title_similarity": "0.33639127",
            "sentiment_compound": -0.1813
        },
        {
            "id": "i2a9qvj",
            "score": 1,
            "text": "Code of the simulation perhaps?",
            "title_similarity": "0.35571265",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a9r9z",
            "score": 1,
            "text": "Meta and Google knew this for years",
            "title_similarity": "0.39871684",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2a9uc5",
            "score": 1,
            "text": "It could explain why entropy does what it does. Think about information as having direct relationships with entropy. The more information that is available the harder it is to parse and the harder it is to organize. The more energy it takes to manipulate and define types of information. Whether it be subatomic or electronic.",
            "title_similarity": "0.5484344",
            "sentiment_compound": 0.3384
        },
        {
            "id": "i2aac51",
            "score": 1,
            "text": "How tf do people get to be that smart ? That’s awesome",
            "title_similarity": "0.35762584",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i2aaf5x",
            "score": 1,
            "text": "Okay, matter state or enery state? Because matter is a state of energy therefore it has equivalency to E. Electromagnetic radiation or photons which are bosons are another defined by hF. Are they saying E= information = ?",
            "title_similarity": "0.61622417",
            "sentiment_compound": 0.5514
        },
        {
            "id": "i2aaqei",
            "score": 1,
            "text": "Sound like the plot for that Godzilla vs Ultraman animated movie by sending compress information to the past or some such you can change the future.",
            "title_similarity": "0.54649174",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2aaqu3",
            "score": 1,
            "text": "Validity of the idea aside, this is a really weird paper in that it seems like it isn’t written by/for physicists. \nAnyway, there is a large gap between what the paper suggests (Mass-Energy-Information equivalence) and what the title describes.",
            "title_similarity": "0.46928307",
            "sentiment_compound": 0.1298
        },
        {
            "id": "i2aax3z",
            "score": 1,
            "text": "So if matter is neither created nor destroyed, what conversion takes place to create information and what is the by-product?",
            "title_similarity": "0.42834622",
            "sentiment_compound": -0.1196
        },
        {
            "id": "i2abch1",
            "score": 1,
            "text": "Half a billion tweets a day. No wonder it feels like a big deal to me when one of mine gets a few thousand views.\n\n>Each day on Earth we generate 500 × 106 tweets, 294 × 109 emails, 4 × 106 gigabytes of Facebook data, 65 × 109 WhatsApp messages, and 720 000 h of new content added daily on YouTube.",
            "title_similarity": "0.44482943",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i2abnt9",
            "score": 1,
            "text": "I’ve experienced information going into a black hole. Every teacher and parent has observed it daily.",
            "title_similarity": "0.37216687",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2abruq",
            "score": 1,
            "text": "[transcendental physics](http://www.erclosetphysics.com/2019/10/the-discovery-of-non-physical-in.html?m=1)\n\nAbove is a link that I feel has already done this.",
            "title_similarity": "0.6207491",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2abx6j",
            "score": 1,
            "text": "So... If information is matter, and matter can be converted to energy... Then knowledge really is power.",
            "title_similarity": "0.58159775",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i2ac0jg",
            "score": 1,
            "text": "Information is just energy and vice versa. I thought this was known?",
            "title_similarity": "0.4236202",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2acfpc",
            "score": 1,
            "text": "So this will basically support that we're in a simulation right?",
            "title_similarity": "0.41714513",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2ack47",
            "score": 1,
            "text": "Don’t harddrives get heavier with more data stored on them? Does that count?",
            "title_similarity": "0.42675728",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2adu6w",
            "score": 1,
            "text": "Does this connect at all to the universe is a matrix theory",
            "title_similarity": "0.5470127",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2aeorz",
            "score": 1,
            "text": "The Arecibo message was sent using radio waves- which is already measured. There were mysterious deep space signals that were captured by High energetic pulses produced by bursts of electrons and antimatter twins- positrons. In order to even research this- measurements had to be made. In turn, whatever we decide to use these resources for- whether it be communication or building microwaves, the resources are already independently measured. Communication has always been measured per the IBM example but it being a 5th matter- it sounds like they just want to take particles that have already been measured to create the communication and put a new name on it. I’m not sure if I’m explaining it correctly but to me, it sounds like someone is writing a dissertation.",
            "title_similarity": "0.76601666",
            "sentiment_compound": 0.8503
        },
        {
            "id": "i2aevwk",
            "score": 1,
            "text": "Can someone eli5 how an experiment for this would work?",
            "title_similarity": "0.455522",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2af5yf",
            "score": 1,
            "text": "Information is used to communicate with something, what in particular does this information communicate with? Maybe we do live in the Matrix after all.",
            "title_similarity": "0.5073112",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2af99u",
            "score": 1,
            "text": "I wonder if this is pertinent to what I hear Luis Elizondo & others talk about - always talking about data. I took it as data is information which builds a detailed picture for analysis to give rock solid evidence of the phenomenon but maybe it’s this?",
            "title_similarity": "0.58737165",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i2afda2",
            "score": 1,
            "text": "isn't it something like this.\n\n the particle next to me is, so I am....",
            "title_similarity": "0.3512643",
            "sentiment_compound": -0.2755
        },
        {
            "id": "i2afl6d",
            "score": 1,
            "text": "I'm not fat, I'm just a walking encyclopedia :D",
            "title_similarity": "0.25066793",
            "sentiment_compound": 0.6166
        },
        {
            "id": "i2afr3y",
            "score": 1,
            "text": "Does  \"information\" mean data by any chance? Like bytes and stuff.",
            "title_similarity": "0.35398757",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i2aga15",
            "score": 1,
            "text": "I'm not a scientist but I *feel* like an \"experiment\" can't be \"proven correct\"... It's the thing by which a *hypothesis* is either proven correct or incorrect...",
            "title_similarity": "0.43084335",
            "sentiment_compound": 0.5023
        },
        {
            "id": "i2agydr",
            "score": 1,
            "text": "A physicist... What's the name?",
            "title_similarity": "0.5354208",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ah26f",
            "score": 1,
            "text": "Wow that certainly is *almost * science, isn’t it?",
            "title_similarity": "0.48229963",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i2ah7jt",
            "score": 1,
            "text": "Everything is information in a simulation...",
            "title_similarity": "0.34043345",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ahyhd",
            "score": 1,
            "text": "But I've always thought of information is data, structured. And that applying metcalfe's law to data, defines the boundary of data and  information (information is useful, actionable data that follows metcalfe's behavior).\n\nIf anything is to similar to matter, it's data; to what information is derived from...\n\n(Yes, I'm a physicist too).",
            "title_similarity": "0.70962083",
            "sentiment_compound": 0.8201
        },
        {
            "id": "i2ai2f7",
            "score": 1,
            "text": "Too bad science can not \"prove\" his hypothesis correct.",
            "title_similarity": "0.38059908",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2aikjg",
            "score": 1,
            "text": "Which means we are in a simulation?",
            "title_similarity": "0.39153278",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ainiw",
            "score": 1,
            "text": "So if this is true could they use this matter to essentially replicate what they want?",
            "title_similarity": "0.40134156",
            "sentiment_compound": 0.4981
        },
        {
            "id": "i2aj762",
            "score": 1,
            "text": "I'm too dumb to find the connection by reading this, but does this idea share any relation to the double slit experiment and how the act of percieving the event changed the outcome?",
            "title_similarity": "0.5131662",
            "sentiment_compound": 0.1655
        },
        {
            "id": "i2ajix6",
            "score": 1,
            "text": "So I read the article and have one question: ‘what?’",
            "title_similarity": "0.3810885",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ajixp",
            "score": 1,
            "text": "That would explain why my laptop is so heavy, I better delete some of those \"homework\" folders.",
            "title_similarity": "0.42894387",
            "sentiment_compound": 0.4877
        },
        {
            "id": "i2ajk3m",
            "score": 1,
            "text": "Unfortunately, this is fundamentally wrong. Information can't be a form of matter because it's an arrangement of matter.\n\nWhat he proposes in the article (like measuring the change of the mass of full hard drive) was something that was known to happen since Einstein's theory of relativity, and it's not new.",
            "title_similarity": "0.69732594",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i2ajuv6",
            "score": 1,
            "text": "I bet people will read the headline and just sssume these guys have no clue what they’re doing. It seems obvious to me. Sometime in the future somebody prove the planck length is the smallest distance but somebody will prove that you can always create new infinites via subdivisions and it’ll never stop working unless there are never and subdivisions",
            "title_similarity": "0.5369673",
            "sentiment_compound": 0.5239
        },
        {
            "id": "i2ak2hw",
            "score": 1,
            "text": "I have two problems (among many) with the design of this experiment. First the author neglects the temperature (in the case of single particles, temperature is determined by kinetic energy) of the positron and electron in the collision, citing that they are equivalent and the positron thermalises in the matter. However, annihilation cross sections (here a quantity related to the likelihood of annihilation at various kinetic energies) are determined for gas phase experiments at varying collision kinetic energies, so this assumption is basically invalid. There will certainly be annihilations of thermalised positrons - through a process where the positron and the electron become bound as positronium and circle each other until their orbits decay, but there will also be annihilation of faster moving positrons and electrons. Second, the author assumes the information will be emitted as a second photon, rather than coupled into the first along with momentum and energy, and they give no argument as to why. I suspect this was because the energy of the gamma emission from p+e annihilation does not vary with energy content and as such the only way for this theory to work is if there is a second secret photon pair that we just never noticed before. Which is not impossible. Meanwhile his moderation method for the positrons is very old - he proposes tungsten, most people use something like frozen neon. They do not specify the type of detector - unfortunately I don't know much about current IR detectors as to whether single photon detection at 50um is feasible right now - that's very cold so would need to be in a cryo environment. Just my two cents",
            "title_similarity": "0.5858786",
            "sentiment_compound": 0.3387
        },
        {
            "id": "i2ak6f1",
            "score": 1,
            "text": "State differences a matter needn’t necessarily be understood as information.",
            "title_similarity": "0.21396029",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i2akdy6",
            "score": 1,
            "text": "Had a thought recently that transforming information affects entropy.  \nSay, why does it look like everything is accelerating away from us faster and faster? Maybe because the entire earth is \"using up\" way more information than relatively quiet stars / galaxies.",
            "title_similarity": "0.5761124",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2aki4c",
            "score": 1,
            "text": "Well information as a form of matter sound a lot like an Engram to me.\n\nThere's noone with the surname Bray involved is there?",
            "title_similarity": "0.41712272",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i2akyj1",
            "score": 1,
            "text": "What are the supposed current 4 forms? Earth, water, fire and air? Is this from a pop-sci magazine?",
            "title_similarity": "0.5542791",
            "sentiment_compound": -0.4479
        },
        {
            "id": "i2ala3h",
            "score": 1,
            "text": "if you design an experiment with a specific outcome in mind... eh?",
            "title_similarity": "0.3856948",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2alnor",
            "score": 1,
            "text": "So that esotheric lady who wrote numbers in my hand so the information cleans my liver was right? ^(/s)",
            "title_similarity": "0.38319027",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i2alqin",
            "score": 1,
            "text": "Boiron founded this research? Their ability to divide atoms in their million parts is amazing",
            "title_similarity": "0.65987754",
            "sentiment_compound": 0.7269
        },
        {
            "id": "i2altun",
            "score": 1,
            "text": "I'm not fat. I'm well informed.",
            "title_similarity": "0.14685287",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i2alw56",
            "score": 1,
            "text": "So the objective is to detect Photon energy changes directed from the source of the erasure. \n\nIf so allowing Thought-> or information. To be used as a variable in energy.",
            "title_similarity": "0.46505398",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i2amdsr",
            "score": 1,
            "text": "Reminds me of the study of the Muon and it’s potential unknown force working against it. Another 9 years on that study, I hope it breaks physics.",
            "title_similarity": "0.59998775",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2amfs9",
            "score": 1,
            "text": "Is it possible to prove something correct?",
            "title_similarity": "0.27890033",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2anbad",
            "score": 1,
            "text": "the universe is optimized for speed.",
            "title_similarity": "0.41926035",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2andyd",
            "score": 1,
            "text": "Would this have implications for the big bang theory? Previously, the theory posited that the universe was concentrated in a point of infinitely dense matter... But if information is a form of matter, this would imply an alternative: a point of infinitely dense information! I.e. all the information of all the trajectories and deterministically calculable potential instances of the universe. \n\nTo really go out on a limb, such a body of information must be, to preserve it's own integrity, complex (i.e. organised) in the Godellian sense. And in the Godellian sense, such a complex system is always flawed. That is to say, any complex system of information has an input or operation which can 'break' the system. Perhaps such a thing could have caused the informational seed of the big bang to 'break' and so cause all that infinity of information to spill out as matter and energy?",
            "title_similarity": "0.68126917",
            "sentiment_compound": 0.4408
        },
        {
            "id": "i2anmfw",
            "score": 1,
            "text": "Obviously it's physical matter. Wow.",
            "title_similarity": "0.22152553",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i2ao4ho",
            "score": 1,
            "text": "Even from a distance  -- I can almost **hear** Sabine H   making a video to debunk this headline.",
            "title_similarity": "0.40451884",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ao4p2",
            "score": 1,
            "text": "Wasn't this proposed in an episode of Dr. Who (Tom Baker)? He and his sidekick Adric visited a world of physically manifested mathematics. Ok not information exactly but the same idea, yes?  I was only 9 at the time I saw this, but the mind of 9 year old me was expanded and challenged by that one.",
            "title_similarity": "0.566291",
            "sentiment_compound": 0.6007
        },
        {
            "id": "i2aob59",
            "score": 1,
            "text": "Ok but how do we get superpowers out of this",
            "title_similarity": "0.5503801",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i2aobh7",
            "score": 1,
            "text": "So guess soon enough we'll be unlocking the Sanctums",
            "title_similarity": "0.40488395",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2aok7t",
            "score": 2,
            "text": "He talks a lot about information erasure, but I thought information couldn't be destroyed? Wasn't that principle the driving force behind Hawking radiation? That a black hole appears to remove information from the universe, and Hawking radiation solves that problem. Have I just *missed*a bunch of advancements in the field of Information? Last I understood it, information is simply all the properties a particle has, its mass-energy, electromagnetic charge, colour charge, momentum, etc. The point being that, theoretically, if we could accurately measure all these properties, on all particles, we could trace history all the way back to the creation of the universe. I suppose what he's asking is \"if the mass-energy (specifically the rest mass) of two annihilated particles is converted into two photons, what happens to all the other information about them?\" But surely the answer is \"it is contained in the two photons\"? For example, a positron and electron annihilation. The mass is converted into energy in the form of two photons. Because each energy value is associated with a very particular particle, when we measure the energy of the photons produced, we know it must have been a positron and an electron, and so we also know the electromagnetic charges of the particles. The momentum can be determined by the direction of the photons and any additional energy they may be carrying, and I wouldn't be surprised if spin translated into polarisation. Thus, information is conserved without the need for proposing that we've somehow *missed* extra photons when observing these collisions.",
            "title_similarity": "0.7190595",
            "sentiment_compound": 0.9494
        },
        {
            "id": "i2aotsh",
            "score": 2,
            "text": "Science folks, if this proves to be correct, could it solve the mystery of \"dark matter\"?",
            "title_similarity": "0.65640414",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i2ap0i7",
            "score": 2,
            "text": "The problem comes in, when 46% of your population don’t believe in research and information.",
            "title_similarity": "0.43004182",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i2ap3zz",
            "score": 1,
            "text": "We are living in a simulation in that case.",
            "title_similarity": "0.41715533",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2aq11g",
            "score": 1,
            "text": "I suggest that the fundamental information units be called \"Ninfos\".",
            "title_similarity": "0.40941435",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2aq9na",
            "score": 1,
            "text": "As clever as I like to think I am I realise people at this level of intelligence probably just hear caveman noises when people like me speak",
            "title_similarity": "0.43360907",
            "sentiment_compound": 0.8779
        },
        {
            "id": "i2aqa0k",
            "score": 1,
            "text": "And now being a decaying storage manufacturer is negative, and positive.",
            "title_similarity": "0.3393255",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i2aqdas",
            "score": 1,
            "text": "But each particle has the same amount of information, so how are they going to measure that?",
            "title_similarity": "0.4035001",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2aqec2",
            "score": 1,
            "text": "So does this mean that a laptop really does get (very slightly) heavier the more applications and documents that are stored on it?",
            "title_similarity": "0.43305477",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2aqo1y",
            "score": 1,
            "text": "What does it mean by information?",
            "title_similarity": "0.22909068",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2aqyzs",
            "score": 1,
            "text": "Hmmm, I’ve always thought if information as being tied to something, but not independent from it. Like how if you think of matter as protons/neutrons, then quarks are the information. Or if you think of a matter as an atom, then protons/neutrons/electrons would be information. Or their densities/energy levels dictate their state of “matter”.\n\ni.e very high energy very low density is plasma, high-medium energy very low density is gas, medium-low energy and high density is liquid, and very low energy and very high density is solid.\n\nSo my question is, how the hell can information be a state of “matter”? That would mean it’s fundamentally different from, and independent of the rest. Just like how a solid is a solid, it has no liquids, this would mean the four states of observable matter have no information…(supercritical points aside).\n\nI think information is more closer to energy, and that can have mass, just like how some tests are showing that light actually has mass (albeit insanely low, something like *10-59 or smth).",
            "title_similarity": "0.681702",
            "sentiment_compound": 0.7725
        },
        {
            "id": "i2ar6lb",
            "score": 1,
            "text": "Literally big if true",
            "title_similarity": "0.21114883",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2arepq",
            "score": 1,
            "text": "I guess information really does matter",
            "title_similarity": "0.251968",
            "sentiment_compound": 0.0972
        },
        {
            "id": "i2arm4i",
            "score": 1,
            "text": "Does this explain why I get lightheaded when I stand up?",
            "title_similarity": "0.27396098",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2arqlr",
            "score": 1,
            "text": "So my random Reddit posts ARE material matter!\n\nScience!",
            "title_similarity": "0.5351927",
            "sentiment_compound": 0.1739
        },
        {
            "id": "i2as1gq",
            "score": 1,
            "text": "Is that intro paragraph suggesting photons are the remnants of erased information? Cool\n\nEdit: *some* photons",
            "title_similarity": "0.49523085",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i2ase05",
            "score": 1,
            "text": "Still doesnt explain how some people can be this Dense. \n\nBadum tss. I know its off topic, but i still wanted to share the word pun, which makes it relevant. Love you mods",
            "title_similarity": "0.35283688",
            "sentiment_compound": 0.8625
        },
        {
            "id": "i2asl57",
            "score": 1,
            "text": "Tesla believed something similar, that thoughts have matter.",
            "title_similarity": "0.610679",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i2ato13",
            "score": 1,
            "text": "Looking forward to calling people who believe disinformation \"lower dimensionals\"",
            "title_similarity": "0.3078363",
            "sentiment_compound": -0.296
        },
        {
            "id": "i2au16z",
            "score": 1,
            "text": "Atoms are empty. Matter has never been found.",
            "title_similarity": "0.18951796",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i2au608",
            "score": 1,
            "text": "Who needs psychedelics when you can do math and mind blow yourself. I hate what I dont know. Math.",
            "title_similarity": "0.43443215",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i2auu8b",
            "score": 2,
            "text": "Sounds like the kind of discovery I shock the world with in my weed dreams",
            "title_similarity": "0.39202008",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i2avieg",
            "score": 5,
            "text": "I read the article and it's complete garbage. The energy that they hypothesize exists after the collision (an extremely well known, and heavily studied collision) and that contains this \"information\" doesn't exist outside of their random change in the energy calculation. In other words, out of nowhere, they add variables to the energy calculation and say that it must exist after an electron-positron collison. Those two photons that they are looking for arenessentially non-existent, even in theory.",
            "title_similarity": "0.62381303",
            "sentiment_compound": 0.4005
        },
        {
            "id": "i2avyrq",
            "score": 1,
            "text": "Isn't that another thing that shows we are living in a simulation?",
            "title_similarity": "0.46534237",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2aw3zi",
            "score": 1,
            "text": "My head does feel lighter now days actually",
            "title_similarity": "0.17771119",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2aweug",
            "score": 1,
            "text": "Silly question, but would that also imply that part of the mass of our bodies is from the mass of information? (even if it isn't recognisable)",
            "title_similarity": "0.46146554",
            "sentiment_compound": 0.0129
        },
        {
            "id": "i2awok5",
            "score": 1,
            "text": "Oh yes! I see blockchain in a cloud.",
            "title_similarity": "0.25796986",
            "sentiment_compound": 0.4574
        },
        {
            "id": "i2awon1",
            "score": 1,
            "text": "This post is dumb af, you could literally change it to a physicist has designed an experiment to prove if unicorns are real. Just because there is a experiment doesnt mean its true and if it's not true it doesn't matter.",
            "title_similarity": "0.5559205",
            "sentiment_compound": -0.7928
        },
        {
            "id": "i2axefm",
            "score": 1,
            "text": "Information is dark matter",
            "title_similarity": "0.25586796",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i2axmgi",
            "score": 1,
            "text": "So where does disinformation and Trump-speak fit into this?",
            "title_similarity": "0.35727805",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2axxk2",
            "score": 3,
            "text": "This seems like BS. The author invokes temperature to figure out how much the information mass should be, when temperature is fundamentally a property of a system, not a particle. Even if the mass is what you expect, why would you expect it to produce separate photons? What causes them to take different trajectories from the gamma photons?",
            "title_similarity": "0.6005571",
            "sentiment_compound": 0.4329
        },
        {
            "id": "i2ay1tn",
            "score": 1,
            "text": "Something falls into a black hole, time is frozen at the edge of the hole so an image of the object stays there, forever recording the information of what went into the hole and  protecting the law of conservation of energy.\n\nOr the double slit photon experiment, whereby the addition of information (recording a result) changes the outcome of the experiment. It may not have mass directly but information effects mass at the boundary of atomic and sub-atomic physics.",
            "title_similarity": "0.7056161",
            "sentiment_compound": 0.1406
        },
        {
            "id": "i2ay39h",
            "score": 1,
            "text": "If it is a matter it can be taxed.....hello Meta, hello Alphabet.....",
            "title_similarity": "0.31659025",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i2ayakc",
            "score": 2,
            "text": "So, energy.  Not information.  Pretty stupid.",
            "title_similarity": "0.14271072",
            "sentiment_compound": 0.3067
        },
        {
            "id": "i2aynvf",
            "score": 2,
            "text": "Yes, sunlight has code inside of it.",
            "title_similarity": "0.29707566",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2azfbn",
            "score": 2,
            "text": "I'm not fat, I'm well read.",
            "title_similarity": "0.18725203",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i2azm14",
            "score": 1,
            "text": "Hence why Jules said “check out the big brain on Brad” because he sensed the information they were after.",
            "title_similarity": "0.5512495",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b0k9z",
            "score": 1,
            "text": "I thought experiments just added support to a hypothesis or theory. How can an experiment prove itself correct?",
            "title_similarity": "0.5856068",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2b0qqk",
            "score": 1,
            "text": "By the way, If this is confirmed to be true. Then it's pretty confirmed that we live in a simulation",
            "title_similarity": "0.47680807",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i2b0wyt",
            "score": 1,
            "text": "I wonder if we will find that misinformation is exponentially more heavy than information.",
            "title_similarity": "0.3878289",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i2b189v",
            "score": 1,
            "text": "So, in a nutshell, simulation theory is real.",
            "title_similarity": "0.3668065",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b2ilm",
            "score": 1,
            "text": "I thought a 5th form of matter was already discovered at absolute zero",
            "title_similarity": "0.52604914",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i2b2z56",
            "score": 1,
            "text": "yeah, many cultures knew…",
            "title_similarity": "0.22056952",
            "sentiment_compound": 0.296
        },
        {
            "id": "i2b3uw1",
            "score": 1,
            "text": "How long until it’s considered racist? Asking on behalf of math.",
            "title_similarity": "0.42106876",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i2b3v73",
            "score": 1,
            "text": "It isn’t information; it’s perception.",
            "title_similarity": "0.10331339",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b4mds",
            "score": 1,
            "text": "Didn’t someone already weigh an iPod with tunes and it weighs more than a blank one?",
            "title_similarity": "0.37093988",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b4s7y",
            "score": 1,
            "text": "Could we skip interacting with the physical particle and go straight to manipulating this information property, thereby altering the particle itself?",
            "title_similarity": "0.4827489",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i2b5fl2",
            "score": 1,
            "text": "This may get buried in the comments, but can anyone ELI5 this to me? What’s the importance of it?",
            "title_similarity": "0.40477136",
            "sentiment_compound": 0.5588
        },
        {
            "id": "i2b5h1s",
            "score": 1,
            "text": "I think articles like this are missleading because most people think of information different than physicists so people are more missinformed about the topic afterwards.",
            "title_similarity": "0.41120392",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2b5jg3",
            "score": 1,
            "text": "Perhaps dark matter is information",
            "title_similarity": "0.37455612",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i2b5khl",
            "score": 1,
            "text": "Sounds like a good argument for the simulation theory",
            "title_similarity": "0.38836035",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2b5zyn",
            "score": 1,
            "text": "If proven true, what are the implications? I’m not very familiar with this level of physics.",
            "title_similarity": "0.4921177",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2b60ci",
            "score": 1,
            "text": "We want…information. Information….information.\nI am not a number! I am a free man!",
            "title_similarity": "0.2758929",
            "sentiment_compound": 0.5664
        },
        {
            "id": "i2b65ic",
            "score": 1,
            "text": "Just when I start understanding chemistry and physics we are possibly going to have an entire new branch of it and I’m preparing my brain to be turned into mush.\n\nInformation overload (no pun intended)",
            "title_similarity": "0.6517136",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i2b67aj",
            "score": 1,
            "text": "If this experiment is true, would it mean that time travel backwards is completely impossible as the information in the past is eventually destroyed?\n\nThis would go against the general relativity theory right?\n\nIs that the big of a deal as i think it is?\n\nPD: i have little to none understanding of quantum and relativistic phisics.",
            "title_similarity": "0.5669335",
            "sentiment_compound": -0.2359
        },
        {
            "id": "i2b6li2",
            "score": 1,
            "text": "So engrams from destiny are real?  Neat",
            "title_similarity": "0.38266015",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2b6tf1",
            "score": 1,
            "text": "Is this the code for the simulation people are thinking we live in now?",
            "title_similarity": "0.5450095",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b6xhj",
            "score": 1,
            "text": "Imagine what mass would become if you could change the information of mass.",
            "title_similarity": "0.417515",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b7hrd",
            "score": 1,
            "text": "“If proved correct…”\n\nReally glosses over that an experiment being proven correct is the tricky part.",
            "title_similarity": "0.48722202",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i2b7ods",
            "score": 1,
            "text": "I always wondered why computers need hard drives and if computer info actually took up physical space or if there was a different reason.",
            "title_similarity": "0.5534787",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i2b7py7",
            "score": 1,
            "text": "People design all kinds of experiments. A lot of ifs here still.",
            "title_similarity": "0.48292503",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b85px",
            "score": 1,
            "text": "Literally just the observer phenomenon",
            "title_similarity": "0.21330863",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b85vk",
            "score": 1,
            "text": "Douglas C Adams was right all along.  The universe is a quantum computer.  42.",
            "title_similarity": "0.617498",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b8b6j",
            "score": 1,
            "text": "Light can transmit information and photons have no mass, so how is information a separate form of matter?",
            "title_similarity": "0.31600502",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i2b8fmm",
            "score": 1,
            "text": "Terry Pratchett fans already know the equation...",
            "title_similarity": "0.36146122",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b8l65",
            "score": 1,
            "text": "So would this prove by proxy that our thoughts and ideas exist somewhere outside of our brains until we use them?",
            "title_similarity": "0.43041658",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b8rwo",
            "score": 2,
            "text": "Is this a case of oversimplified reporting? Information having physical mass doesn't sound right: photons can carry information and they're massless particles...",
            "title_similarity": "0.4409535",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b8s6d",
            "score": 1,
            "text": "Water has memory. Olaf was right.",
            "title_similarity": "0.2512794",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b94io",
            "score": 1,
            "text": "Sooooo we are in a simulation?",
            "title_similarity": "0.38129383",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2b95ug",
            "score": 1,
            "text": "For a layman how would it make sense?\n\nIsn't the information always there with the particle at a fundamental level\n\nHow'd you measure the difference information makes?\n\nLike an electron will always have spin information associated with it as long as it exist . How'd you measure the mass/ energy that spin adds?\n\nIt's not like you can take away the spin from electron and still call it electron. How would you even take away the information anyways",
            "title_similarity": "0.69491744",
            "sentiment_compound": 0.4642
        },
        {
            "id": "i2b9d1a",
            "score": 1,
            "text": "I can formulate an experiment take 2 books in one book write out some meaning equation, in the other copy the same amount of text from 50 shades of grey. If the meaningful equation book wieghs more then the experiment is proved true",
            "title_similarity": "0.5496925",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i2b9msd",
            "score": 1,
            "text": "So I don’t think schools outside of higher education are even really teaching about plasma yet, is it possible for elements to transition from the other three forms into plasma? Or is plasma its own exclusive thing? If they can transition between solid, liquid, gas, and plasma; then surely somehow information would also fit in there?",
            "title_similarity": "0.57216144",
            "sentiment_compound": 0.7929
        },
        {
            "id": "i2b9vfc",
            "score": 1,
            "text": "What in physics green earth happened to all the comments",
            "title_similarity": "0.49996996",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ba145",
            "score": 1,
            "text": "The way I'd explain this is that it has particular implications to the math that have already been hinted at. This really isn't a shocker and is more just taken for granted today.",
            "title_similarity": "0.43322086",
            "sentiment_compound": 0.4034
        },
        {
            "id": "i2ba20k",
            "score": 3,
            "text": "Wow, does this explain why the double slit experiment results change with observation / no observation?",
            "title_similarity": "0.5018605",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i2bahqm",
            "score": 3,
            "text": "Hinduism has been stating this, in more esoteric terms, for literally thousands of years. It’s called the Akash and it’s something like an information superhighway.",
            "title_similarity": "0.5084307",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2bas2q",
            "score": 1,
            "text": "Hence the conservation of energy. This is true since our information is sent into the universe manifested in waves of energy that will travel infinitum. \nTo this I offer an except from “A River Runs Through It” \n“Eventually, all things merge into one, and a river runs through it. The River was cut by the world’s greatest flood and runs over rocks from the basement of time. On some of those rocks are timeless raindrops. Under the rocks are the words, and some of the words are theirs.”\n\nSeems apropos",
            "title_similarity": "0.46913788",
            "sentiment_compound": 0.8442
        },
        {
            "id": "i2bbtph",
            "score": 1,
            "text": "How would this impact the interpretations of the double-slit experiment?",
            "title_similarity": "0.41469043",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bcbc8",
            "score": 1,
            "text": "I keep talking about information being an inherent part of the universe for a while. Especially concerning information processing + mass reaching and matching the speed of light. It's the limit the universe can process interactions between forces? It'd be interesting to see where this goes.",
            "title_similarity": "0.6919591",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i2bcvit",
            "score": 1,
            "text": "Data: Mostly random values that mean very little on its own.\n\nInformation: When data is arranged in a way that is understandable and useful. \n\nIs this new form a matter actually data or information? There is a vast difference. If it's actually information then that is amazing. If its data, then it's not surprising at all.",
            "title_similarity": "0.4166485",
            "sentiment_compound": 0.8265
        },
        {
            "id": "i2bd6r0",
            "score": 1,
            "text": "the matrix movies are visually impressive period films \n\nthat is all\n\n\n\n- this concludes today's message\n  from the biology department",
            "title_similarity": "0.5374813",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2bde1s",
            "score": 1,
            "text": "Umm…whaaauuut? No need to respond. I will survive my lack of intelligence on the subject. I wish I were smart so I wouldn’t have to work so hard, ha ha! Have a wonderful day.",
            "title_similarity": "0.3198645",
            "sentiment_compound": 0.8691
        },
        {
            "id": "i2be5la",
            "score": 1,
            "text": "someone please post a short n’ sweet of what “information” means in this context. \n\nall kinds of takes happening in this comments section",
            "title_similarity": "0.24341306",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i2beywj",
            "score": 1,
            "text": "So dark matter is the unknown?",
            "title_similarity": "0.25501406",
            "sentiment_compound": 0.0972
        },
        {
            "id": "i2bf2ck",
            "score": 1,
            "text": "Finally; an explanation for why my bmi is so high!",
            "title_similarity": "0.4021669",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bfade",
            "score": 1,
            "text": "How can it be the fifth form of matter when there are already like 30 states of matter.\n\nThere are 4 fundamental states of matter. But, you can't call information a fundamental state of matter period. The fundamental states of matter are all associated with pressure and temperature.",
            "title_similarity": "0.5873155",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i2bfi8x",
            "score": 1,
            "text": "This makes absolutely no sense to me!",
            "title_similarity": "0.09154945",
            "sentiment_compound": -0.4186
        },
        {
            "id": "i2bgu8k",
            "score": 1,
            "text": "The \"hard problem\" of consciousness. Basically information stacks. Self referencial information is the beginning of consciousness.",
            "title_similarity": "0.5007316",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2bhft5",
            "score": 1,
            "text": "Where do we stand with photons? Particles or waves?",
            "title_similarity": "0.4173751",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bhl53",
            "score": 1,
            "text": "I understand this. When I’m learning something new I can feel the information downloading in my brain. Sounds crazy but it’s true.",
            "title_similarity": "0.48504382",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2bhq7n",
            "score": 1,
            "text": "So, under what genre of scientific research is this experiment? Quantum physics?",
            "title_similarity": "0.6705321",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bht6i",
            "score": 1,
            "text": "Don't we know that computer memory increases in weight with more files on it?",
            "title_similarity": "0.40286493",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bhyx8",
            "score": 1,
            "text": "Makes sense to me, I've always felt that, if everything has a \"recipe\" so to speak, then the fundamental building block of the universe isn't the matter in it, it's the recipe to MAKE the matter in it.",
            "title_similarity": "0.566529",
            "sentiment_compound": -0.4356
        },
        {
            "id": "i2bi0zi",
            "score": 1,
            "text": "Isn’t information just thought though? I’m very far away from understanding this but I’d like to know more",
            "title_similarity": "0.35617387",
            "sentiment_compound": 0.5023
        },
        {
            "id": "i2bi7ft",
            "score": 1,
            "text": "What's the technical definition of \"information\" being used here?",
            "title_similarity": "0.34156114",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bioag",
            "score": 1,
            "text": "Here is my 5th grader take away.\nGenerally one thinks of particles as generating information. \nThis theory proposes that information generates particles.\n\nThat is to say that particles are literally the bits of information we have been using to describe their state.",
            "title_similarity": "0.66688824",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bj52d",
            "score": 1,
            "text": "A bit of background information: \n\n- Electrons are mass carrying particles and photons are force carrying particles. Matter and energy are made of particles. \n\n- States of matter: Solids, liquids, gases and plasma. \n\n- Neither energy nor matter can be created or destroyed, just transferred / changed. \n\n- When matter and anti-matter collide they are destroyed *but* are converted into energy. \n\n--- \n\nColliding an electron and a positron is how they plan to test this idea, because they can then see what particles remains after they collide the electrons  ( which will destroy matter and leave the energy particles behind which will be inside a proton). They hope to find a low energy proton containing the electrons information. \n\nWe already know that information can be and is stored in cells, and that information requires energy to move so they think information would be stored in a photon inside that electron and that the information is what tells the electron how to behave. \n\nWhether information is matter really depends in whether or not it has mass which is interesting and I think probably false. A photon doesn't have mass itself but it can carry particles which do have mass. \n\nI think information likely doesn't have mass and is not matter, but rather that energy organizes matter which is essentially information. If I had to guess Id say that information is how atoms react to energy and that information is a reaction rather than an actual new thing:  Information being a byproduct of atoms and energy interacting, maybe telling the atom how to behave based on the characteristics of the energy. I think this is more likely based on how we and everything interact with energy, and that matter is required in order for that reaction to take place rather than information being matter itself. \n\nAdditional energy and matter must also be present to move energy. If energy and matter react to eachother, in order for that information to move, energy must be available, which again is a reaction of energy amd matter.",
            "title_similarity": "0.6283392",
            "sentiment_compound": 0.9852
        },
        {
            "id": "i2bjouh",
            "score": 1,
            "text": "“The entire knowledge of the universe is already stored in your brain. You just need someone to remind you it’s there.”",
            "title_similarity": "0.49699593",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bjwqd",
            "score": 1,
            "text": "Finally, one step closer to acknowledging the aethereal plane.",
            "title_similarity": "0.35978246",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bk6yw",
            "score": 1,
            "text": "I know a lot of movie trivia facts. Is that why I’m fat?",
            "title_similarity": "0.40982366",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bkt5w",
            "score": 1,
            "text": "Knowledge is truly now power! Try the all-new brain engine!",
            "title_similarity": "0.48160857",
            "sentiment_compound": 0.5399
        },
        {
            "id": "i2bl0o8",
            "score": 1,
            "text": "this just sounds like garbage",
            "title_similarity": "0.08084379",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2blgq9",
            "score": 1,
            "text": "I didn’t read everyone’s comments but I immediately thought of an experiment - could the theory here be proven by some kind of clone situation? Details: identical living organisms who’s life spans are the same but who’s interactions with their environments is different - say 1 normal and 1 complete sensory deprivation. Then measure their mass. Wouldn’t that prove what’s being discussed? Information has mass.",
            "title_similarity": "0.64489174",
            "sentiment_compound": -0.6199
        },
        {
            "id": "i2blnva",
            "score": 1,
            "text": "but theirs no information without consciousness so shouldn’t consciousness be the the fifth form of matter?",
            "title_similarity": "0.6594999",
            "sentiment_compound": -0.3919
        },
        {
            "id": "i2blpwd",
            "score": 1,
            "text": "Solid, liquid, gas, and plasma are the four recognized states of matter. Since the article cites Claude Shannon, I assume he is working with the same notion of information as I am. While matter can be used to store information, I do not think it could count as a fifth state of matter. Arranging matter into a form that carries information, such as moving beads on an abacus or copying a file to a flash drive, does not change the physical medium to a different state of matter.",
            "title_similarity": "0.6356593",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2bluju",
            "score": 1,
            "text": "Information huh? So big day for the religious people!",
            "title_similarity": "0.31107914",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bmkdr",
            "score": 1,
            "text": "I'm not sure I understand the paragraph about \"measuring 1TB of information\" by comparing the difference in a storage device -- is the expectation that it would have a different temperature or weight? If that's the case, my main issue with that is that even if the hard drive was erased of \"information\", that in itself is information. \"0\" is information just as much as \"1\" is - it shouldn't ever change perceptibly (outside of the physical properties that define 1 vs 0) in a way that can be measured --- right?",
            "title_similarity": "0.5178287",
            "sentiment_compound": -0.4063
        },
        {
            "id": "i2bmll7",
            "score": 1,
            "text": "That some batshit right there.  It's right up there with a wizard in the sky who happens to look just like us.  Of course everything \"contains\" information, but it's a tree falling in the woods.  Someone has to hear it for it for that sound to exist.",
            "title_similarity": "0.30387056",
            "sentiment_compound": -0.0387
        },
        {
            "id": "i2bmsmx",
            "score": 1,
            "text": "Ok so you got a particle accelerator then you manage a way to read the brain with neuro sensors. Maybe even musk nuro-link. Have the data it reads directed into the accelerator somehow to alter the particle and make it not random. The kicker is you don't try to alter anything. You have the person do something that makes the brain highly active such as learning or doing some kind of studying. Hell throw in lsd to see if it kick off any better. Boom now you might have a directed not random particle accelerator. Also I am just throwing this out for fun. I have no idea of the science behind all this. I love learning though.",
            "title_similarity": "0.6473729",
            "sentiment_compound": 0.8313
        },
        {
            "id": "i2bnget",
            "score": 1,
            "text": "I know I’m literally too dumb to understand how a phone works and if I can build and repair one so if someone who goes out of their way to prove and hypothesize stuff like this I’ll believe it wholeheartedly",
            "title_similarity": "0.426097",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i2bnm4k",
            "score": 1,
            "text": "So is Disinformation Anti Matter ?",
            "title_similarity": "0.22220726",
            "sentiment_compound": -0.3535
        },
        {
            "id": "i2bo403",
            "score": 1,
            "text": "So where does this put language?",
            "title_similarity": "0.123001635",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bolcl",
            "score": 1,
            "text": "Using the word \"information\" confused a lot of people.",
            "title_similarity": "0.29049468",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i2bpxez",
            "score": 1,
            "text": "So bose-einstien condensate and fermionic condensate are not states of matter?",
            "title_similarity": "0.3995915",
            "sentiment_compound": -0.0191
        },
        {
            "id": "i2bqlck",
            "score": 1,
            "text": "It turns out the deepest most profound information at the end of the impossibly complex quantum tangle proves to be a cheat code for the original super Mario brothers level four.",
            "title_similarity": "0.59593487",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i2bri3x",
            "score": 1,
            "text": "I feel there’s a “Fart Smeller” joke in here, hidden in the math.",
            "title_similarity": "0.43048477",
            "sentiment_compound": 0.296
        },
        {
            "id": "i2brjbx",
            "score": 1,
            "text": "Imagine a ball of information and what we could do with it",
            "title_similarity": "0.30887094",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bs1hr",
            "score": 1,
            "text": "So if they do discover extra photons then what does that mean? What can be done with that?",
            "title_similarity": "0.56297386",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bt1z0",
            "score": 1,
            "text": "information is  intangible",
            "title_similarity": "0.20038079",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bti69",
            "score": 1,
            "text": "Is this like a proof for simulation theory?",
            "title_similarity": "0.46046263",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2btjaz",
            "score": 1,
            "text": "Does this relate in anyway to Shannon Information Theory?  Didn't Shannon use all sorts of statistical arguments that are similar to stat mech that is behind thermodynamics in order to come up with the theorems that govern information theory?",
            "title_similarity": "0.6235112",
            "sentiment_compound": -0.4696
        },
        {
            "id": "i2bu1tf",
            "score": 1,
            "text": "So Warren Ellis had it right in Planetary? We’re the three dimensional representation of a two dimensional data universe (or something like that)?",
            "title_similarity": "0.57822704",
            "sentiment_compound": 0.4329
        },
        {
            "id": "i2bvzvr",
            "score": 1,
            "text": "And the question is , can we build the Grid from the Tron?",
            "title_similarity": "0.43949488",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bw1pa",
            "score": 1,
            "text": "In physics, 'Information' is the meaning ascribed to an irregular pattern that manifests in mass, energy or both. As such, there is no doubt a correlation between mass, energy and 'information'. Whether it has a meaning beyond what we make it to be it's anyone's guess.",
            "title_similarity": "0.6651152",
            "sentiment_compound": 0.6497
        },
        {
            "id": "i2bw3uh",
            "score": 2,
            "text": "I’m not fat, I just know a lot of trivia",
            "title_similarity": "0.33430254",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bx5wl",
            "score": 1,
            "text": "So reading makes me gain mass. That’s why I’m fat and that information makes my head hurt.",
            "title_similarity": "0.33720097",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2bxh1e",
            "score": 1,
            "text": "Wait….\n\nWouldn’t this kinda prove Lee Cronins „Assembly Theory“ ?\n\nPlease don’t be mad at me I’m just a shmock who recently heard him on the Lex Fridman Podcast where he talked about how in his opinion the universe is related to a sort of „memory“. Couldn’t that „memory“ be the information held by the universe ? A coherent mass which holds all information ?",
            "title_similarity": "0.7326704",
            "sentiment_compound": -0.3485
        },
        {
            "id": "i2bzbdc",
            "score": 1,
            "text": "Does that mean that smarter people are heavier? If the experiment is proven correct…",
            "title_similarity": "0.4254174",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2bzu1z",
            "score": 1,
            "text": "So what are some potential sci-fi technologies we could get if this were confirmed??",
            "title_similarity": "0.51298743",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2c1p3o",
            "score": 1,
            "text": "L-space. Sir Terry was right all along.",
            "title_similarity": "0.32034564",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2c34tb",
            "score": 1,
            "text": "Anybody who's ever had to shlep a coursebook all day will immediately agree.",
            "title_similarity": "0.31545326",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2c4h9u",
            "score": 1,
            "text": "No matter how much the devs optimize, our simulation still shipped with some variable properties attached to us so that we can be changed in real time, and that takes up a small amount of memory.\n\nChecks out.",
            "title_similarity": "0.5056652",
            "sentiment_compound": 0.4812
        },
        {
            "id": "i2c4qo6",
            "score": 1,
            "text": "I’m looking forward to seeing how Deepak Chopra will spin this",
            "title_similarity": "0.32144392",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2c6jh6",
            "score": 1,
            "text": ">\tthe Landauer principle has been extended to the Mass–Energy–Information (M/E/I) equivalence principle.11 The M/E/I principle states that information is a form of matter, it is physical, and it can be identified by a specific mass per bit while it stores information or by an energy dissipation following the irreversible information erasure operation, as dictated by the Landauer principle.5,6 The M/E/I principle has been formulated while strictly discussing digital states of information. However, because Shannon’s information theory is applicable to all forms of information systems and it is not restricted only to digital states, the author extrapolated the applicability of the M/E/I principle to all forms of information, proposing that information is the fifth state of matter.\n\n>\tThe first proposed experiment to test the M/E/I equivalence principle involved the measurement of the mass change in 1 Tb data storage device before and after the digital information is completely erased.11 At room temperature, the calculated mass change for this experiment is in the order of ∼10−25 kg, making the measurement unachievable with our current technologies.\n\nIt’s so crazy, if we can establish information as a state of matter!",
            "title_similarity": "0.6125026",
            "sentiment_compound": -0.1591
        },
        {
            "id": "i2c73yd",
            "score": 1,
            "text": "He’s done it he’s about to discover the engram (Destiny reference)",
            "title_similarity": "0.42344296",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2c8l68",
            "score": 1,
            "text": "Well it has mass in the 5'th dimension and as something that takes energy in our brain.",
            "title_similarity": "0.5861877",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i2c99oj",
            "score": 1,
            "text": "Sounds more philosophical than real.",
            "title_similarity": "0.27929157",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2c9e32",
            "score": 1,
            "text": "Oh great, The Legendary Mechanic is real, marvelous.",
            "title_similarity": "0.4210449",
            "sentiment_compound": 0.8402
        },
        {
            "id": "i2c9rgx",
            "score": 1,
            "text": "I recall reading that if time suddenly started flowing backwards, the every particle can remember it's past motion(s).  If that piece of information is lost then that particle no longer can do that.  It can no longer go forward in time either.  Poor chap...",
            "title_similarity": "0.48080865",
            "sentiment_compound": -0.8316
        },
        {
            "id": "i2ca16h",
            "score": 1,
            "text": "If mass is energy and information has mass, then knowledge is power, literally!",
            "title_similarity": "0.4898484",
            "sentiment_compound": 0.3382
        },
        {
            "id": "i2cjxai",
            "score": 1,
            "text": "I wish I was a smart person like people who get paid to work on stuff like this.",
            "title_similarity": "0.37625146",
            "sentiment_compound": 0.8555
        },
        {
            "id": "i2cnjlp",
            "score": 1,
            "text": "I wish people spend more energy on this type of information. \n\nThank you for sharing.",
            "title_similarity": "0.31795126",
            "sentiment_compound": 0.8553
        },
        {
            "id": "i2coh79",
            "score": 1,
            "text": "This means that, similar to other forms of matter, if you pack enough information into a small enough space you make a black hole and event horizon.\n\nThis kind of black hole is called a 'Lecture'.",
            "title_similarity": "0.5747535",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i2cq86r",
            "score": 1,
            "text": "Kind of explains the Force.",
            "title_similarity": "0.3119103",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2cqqor",
            "score": 1,
            "text": "My brain hurts just reading that. I love it",
            "title_similarity": "0.27817586",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2csfro",
            "score": 1,
            "text": "I'm not fat, I'm just well informed.",
            "title_similarity": "0.16866863",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2d43cc",
            "score": 1,
            "text": "About time! Everything, be it theoretical ( like a thought or a feeling) or tangible is aware of its own existence. A knob is aware of existing as a knob. Embedded within the whole description of/information about itself. No more, unless expanded via contact (with a door, becoming doorknob and completing the door).  \nConsciousness is an upgrade of it, the ability to perceive/be aware of anything across distances.",
            "title_similarity": "0.4795193",
            "sentiment_compound": 0.5255
        },
        {
            "id": "i2d6xkd",
            "score": 1,
            "text": "What kind of information can it carry exactly? And is it only binary?\n\nEDIT:\n\nBecause since there is the theory that the amount of info a photon can carry is infinite, couldn’t scientists “load” photons up information? And if so, how would one extract information?",
            "title_similarity": "0.61591136",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2damas",
            "score": 1,
            "text": "Seems like this would violate the conservation of quantum information principle and the 'no-hiding' theorem.",
            "title_similarity": "0.42189568",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i2e4sgi",
            "score": 2,
            "text": "Does this add credence to the holographic simulation theory?",
            "title_similarity": "0.46529517",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2elxwz",
            "score": 1,
            "text": "Ahh quantum physics, fun and being absolutely bonkers and almost magic",
            "title_similarity": "0.52339506",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2laizp",
            "score": 2,
            "text": "Isn't everything just the information fundamentally?",
            "title_similarity": "0.4002417",
            "sentiment_compound": 0.0
        },
        {
            "id": "i329ztv",
            "score": 1,
            "text": "Do you guys realize that all those rumors about a slight loss of weight during death could actually be our information being destroyed? Go ahead share this idea. I'll wait right here.",
            "title_similarity": "0.47129852",
            "sentiment_compound": -0.785
        },
        {
            "id": "i5h0izv",
            "score": 1,
            "text": "That's why i love science",
            "title_similarity": "0.44417676",
            "sentiment_compound": 0.6369
        }
    ]
}