{
    "Nearly half of all older adults now die with a diagnosis of dementia listed on their medical record, up 36% from two decades ago, new study shows\n": [
        {
            "id": "i30hymh",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue to be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.33568507",
            "sentiment_compound": 0.7088
        },
        {
            "id": "i30jp3w",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i318odq",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i30n8tq",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i30o6cz",
            "score": 0,
            "text": "Increased seed oil diet",
            "title_similarity": "0.069579765",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i31a45l",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i30qnfn",
            "score": -4,
            "text": "I think aluminum is a huge factor. We used it insanely over the last 30-40 years yet it's been linked to dementia.",
            "title_similarity": "0.7231677",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i30skl0",
            "score": 0,
            "text": "higher life expectancy.",
            "title_similarity": "0.06095121",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30o5n9",
            "score": -10,
            "text": "The boomers were very into cocaine and other hard drugs. So I don't see this as a surprise.",
            "title_similarity": "0.23117104",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i30slwo",
            "score": 1,
            "text": "Could be that people get older,  ould be that most water supplies, food sources and pharmaceuticals are poisoned with disgusting chemicals on purpose",
            "title_similarity": "0.5641215",
            "sentiment_compound": -0.765
        },
        {
            "id": "i30sl0f",
            "score": 5,
            "text": "Boomers were exposed to much higher levels of lead in he atmosphere during their early childhood than their parents or their kids.  And lead poisoning in infants is strongly correlated with dementia later in life.\n\nOn the up side, GenX like me and those younger are likely to reverse this trend.",
            "title_similarity": "0.63311505",
            "sentiment_compound": -0.128
        },
        {
            "id": "i3119cz",
            "score": 2,
            "text": "Exercise and maintain a good sleep schedule and make sure you take probiotics and keep your gut biome healthy. Take lions mane mushroom and multivitamins.  Try to learn an instrument or different language and just maybe you might make it out of this world with a clear head.",
            "title_similarity": "0.26342547",
            "sentiment_compound": 0.8591
        },
        {
            "id": "i30lx8l",
            "score": 24,
            "text": "Antibiotics and better health care in general have extended lifespans beyond the design life of neurons. Just as older people are more prone to infections, bone deteriorization, muscle atrophy, and loss of skin elasticity; so are they more prone to neural degeneration.",
            "title_similarity": "0.5301993",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i311919",
            "score": 3,
            "text": "Lots of good guesses that could all be related, but I can share something that has been proven to have a correlation. The over-the-counter sleep aid and anti-histamine Diphenhydramine (Benadryl, and the active ingredient in most sleep aids, it can also be used for insomnia, symptoms of the common cold, tremor in Parkinsonism, and nausea) has been show to increase risk of dementia and impair cognitive functions, especially in the elderly. \n\n[Alzheimer’s Drug Discovery Foundation’s paper on Diphenhydramine (e.g., Benadryl)](https://www.alzdiscovery.org/uploads/cognitive_vitality_media/Diphenhydramine-Cognitive-Vitality-For-Researchers.pdf)\n>Evidence Summary\n\n>Diphenhydramine may improve sleep but tolerance develops quickly and may disrupt cognitive functions including memory. Long-term use of anticholinergic drugs is associated with increased dementia risk.\n\n>Potential harm to the brain: Long-term anticholinergic use has been associated with increased dementia risk; diphenhydramine can impair many cognitive functions including memory.\n\n>Aging and related health concerns: Diphenhydramine may improve sleep but it is unlikely to increase slow-wave sleep; because of increased risk for greater adverse effects, it is listed as inappropriate for use in older adults based on the Beer’s criteria.\n\nThis paper was released in 2017, but it’s still widely prescribed to the elderly in the US.",
            "title_similarity": "0.51813066",
            "sentiment_compound": 0.946
        },
        {
            "id": "i31be50",
            "score": 0,
            "text": "So what became really common and popular about twenty years ago? As armchair scientists I have faith we can totally figure this out. \n\nMy vote is the internet becoming more mainstream and the amount of people staring at screens all day. \n\nBut really, there has to be something that changed.",
            "title_similarity": "0.5329139",
            "sentiment_compound": 0.4464
        },
        {
            "id": "i31fj5a",
            "score": 0,
            "text": "Microplastics in the blood stream is my guess.",
            "title_similarity": "0.24779266",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31gc9k",
            "score": 0,
            "text": "I would take this with a grain of salt. It’s a very easy diagnosis to use even if not the cause of death. My dad coded in the middle of the night and the cause of death per death certificate: Dementia. He never had dementia. I was too devastated to try and find out what actually happened. :-/",
            "title_similarity": "0.5028629",
            "sentiment_compound": -0.9404
        },
        {
            "id": "i31vqjl",
            "score": 0,
            "text": "I’d be willing to correlate this with a longer lifespan being common in the modern day. The longer people live, the more of a chance they have to develop mental deterioration like that.",
            "title_similarity": "0.35216665",
            "sentiment_compound": 0.5809
        },
        {
            "id": "i31x2en",
            "score": 0,
            "text": "there’s probably more now because other adult doctors doing the research can set reminders to count how many people have dementia instead of forgetting like usual",
            "title_similarity": "0.594103",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i321q9b",
            "score": 0,
            "text": "Are we better at detection before and after death, or has there been a variable change that’s causing this?",
            "title_similarity": "0.2130228",
            "sentiment_compound": -0.25
        },
        {
            "id": "i32r1w0",
            "score": 0,
            "text": "I blame this on the cardiologists of the late 1980’s and early 90s. They were so good that ordinary folks who should have died in their late 50s or 60s made it into their 70’s and 80’s just to forget it all. Goddamn cardiologists",
            "title_similarity": "0.6062588",
            "sentiment_compound": -0.7398
        },
        {
            "id": "i32sqn5",
            "score": 0,
            "text": "a growing older population ?",
            "title_similarity": "0.24028921",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i336rnl",
            "score": 0,
            "text": "We aren’t meant to live so long.",
            "title_similarity": "0.1463257",
            "sentiment_compound": 0.0
        },
        {
            "id": "i33ixe7",
            "score": 0,
            "text": "Never gonna get the boomers to approve of funding for research they won’t be around to benefit from. This has been the problem the entire time",
            "title_similarity": "0.34162652",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i30urcf",
            "score": 6,
            "text": "All that plastic in their bodies built up over time I guess",
            "title_similarity": "0.23989773",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30knez",
            "score": 11,
            "text": "I'm sure that people living longer and better diagnostic tools have nothing to do with this.",
            "title_similarity": "0.19262165",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i30rzft",
            "score": 6,
            "text": "More sedentary lifestyle?",
            "title_similarity": "0.023795487",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30j1rb",
            "score": 400,
            "text": "The more the average live span goes up, the higher the percentage of old people prone to developing dementia.",
            "title_similarity": "0.6164237",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30irzl",
            "score": -1,
            "text": "Lead from cars is my guess.",
            "title_similarity": "0.11909495",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30qcsv",
            "score": 1,
            "text": "Probly microplastics blocking connections of clogging connections in the brain",
            "title_similarity": "0.18792701",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i30rlp8",
            "score": 1,
            "text": "My guess is a combination of genetics, lifestyle, processed food diets, stress, environmental pollution, and living longer.\n\nI'm 43 and strive to stay fit, eat a very healthy, non processed diet, and keep my brain active with new corners to think around.",
            "title_similarity": "0.32962722",
            "sentiment_compound": 0.659
        },
        {
            "id": "i30ssjm",
            "score": 1,
            "text": "micro plastics, pollution, geo engineering here we come....",
            "title_similarity": "0.040977325",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30yj45",
            "score": 1,
            "text": "I wonder if there is a link to dementia and micro plastics ?",
            "title_similarity": "0.28964454",
            "sentiment_compound": 0.0
        },
        {
            "id": "i310wxp",
            "score": 1,
            "text": "Micro plastics  maybe?",
            "title_similarity": "-0.0453256",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3140un",
            "score": 1,
            "text": "Shouts out micro plastics and alcohol! I’ll NEVER leave you. Where am I?",
            "title_similarity": "0.1510947",
            "sentiment_compound": 0.1129
        },
        {
            "id": "i314519",
            "score": 1,
            "text": "Will they expand this study’s like these to include links between micro-plastics (like PFAS) and dementia?",
            "title_similarity": "0.30599847",
            "sentiment_compound": 0.743
        },
        {
            "id": "i314hg6",
            "score": 1,
            "text": "Welcome to the world of microplastics.",
            "title_similarity": "-0.07029961",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i31czgo",
            "score": 1,
            "text": "Lead in the pipes\n\nAmerica does not care about public health at all \n\nHere are the end results",
            "title_similarity": "0.2406011",
            "sentiment_compound": -0.3875
        },
        {
            "id": "i31deco",
            "score": 1,
            "text": "I’d bet there’s some kind of correlation between this and the article I just saw the other day about the first case of microplastics being found In human blood.",
            "title_similarity": "0.49994257",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31ix6z",
            "score": 1,
            "text": "Can’t wait for the bombshell that microplastics cause dementia and we all dip out",
            "title_similarity": "0.46985048",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31lgoh",
            "score": 1,
            "text": "Can't believe people think that this indicates some awful underlying cause. It's because it's diagnosed more and because PEOPLE ARE LIVING LONGER",
            "title_similarity": "0.3150532",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i31p558",
            "score": 1,
            "text": "I think it’s just a popular diagnosis because it lets people\nCheck out of emotional responsibility for their parents before they die.",
            "title_similarity": "0.3916554",
            "sentiment_compound": -0.128
        },
        {
            "id": "i31pylh",
            "score": -1,
            "text": "Is there not links to dementia and protein plaques in the brain.   Is there not also evidence that fasting,  especially using bouts that put the body into autophagy  help to reduce those plaques reducing the likelihood of dementia.",
            "title_similarity": "0.40191606",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i31v0ac",
            "score": 1,
            "text": "Did the human brain develop too fast or is it something we are doing to ourselve?  (diet, pollution etc) \n\nWe don't see the prevalence of cognitive disease in other species.",
            "title_similarity": "0.30242857",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31wcxn",
            "score": 1,
            "text": "People living longer, rates of dementia  go up",
            "title_similarity": "0.42287707",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32cyf5",
            "score": 1,
            "text": "It’s a sign of progress. Dying with dementia means you lived long enough to get dementia without dying of other diseases.",
            "title_similarity": "0.37173313",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i32pekp",
            "score": 1,
            "text": "Aspartame. Sucralose. Among many other things.",
            "title_similarity": "0.16767585",
            "sentiment_compound": 0.0
        },
        {
            "id": "i33hl3s",
            "score": -1,
            "text": "I must be one of the few people who wouldn't mind dying to dementia. Slowly forgetting who I am and who I know sounds peaceful to me, the only bad part being things like losing control over bodily functions such as the ability to swallow.",
            "title_similarity": "0.36263025",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i30n0hr",
            "score": 58,
            "text": "I believe it's the lack of nutrition and ethics in the food system.",
            "title_similarity": "0.24059929",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i30iw4l",
            "score": 50,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i30soby",
            "score": 5,
            "text": "One problem is that many old folks homes will diagnose dementia and other mental illness to keep patients doped up & docile.",
            "title_similarity": "0.60372436",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i30q6qg",
            "score": 39,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i30pzfc",
            "score": 2,
            "text": "probably because average lifespan is also higher compared to 20 years ago",
            "title_similarity": "0.3562482",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30stvo",
            "score": 2,
            "text": "Maybe it’s all of the roundup which is being used just prior to harvest on virtually all non-organic crops now as a “dry-down” agent and as an infield “preservative”",
            "title_similarity": "0.40839124",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30t9vr",
            "score": 2,
            "text": "Boomer lead poisoning probably, explains alot of what's going on in the world now to",
            "title_similarity": "0.4216872",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i31aprz",
            "score": 2,
            "text": "100% guarantee this has to do with insurance purposes, many places (esp in the mental health field) will not cover your health expenses without a diagnosis. this is the sad reality of american healthcare",
            "title_similarity": "0.59129465",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i31haj4",
            "score": -2,
            "text": "“The production of meat has doubled in the 30 years from 1988 to 2018 and increased four-fold since the mid 1960s”\n\nhttps://www.theworldcounts.com/challenges/consumption/foods-and-beverages/world-consumption-of-meat/story\n\n“In terms of meat intake, each additional 25 grams (approximately a single serving) of processed meat per day was associated with a 44% increased risk for all dementias and a 52% increased risk for Alzheimer's disease.”\n\nhttps://www.alzdiscovery.org/cognitive-vitality/blog/does-eating-meat-increase-dementia-risk#:~:text=In%20terms%20of%20meat%20intake,increased%20risk%20for%20Alzheimer's%20disease.\n\n“These findings suggest very low meat consumption increases the long-term risk of dementia and AD, and that a protopathic bias could have impacted finding from previous studies.”\n\nhttps://pubmed.ncbi.nlm.nih.gov/30883348/",
            "title_similarity": "0.7158985",
            "sentiment_compound": -0.4201
        },
        {
            "id": "i31hoax",
            "score": -2,
            "text": "The huge increase in artificial sweetener consumption can't be helping with all the aspartame, acesulfame k etc.",
            "title_similarity": "0.28137243",
            "sentiment_compound": 0.4043
        },
        {
            "id": "i31wlsq",
            "score": 2,
            "text": "Correlation with longevity. Older you get greater chance of dementia.",
            "title_similarity": "0.46144667",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i30p71l",
            "score": 10,
            "text": "This will be partially reduced in most communities when people born after the switch to unleaded gas get to old age. Right now through the early 2040s we’re gonna get peak numbers of people who got lead poisoning as children hitting theirs 70s",
            "title_similarity": "0.7291149",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i30nvuo",
            "score": 3,
            "text": "Does it account for past misdiagnosis? I could read it but I like the conversation",
            "title_similarity": "0.18107532",
            "sentiment_compound": 0.5023
        },
        {
            "id": "i31hg9k",
            "score": 2,
            "text": "I think false diagnoses may be rising too. Iirc slapping a dementia diagnosis on nursing home residents makes it easier for staff to administer medications that calm them down.",
            "title_similarity": "0.470533",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i30mb41",
            "score": 12,
            "text": "There was a lot of lead in car exhaust when they were kids and there was a lot of cars",
            "title_similarity": "0.4130052",
            "sentiment_compound": -0.296
        },
        {
            "id": "i30yolk",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i30j996",
            "score": 259,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i30q0h5",
            "score": 128,
            "text": "Pretty sure if they did a study on how many have used alcohol, taken Benzo’s on a regular basis (especially late in life by the elderly 65+) it could be related. I know I am too young for the memory issues I have, in my case tho I believe it’s related to 4 concussions in my lifetime.",
            "title_similarity": "0.6771025",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i30lb6b",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "-0.010171823"
        },
        {
            "id": "i30uzuh",
            "score": 5,
            "text": "I’m sure spraying half our food with Roundup is doing wonders for our brains.",
            "title_similarity": "0.3911095",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i311hvb",
            "score": 5,
            "text": "After ten years of working in long-term care and dealing with dementia patients, I can say this: I hope my parents die in a flaming car wreck if it's a choice between that and the slow, lingering dissolution of their personalities and their dignity. It is a horrible, horrible thing to have to watch as a caregiver, and trying to help families navigate through the emotional, physical and financial turmoil it created burned me out completely. I just quit one day. Called in to my boss and told her that I was done with nursing and going back to school to do something, anything else with my life.",
            "title_similarity": "0.643116",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i31wpvn",
            "score": 5,
            "text": "Diabetes type III - western diet for the win!",
            "title_similarity": "0.3412708",
            "sentiment_compound": 0.6239
        },
        {
            "id": "i30ppg5",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.010171823"
        },
        {
            "id": "i30um7g",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "-0.010171823"
        },
        {
            "id": "i30l68c",
            "score": 650,
            "text": "There's strong links to dementia and atmospheric pollutants such as micro metallic particles released from car exhausts as they run. Doesn't surprise me cases are rising as both car use becomes more popular with time and air pollution is on the rise.",
            "title_similarity": "0.3604594",
            "sentiment_compound": 0.5391
        },
        {
            "id": "i30q55x",
            "score": 28,
            "text": "Dementia is sort of unhelpfully broad.",
            "title_similarity": "0.29165366",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30i8gy",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "-0.010171823"
        },
        {
            "id": "i328dw0",
            "score": 8,
            "text": "As someone who worked in HAZMAT for 13 years between 2007 and 2020 I cannot say anything to what causes dementia specifically but please do not wear shoes in your home.\nEspecially if you have little kids, take off your footwear before entering your house/apartment.\nWhat we as humans absorb/inhale/ingest on a daily basis is insane…\nI had a much better, more succinctly written post but accidentally deleted it.. I don’t usually post on serious topics like this but please.. take your shoes off",
            "title_similarity": "0.504703",
            "sentiment_compound": 0.8573
        },
        {
            "id": "i30nozd",
            "score": 330,
            "text": "We need studies looking into the effects of micro plastics and they cross the blood brain barrier.",
            "title_similarity": "0.31258512",
            "sentiment_compound": -0.128
        },
        {
            "id": "i30qji6",
            "score": 172,
            "text": "[removed]",
            "title_similarity": "-0.010171823"
        },
        {
            "id": "i30p7jn",
            "score": 116,
            "text": "[removed]",
            "title_similarity": "-0.010171823"
        },
        {
            "id": "i30zt7w",
            "score": 16,
            "text": "As a physician, I have reviewed numerous medical records listing dementia as a diagnosis. Only to find that after talking to the patient and looking further for anything to substantiate the diagnosis I couldn’t find anything. Same for other diagnosis listed on their charts or allergies or medications. So I take this with a grain of salt.",
            "title_similarity": "0.6277255",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30mj0b",
            "score": 710,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i30p0qu",
            "score": 1073,
            "text": "[removed]",
            "title_similarity": "-0.010171823"
        },
        {
            "id": "i319swb",
            "score": 343,
            "text": "You're all looking at pinpointing a few, specific triggers for dementia. This thread has suggestions that it's micro plastics, nutrition, chemicals, air pollution, social isolation, etc. The fact is that dementias are very likely caused by compounding factors. You're *all* right, but only partially.",
            "title_similarity": "0.431432",
            "sentiment_compound": -0.2144
        },
        {
            "id": "i30j2e2",
            "score": 8190,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i30p86a",
            "score": 250,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i30j5v0",
            "score": 2252,
            "text": "More awareness and more detailed health records may explain rise",
            "title_similarity": "0.1273783",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31401u",
            "score": 5547,
            "text": "If you live long enough you will probably get both dementia and cancer.",
            "title_similarity": "0.60401165",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i30vo2q",
            "score": 93,
            "text": "You have no idea how much I appreciate that this study specifies not that \"people died with dementia\" but \"people died with a **diagnosis** of dementia **listed on their medical record**.\"\n\nThose are two **wildly** different things.  There's already been studies showing that records can have massive artifacts in them due to things that have nothing to do with actual epidemiology.  There was that great one a decade(?) ago that revealed the bizarre spike in heart disease in NYC was entirely the product of the unusability of the death recording software the city required hospitals to use to report deaths.\n\nMental health professional here: \"dementia\" is not a disorder.  It is a whole **class** of disorders, Further, many of those specific disorders (including Alzheimer's Dementia and Lewy Body Dementia) can only be conclusively be diagnosed **posthumously**.\n\nWhile it is possible that there's an increase in dementia, the evidentiary basis for any epidemiology of dementia is so utterly unreliable, we have no idea what is **actually** going on.\n\nOne possibility, btw, is that changes in the US healthcare system, including the advent of the ACA, mean that more people who had dementia all along are now getting diagnosed.  Another is that as the Boomers age and there's this growing bubble of the elderly, stigma against formally diagnosing dementia is waning and physicians are more willing to record a diagnosis of dementia.  Another is that as the wheels come off the US economy, more and more elders with dementia who would have been cared for by family are being cared for by professionals who are then going to record medical diagnoses if only to bill for their services.",
            "title_similarity": "0.6609807",
            "sentiment_compound": 0.9218
        },
        {
            "id": "i31680n",
            "score": 1635,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i30qnhs",
            "score": 1359,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i30qwxr",
            "score": 2842,
            "text": "I’ll keep saying it, we need to 10x research funding here, this is a huge burden on the patient and the family.",
            "title_similarity": "0.54125607",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i30qp3z",
            "score": 1,
            "text": "And how many die of dementia?",
            "title_similarity": "0.7046485",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i30qvdy",
            "score": 2,
            "text": "Yes, general population is getting older. Age is the biggest risk factor for dementia",
            "title_similarity": "0.5763939",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i30t4ie",
            "score": 1,
            "text": "Yes, increased lifespan and diagnosis plays a role. However, it is not at all implausible that this is a real increase, since many of the known risk factors for dementia have been on the rise for decades. For example, there is strong evidence that \"[greater exposure to airborne pollutants is associated with increased risk of dementia.](https://content.iospress.com/articles/journal-of-alzheimers-disease/jad180631)\" Also, numerous [cardiovascular diseases can increase dementia risk.](https://link.springer.com/article/10.1007/s11065-017-9359-z) Technological advancements have increased the proportion of people who live a [sedentary lifestyle](https://www.nature.com/articles/s41398-020-0799-5), another risk factor for cognitive decline. [Sleep disorders are becoming more prevalent](https://jcsm.aasm.org/doi/full/10.5664/jcsm.8482) and [sleep dysfunction increases the risk of all types of cognitive decline.](https://jnnp.bmj.com/content/jnnp/91/3/236.full.pdf)\n\n&#x200B;\n\n[Here's a great review](https://bmjopen.bmj.com/content/bmjopen/9/1/e022846.full.pdf) of \"modifiable risk factors\" for dementia.",
            "title_similarity": "0.49655157",
            "sentiment_compound": 0.9042
        },
        {
            "id": "i30un3k",
            "score": 2,
            "text": "Do they hypothesize as to why?",
            "title_similarity": "-0.041865103",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30va34",
            "score": 2,
            "text": "My mom used to say that when she died her body probably would not decompose properly because of all the preservatives in the food chain.  She passed of dementia at 87.   Dad passed at 95 (of old age and dementia) and he started getting dementia at around 92. \n\nI think it’s true the the longer people live the more prevalent dementia is going to become.  Hopefully they find a treatment before I get there.",
            "title_similarity": "0.7181022",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i30x43g",
            "score": 3,
            "text": "About 75% of my relatives get hit with Alzheimer's or Dementia. \n\nI have my trust sorted out (in my 30s) to avoid probate. I also have plans to go up to Oregon if I start to slip and go visit one of Jack Kevorkian's blessed angels.",
            "title_similarity": "0.7743251",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i30x8hw",
            "score": 1,
            "text": "Between diabetes, dementia, and cancer, old age is like running a gauntlet.",
            "title_similarity": "0.6245445",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i30yvl6",
            "score": 3,
            "text": "Please legalize eithenithia, I'd like to go knowing who I am, surrounded with people I know and love with dignity.",
            "title_similarity": "0.066862315",
            "sentiment_compound": 0.8934
        },
        {
            "id": "i30z020",
            "score": 1,
            "text": "Diagnoses are, to some extent, memes.  The more we see a diagnosis, the more we see a diagnosis.",
            "title_similarity": "0.2544098",
            "sentiment_compound": 0.0
        },
        {
            "id": "i30zd23",
            "score": 2,
            "text": "Comeon science do somthing we are In 2022",
            "title_similarity": "0.17997678",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3111md",
            "score": 1,
            "text": "the plastic in our brains...",
            "title_similarity": "-0.036132064",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3118gh",
            "score": 1,
            "text": "Welcome to the leaded paint/gas generation?",
            "title_similarity": "0.11322945",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i311mnt",
            "score": 1,
            "text": "Better diagnosis? Longer lives?",
            "title_similarity": "0.15435567",
            "sentiment_compound": 0.504
        },
        {
            "id": "i311oaf",
            "score": 2,
            "text": "Im just gonna say it, its kinda insane to me that for most of world history aging and therefore being likely to go insane are not really addressed, yet in modern times half of every meat raisin has a brain with gears that are missing a few teeth. I thought wisdom came with age?? This descent into cognitive deterioration must be caused by some extreme external factors",
            "title_similarity": "0.59613025",
            "sentiment_compound": -0.5052
        },
        {
            "id": "i311x2f",
            "score": 3,
            "text": "Single biggest fear in my life. This disease scares the crap of of me.",
            "title_similarity": "0.42962718",
            "sentiment_compound": -0.802
        },
        {
            "id": "i311zqp",
            "score": 1,
            "text": "isn't that most likely due to people getting older on average and these type of \"defects\" really starting to appear more often the older you get?",
            "title_similarity": "0.47510394",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i312cwv",
            "score": 2,
            "text": "Wonder if this can be linked to fluoride in water.",
            "title_similarity": "0.071838416",
            "sentiment_compound": 0.0
        },
        {
            "id": "i312g46",
            "score": 1,
            "text": "Given the ubiquity of heart disease in the US, I wonder if there might be a correlation here with failing hearts pumping less oxygenated blood to the brain in the waning years of life.",
            "title_similarity": "0.5947224",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i312oda",
            "score": 1,
            "text": "So, this is because we’re actually seeing the signs now, right?",
            "title_similarity": "0.028644368",
            "sentiment_compound": 0.0
        },
        {
            "id": "i312vef",
            "score": 1,
            "text": "Yep not sure how the world plans to deal with the dementia & Alzheimer's about to overtake boomers. Truly an overwhelming problem all around.",
            "title_similarity": "0.55916166",
            "sentiment_compound": 0.1124
        },
        {
            "id": "i312zo1",
            "score": 1,
            "text": "Think it has something to do with the push of more carbs and less on essential fats we are eating?",
            "title_similarity": "0.29364952",
            "sentiment_compound": 0.0
        },
        {
            "id": "i313pev",
            "score": 2,
            "text": "Anything to do with Prions? those things are terrifying",
            "title_similarity": "0.07764344",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i313roc",
            "score": 1,
            "text": "Lead exposure, stress, alcohol use and better awareness of the condition. Now if only there was some real screening of judges, police and elected officials to ensure that they're mentally competent to perform their job as they age!",
            "title_similarity": "0.36149067",
            "sentiment_compound": 0.6476
        },
        {
            "id": "i313vpc",
            "score": 1,
            "text": "Woo hoo, I’m ready to go. No insurance, no kids, no retirement. My future is getting brighter.",
            "title_similarity": "0.16675767",
            "sentiment_compound": 0.8306
        },
        {
            "id": "i313xvo",
            "score": 1,
            "text": "Did the list get longer ie more diagnosis listed per death? Or did dementia replace something else’s?",
            "title_similarity": "0.5563652",
            "sentiment_compound": -0.644
        },
        {
            "id": "i3143xb",
            "score": 1,
            "text": "Three women on my mother's side succumbed are falling to their knees from dementia. But the main issue of their lives was that they were extreme worriers. To the point that I think it overwrote their brain code.",
            "title_similarity": "0.6669155",
            "sentiment_compound": -0.6474
        },
        {
            "id": "i314bmb",
            "score": 1,
            "text": "Death anxiety and the Alzheimerization of ageing.",
            "title_similarity": "0.5214789",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i315hui",
            "score": 1,
            "text": "I'm guessing we are better at diagnosing it now.",
            "title_similarity": "0.14787035",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i315sva",
            "score": 1,
            "text": "Klonoin ritiviol or whatever it's name is. We don't make it in my company due to the dementia it causes.  Anti anxiety meds def contribute.",
            "title_similarity": "0.53179896",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i3169fd",
            "score": 1,
            "text": "Maybe it's all that plastic in our blood?  I mean, it is a possibility...right?",
            "title_similarity": "0.17109054",
            "sentiment_compound": 0.0
        },
        {
            "id": "i316q2p",
            "score": 1,
            "text": "Can't be from all the micro plastic in our bodies.... no...",
            "title_similarity": "0.09127051",
            "sentiment_compound": 0.0
        },
        {
            "id": "i316vqe",
            "score": 1,
            "text": "well if the increase is not just coming down to better diagnosis this is very concerning. idk what it could be though.",
            "title_similarity": "0.14063889",
            "sentiment_compound": 0.683
        },
        {
            "id": "i316zk3",
            "score": 1,
            "text": "I imagine there are many that are legit diagnoses, but could this also be something more? I wonder if there is a parallel increase with dementia diagnoses and also folks court ordered a conservator? \n\nAnd by this I mean the business of conservators making money at the end of other peoples life off of wealth. \n\nPersonally touched by something similar to the plot in “I Care A Lot”",
            "title_similarity": "0.48502448",
            "sentiment_compound": 0.9171
        },
        {
            "id": "i317bm9",
            "score": 1,
            "text": "Does this have anything to do with life expectancy increasing giving the mind time to deteriorate?",
            "title_similarity": "0.3096037",
            "sentiment_compound": 0.34
        },
        {
            "id": "i317ijc",
            "score": 2,
            "text": "Generation Lead. Many of them would have been severely lead poisoned as children, primarily due to regularly breathing leaded gasoline fumes.",
            "title_similarity": "0.4970676",
            "sentiment_compound": -0.743
        },
        {
            "id": "i317ytj",
            "score": 2,
            "text": "Probably didn't help that there was lead in the gas for years.",
            "title_similarity": "0.4554686",
            "sentiment_compound": -0.3089
        },
        {
            "id": "i31834p",
            "score": 2,
            "text": "3 of my 4 grandparents had or have some sort of dementia. My great aunt died of Lewy Body Dementia. We are pretty sure that my grandfather (the brother of my great aunt) also has Lewy Body Dementia but at his age and health level it is not worth testing for at this point. My mother (her aunt was the one with Lewy Body Dementia) is so terrified of Lewy Body Dementia that I think she will kill herself if she is ever diagnosed. My family genetics are not kind to me in this regard, although I did have a great grandmother who lived to be 99.5 years old and was of sound mind almost to the end, so who knows?",
            "title_similarity": "0.67206264",
            "sentiment_compound": -0.8803
        },
        {
            "id": "i31867x",
            "score": 2,
            "text": "All that plastic in our bloodstream",
            "title_similarity": "0.18440232",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3189j9",
            "score": 2,
            "text": "We're surviving cancer and heart attacks in greater numbers.",
            "title_similarity": "0.53384686",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i318hp6",
            "score": 2,
            "text": "Happened to my grandfather. Took about 12 long years of gradual decline from diagnosis to his death, completely robbed him of his personality and freedom by the end. He was in home hospice for well over a year before he died. It's a terrible disease.",
            "title_similarity": "0.7020021",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i318zgr",
            "score": 3,
            "text": "I'm wondering how heavy of a contributor stress and lack of mental stimulation (e.g. hobbies, maintaining skills, regular contact with other human beings, the usual enrichment) are here. I always had a hunch that mental faculties need to be actively maintained and exercised to have the best shot at sticking around, akin to teeth or muscle.\n\nI notice a lot of older folk tend to not really have much to do - it's hard to make and maintain friendships as an adult, and it seems like it only gets harder with age. The world has a way of really closing itself off from people. (Especially with worthwhile, accessible common spaces becoming a thing of the past in many parts of the US)",
            "title_similarity": "0.41002178",
            "sentiment_compound": 0.8307
        },
        {
            "id": "i31956n",
            "score": 1,
            "text": "Could this be due to people living longer?",
            "title_similarity": "0.1372005",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31ag3z",
            "score": 5,
            "text": "Lead exposure is still a thing not at bad as it once was but the rooster has come home, these boomers took in a lot of lead.",
            "title_similarity": "0.3386845",
            "sentiment_compound": 0.2323
        },
        {
            "id": "i31ax75",
            "score": 1,
            "text": "I didn't want to know this. Why did you inflict this on me? I hate you",
            "title_similarity": "0.13216488",
            "sentiment_compound": -0.6023
        },
        {
            "id": "i31az6r",
            "score": 1,
            "text": "Toxic chemicals in everything we eat, drink, and breathe.",
            "title_similarity": "0.33149856",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31b14x",
            "score": 1,
            "text": "How many had surgery before that diagnosis? Post operative delirium which affects a lot of older people can lead to dementia.",
            "title_similarity": "0.7752149",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31b5d2",
            "score": 1,
            "text": "There are so many uncontrollable variables in this is not even funny. I’m but even sure how it got published.",
            "title_similarity": "0.19163683",
            "sentiment_compound": 0.092
        },
        {
            "id": "i31b6zw",
            "score": 1,
            "text": "With fluoride in the water, air pollutants in the air, and microplastics literally absolutely everywhere; I can’t imagine why these cases are increasing? Hmm",
            "title_similarity": "0.29533553",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31b9jk",
            "score": 1,
            "text": "There are probably factors that are increasing rates is dementia. However, we are also testing more and curing the other things. This means that there will be a rise in dementia.",
            "title_similarity": "0.35340887",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31bfd2",
            "score": 2,
            "text": "Maybe it’s because we’re living longer?",
            "title_similarity": "0.10917467",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31bkpq",
            "score": 1,
            "text": "so half of all older adult americans?",
            "title_similarity": "0.6194048",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31bpqn",
            "score": 1,
            "text": "Luckily cubes grow in my cupboard under the stairs",
            "title_similarity": "0.23196076",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i31btq5",
            "score": 1,
            "text": "What if it was just undiagnosed though. Different times and different understanding from doctors",
            "title_similarity": "0.27294046",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31bux7",
            "score": 1,
            "text": "This is probably the biggest issue with extending life. We are probably a couple breakthroughs away from keeping someone alive for a couple decades more but their brain will likely be mush and they won’t be able to enjoy it.",
            "title_similarity": "0.530272",
            "sentiment_compound": 0.7269
        },
        {
            "id": "i31c0pe",
            "score": 1,
            "text": "Yea because we know to how to delay everything else so we are going to inevitably die of something. Dementia is the end result for all of us if you make it passed everything else",
            "title_similarity": "0.44602317",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i31c1jy",
            "score": 1,
            "text": "Isnt that cause they all grew up eating and breathing lead? \n\n*Jk it wouldnt be up from 2 decades ago if that was the case",
            "title_similarity": "0.5736334",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31c6a9",
            "score": 1,
            "text": "That's because nobody wants to remember these fucked up times we live in",
            "title_similarity": "0.14927033",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i31cgfz",
            "score": 1,
            "text": "I guess my questions are:\n\n1. Is dementia more widely diagnosed than it was 20 years ago?\n2. U.S. life expectancy has increased by 3 years since 1990, could that mean dementia is more likely to show up since people are living longer?",
            "title_similarity": "0.67789376",
            "sentiment_compound": 0.3527
        },
        {
            "id": "i31cnzk",
            "score": 1,
            "text": "Then there is the dementia from Parkinson disease, etc",
            "title_similarity": "0.46831873",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31covj",
            "score": 1,
            "text": "Is part of it simply not dying as much to other diseases? It would feel like dementia is something that would claim everyone's life eventually if they didn't die in other ways.",
            "title_similarity": "0.54193866",
            "sentiment_compound": 0.6854
        },
        {
            "id": "i31cxpp",
            "score": 1,
            "text": "Probably better screening and treatment of other diseases",
            "title_similarity": "0.1157053",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i31d25f",
            "score": 1,
            "text": "That entire generation is lead poisoned, it doesn't surprise me. If you're old and reading this, start playing video games. It's a good mental exercise to help prevent dementia.",
            "title_similarity": "0.41791967",
            "sentiment_compound": 0.3582
        },
        {
            "id": "i31d7ie",
            "score": 1,
            "text": "People are living longer, not surprising we're seeing more people end up with it.",
            "title_similarity": "0.22223568",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i31dpgt",
            "score": 1,
            "text": "I want to say one word to you, Benjamin. Just one word:",
            "title_similarity": "0.060422175",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i31dvlr",
            "score": 1,
            "text": "so...why live longer if you're just gonna spend that longer bit a doddering fool?",
            "title_similarity": "0.23571807",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i31e1gn",
            "score": 1,
            "text": "wondering if this shift is paralleled in the UK or other countries too…",
            "title_similarity": "0.18549103",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31e1p7",
            "score": 1,
            "text": "This sounds like it's because of better technology for diagnosing and the fact that humans are living longer. If cancer is being treated better than it ever has been, I would imagine at some point everybody will develope dementia. Is this a wrong take on this?",
            "title_similarity": "0.49938896",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i31e446",
            "score": 1,
            "text": "Plastic food packaging.",
            "title_similarity": "-0.03293873",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31e5bd",
            "score": 1,
            "text": "My (70 m) mother was diagnosed around 80. It took her at 86. Her father, and at least one sister had it as well.",
            "title_similarity": "0.63543165",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i31e7pl",
            "score": 12,
            "text": "It's our damn diets and lack of exercise!!!! \n\nDiabetes greatly increases your likelihood of developing AD.",
            "title_similarity": "0.42801064",
            "sentiment_compound": -0.7326
        },
        {
            "id": "i31e8gr",
            "score": 16,
            "text": "Wonder if it’s tied to the increasing prevalence of type 2 diabetes in older adults and the fact that diabetes and increased blood sugar predisposes you to dementia https://pubmed.ncbi.nlm.nih.gov/30022099/",
            "title_similarity": "0.6132779",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i31e8iw",
            "score": 1,
            "text": "Idk seems like they got an extra +20 years each generation. So by my made up understanding of genetics you should have until you are about 100 years old. By then there should be a cure. You'll be fine.",
            "title_similarity": "0.5918839",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i31ebtw",
            "score": 1,
            "text": "Any correlation with covid?",
            "title_similarity": "0.07051679",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31ednl",
            "score": 2,
            "text": "Is there any connection between blackouts drinking alcohol and dementia? \n\nAsking for… me",
            "title_similarity": "0.45544347",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31eg22",
            "score": 1,
            "text": "Is this because of better diagnosis techniques and a lessening of the stigma?",
            "title_similarity": "0.12205313",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i31eilb",
            "score": 1,
            "text": "So the more accurate title should be higher rates of dementia diagnosis due to insurance companies allowing medical staff to have additional diagnosis listed.",
            "title_similarity": "0.35095185",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31eiy7",
            "score": 1,
            "text": "Is this because the rate is increasing or more people are getting dementia?",
            "title_similarity": "0.5055872",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31ene3",
            "score": 1,
            "text": "Wonder what the correlation is to longer average life span, if any",
            "title_similarity": "0.24027163",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31eny3",
            "score": 1,
            "text": "Unless the AD shows up in the 40s it is not genetically predetermined. \n\nTake control of your health and lifestyle and you will lower your risk of AD to less than that of most people.\n\nYou may have some genetics that increase your risk of AD but unless your family develops AD in their 40s (super rare) then it is not predetermined. \n\nHow you live your life will play the biggest role in whether you develop AD.",
            "title_similarity": "0.48933834",
            "sentiment_compound": 0.8126
        },
        {
            "id": "i31eqi8",
            "score": 2,
            "text": "Is there any reason to suspect this may have to do with lead exposure?\n\nSeems like lead exposure didn’t really pick up until car ownership took off post-depression and leaded fuel was suddenly in the air everywhere. People dying 20 years ago and before would have been young adults by the end of the depression, whereas people dying today were likely the most lead-exposed group of children in history.",
            "title_similarity": "0.6579422",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i31etfh",
            "score": 2,
            "text": "Nature’s way of helping us to forget how crappy of a world we had to live in",
            "title_similarity": "0.10484038",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i31evbd",
            "score": 2,
            "text": "After seeing my grandpa go through that + Parkinson's, I have a plan for a week after my diagnosis (so I can still die \"me\")",
            "title_similarity": "0.6515937",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i31f17i",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i31f4ca",
            "score": 1,
            "text": "Couldn’t this just be from a better understanding of dementia and the different forms and symptoms than in the past?",
            "title_similarity": "0.37827215",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i31f5j3",
            "score": 2,
            "text": "But don't worry, 100% of the 75 year olds in congress are fine...",
            "title_similarity": "0.43039757",
            "sentiment_compound": 0.6496
        },
        {
            "id": "i31feyt",
            "score": 2,
            "text": "I suppose this LEAD to some questions.",
            "title_similarity": "-0.052888572",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31fgrs",
            "score": 2,
            "text": "It’s that damn Mac Donalds.",
            "title_similarity": "0.22224462",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i31fi8g",
            "score": 1,
            "text": "Does this not just mean we're 'better' at getting older and fighting off other ailments?",
            "title_similarity": "0.2868744",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i31fkeg",
            "score": 6,
            "text": "Alzheimer's has been described as \"type 3 diabetes\".\n\nI would like to see how the Alzheimer's rate has tracked the trajectory of the obesity epidemic.",
            "title_similarity": "0.6110736",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i31fv6u",
            "score": 1,
            "text": "Boomers that used to go on about how their generation never worried about things like lead poisoning.",
            "title_similarity": "0.38059506",
            "sentiment_compound": -0.1058
        },
        {
            "id": "i31g057",
            "score": 1,
            "text": "Sounds like we're doing a better job of diagnosis.",
            "title_similarity": "0.100013226",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i31g11e",
            "score": 1,
            "text": "I wonder how much of this rise is incidence and how much is simply better detection. \n\nAlso keep in mind that elderly people today grew up In a more toxic time, environmentally speaking. Today's microplastics certainly aren't any good, but they're nothing compared to leaded gas for example.",
            "title_similarity": "0.493967",
            "sentiment_compound": 0.2375
        },
        {
            "id": "i31g476",
            "score": 1,
            "text": "Maybe the same things causing the obesity/diabetes epidemic are causing dementia.",
            "title_similarity": "0.5444889",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31g4j5",
            "score": 1,
            "text": "It’s because they can save you from what would have killed you and many cancers are chronic. Science can keep you alive long enough for your brain to give out",
            "title_similarity": "0.38587523",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i31gbut",
            "score": 1,
            "text": "bad process food diet, constant social media obsession, depression, working yourself to death … does anyone wonder why",
            "title_similarity": "0.40949988",
            "sentiment_compound": -0.926
        },
        {
            "id": "i31gizf",
            "score": 1,
            "text": "Either we’re better at diagnosing it or the world is just way more insane these days",
            "title_similarity": "0.24400926",
            "sentiment_compound": -0.024
        },
        {
            "id": "i31gjxn",
            "score": 1,
            "text": "Worth mentioning: as we learn more about dementia, we also learn about ways to counteract brain degeneration. A number of studies support that not just staying active, but strength training can help preserve cognitive abilities in your older years. Not just life long strength training, but even taking it on later in life (obviously, only if medical professionals deem the you ok to start).\n\nhttps://www.sydney.edu.au/news-opinion/news/2020/02/11/strength-training-can-help-protect-the-brain-from-degeneration.html",
            "title_similarity": "0.4322",
            "sentiment_compound": 0.96
        },
        {
            "id": "i31gwfd",
            "score": 1,
            "text": "Food chemicals, fructose in everything helps you on your way.",
            "title_similarity": "0.12221297",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i31gwg2",
            "score": 1,
            "text": "This is going to sound boomer af but could it be linked to the fact that before two decades ago we didn’t have nearly as much widespread information coming at us from all angles like we do now. Yeah we got important stuff in the paper and on tv, but those were dedicated “I am absorbing news from other places in the world” time, now I can scroll through my Reddit feed and see posts like this, Russia conflict, Australian problems, UK problems, all in five minutes. Maybe we are overloading our brains and we just physically cannot comprehend such a large scale of people.",
            "title_similarity": "0.6013909",
            "sentiment_compound": 0.6652
        },
        {
            "id": "i31gwta",
            "score": 2,
            "text": "Doesn't necessarily mean higher incidence but perhaps just more highly reported.",
            "title_similarity": "0.05861476",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31gxv8",
            "score": 1,
            "text": "Check the rates of Dementia in Japan though. How do we get what they've got?",
            "title_similarity": "0.44834778",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31h21x",
            "score": 2,
            "text": "People are also living waaaaayyyy longer.",
            "title_similarity": "0.16334215",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31h4wz",
            "score": 1,
            "text": "Is there a working hypothesis for the cause? Perhaps people in the past were simply undiagnosed? Or perhaps it’s the result of genetic entropy?",
            "title_similarity": "0.2630899",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31hafr",
            "score": 1,
            "text": "It's obviously something we're consuming that's causing this so frequently in later years. I just wish I knew what it was...",
            "title_similarity": "0.29120302",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i31hb1g",
            "score": 1,
            "text": "I mean, this is most likely good news…but that doesn’t sell so it’s ‘turnt’ to sound bad. Best guesses are: diagnosis is becoming more accurate *and* people are living longer which ensures they reach the ages (and live past the preventable diseases) that lead to the inevitable ‘age-related diseases’ which comprise an overwhelming majority of dementia causing agents.",
            "title_similarity": "0.47093728",
            "sentiment_compound": 0.6096
        },
        {
            "id": "i31hcrn",
            "score": 1,
            "text": "Could it be related to people living longer? People that die at age 60 just haven’t had the time to develop dementia.",
            "title_similarity": "0.6465379",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i31hg0v",
            "score": 1,
            "text": "Yes, because they don’t die from a toothache or now preventable cancer, or anything else they used to die from. Leaving more time to develop dementia. Along with better diagnosis of dementia itself.",
            "title_similarity": "0.553679",
            "sentiment_compound": -0.8225
        },
        {
            "id": "i31hk57",
            "score": 2,
            "text": "People are also accepting that confusing, memory loss and alternate behaviours are not “normal ageing”. Thus more people being reviewed and more diagnosis. Its absolutely fascinating all the research into it in recent years. Including the new type 3 diabetes/alzheimers.",
            "title_similarity": "0.5548688",
            "sentiment_compound": 0.4927
        },
        {
            "id": "i31hlov",
            "score": 2,
            "text": "Great, one more thing to be anxious about.",
            "title_similarity": "-0.052200757",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i31hqp7",
            "score": 3,
            "text": "I was just chatting with my Gran about this yesterday. In the last year in her peer group, 3 people have received a dementia diagnosis, 2 has gone terribly downhill with dementia, and 6 have sadly passed away directly in relation to dementia. She called to let me know another friend had received the diagnosis. \n\nShe is extremely paranoid that she’s going to develop it (she’s 85, has zero cognitive or memory issues, and is spicy as ever.) I gave her reassurance, but one never knows for certain. Her father had dementia when he passed from cancer, in 2006. We took care of him with the assistance of a visiting nurse and those were really rough times emotionally. He would see rabbits in the house and speak to dead family members on a regular basis. \n\nShe was concerned there might be an environmental factor impacting the area, since all of these people have lived in the same 5-10 mile radius since birth and it seemed abnormal to her that so many are developing dementia (as well as cancers- 60% of the houses just on their small street have had someone living there with or ultimately die from cancer: brain, bladder, breast, and now a new prostate cancer case.) It’s a very tiny, pretty rural village next to a slightly larger but still rural town, but all the groundwater has tested positive for high levels of arsenic, going back at least 35 years that I can remember.\n\n(EDIT: and fwiw… it’s in Michigan.)",
            "title_similarity": "0.74900097",
            "sentiment_compound": -0.9696
        },
        {
            "id": "i31hy1z",
            "score": 3,
            "text": "just saying, but these are also the people running our nations.",
            "title_similarity": "0.27389604",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31hzl5",
            "score": 1,
            "text": "Pollution from plastics, heavy metals, air pollution, heavy pesticide use, highly processed food, high sugar diets, not enough sleep, not enough exercise, alcohol, drug use, too much tv... We live poisonous lives and we're going in the wrong direction.",
            "title_similarity": "0.35576636",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i31i1zp",
            "score": 1,
            "text": "Ja. And I hate it. My father in law. Legend. Terrible affliction. I think we live longer than we are designed too.",
            "title_similarity": "0.46275544",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i31ibzf",
            "score": 1,
            "text": "We need assisted suicide to be legal here. No way this happens to me.",
            "title_similarity": "0.17415802",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i31idma",
            "score": 1,
            "text": "My mother in law had dementia for 6 years before she died and it didn’t even get mentioned on her death certificate. All it had on it was heart disease and diabetes, so I’m guessing that number could be higher.",
            "title_similarity": "0.73483944",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i31iil9",
            "score": 1,
            "text": "Longer life expectancy might lead to the body outlasting the mind???",
            "title_similarity": "0.32865292",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31iri4",
            "score": 1,
            "text": "In times gone by, you were just called senile and ‘old’ in this behaviour but it’s nice it’s being diagnosed because it is manageable through treatment!",
            "title_similarity": "0.29348892",
            "sentiment_compound": 0.6114
        },
        {
            "id": "i31j38v",
            "score": 1,
            "text": "I’d have to say it’s from all the toxic ingredients in our food",
            "title_similarity": "0.34292454",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31j99p",
            "score": 1,
            "text": "Plastic in my blood can't be helping.",
            "title_similarity": "0.04489872",
            "sentiment_compound": -0.2235
        },
        {
            "id": "i31ja2w",
            "score": 1,
            "text": "people die at more advanced ages than ever before, and better diagnosed. NBD",
            "title_similarity": "0.60212094",
            "sentiment_compound": 0.5149
        },
        {
            "id": "i31jaei",
            "score": 1,
            "text": "We used to call it senality.",
            "title_similarity": "0.0039096866",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31jdwp",
            "score": 1,
            "text": "Have we always been dying with dementia? The old people were probably too deep into it to remember it",
            "title_similarity": "0.6261482",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31jk74",
            "score": 1,
            "text": "Fascinating ...and possibly preventable.  There’s new science that suggests a possible reason and a cheap treatment option but big pharma won’t pay for the trials because they are making so much money from the current drugs.",
            "title_similarity": "0.36934835",
            "sentiment_compound": 0.1655
        },
        {
            "id": "i31jldi",
            "score": 1,
            "text": "4+ generations of eatibg processed sugar and corn syrup shown to cause generational cognitive decline in laboratory rats and chimpanzees.",
            "title_similarity": "0.55731237",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31jpgr",
            "score": 1,
            "text": "People are living longer… that’s why",
            "title_similarity": "0.10595846",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31ju1o",
            "score": 1,
            "text": "Probably because 20 years ago it was just written up as old age. \nIf the study is from the USA then it’s probably a medical scam. They mark down patients as having dementia when they don’t but write a prescription to get the pills and sell them to people that need them but can’t afford to pay full price.",
            "title_similarity": "0.6313897",
            "sentiment_compound": -0.4497
        },
        {
            "id": "i31kflw",
            "score": 2,
            "text": "Does this also have to do with average life expectancy going up? The thought being us living longer allows for more health issues to arise.",
            "title_similarity": "0.29137808",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31kh9q",
            "score": 1,
            "text": "We're just better at clueing into the signs now",
            "title_similarity": "0.035339355",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i31kkby",
            "score": 1,
            "text": "47% of people age 67+. Damn",
            "title_similarity": "0.48681137",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i31kzjf",
            "score": 2,
            "text": "How does it compare age wise? People are generally healthier now and living longer than 20 years ago. Is it because people are living longer and not dying of other things? The study blurb only mentioned people over the age of 67. They didn’t break the data into age buckets and compare say 67-72 diagnoses 20 years ago vs today (unless I missed it).",
            "title_similarity": "0.5328584",
            "sentiment_compound": 0.3094
        },
        {
            "id": "i31l119",
            "score": 1,
            "text": "This is why I champion euthanasia. Growing old sounds horrible. After I literally lose my mind, there is no point in my body, and me, living. I'd just be a burden.",
            "title_similarity": "0.45689037",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i31lfc0",
            "score": 1,
            "text": "That seems like a substantial amount of people and it’s expected to rise even more. There’s got to be a cause driving all this right?",
            "title_similarity": "0.18342364",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i31lfqs",
            "score": 1,
            "text": "Maybe because dying at an older age?",
            "title_similarity": "0.35005665",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31ln2x",
            "score": 1,
            "text": "We are cursed with long life.",
            "title_similarity": "0.2535576",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31lr7f",
            "score": 1,
            "text": "Do we know if it's more actual cases, or just more diagnosis?  Kind of like \"autism spectrum disorder\"; don't know a real diagnosis?  Must be autism/dementia.",
            "title_similarity": "0.43482506",
            "sentiment_compound": -0.2151
        },
        {
            "id": "i31md04",
            "score": 1,
            "text": "Y'all should look at the rate of Alzheimer's in Canada ( and other northern countries ) vs the States. It's pretty crazy.",
            "title_similarity": "0.5099772",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i31mf4g",
            "score": 2,
            "text": "A doctor gently suggested my moms dementia was likely caused by her years of heavy drinking. I had no idea! Very sad and hard on everyone for sure. The decline can be fast. Be patient…all you can do until it ends snd you miss their forgetfulness.",
            "title_similarity": "0.62781346",
            "sentiment_compound": -0.4308
        },
        {
            "id": "i31mn96",
            "score": 2,
            "text": "Well that’s terrifying",
            "title_similarity": "-0.037534554",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i31n1vw",
            "score": 1,
            "text": "Forgive me for I am fried but is this at all possible from people generally living longer now compared to 2 decades ago?",
            "title_similarity": "0.4954322",
            "sentiment_compound": 0.1406
        },
        {
            "id": "i31n1yp",
            "score": 1,
            "text": "My uncle was 49 and died from Dementia/Alzheimer’s 2 years ago. So it’s definitely possible in younger people. He didn’t show signs of it until maybe like 8 months before his death. Before that he seemed perfectly healthy. It all went downhill sooo fast",
            "title_similarity": "0.7139839",
            "sentiment_compound": 0.5965
        },
        {
            "id": "i31n8cu",
            "score": 1,
            "text": "We are living too long.",
            "title_similarity": "0.17443985",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31nc5i",
            "score": 2,
            "text": "Keep your brain working guys!\n\nThey have found that people working in academia are much less likely to have neurological diseases when they grow old. This is because their minds are constantly challenged and stimulates, casing new neural connections to be formed regularly, whereas people who never use brain and are only doing dull tasks are more in risk of these neurological diseases",
            "title_similarity": "0.46608597",
            "sentiment_compound": -0.5818
        },
        {
            "id": "i31ncaz",
            "score": 2,
            "text": "Lead. \n\nWe need to discuss the lead exposure of previous generations and the accumulation of said lead into their systems until the mid 1970s. Only to now be replaced w micro plastics.",
            "title_similarity": "0.5255763",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31nf21",
            "score": 2,
            "text": "A lot of the stories posted hear give me a headache but this is interesting",
            "title_similarity": "0.3278561",
            "sentiment_compound": 0.5499
        },
        {
            "id": "i31nj70",
            "score": 1,
            "text": "Feels like it was a change in the medical field that made this change",
            "title_similarity": "0.2931251",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i31nnfx",
            "score": 1,
            "text": "Live longer; Die from age-related conditions. \nMakes sense.",
            "title_similarity": "0.2641614",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i31nrvm",
            "score": 1,
            "text": "Well yeah, people are living longer",
            "title_similarity": "0.09252214",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i31nvys",
            "score": 1,
            "text": "Since they seem to attribute part of this to Medicare, I'd be curious to see how this related to outside the US",
            "title_similarity": "0.3259583",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i31o8mg",
            "score": 2,
            "text": "Microwave ovens. It’s because of microwaves",
            "title_similarity": "0.1183678",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31od6o",
            "score": 1,
            "text": "I just wonder about the legal consequences of this diagnosis creep. Dementia is one of a few medical diagnoses that has legal ramifications, namely usually leading towards incompetence and power of attorney, or guardianships that rob people of the ability to make their own medical, financial or other legal decisions. We need to make sure we aren't opening the door for more elder abuse, exploitation, or ignoring the legitimate wishes of people competent enough to make them.",
            "title_similarity": "0.42584765",
            "sentiment_compound": -0.7251
        },
        {
            "id": "i31oe90",
            "score": 1,
            "text": "Cant wait to experience outer wilds again",
            "title_similarity": "0.016403636",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31ohmf",
            "score": 1,
            "text": "Well what do you expect when their blood is full of plastic?",
            "title_similarity": "0.10004972",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i31opt6",
            "score": 2,
            "text": "My guess is this is a case of more thorough diagnoses and longer lifespans.",
            "title_similarity": "0.24416804",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31ou0d",
            "score": 2,
            "text": "Less Sleep, More Stress, and a lot more inference and awareness manipulation in the age of information overload.",
            "title_similarity": "0.30256075",
            "sentiment_compound": -0.76
        },
        {
            "id": "i31oyev",
            "score": 3,
            "text": "Means nothing.\n\nBetter diagnosis, people live older etc…\n\nSales of electric cars are much higher than 2 decades ago, and so is dementia apparently going up too… so they are positively correlated!!! Oh no stop making electric cars!",
            "title_similarity": "0.5832454",
            "sentiment_compound": 0.6501
        },
        {
            "id": "i31p3ik",
            "score": 2,
            "text": "Now correlate this to individuals who had a \"sweet tooth\"",
            "title_similarity": "0.0071218237",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i31p3p2",
            "score": 2,
            "text": "Breathing through your mouth at night // Sleep Apnea which is grossly under diagnosed across world probably have a lot to do with it as well.",
            "title_similarity": "0.45647174",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i31pa3h",
            "score": 2,
            "text": "I mean living much longer prob will do that",
            "title_similarity": "0.13316388",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31pay1",
            "score": 3,
            "text": "How does this correlate to the rate of diabetes during this time span?",
            "title_similarity": "0.41905463",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31pllh",
            "score": 2,
            "text": "I don’t know if it’s intriguing or sad, they that stressed?",
            "title_similarity": "0.11452802",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i31pnsv",
            "score": 1,
            "text": "Not sleeping 8 hours+ causes dementia, Alzheimer’s, heart disease, diabetes, etc",
            "title_similarity": "0.7427371",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i31prov",
            "score": 1,
            "text": "The drive to live longer has consequences.\nRegardless of how healthy you live your life, the majority who reach their seventies and above will either have their body or their mind begin to fail or both.\nWe are presently watching my partner’s  90+ year old parents die in slow increments. One with dementia, one whose body is failing in multiple areas.\nIt is a study in the cruelty of medicine.",
            "title_similarity": "0.762785",
            "sentiment_compound": -0.9153
        },
        {
            "id": "i31pshk",
            "score": 1,
            "text": "Leaded gasoline or micro plastics entering the blood-brain barrier?",
            "title_similarity": "0.32852125",
            "sentiment_compound": -0.128
        },
        {
            "id": "i31ptki",
            "score": 1,
            "text": "All the chemicals in our bodies probably. We have plastic in our blood and stomachs at this point right?",
            "title_similarity": "0.27786562",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31q5ih",
            "score": 1,
            "text": "Chemical exposure is catching up as well. The idea that heavy metal and solvent/plastic exposure doesn’t contribute to overall long term health problems is the next lead paint problem we’ll come across.",
            "title_similarity": "0.32638112",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i31qhb7",
            "score": 1,
            "text": "Lead in gas was prevalent when our current older generation was 10-40 years old. Would not be surprised if that has something to do with it.",
            "title_similarity": "0.4787852",
            "sentiment_compound": -0.1695
        },
        {
            "id": "i31ql7q",
            "score": 1,
            "text": "Was t there a general label previously of “senile” ?",
            "title_similarity": "0.1501754",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31qp64",
            "score": 1,
            "text": "Turns out plastic in the blood is bad for us?",
            "title_similarity": "0.1682136",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i31qu84",
            "score": 1,
            "text": "One of the things I'm genuinely worried about in the future is having a mental disorder like dementia or Alzheimer's or something like that or Parkinson's or something. Because right now I get four to five hours of uninterrupted sleep and then I sleep for an additional few hours. I'm trying to fix my sleep schedule, but I usually revert back to sleeping 4 to 5 hours waking up, attending an office meeting and then sleeping for additional 3 hours. It helps that I work from home so I'm able to sleep after my morning meeting, but this is something I'm genuinely worried about.\n\nI don't know why I just don't have the discipline to sleep at 12:00 a.m. and wake up at 8:00 a.m. If I literally do just that I probably be fine but somehow someway. I just find myself staying up until 4:00 or 5:00 in the morning and waking up at 9. :00 to attend my morning meeting and then going back to sleep around 9:30 and waking up around to say 12:00 pm or even 2. Do note. I get my work done. It's just my sleep schedule is out of whack",
            "title_similarity": "0.62829804",
            "sentiment_compound": 0.431
        },
        {
            "id": "i31rfcj",
            "score": 2,
            "text": "Old people today are solidly the network and cable TV generation. Combine that with terrible diet, and it makes complete sense that these human minds slip away well before contemporary medicine allows their bodies to.\n\nI still think it’s mostly TV though.  Their parents were right: TV rots the mind. Especially the endless drone of commercial, laden cable TV.\n\nI hope the video game generations hold up better. Interactivity and active problem solving and reflex exercise.",
            "title_similarity": "0.5070947",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i31rijv",
            "score": 3,
            "text": "Judging from a few lines in the article *most* of this is probably more thorough diagnosis practices.\n\nThis does make me wonder though, how much of what people consider to be normal aging related struggles, are actually mild dementia. Would knowing what, and why, help develop coping strategies? Or is it not really worth alarming someone with such a diagnosis?",
            "title_similarity": "0.43855506",
            "sentiment_compound": -0.1197
        },
        {
            "id": "i31rl8z",
            "score": 2,
            "text": "Probably because people are living so long. Brains don’t do too well after 80 or 90 years.",
            "title_similarity": "0.533414",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i31rlpi",
            "score": 2,
            "text": "What if the leaded fuel is the lead cause for this, and Gen X and later won’t be as effected?",
            "title_similarity": "0.24038392",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31rp6y",
            "score": 2,
            "text": "Is this people who don’t want COVID listed as a cause of death.   It seems there is a huge uptick of these things, meaning cause of death being listed as something other than COVID.",
            "title_similarity": "0.44272918",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i31rqeh",
            "score": 2,
            "text": "Does that mean the dementia is on the rise, or does that mean that it's increasingly convenient and permissible to give old people a dementia diagnosis so that their input regarding their medical, financial, and legal affairs can be ignored from that point on?",
            "title_similarity": "0.4540158",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i31ry4r",
            "score": 2,
            "text": "My mom passed away from vascular dementia and I’ll tell you what…. If/when I get the diagnosis I really hope assisted suicide is legal because otherwise it could get messy",
            "title_similarity": "0.53285563",
            "sentiment_compound": -0.553
        },
        {
            "id": "i31rzdk",
            "score": 2,
            "text": "Who would've thought all those drugs in the 60s and 70s wouldn't leave a lasting impression?",
            "title_similarity": "0.40167704",
            "sentiment_compound": 0.2612
        },
        {
            "id": "i31s06w",
            "score": 2,
            "text": "Is it possibly because of longer life expectancy?",
            "title_similarity": "0.17519984",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31s2s9",
            "score": 1,
            "text": "Yes, because doctors actually write that down now. Before, it was considered a given in old people, doctors didn't even consider it as a symptom of something else other than old age.\n\nAt least in my country, other countries might be different.",
            "title_similarity": "0.49380407",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i31s37x",
            "score": 1,
            "text": "My mother passed from dementia in January. She forgot to swallow and lungs filled up with liquid. Next came the death rattle and she was gone 48 hours later. Good thing she wasn’t in pain",
            "title_similarity": "0.70027506",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i31s7on",
            "score": 1,
            "text": "When I started working in the health industry, I learned it’s 50/50 you’ll get dementia by the time you’re 80. That bummed me out.",
            "title_similarity": "0.7528033",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31sj0e",
            "score": 3,
            "text": "Lead and mold poisoning often go undiagnosed and if someone stays in a home for a long time the likelyhood of being exposed goes up. Especially for the elderly who have trouble cleaning.",
            "title_similarity": "0.58717805",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i31snvx",
            "score": 1,
            "text": "Does this mean it’s increasing in likelihood or we just detect it better?",
            "title_similarity": "0.051103346",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i31syx6",
            "score": 1,
            "text": "Would that be because it wasn’t diagnosed as often two decades ago? \nLike when I was kid no one ADD/ADHD because it wasn’t a thing to diagnose yet.",
            "title_similarity": "0.51940286",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i31t54l",
            "score": 1,
            "text": "While I'm confident that better medical practices have resulted in more cases being caught than would have been otherwise, but I wouldn't be surprised if overstimulation and stress are linked in some way to the development of dementia.",
            "title_similarity": "0.49756655",
            "sentiment_compound": -0.3917
        },
        {
            "id": "i31t55l",
            "score": 2,
            "text": "So, it used to be 14% and now it’s 50%? \n\nGot it",
            "title_similarity": "0.5771803",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31t5dv",
            "score": 2,
            "text": "Lots of guesses stating it’s better diagnosis but that’s only part of the story.  The other part is micro plastics and other 20th century pollutants.",
            "title_similarity": "0.3915854",
            "sentiment_compound": 0.2382
        },
        {
            "id": "i31t9ky",
            "score": 2,
            "text": "I wonder how much of this can be explained by greater longevity.",
            "title_similarity": "0.1757182",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i31tbpz",
            "score": 2,
            "text": "It's a good thing we have so many 70 and 80 year olds running our government.",
            "title_similarity": "0.48517138",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i31tehn",
            "score": 2,
            "text": "Do you suppose this is because people are generally living long enough nowadays to have dementia?",
            "title_similarity": "0.53894734",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31thn4",
            "score": 2,
            "text": "people have increasingly eating a lot more garbage. like animals products aren’t really healthy but their use is almost never cautioned against.",
            "title_similarity": "0.32068115",
            "sentiment_compound": 0.4378
        },
        {
            "id": "i31tq9c",
            "score": 2,
            "text": "it's all the toxins in the world they created.  it'll be worse as things get worse",
            "title_similarity": "0.3999978",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i31tvht",
            "score": 2,
            "text": "Something to be said for assisted suicide.  I am a giant fan of being the only person who gets to die in my body.",
            "title_similarity": "0.44066563",
            "sentiment_compound": -0.7964
        },
        {
            "id": "i31tz1x",
            "score": 2,
            "text": "This is why they say you should get 8 hours of sleep every night. It's proven to lower the chances of alzheimer's and dementia",
            "title_similarity": "0.53640604",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i31u2v1",
            "score": 2,
            "text": "I wonder what the age difference is, between these people now and then.  Are they older?  \n\nThe most likely thing would be changes in the way things are diagnosed.  More and more hospitals are being driven to diagnose EVERY condition, when 2 decades ago they tended to just diagnose relevant ones. Mild dementia isn’t really relevant when a patient dies from a heart attack…. But now it affects reimbursement and other quality measures so it is put down on paper when it wouldn’t have been before.",
            "title_similarity": "0.70063627",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i31u478",
            "score": 2,
            "text": "Is the presumption that people’s bodies are outliving their minds or that cognitive decline is beginning at an earlier age in more of the population?",
            "title_similarity": "0.45348793",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31u4h2",
            "score": 2,
            "text": "Let me guess; heavy metals, plastics, pollution are also up more than 36%?",
            "title_similarity": "0.59999144",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31utu3",
            "score": 2,
            "text": "Modern civilization is killing us. Terrible diets, no exercise, terrible media consumption etc etc",
            "title_similarity": "0.3598803",
            "sentiment_compound": -0.799
        },
        {
            "id": "i31uvq3",
            "score": 2,
            "text": "Cool - sounds like the NHS is doing such a good job that enough people are able to live long enough to get dementia. Dementia is horrific, but an uptick can just as easily be caused by a drop in other illnesses.",
            "title_similarity": "0.47593644",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i31v4q3",
            "score": 1,
            "text": "Makes sense people are living longer but dieing of things we don't understand yet, interesting info",
            "title_similarity": "0.28940272",
            "sentiment_compound": -0.438
        },
        {
            "id": "i31v92q",
            "score": 33,
            "text": "Seriously, I don't wanna become 80. No fear of death, but scared to hell of dementia. Seen it too often.",
            "title_similarity": "0.40594262",
            "sentiment_compound": -0.9222
        },
        {
            "id": "i31vot9",
            "score": 1,
            "text": "My grandma had dementia. I helped my mom with taking care of her on occasion, because we simply couldn't afford full nursing home access. She didn't have Alzheimer's thankfully -- a truly insidious disease. The difference is pretty noticeable since she had control of motor functions and could eat cereal and such.   \n\n\nAnyway, she flirted with me by winking her eye at me like we were at an old sockhop and I'm surprised that I ever got an erection again after that",
            "title_similarity": "0.52795184",
            "sentiment_compound": 0.8798
        },
        {
            "id": "i31vvgm",
            "score": 2,
            "text": "I think dimentia is probably the most humane way to go. You die slowly without realising.",
            "title_similarity": "0.32410276",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i31vwxw",
            "score": 1,
            "text": "Isn't that because, overall, people are living longer, and the longer you live the more likely it is you will get dementia?",
            "title_similarity": "0.45298022",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31vzv1",
            "score": 1,
            "text": "We’ve gotten really good at fixing the body. The brain, not so much.",
            "title_similarity": "0.19875357",
            "sentiment_compound": 0.4927
        },
        {
            "id": "i31w8f4",
            "score": 2,
            "text": "It's a very convenient diagnosis. \n\nWho here has any experience with the way that those who are in care homes or who have carers coming into their own homes?\n\nNot just the elderly but vulnerable people of all types and ages.\n\nCarers get treated like crap and 95% of them take it out on the 'clients'.\n\nCovid got the blame for a couple of years though..",
            "title_similarity": "0.70952725",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i31waww",
            "score": 1,
            "text": "This is good, right? When I was a kid it was a ton of other diseases, which I assume we’ve cured or learned to manage. Could this be seen as progress in some way?",
            "title_similarity": "0.42028752",
            "sentiment_compound": 0.7236
        },
        {
            "id": "i31wzyu",
            "score": 2,
            "text": "Several reasons for that. A big one being that most cancers are treatable now, and we have better methods for treating heart disease. Those have traditionally been the big killers of people in the later years. More people are living long enough to die from something else, in this case dementia.",
            "title_similarity": "0.69020605",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i31x007",
            "score": 6,
            "text": "Isn't it true that the majority of people tend to die pretty horribly?\n\nEveryone seems to think old age asleep in bed is the \"good way\", and sort of gloss over that most of those people have a grab bag of dementia, incontinence, skin conditions, failing organs, cancer, chronic infections, incredibly slow healing wounds, basically blind, basically deaf and most likely a touch of arthritis along with any number of additional pains collected over a lifetime.\n\nI wonder how much morphine \"peacefully\" passing requires in general...",
            "title_similarity": "0.7216443",
            "sentiment_compound": -0.9191
        },
        {
            "id": "i31x1ce",
            "score": 2,
            "text": "Does it take into account that we are living longer?",
            "title_similarity": "0.15101306",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31xv6e",
            "score": 1,
            "text": "Probably all the old pipes, lack of health care, lack of exercise, lack of good food",
            "title_similarity": "0.35531536",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i31y2t4",
            "score": 2,
            "text": "If you end up in the hospital as an old person, then you are likely to be discharged into rehab at a skilled nursing facility where you will be chemically restrained (Xanax, seroquel, what have you). This takes a long time to recover from, and may be part of the dementia diagnoses.",
            "title_similarity": "0.6263317",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31y5bx",
            "score": 1,
            "text": "Quantity over quality not always the best choice",
            "title_similarity": "0.10428313",
            "sentiment_compound": -0.5216
        },
        {
            "id": "i31yjn0",
            "score": 1,
            "text": "I've had four elderly family members die in the last few years and all had some form of dementia/ alzheimer's.",
            "title_similarity": "0.805026",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i31ylvc",
            "score": 1,
            "text": "Its like were all going crazy. We just live long enough to break our brains too.",
            "title_similarity": "0.33353412",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i31yrdh",
            "score": 1,
            "text": "This is why we have got to stop fluoridating water! It’s been cooking our neurons for generations now and now we live long enough to see the effects.",
            "title_similarity": "0.382547",
            "sentiment_compound": -0.3595
        },
        {
            "id": "i31z45o",
            "score": 1,
            "text": "I work in healthcare and we often do training modules. When it gets to Dementia, they always say \"It is not a normal part of aging.\"\n\nI know that's what they say, but I never believed it.",
            "title_similarity": "0.5595019",
            "sentiment_compound": 0.0
        },
        {
            "id": "i31z5o8",
            "score": 1,
            "text": "I think it’s laziness on the death certificate, my grandpa just died of complications from Covid and the dr who he never met and is 5 hours away wrote “senile dementia.” He was 93 so they just didn’t care.",
            "title_similarity": "0.6446918",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i31zdxk",
            "score": 1,
            "text": "I'm going to go ahead and blame plastics.",
            "title_similarity": "0.13751452",
            "sentiment_compound": -0.34
        },
        {
            "id": "i31zeza",
            "score": 1,
            "text": "People died earlier in their life this is the longest people have lived so yes dementia will play a factor. Also it was studied as much even a decade ago and now it’s being looked at through the lens.",
            "title_similarity": "0.7571925",
            "sentiment_compound": 0.3163
        },
        {
            "id": "i31zjbn",
            "score": 1,
            "text": "If one reads the Stoic literature, a different way to look at old age can be learned. In all honesty we take getting old way too serious. All my close relatives have died with severe dementia. Why? Why put yourself, why put us and the whole system through so much pain and suffering. Just because you should according to the believes of our current society? I bet dementia is a lot less prevalent in a country like South Korea, guess why.",
            "title_similarity": "0.63876235",
            "sentiment_compound": -0.8333
        },
        {
            "id": "i31zuh6",
            "score": 1,
            "text": "I'm so scared I'll lose one of my parents to dementia or Alzheimer's. My grandmother's Alzheimer's was rough. During one of our last conversations, she didn't know who I was. And she felt trapped and confused by her situation, and would frequently lash out at my aunt (her caretaker) in ways she never would when she was having good days. My parents are now in their late 60s, and I try to visit them as often as I can so I have as much time with them as possible. It's scary to think about.",
            "title_similarity": "0.61854684",
            "sentiment_compound": -0.9033
        },
        {
            "id": "i3200uo",
            "score": 1,
            "text": "Is this related to any increase in sugary foods(alzheimer's is known as diabetes type 3 for good reason!) and sedentary lifestyles?",
            "title_similarity": "0.45953506",
            "sentiment_compound": 0.6696
        },
        {
            "id": "i320aah",
            "score": 1,
            "text": "I’ve taken detailed notice over the last 5 years. I’m 47. My family has a history, and I’m lockstepping into it. I’ll decline faster than my grandparents. My mother is doing well, but I can see her dealing with markers as well. It’s terrifying at times.",
            "title_similarity": "0.6201459",
            "sentiment_compound": -0.431
        },
        {
            "id": "i320b2w",
            "score": 1,
            "text": "Beginning symptoms could be anything from forgetfulness to loss of bladder control to mood swings and poor impulse control",
            "title_similarity": "0.26152974",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i320dht",
            "score": 1,
            "text": "It’s because of more of the population reaching increased age.",
            "title_similarity": "0.25422478",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i320fjb",
            "score": 1,
            "text": "Do more people have it or are we better at detecting it? Either way. We will all get something and die eventually.",
            "title_similarity": "0.28241098",
            "sentiment_compound": -0.25
        },
        {
            "id": "i320u9v",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i3211q3",
            "score": 1,
            "text": "Just remember nurses, doctors, and lawyers are the same as mechanics and just about any job, some are great most are good and  a lot of them are idiots. I bet dementia is over diagnosed",
            "title_similarity": "0.59205025",
            "sentiment_compound": 0.8062
        },
        {
            "id": "i321r4e",
            "score": 1,
            "text": "*Over the age of 67..*; so twenty years later, people are gradually staying alive longer, despite their mental capacity further deteriorating as more time passes. We can fix and replace a whole bunch of stuff, but limited in some regards.",
            "title_similarity": "0.5349937",
            "sentiment_compound": -0.1406
        },
        {
            "id": "i321t1b",
            "score": 1,
            "text": "It's fascinating that so many here 'just' suspect better diagnosis. As if nothing else could have changed in terms of causing factors over the past decades.",
            "title_similarity": "0.44331652",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i322gjo",
            "score": 1,
            "text": "This is my fear.  Losing yourself while still alive.  I did some work at an alzheimers care facility and decided then and there that I'm glad I live in a death with dignity state.",
            "title_similarity": "0.50509804",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i322jnb",
            "score": 2,
            "text": "With the ever increasing pollution in the environment what do you expect!\n\nI bet a big part is from the plastic micro particles in our food and water.\n\nAnd everything raised up in the air from cars and factories.",
            "title_similarity": "0.2971929",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3235pv",
            "score": 2,
            "text": "The brain is a muscle. Keep working it out or it will get out of shape.",
            "title_similarity": "0.2271955",
            "sentiment_compound": 0.0
        },
        {
            "id": "i323m8j",
            "score": 1,
            "text": "what a terrifying bit of knowledge to hold as my parents get into their 70s.  Great.",
            "title_similarity": "0.45297706",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i323rc8",
            "score": 1,
            "text": "Does anyone know if this data has been scrubbed for the widespread “dosing” conducted at elderly care facilities to make “troublesome” residents compliant?",
            "title_similarity": "0.5234301",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i3247gm",
            "score": 1,
            "text": "My father meets the category of “Advanced Alzheimer’s.” After vacationing with my MIL, here we go again. Those changes make themselves apparent so quickly.",
            "title_similarity": "0.52047586",
            "sentiment_compound": 0.0
        },
        {
            "id": "i324ex2",
            "score": 1,
            "text": "Sometimes it's caused by a stroke or alcoholism or genetic conditions.",
            "title_similarity": "0.37264305",
            "sentiment_compound": 0.0
        },
        {
            "id": "i324lpg",
            "score": 1,
            "text": "Eh isn’t that kind of impart to reporting? We have just recently like 20-30 years, invented the internet and opened it up to all.  We have since been inventing more and more ways to track data.  I think this is the case with Asperger‘s and autism like the amount of cases appeared to grow but it was just due to better data taking and better earlier diagnosis.",
            "title_similarity": "0.538566",
            "sentiment_compound": 0.8807
        },
        {
            "id": "i325ogk",
            "score": 1,
            "text": "I would bet just about anything that the vast majority of this increase can be explained by increased recognition/diagnosis not actually an increase in the true incidence",
            "title_similarity": "0.3626477",
            "sentiment_compound": 0.677
        },
        {
            "id": "i325sd8",
            "score": 3,
            "text": "Psychedelic medicine may be a potential solution: https://www.frontiersin.org/articles/10.3389/fnsyn.2020.00034/full",
            "title_similarity": "0.20378062",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i325zjr",
            "score": 1,
            "text": "I keep reading that dementia rates are going down?",
            "title_similarity": "0.4718879",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3268e0",
            "score": 1,
            "text": "Prob going to multiply now, seeing as we’ve all been injected with god doesn’t even know what!",
            "title_similarity": "0.32305267",
            "sentiment_compound": 0.3382
        },
        {
            "id": "i326g7v",
            "score": 3,
            "text": "People are also living longer than they used to. Correlation perhaps?",
            "title_similarity": "0.32506597",
            "sentiment_compound": 0.0
        },
        {
            "id": "i326jl0",
            "score": 2,
            "text": "all this speculation when the 2nd paragraph says\n>But that sharp rise may have more to do with better public awareness, more detailed medical records and Medicare billing practices than an actual rise in the condition, the researchers say.",
            "title_similarity": "0.42388898",
            "sentiment_compound": 0.5927
        },
        {
            "id": "i326nng",
            "score": 1,
            "text": "I mean if it’s in your genes can you *really* “prevent” dementia? Or is it just potentially delaying the onset?",
            "title_similarity": "0.36450735",
            "sentiment_compound": 0.0
        },
        {
            "id": "i326ytg",
            "score": 1,
            "text": "We've nearly mastered the body but we're still scratching the surface of the brain",
            "title_similarity": "0.30722392",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3271mu",
            "score": 1,
            "text": "Well this was listed on my moms, but in fact that is not why she died.  It was an easy diagnosis.  We were going to fight it but didn’t want to spend 10k on an autopsy.  So while the record is incorrect, it wasn’t feasible to contest it.  My understanding is that this is the default diagnosis and isn’t really questioned and an easy way to wrap up the paperwork.",
            "title_similarity": "0.35288823",
            "sentiment_compound": 0.846
        },
        {
            "id": "i3273jy",
            "score": 1,
            "text": "That's what happens when you put lead in paint and gasoline for a few decades I suppose",
            "title_similarity": "0.5567679",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3278sw",
            "score": 1,
            "text": ">Two Decades Ago\n\nOkay, so think back to where EHR (electronic health records) were back two decades ago. \n\nThink back to where diagnoses for dementia and Alzheimer’s was two decades ago. \n\nWhile I’m not uncertain that there isn’t a thing to be said here there are strong variables to take into account.",
            "title_similarity": "0.5982734",
            "sentiment_compound": 0.7259
        },
        {
            "id": "i327beb",
            "score": 1,
            "text": "Guys just putting this out here in 23 and am pretty sure I’m getting early on set dementia.",
            "title_similarity": "0.5501518",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i327h0j",
            "score": 1,
            "text": "Medicare pays more for patients with dementia so there is a very high incentive to test for and diagnose it now. I have to imagine this is the main reason for such a short term change",
            "title_similarity": "0.44435272",
            "sentiment_compound": 0.4173
        },
        {
            "id": "i327p1w",
            "score": 1,
            "text": "What is the likelihood this is caused by microplastics? I'm starting to think they look like a possible suspect for things like dementia and autism. It would explain the sudden onset.",
            "title_similarity": "0.37087554",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i327wgd",
            "score": 1,
            "text": "Simple, if you are old, you are likely to get delirium or dementia.\n\nIf you are in the ICU you are likely to get ICU delirium.\n\nIf you get sepsis you are likely to get delirium or dementia. \n\nAlso, medicare reimburses/pays for that diagnosis when it gets treated so why not added to the bunch?",
            "title_similarity": "0.6257722",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3281ps",
            "score": 1,
            "text": "Less exercise and more stress.",
            "title_similarity": "0.056679346",
            "sentiment_compound": -0.4754
        },
        {
            "id": "i3283w2",
            "score": 1,
            "text": "Does this just mean that we’ve better and more targeted at diagnosing? Have the numbers of those diagnosed gone down proportionality.",
            "title_similarity": "0.37730917",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i328kdn",
            "score": 3,
            "text": "“Fat makes you fat” they were sold on a lie funded by big sugar companies. Now these peeps are paying the price.",
            "title_similarity": "0.38779807",
            "sentiment_compound": 0.0
        },
        {
            "id": "i328u23",
            "score": 1,
            "text": "Just remember death is one heart beat away from the living",
            "title_similarity": "0.36384133",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i329al9",
            "score": 1,
            "text": "Usually it can be added by a family member just alluding they have dementia...\n\nBut normally the level of dementia we see is in 90+ year olds who clearly are just poor historians.",
            "title_similarity": "0.76182836",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i329jmt",
            "score": 1,
            "text": "Most likely a difference in diagnosis criteria/testing methods.",
            "title_similarity": "0.110265",
            "sentiment_compound": 0.0
        },
        {
            "id": "i329uab",
            "score": 1,
            "text": "Boy, can't wait till I can't remember all this trauma.",
            "title_similarity": "0.1177078",
            "sentiment_compound": -0.5023
        },
        {
            "id": "i32a30f",
            "score": 1,
            "text": "Probably because they are being pumped full of benzos.\n\nElderly people love their little blue pills to help them sleep.\n\nSide effect, known to cause dimentia.",
            "title_similarity": "0.43910125",
            "sentiment_compound": 0.7845
        },
        {
            "id": "i32a5mk",
            "score": 1,
            "text": "I have this strange and horrifying sense that this will happen to me one day.",
            "title_similarity": "0.11051025",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i32ablo",
            "score": 1,
            "text": "That's what seed oils and refined carbohydrates will do.",
            "title_similarity": "0.027950969",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32ah3h",
            "score": 1,
            "text": "My hope is that we’ll make euthanasia legal. I worked a while in a LTC facility and saw the decline in many of our patients….just warehoused there, forgotten by the family, Medicare funded until it’s over. \n\nI still have nightmares from my first week on the job.",
            "title_similarity": "0.70709026",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i32anof",
            "score": 1,
            "text": "there’s another factor to keep in mind-sometimes nursing homes will make it seem like the residents have a condition like dementia and whatnot, so they can get away with medicating them with sedatives, so they’ll be more compliant. it’s not in necessarily in the person’s best interests nor accurate.",
            "title_similarity": "0.38072747",
            "sentiment_compound": 0.8807
        },
        {
            "id": "i32auhj",
            "score": 1,
            "text": "Medicine has acheived leap years in helping our bodies be as physically healthy as they can be....with the exception of brain health.  Living with a parent with dementia....it is utterly heartbreaking....and the cost of care is financially straining....",
            "title_similarity": "0.59135973",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i32bmco",
            "score": 1,
            "text": "Probably because we're cutting down on deaths from other reasons and eventually everyone will get dementia or cancer. Who knows we may cut down on those two in the future and people will die from loss of blood due to their paper thin skin and constant skin tears.",
            "title_similarity": "0.5867547",
            "sentiment_compound": -0.9337
        },
        {
            "id": "i32bmxk",
            "score": 1,
            "text": "After seeing the effects of lead all through their lives from the 1930s-1970s, can't wait to see what new horrors await us with all the micro plastics in our blood",
            "title_similarity": "0.49325264",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i32bxqh",
            "score": 1,
            "text": "Well it's good to know I won't have any idea that I'm old and dying when I'm old which I am, really, going on 80.",
            "title_similarity": "0.41254804",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i32c0t0",
            "score": 1,
            "text": "I wonder how it correlates to age of death?  Could it be more prevalent because people are living longer?",
            "title_similarity": "0.4213724",
            "sentiment_compound": -0.644
        },
        {
            "id": "i32chfs",
            "score": 1,
            "text": "I’m a speech therapist working w these folks, I stage dementia all day long. I don’t know exactly but I suspect people are probably artificially kept alive w meds and surgeries etc a lot after insults that should have killed them or a disease process that would burn out faster without the interventions - so when your body isn’t as efficient or some parts aren’t working and it can’t change course quickly enough to make up for it - your brain, like any other organ, isn’t going to work as well. I get the sense the majority of older adults w dementia never get past the very mild stages and don’t actually die of dementia. And the article only says they’re seeing it listed more, not that the incidence has increased, necessarily \n\nLike it says in the article also - billing is probably a lot of this. Insurance companies expect you to justify certain interventions w a diagnosis code to justify them, and sometimes they’re won’t cover particular interventions without particular codes - I wonder if it’s just that the trend has been giving out more interventions - whether it’s therapy, just saying the person is more dependent to get $ for the facility - that require these codes?",
            "title_similarity": "0.64749044",
            "sentiment_compound": 0.5499
        },
        {
            "id": "i32cnpt",
            "score": 1,
            "text": "I hope I get dementia so I don’t know I’m going. Sounds like a better way than being conscious with cancer knowing you’re going to die.",
            "title_similarity": "0.52359056",
            "sentiment_compound": -0.25
        },
        {
            "id": "i32cxtv",
            "score": 3,
            "text": "Extending life with our current medicine unfortunately means condemning everyone to die of Dementia, Cancer, Heart Attack, and Stroke\n\n3 in 20 people develop dementia and 1 in 6 will die of cancer. That right there is already 30% of the population. \n\n1 in 3. Think of how many people you know. Now consider that every third person will succumb to one of two things.",
            "title_similarity": "0.78342056",
            "sentiment_compound": -0.9578
        },
        {
            "id": "i32d81q",
            "score": 1,
            "text": "Leaded gasoline and paint. Hell gasoline exhaust is nasty even today",
            "title_similarity": "0.28880566",
            "sentiment_compound": -0.886
        },
        {
            "id": "i32dere",
            "score": 1,
            "text": "Yeah! That must mean heart disease is down!\n\nTLDR: we all die eventually.",
            "title_similarity": "0.5316913",
            "sentiment_compound": 0.4738
        },
        {
            "id": "i32dmqn",
            "score": 1,
            "text": "Maybe its the constant advertisements berating us, high stress, and our constant work load. Though my money's on corporate greed selling us something they knew was bad for us twenty years ago but didnt take seriously.",
            "title_similarity": "0.46812862",
            "sentiment_compound": -0.4978
        },
        {
            "id": "i32dnjl",
            "score": 5,
            "text": "My grandfather has dementia and is in a nursing home.\n\nIn the last month has had a minor heart attack and covid. It honestly just feels like we're waiting for something to kill him and that wouldn't be the worst thing. \n\nThere is so much guilt on the family side because it's not how anyone should live but noone is financially or physically capable to take care of him.\n\nIt's a sad thought for a man who lived a great life and loved me unconditionally.",
            "title_similarity": "0.6705588",
            "sentiment_compound": 0.9419
        },
        {
            "id": "i32dout",
            "score": 1,
            "text": "Sounds like we got better at diagnosing",
            "title_similarity": "0.16421445",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i32dru9",
            "score": 1,
            "text": "Look at the labels on just about any package in the grocery and note the many, many additives & you will understand why",
            "title_similarity": "0.2762485",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32eh4g",
            "score": 2,
            "text": "I worked in two assisted living facilities. People don't do autopsies on 90 year Olds with failing health. Also, when you have hospice involved there's there's good chance they'll dose the elderly with so much morphine they stop eating and slip into a drug coma. I've seen it and it's completely f'd up.",
            "title_similarity": "0.64726555",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i32f36a",
            "score": 1,
            "text": "I hope we find a cure or something to stop dementia and alzheimers",
            "title_similarity": "0.37405404",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i32f4uj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.010171823"
        },
        {
            "id": "i32fv3e",
            "score": 1,
            "text": "What role does our diet play in this? Processed foods have become significantly more common over the decades.",
            "title_similarity": "0.4840355",
            "sentiment_compound": 0.34
        },
        {
            "id": "i32gwk6",
            "score": 1,
            "text": "Now, my question is do we take this as something to be concerned about? In regards to something happening to cause this?\n\nOr, a realization that this is a common occurrence with older age and should take this into account?",
            "title_similarity": "0.22700982",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32gyk7",
            "score": 1,
            "text": "People are living way longer than they use to…",
            "title_similarity": "0.33130595",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32har2",
            "score": 2,
            "text": "Look into how many incredible toxins are in the foam of modern day furniture. As it degrades, we breath it in. When there is a fire it's even more cancerous.\n\nI really am not a conspiracy person, but when I went through firefighter training this was talked about extensively.",
            "title_similarity": "0.4781159",
            "sentiment_compound": -0.2173
        },
        {
            "id": "i32hpyy",
            "score": 1,
            "text": "We just live too damn long nowadays.  Maybe the lower life expectations of the past were better.  Gave you the chance to die before your brain crapped out.",
            "title_similarity": "0.37088823",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i32hq69",
            "score": 1,
            "text": "the more you use your brain, the better off you'll be. many doctors, professors, are sharp as a mf in their later years (if they continue to work).",
            "title_similarity": "0.54845214",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i32i460",
            "score": 1,
            "text": "two decades ago genetically enginered food n bovine growth hormone were just starting to be applied massively to increase crop yields",
            "title_similarity": "0.4480843",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i32iarq",
            "score": 3,
            "text": "The average life expectancy in developed nations has probably outpaced the appropriate life expectancy for humans.",
            "title_similarity": "0.4364823",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32icu8",
            "score": 1,
            "text": "Pretty sure I've got the starting signs. My head feels screwed up all the time.",
            "title_similarity": "0.31435043",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i32ijdz",
            "score": 1,
            "text": "Well this is something to look forward to. Shame I won’t remember that it was something I planned for.",
            "title_similarity": "-0.026465846",
            "sentiment_compound": -0.25
        },
        {
            "id": "i32j948",
            "score": 1,
            "text": "This seems skewed based on billings for services related to dementia among other factors. First, testing shouldn't count. Second, people are living longer. When Doc Holliday died at 36 he had no signs of old age let alone dementia.",
            "title_similarity": "0.63628805",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i32jfjf",
            "score": 1,
            "text": "I’m only 24 but I can’t help but feel like I have dementia sometimes stupid since in a nurse but my issues with ADHD are staggering and only worsening.. it’s all surrounding memory and even the ability to form thoughts and language in ways constructive and fully graspable to people outside… it’s hard to explain and I just really hope it’s natural stupidity and not a worsening condition",
            "title_similarity": "0.5207257",
            "sentiment_compound": 0.7817
        },
        {
            "id": "i32jndm",
            "score": 1,
            "text": "Here's the question though- is the prevalence higher, or are we just better at diagnosing dementia add something other than and separate from 'normal' aging?",
            "title_similarity": "0.40487957",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i32ju6x",
            "score": 1,
            "text": "Dementia scares me. I’ve seen all kinds of dementia. It’s terrifying.",
            "title_similarity": "0.45860252",
            "sentiment_compound": -0.7269
        },
        {
            "id": "i32l3en",
            "score": 3,
            "text": "Tbh it is because we actually diagnose most diseases rather than lettings them pass as old age\n\nAnd moreover we live for longer and tbh the brain may be one of the things that remain the same since teens",
            "title_similarity": "0.50809383",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32lbwt",
            "score": 4,
            "text": "right, but if life expectancy has risen, then more people are reaching the ages affected by dementia, right? that’s got to account for at least some.",
            "title_similarity": "0.5057132",
            "sentiment_compound": 0.1768
        },
        {
            "id": "i32lre9",
            "score": 1,
            "text": "Watching my grandfather get dementia has been awful. He doesn’t recognize barely anymore. We had to put him in a home the day after my grandmother died at 78 of ovarian cancer.\n\nThe crazy part? He turns 90 in a few days, started smoking cigarettes at age 11 and didn’t quit until he was 76, drank every night, ate like crap, never exercised, as opposed to my grandmother who quit smoking when the warning came out, barely drank and took care of herself. And yet she died of cancer well before him. \n\nLife is so strange.",
            "title_similarity": "0.6886877",
            "sentiment_compound": -0.9681
        },
        {
            "id": "i32m9xm",
            "score": 1,
            "text": "Did laws change so that dimentia earns hospitals and nursing homes more due to non-rehabilitation classification? Maybe irs laws changed to incentivize caretakers? How does this compare to other countries?",
            "title_similarity": "0.45337975",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32nzjf",
            "score": 1,
            "text": "I'm sure all of those leaded gas fumes, lead paint chips and lead pipes everywhere for water back in the day has nothing to do with this.",
            "title_similarity": "0.32280794",
            "sentiment_compound": 0.296
        },
        {
            "id": "i32otqr",
            "score": 1,
            "text": "We’ve reached a point where we have extended our bodies lifespan farther than our brain can handle.  \n\nHow to augment this could be interesting.  Possible Johnny Pnumonic vibes.",
            "title_similarity": "0.37909093",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i32p075",
            "score": 1,
            "text": "Stress, stress, medications like benzos and more stress. Makes sense.",
            "title_similarity": "0.16892028",
            "sentiment_compound": -0.7346
        },
        {
            "id": "i32p2b7",
            "score": 1,
            "text": "As someone getting up there whose memory is starting to slip, this scares the living hell out of me",
            "title_similarity": "0.24320646",
            "sentiment_compound": -0.81
        },
        {
            "id": "i32p5p0",
            "score": 1,
            "text": "Our food and water are polluted with PSAS, \"the forever chemical\" and we are exposed to more and more chemicals all the time. They refuse to stop polluting our ground water and aquifers with fracking chemicals and more. \n\nThere's a good reason this sort of thing is becoming more of a thing and it won't stop till our government isn't fueled by corporate greed.",
            "title_similarity": "0.3502733",
            "sentiment_compound": -0.654
        },
        {
            "id": "i32piba",
            "score": 1,
            "text": "Watch [The Bleeding Edge ](https://www.google.com/search?q=replacement+surgery+linked+to+memory+loss+netflix&client=firefox-b-1-m&sxsrf=APq-WBvvIuY-vLCXGWIegNyGKdAlRr-eLg%3A1648875128477&ei=eNZHYrHoHJnJptQP2r-yKA&oq=replacement+surgery+linked+to+memory+loss+net&gs_lcp=ChNtb2JpbGUtZ3dzLXdpei1zZXJwEAEYAjIFCCEQoAEyBQghEKABMgUIIRCgAToHCCMQsAMQJzoHCAAQRxCwAzoFCCEQqwJKBAhBGABQxApYqSBg_StoAXABeACAAfMBiAGvBZIBBTAuMy4xmAEAoAEByAEJwAEB&sclient=mobile-gws-wiz-serp)on Netflix. It links replacement surgeries with memory loss. I wonder how many older people died with “dementia” that really had metal poisoning?",
            "title_similarity": "0.40427703",
            "sentiment_compound": -0.884
        },
        {
            "id": "i32pwg3",
            "score": 1,
            "text": "I guess that's the lead-based generation finally coming of age",
            "title_similarity": "0.33000326",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32r5cx",
            "score": 1,
            "text": "Gotta die of something.",
            "title_similarity": "0.16121608",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i32reoa",
            "score": 1,
            "text": "Can I ask a phunny question about possible reasons?",
            "title_similarity": "-0.067406416",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32s65k",
            "score": 1,
            "text": "Without reading all the way down… Alzheimers was originally “early onset dementia” so I’m now technically too old to be diagnosed even though it’s already slip sliding away. A review of twenty years of diagnoses is more of a historical analysis than a medical one. Doctors are influenced by many things that vary over time and reimbursable diagnosis is one favorable to the patient, the family and the caregivers. Don’t get paperwork mixed up in your medicine.",
            "title_similarity": "0.59381706",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i32sbzq",
            "score": 1,
            "text": "I heard years ago it was caused by aluminium in deodorant. So I haven't used antiperspirant for like 15 years",
            "title_similarity": "0.5789918",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i32sh3i",
            "score": 1,
            "text": "I going to bet it because of our ignorant use of plastics.",
            "title_similarity": "0.09308911",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i32shwv",
            "score": 4,
            "text": " Recent data from research into Psychedelic compounds such as Psilocybin and DMT is showing incredible results for patients with dementia. \n\nThese compounds have numerous benefits for not only psychiatric issues such as ptsd and Medication resistant depression, but even more amazingly, new neural pathway/connections.  *Neurogenesis.\n\nHopefully one day dementia will be treatable and preventable.",
            "title_similarity": "0.39860523",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i32t72q",
            "score": 1,
            "text": "in the US? how does it compare?",
            "title_similarity": "0.00041496754",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32ta8b",
            "score": 3,
            "text": "And consumption was a common diagnosis 100 years Ago",
            "title_similarity": "0.40084583",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32tmt7",
            "score": 3,
            "text": "Woo! Lead paint, lead fuel… all coming back now. I’m pulling this out of my arse.",
            "title_similarity": "0.33825314",
            "sentiment_compound": 0.5255
        },
        {
            "id": "i32ttd5",
            "score": 1,
            "text": "Better living though science. Petrochemicals are my guess",
            "title_similarity": "0.17499813",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i32uy5k",
            "score": 3,
            "text": "Human batteries lose their efficiency just like iPhones. To many apps running in the background these days.",
            "title_similarity": "0.4405492",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i32vt0l",
            "score": 1,
            "text": "Leaded gas? Longer life? Micro plastic?",
            "title_similarity": "0.1661179",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32w3mm",
            "score": 1,
            "text": "Gotta be all the Roundup in the soil…",
            "title_similarity": "0.050569877",
            "sentiment_compound": 0.0
        },
        {
            "id": "i32wq9f",
            "score": 3,
            "text": "Awesome,. Can't  wait!",
            "title_similarity": "-0.14930356",
            "sentiment_compound": 0.6588
        },
        {
            "id": "i32xp43",
            "score": 1,
            "text": "Prions and mad cow disease (are those the same or different?) is my guess.",
            "title_similarity": "0.26328784",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i32xz94",
            "score": 1,
            "text": "If I get dementia, I want to be euthanized. Sorry if that's offensive to anyone.",
            "title_similarity": "0.3610316",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i32yg4r",
            "score": 4,
            "text": "I would wager dollars to donuts this is almost all about continuous trauma from work stress. We recently had a study posted here that indicated its becoming more frequent within comparison groups of the same age now vs a decade ago.",
            "title_similarity": "0.6676588",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i32z8v3",
            "score": 1,
            "text": "Is it just better diagnostics?",
            "title_similarity": "0.043335706",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3300lz",
            "score": 1,
            "text": "Feeling bad about knowing this.",
            "title_similarity": "0.08328083",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i330be4",
            "score": 1,
            "text": "How does the death feel? It feels like “you put a woollen cloth on a flower which has thorns along side its stem. And pull the cloth as quickly as possible. The petals of the flower will come along with that cloth, but the thorns will damage the cloth in their own unique way. Thats how a soul is captured like those rose petals. Thats what the body experiences just like what thorns did to the cloth”",
            "title_similarity": "0.25275755",
            "sentiment_compound": 0.128
        },
        {
            "id": "i331e7a",
            "score": 2,
            "text": "It doesn’t help when the elderly doesn’t get proper care or socialization. :/",
            "title_similarity": "0.20634359",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i331icd",
            "score": 1,
            "text": "Honestly I’m not sure we’re meant to live past about 35.",
            "title_similarity": "0.3880122",
            "sentiment_compound": 0.2589
        },
        {
            "id": "i33219c",
            "score": 1,
            "text": "Is it more common or do we just know the signs better ?",
            "title_similarity": "0.02336691",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i33277y",
            "score": 1,
            "text": "Are they all heading footballs then?",
            "title_similarity": "0.16406573",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3327m0",
            "score": 1,
            "text": "Maybe it’s all the drugs and day care centers as well as the total neglect and abandonment in nursing homes.\n\nFood for thought.",
            "title_similarity": "0.50320387",
            "sentiment_compound": -0.3933
        },
        {
            "id": "i3329vf",
            "score": 1,
            "text": "36% up instead of several other diseases and conditions that medicine prevented?",
            "title_similarity": "0.6540973",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i332g3q",
            "score": 2,
            "text": "Hmmmm what terrible chemicals did we release 60 years ago?",
            "title_similarity": "0.42087695",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i332pox",
            "score": 1,
            "text": "Maybe this: Brains needs cholestorol!. And most part of the medical world believes \"cholestorol is  dangerous\" so they try to give (older) people \"lower-youre-cholestorol-advice\".\nSo most people do whatever necessary to lower their cholestorol-levels in their body (pills, food) - maybe side effect: damaged brains... hence dementia/alzheimer.\nMore research needed!",
            "title_similarity": "0.5373479",
            "sentiment_compound": -0.8309
        },
        {
            "id": "i333ao0",
            "score": 1,
            "text": "Matthew Walker talks about how important sleep is for Alzheimers and dementia, and how caffeine later in the day causes a 30-40 percent loss of deep sleep. My guess would be this is one of the biggest reasons since everyone is just sleeping 6 hours nowadays and caffeine usage is going up",
            "title_similarity": "0.7362696",
            "sentiment_compound": -0.128
        },
        {
            "id": "i333d84",
            "score": 1,
            "text": "Yeah cause we're all kidding our fckn minds now.",
            "title_similarity": "0.13594626",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i334u8f",
            "score": 2,
            "text": "I wonder if it has to do with lead content in older stuff?",
            "title_similarity": "0.30147237",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3354ma",
            "score": 1,
            "text": "It’s almost like our bodies weren’t made to live as long as we do now!",
            "title_similarity": "0.30569983",
            "sentiment_compound": 0.3609
        },
        {
            "id": "i33584k",
            "score": 1,
            "text": "Where was this study taken?",
            "title_similarity": "0.008345582",
            "sentiment_compound": 0.0
        },
        {
            "id": "i335gsa",
            "score": 1,
            "text": "A nurse I work with has a theory that it’s high sugar intake that’s causing high numbers of dementia sufferers",
            "title_similarity": "0.5558622",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i335mg8",
            "score": 1,
            "text": "Does anyone in the medical community think this stat is simply due to our now having a name for this diagnosis? Before, it was just called old age. Our brains deteriorate just as our other body parts as we get closer to end of life. Example: locked bowel syndrome was a common cause of death listed on death certificates 100 yrs ago. We now know this to be probable colon cancer. \n\nI don’t mean to sound callus, but we are all going to die. We have to die of something. Medical advances continue to alter many previous common causes. Heart surgeries, replacement, etc have reduced this as most common cause. Diabetes is finally being taken more seriously by patients, cancer advances always improving survival rates…I mean, what do you want to be the cause of your eventual death? Our body parts only have a finite lifespan. \n\nI’ve lost several aging family members the past 10 yrs and I’m telling you, a slow deterioration, prolonged end full of impairments, disablements and pain is not what I want for myself or those I leave behind… but it does seem like the days of hearing, “he died peacefully in his sleep” are rare. If I had a choice, sudden and unexpected seems a better way.\n\nEdit: I was so eager to share my opinion on this, I didn’t read many others. I see now, many people feel as I do. Sorry to be repetitive…. But not sorry enough to remove post- hahaha",
            "title_similarity": "0.6696632",
            "sentiment_compound": -0.9108
        },
        {
            "id": "i336e6a",
            "score": 1,
            "text": "Vaccines and medicine go brrr.\n\nOld people living off nature are healthy.",
            "title_similarity": "0.3774275",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i336mi3",
            "score": 1,
            "text": "From my experience working in healthcare I would argue not everyone actually has dementia, often it is written down they have a diagnosis simply because they have memory problems and it hasn't been checked.\n\nI'm sure more people do suffer from it but also some is due to a mass game of Chinese whispers.",
            "title_similarity": "0.5932236",
            "sentiment_compound": -0.5076
        },
        {
            "id": "i336p9s",
            "score": 1,
            "text": "I hope it won't happen to any of my parents, but is probably going to happen to me one day, I banged my head multiple times in my life, and on top of that I even had covid.   \nI'll consider myself lucky if I make it to 60 while still making sense.",
            "title_similarity": "0.56797385",
            "sentiment_compound": 0.7814
        },
        {
            "id": "i338awk",
            "score": 1,
            "text": "This is so fucked up and scary as hell.",
            "title_similarity": "0.0941497",
            "sentiment_compound": -0.9373
        },
        {
            "id": "i338bml",
            "score": 1,
            "text": "Totally can't be all of these chemicals they've been adding to everything since the 80s right?",
            "title_similarity": "0.5463129",
            "sentiment_compound": 0.0
        },
        {
            "id": "i338h7p",
            "score": 1,
            "text": "It's all the lead paint they were eating. I swear.",
            "title_similarity": "0.4290087",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i338mac",
            "score": 1,
            "text": "Is this at all related to the revelation that a lot of boomers and Gen X'ers have lead poisoning?",
            "title_similarity": "0.5552862",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i3390wj",
            "score": 1,
            "text": "People are living longer, bodies don't last forever, you will die eventually.",
            "title_similarity": "0.39242363",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i3398uc",
            "score": 3,
            "text": "As a research student studying aging I'll provide a different perspective:\n\n- Age is by far the largest risk factor for dementia\n\n- The increase in dementia burden is a problem of our 'single disease' approach to medicine\n\n- Even if we could cure Alzheimer's, it would [add only 2 months to life expectancy](https://link.springer.com/article/10.1007/s10522-020-09901-y), as the next age-related disease in line afflicts you\n\n- Making people live longer by targeting one disease at a time does not improve resilience and overall disease susceptibility (see: [COVID-19](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7262305/))\n\nGeroscience researchers believe that chronic diseases like dementia have become a greater problem in the 21st Century as we do not target the biological aging process that fundamentally drives all the major diseases that come with age (cancer, dementia, heart disease etc). This apparent increase in dementia is perhaps secondary to reductions in smoking and the advent of statins/antihypertensives, because heart disease is delayed and patients are now surviving to ages where dementia becomes a problem. \n\nWe also know that [different organs can age at different rates](https://www.sciencedirect.com/science/article/pii/S2211124722001863), and this may partly explain the epidemiology.  \n\nHeart disease was the leading cause of mortality (and basically still is, but to a lesser extent), and success in delaying that has meant that we now develop the next disease in line. The current approach we have is described as 'whack-a-mole' medicine because we are merely trading one disease for the next, by targeting diseases one at a time.\n\nYet, if aging is the primary cause of the various diseases that accumulate with age, then targeting this biology will treat *multiple* diseases. This affords far greater potential to keep people healthy as they age, compared to single-disease approaches.\n\nThese are controversial claims, but there is preclincal evidence to support it. For example, the [Mayo Clinic mice](https://imgur.com/gallery/TOrsQ1Y) show how targeting aging to prevent/treat disease is overwhelmingly superior to traditional approaches.\n\nhttps://doi.org/10.1016/j.cell.2014.10.039\n\nhttps://doi.org/10.1016/j.tma.2017.09.004",
            "title_similarity": "0.67539793",
            "sentiment_compound": 0.9751
        },
        {
            "id": "i339eqs",
            "score": 1,
            "text": "We're dying less of other things however, and diagnosis of dementia is more common. If you eradicate some cause of mortality like heart disease for example, then the proportion of deaths from cancer, for example, will increase.",
            "title_similarity": "0.56574607",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i339gpp",
            "score": 1,
            "text": "The NIH is funding Alzheimer’s studies like crazy’s",
            "title_similarity": "0.51250947",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i33a498",
            "score": 3,
            "text": "“Why We Sleep” by Matthew Walker goes quite in depth into the association of sleep to dementia. The science is fascinating - highly recommend to anyone with even a small interest in sleep science, neuroscience and human performance/behaviours.",
            "title_similarity": "0.43123484",
            "sentiment_compound": 0.8516
        },
        {
            "id": "i33b43i",
            "score": 1,
            "text": "Fluoride and aluminum",
            "title_similarity": "0.094928876",
            "sentiment_compound": 0.0
        },
        {
            "id": "i33c0tc",
            "score": 1,
            "text": "I bet all the plastic and metal in our food has pretty much everything to do with that....",
            "title_similarity": "0.20726141",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i33cazd",
            "score": 1,
            "text": "I think I read somewhere this was being attributed to a massive uptick in micro plastics in our bloodstream",
            "title_similarity": "0.38695073",
            "sentiment_compound": 0.0
        },
        {
            "id": "i33d6k3",
            "score": 1,
            "text": "Is it a rise in dementia or is it an improvement in our ability to diagnose dementia? It used to be that getting old simply meant that your mind would dull and that was that.",
            "title_similarity": "0.5429317",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i33ds1j",
            "score": 1,
            "text": "yeah. because everyone gets older, all the other old age killers are slowly being taken care off (like, people used to die of heartconditions and strokes before they could slip far enough into dementia to be diagnosed) as well as our ability to diagnose dementia and it's likely there's a connection to the ever rising amount of corn syrup in average food budget and this too.\n\nso while it's concerning to see in numbers, it's not unexplained or weird.",
            "title_similarity": "0.65576726",
            "sentiment_compound": 0.3855
        },
        {
            "id": "i33e4gl",
            "score": 1,
            "text": "To be fair it's increasing in the younger populations too see qanon and Trump supporters",
            "title_similarity": "0.27357817",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i33eypf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i33fe77",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i33feo3",
            "score": 1,
            "text": "Mental overwork and working to old definitly",
            "title_similarity": "0.24677245",
            "sentiment_compound": 0.0
        },
        {
            "id": "i33fggu",
            "score": 1,
            "text": "I can hear it now from the teens ans twenties set.  Anyone over thirty has dementia and therefore whatever they have to say is worthless.",
            "title_similarity": "0.69966674",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i33fhr4",
            "score": 1,
            "text": "Whats the cause of dementia? One of my grandpa died from demetia and he used to smoke and drink alot. My other grandpa never smoke or drink and he’s healthy af..I wonder if smoking and drinking affects it alot",
            "title_similarity": "0.56662744",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i33flk6",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.010171835"
        },
        {
            "id": "i33g6lj",
            "score": 1,
            "text": "I bet the drug revolution of the 1960s and 70s had a bit to do with this.",
            "title_similarity": "0.3484635",
            "sentiment_compound": 0.0
        },
        {
            "id": "i33gkbq",
            "score": 2,
            "text": "Gee, I wonder if it has anything to do with our lead water pipes and all the over processed garbage we eat? Who thinks it’s more important to spend money bombing 3rd world countries than replacing the lead water pipes we drink out of?",
            "title_similarity": "0.42982143",
            "sentiment_compound": 0.3513
        },
        {
            "id": "i33gt6y",
            "score": 1,
            "text": "It feels intuitive that all the things that are killing the planet are killing us. Alzheimer’s may be a horrifying manifestation of that reality.",
            "title_similarity": "0.41889536",
            "sentiment_compound": -0.926
        },
        {
            "id": "i33h9ko",
            "score": 1,
            "text": "It's amazing what years of research will allow as far as expanding diagnostic parameters. A lot of disabilities and disorders have had productive research and now we can see different markers or presenting symptoms/traits  which makes proper diagnosis more likely than it used to be.",
            "title_similarity": "0.3899895",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i33i4lh",
            "score": 1,
            "text": "Purely opinion, but I think life style is a huge factor - diets high in processed foods and sugars effect brain health. Exercise and other activity is also a factor for brain health. So, stop eating out twice a day, sitting on your sofa watching tv or gaming or playing with your phone, it’s bad for your whole body. Spend time outside, do a variety of physical activities, exercise, read books, spend time with people in person, cook the majority of your meals and avoid processed foods, red meat, and fried foods. Include in your diet plenty of protein and vegetables. Be mindful of foods that cause inflammation. Take vitamins. And, most importantly, talk to your doctor.",
            "title_similarity": "0.454916",
            "sentiment_compound": -0.4235
        },
        {
            "id": "i33j71u",
            "score": 1,
            "text": "NP here.  I will guess that vascular disease is responsible.  We are too dang fat.",
            "title_similarity": "0.28588617",
            "sentiment_compound": 0.6633
        },
        {
            "id": "i33jk84",
            "score": 1,
            "text": "2 things\nA) were living longer so now we're in an Era of our bodies lasting long enough that it's our brain wearing out\nB) we're also getting better at diagnosing things dementia better than we were a few years ago so \nIt's just like with autism the numbers are naturally going to increase when you get more adept at knowing when someone has it",
            "title_similarity": "0.513016",
            "sentiment_compound": 0.8709
        },
        {
            "id": "i33jrkj",
            "score": 1,
            "text": "How much of this can be laid at the feet of leaded gasoline fumes during formative years?",
            "title_similarity": "0.4339484",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i33k0l3",
            "score": 1,
            "text": "Something is really wrong. It’s either diet, chemicals, particulates, ettc. But this is insanely high.",
            "title_similarity": "0.21796161",
            "sentiment_compound": -0.2952
        },
        {
            "id": "i33luis",
            "score": 1,
            "text": "Congratulations; living older just equals more years of sickness. \n\nWe should be looking at increasing quality of life. Not living as long as possible.",
            "title_similarity": "0.47973764",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i33m201",
            "score": 1,
            "text": "I heard from someone retired who worked in medicine that it’s likely cholesterol drugs. The brain runs on cholesterol, so…\n\nIs there anything that conclusively refutes this? There’s multiple causes of each of the multiple types dementia, so obviously cholesterol meds aren’t responsible for all of it, but has their role been ruled out?",
            "title_similarity": "0.57708335",
            "sentiment_compound": 0.2523
        },
        {
            "id": "i33mfox",
            "score": 1,
            "text": "Are more people getting dementia, or are we getting better at diagnosing it?",
            "title_similarity": "0.43976903",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i33mike",
            "score": 1,
            "text": "Could it not be argued that people in the past could still have got dementia, but died of other causes that are more treatable today?",
            "title_similarity": "0.5111971",
            "sentiment_compound": -0.6536
        },
        {
            "id": "i33muo2",
            "score": 1,
            "text": "I'm not surprised. Put garbage into your body for 70 years and see what happens.  I'm not talking about bad choices either. I'm talking all the chemicals in our food  and the environment itself.",
            "title_similarity": "0.46498334",
            "sentiment_compound": 0.2924
        },
        {
            "id": "i33ngck",
            "score": 1,
            "text": "I wonder if microplastics could cause dementia. I have heard that dementia has something to do with brains becoming unable to purge waste during sleep or something like that. Maybe small amounts of microplastics in blood slowly gather in brain and plug something.\n\nNot that I actually know though, but I hope someone who knows better could tell if this is plausible.",
            "title_similarity": "0.4335672",
            "sentiment_compound": 0.8201
        },
        {
            "id": "i33o828",
            "score": 1,
            "text": "I had to fight to get dementia taken off my elderly friends chart. He was in and out of hospital and it kept showing up , because English isn’t his first language and he was hard of hearing.",
            "title_similarity": "0.6307095",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i33oeff",
            "score": 1,
            "text": "I hope there's no correlation in dementia and the recent discovery of the amount of micro-plastics found in people's blood streams.",
            "title_similarity": "0.39056885",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i33os58",
            "score": 1,
            "text": "No surprise here.  Dementia is a side effect of anti-anxiety drugs.  Opram commonly known as Ciprolex is widely prescribed.",
            "title_similarity": "0.46899912",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i33oz7b",
            "score": 1,
            "text": "Of course !! Have you seen what Americans eat!! ED is the first warning as those are the tiniest veins. Guess what happens when your brains veins/arteries get blocked….  Plant based eating allows your body to heal that damage. Too bad DRs and Big Pharma don’t want anyone to know that !!!",
            "title_similarity": "0.39389208",
            "sentiment_compound": -0.8741
        },
        {
            "id": "i33p5r0",
            "score": 1,
            "text": "My mom passed away of dementia at the age of 90, two years ago. She was very healthy all of her life, never got sick and yet her decline was quick, within 6 months, and a lot of it I think had to do with the pandemic, as we were not allowed to see her in person in those last 6 months.",
            "title_similarity": "0.66636115",
            "sentiment_compound": 0.6903
        },
        {
            "id": "i33pv0a",
            "score": 1,
            "text": "We also live longer abd have better diagnostic tools so once you account for that, is there a nett increase?",
            "title_similarity": "0.27731305",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i33q1mq",
            "score": 1,
            "text": "This comment thread is making me want legal euthanasia by the time I’m old enough to eventually get cancer or Alzheimer’s/dementia. \n\nHow is this not an option for us?\nWouldn’t you choose a doctor assisted morphine OD without a second thought, if your alternative was months of pain and fear in a hospital/nursing home/hospice/chemo chair?\n\nAll the arguments for this not being legal just don’t hold water. There’s dignity in being able to choose how you die.",
            "title_similarity": "0.5613686",
            "sentiment_compound": -0.9406
        },
        {
            "id": "i33qoik",
            "score": 1,
            "text": "That’s the low fat, low protein, high carbs diet sprinkled with pharmaceutics for you! When will we realize that they don’t care about us ?",
            "title_similarity": "0.31327277",
            "sentiment_compound": 0.0
        },
        {
            "id": "i33r8ab",
            "score": 1,
            "text": "We have medicine to keep the husk alive, but the brain rots all the same. Life might have been kinder if we never managed to keep people alive past 75.",
            "title_similarity": "0.494811",
            "sentiment_compound": 0.8591
        },
        {
            "id": "i33rm9l",
            "score": 1,
            "text": "Is this because people are living longer?",
            "title_similarity": "0.12248907",
            "sentiment_compound": 0.0
        },
        {
            "id": "i33s1n5",
            "score": 1,
            "text": "“He’s just a little confused” - 2 decades ago",
            "title_similarity": "0.40155435",
            "sentiment_compound": 0.0
        },
        {
            "id": "i33sedv",
            "score": 1,
            "text": "Stop eating meat!!!! The uptake of copper and heme iron from meat cannot be self regulated by the body and it builds up over time in the brain which shorts it out. Imagine having a computer (the brain) and every day you throw a pinch of iron/copper dust inside. What would happen after 60 years of that...?",
            "title_similarity": "0.51985866",
            "sentiment_compound": -0.5216
        },
        {
            "id": "i33sp62",
            "score": 1,
            "text": "This could be because of changing diagnostic criteria, not *necessarily* from an increase in actual dementia.\n[edit] That’s actually what the article said!\nSo the title is clickbait.",
            "title_similarity": "0.4186738",
            "sentiment_compound": 0.3802
        },
        {
            "id": "i33tikj",
            "score": 1,
            "text": "From a TED talk I listened to a while back, Dr's would often list a secondary reason for a Dementia patients death.  This is a big part of the reason why Dementia research is underfunded  - the numbers of people with one of the Dementia diseases was under reported both in death certificates AND diagnosis.  It's good to see that it's changing, including high profile cases like Robin Williams (Lewy Body), and the Bolin family (Pat Bolin (Denver Broncos  owner) and his wife have Alzheimer's) and Tony Bennet (Alzheimer's).",
            "title_similarity": "0.68840504",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i33uigf",
            "score": 1,
            "text": "I keep seeing studies discussing these sorts of findings and studies with more and more negative findings in regards to microplastics and lead. I wonder how correlated the two will end up being in a decade or two?",
            "title_similarity": "0.54683787",
            "sentiment_compound": -0.6436
        },
        {
            "id": "i33us0g",
            "score": 1,
            "text": "We spend too much mental energy on staring into screens and seeing everything at once while doing nothing, and that's just one of the problems with modern society.",
            "title_similarity": "0.23889479",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i33wq8r",
            "score": 1,
            "text": "I have ADHD aswell which makes me 50% more likely to get dementia, according to research. I'm very scared as I'm pretty convinced that's how I'm going to go",
            "title_similarity": "0.7510697",
            "sentiment_compound": 0.4033
        },
        {
            "id": "i33xnsv",
            "score": 1,
            "text": "I wonder what the presence of lead in basically everything, (dishes, gasoline, toys, paint, water pipes, etc.) when the elderly were younger had anything to do with the prevalence of dementia today?\n\nI was joking the other day about younger generations giving boomers a break when it comes to stupidity because we had lead everywhere, but I really wonder if it might have caused lasting affects.",
            "title_similarity": "0.5739614",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i33y3ij",
            "score": 1,
            "text": "For anyone that is caregiving for a family member with dementia Reddit has a dementia group that is phenomenal in providing non-judgmental support and practical advice.",
            "title_similarity": "0.38903823",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i33ycz9",
            "score": 1,
            "text": "There is already research that has shown that what people eat plays a huge role in dementia rates and longevity. The regions where people live longest with the least amount of health conditions are termed \"blue zones\". There is even a small blue zone in the US, too.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6125071/",
            "title_similarity": "0.59893155",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i33yp7b",
            "score": 1,
            "text": "It can happen when you least expect it too.  My mom was laughing after eating dinner and soon minutes later had a stroke.  Damaged her frontal lobes so bad.  When she got out of the hospital she was half paralyzed and had dementia.",
            "title_similarity": "0.64455175",
            "sentiment_compound": -0.6359
        },
        {
            "id": "i33z2cs",
            "score": 1,
            "text": "It's from marijuana. I am expecting this to go up even more",
            "title_similarity": "0.17897996",
            "sentiment_compound": 0.0
        },
        {
            "id": "i33z7md",
            "score": 1,
            "text": "I am 63 and I live alone. This is my greatest fear.",
            "title_similarity": "0.400153",
            "sentiment_compound": 0.0
        },
        {
            "id": "i33zbmk",
            "score": 1,
            "text": "Has any research on dementia focused on lead exposure in childhood/young adulthood? I always wonder if that cohort of people was just always going to have these problems due to their degree of lead exposure.",
            "title_similarity": "0.6079892",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i33zhbq",
            "score": 2,
            "text": "I watched a documentary on a research study that was done at this retirement community that started a few decades ago. They had very good records over something like fourteen thousand people.\n\n\nThey saw that there's really very little correlation between vitamins or Diet and dementia in old age. They also found that the standard belief that the lesions and spots of the brain are clear signs post-mortem that the patient had some form of dementia - and this was not true. They found an even distribution of markings on the brain between people that displayed cognitive impairment and those who did not.\n\nThey found a decrease by those who drank some degree of alcohol oh, so that seems to be a good thing in moderation. They also found a correlation between individuals who were a healthy body weight when younger, and put on some weight in their later years. Gaining some weight as we age was indicative of reduced risk for cognitive decline.\n\nThey also found a link between activity and mental decline, I think we all knew that already but the more social you are the more you reduce your risk.\n\nAnd then I think they mentioned that after age 65 or so, every 5 years doubles your risk percentage of getting some kind of cognitive impairment. So the idea that once you reach a certain age, if you haven't gotten Alzheimer's or such yet, that you are safe. This is not true",
            "title_similarity": "0.7226323",
            "sentiment_compound": 0.6686
        },
        {
            "id": "i33zy2l",
            "score": 1,
            "text": "I bet alcohol consumption got something to do with it \n\nBut alcohol company will bury any research  into that",
            "title_similarity": "0.29311067",
            "sentiment_compound": 0.0
        },
        {
            "id": "i340869",
            "score": 1,
            "text": "Honestly people need a reason to live and most are just plain tired of a life that has little promise of fun and meaning when you get old.",
            "title_similarity": "0.38318124",
            "sentiment_compound": 0.6302
        },
        {
            "id": "i340vcz",
            "score": 1,
            "text": "At what point does elective euthanasia become an option? Dementia is a horrible way to spend the last years of your life and is torture for loved ones. I would much rather end it on my own terms before my mind is that far gone.",
            "title_similarity": "0.5349313",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i3425zb",
            "score": 1,
            "text": "My sister passed away last year and dementia was listed as cause of death.  I was surprised since I had never heard of dementia being identified as the primary cause of death.",
            "title_similarity": "0.66173875",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i342s4q",
            "score": 1,
            "text": "I wonder how many of these deaths also had Covid (unvaccinated) on the diagnosis.  It might explain some of the correlation.",
            "title_similarity": "0.46523356",
            "sentiment_compound": 0.0
        },
        {
            "id": "i343563",
            "score": 1,
            "text": "One of the most terrifying ways to go… There’re few things I’ve found more heart wrenching then watching a person you used to know, slowly disappear into a cloud of confusion and fear while you’re desperately trying to find some fragment of a memory that’s retained in order to maintain a connection with them",
            "title_similarity": "0.36524105",
            "sentiment_compound": -0.8074
        },
        {
            "id": "i343ety",
            "score": 1,
            "text": "It’s probably all that excess sugar and cheap food thats relentlessly marketed to us poors; Did I mention this is also needed to survive, with what little time we actually have left after a full days work and for what horrible labor compensation goes for these days. No time to cook, no money for quality food. But a slow death is sanctioned as long as big corporations can profit. Capitalism deals another blow.",
            "title_similarity": "0.48110694",
            "sentiment_compound": -0.714
        },
        {
            "id": "i344gkg",
            "score": 1,
            "text": "OK... BUT how often do we have \"eccentric\" old people now as opposed to individually understood and specifically identified diseases? I think it's more a case of better tools, better understanding, and more diligent observations by the medical/psychiatric community that lead to these higher numbers. \n\nBack in the day it was all just lumped into, \"that's part of getting old.\"",
            "title_similarity": "0.562913",
            "sentiment_compound": 0.8271
        },
        {
            "id": "i345rxm",
            "score": 2,
            "text": "There’s a good book about it by team Sherzai: the Alzheimer’s solution. \n\nConclusion, eat the least amount of animal products, eat whole whole plant foods, move, challenge your brain and remain active in social circles. \n\nYou should start early. The onset of Alzheimer’s can begin decades before symptoms arise. When the symptoms start, the disease is hard to stop",
            "title_similarity": "0.42698774",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i345ta9",
            "score": 1,
            "text": "I’m no expert on the subject, but there must be a connection of what’s going into our bodies. Processed foods full of a zillion additives I can’t even pronounce, myriads of different drugs that I’ve taken for years, tobacco products, sugar, fast food, etc. Maybe all of these things together produce a slow cumulative effect? If so, I am totally screwed. At nearly 70, I have no one to turn to if I get dementia: no wife, no children, no siblings, and that scares the hell out of me.",
            "title_similarity": "0.6071366",
            "sentiment_compound": -0.957
        },
        {
            "id": "i34bdc6",
            "score": 1,
            "text": "Serious question: is this increasing in frequency or are the definitions/detection methods changing to discover more cases?",
            "title_similarity": "0.1436469",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i34fkv6",
            "score": 1,
            "text": "The number could be higher than that. When my friends parent passed away it was from dementia but on the death certificate they listed heart failure. When asked about it the coroner said 'Well, that's what caused their death; their heart stopped'. That never made any sense to me at all. If I get in a car wreck and crushed then eventually my heart will stop and I'll die but I would think the cause of death would be vehicle accident.",
            "title_similarity": "0.6418606",
            "sentiment_compound": -0.97
        },
        {
            "id": "i34h5bu",
            "score": 1,
            "text": "I imagine this is a US thing? \nThe companies who get away with all these chemicals and sugar know exactly what they are doing.\nAnd then making it safer when new guidelines finally get introduced is still evil.",
            "title_similarity": "0.29268146",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i352ucs",
            "score": 1,
            "text": "&#x200B;\n\nCould be those microplastics ... those who always have a can or bottle releasing BPA chemicals into their bodies (including me) are now teeming with bits of plastic that will never leave the blood lodging in all kinds of places, including the brain.",
            "title_similarity": "0.33961654",
            "sentiment_compound": 0.0382
        },
        {
            "id": "i35aror",
            "score": 1,
            "text": "I wonder if we don’t know, we call it dementia.  Perhaps we are using drugs to push life beyond its expectations, and the brain just poops out",
            "title_similarity": "0.40040055",
            "sentiment_compound": 0.0
        },
        {
            "id": "i35if0c",
            "score": 2,
            "text": "\"This is surely because of animal products\" \n\nI suspect industrial seed oils have a relationship because canola oil worsened brain function when studied and I don't really see this being studied because you can hardly find people who don't eat these. \nhttps://medicine.temple.edu/news/canola-oil-linked-worsened-memory-and-learning-ability-alzheimers-disease-temple-researchers",
            "title_similarity": "0.42227125",
            "sentiment_compound": -0.296
        },
        {
            "id": "i35m0xj",
            "score": 1,
            "text": "It’s because people are living longer and we’re better at diagnosing dementia.",
            "title_similarity": "0.34207112",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i35zrqg",
            "score": 1,
            "text": "I think they say smoking weed out of aluminum gives you dementia but I forgot",
            "title_similarity": "0.41784877",
            "sentiment_compound": 0.0
        },
        {
            "id": "i376bt8",
            "score": 2,
            "text": "Some believe Lyme Disease (especially undetected/untreated) may be a major cause. It is constantly on the rise, more and more over time. Unfortunately it is highly under-funded and  covered up for some reason. It is also thought to sometimes cause other conditions involving the brain such as MS and Parkinson’s. \nAlso, many people have Lyme Disease at some point but never see the tick or rash (tick the size of a poppy seed or rash on the scalp for example).",
            "title_similarity": "0.5447358",
            "sentiment_compound": -0.8373
        },
        {
            "id": "i38u49r",
            "score": 2,
            "text": "Salk institute research proves cannabinoids remove brain plaque - link below\n\nhttps://www.salk.edu/news-release/cannabinoids-remove-plaque-forming-alzheimers-proteins-from-brain-cells/",
            "title_similarity": "0.3958966",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4z14ki",
            "score": 1,
            "text": "another hopeful move for choosing death with dignity.",
            "title_similarity": "0.13899699",
            "sentiment_compound": 0.2732
        }
    ]
}