{
    "Donald Trump’s presidency associated with significant changes in the topography of prejudice in the United States | Researchers found that explicit racial and religious prejudice increased amongst Trump’s supporters, while prejudice decreased among those who opposed him\n": [
        {
            "id": "i49rssy",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue to be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.54718757",
            "sentiment_compound": 0.7088
        },
        {
            "id": "i4a2r78",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a5woa",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a1olp",
            "score": 18,
            "text": "Putin's stroke of genius was to join with the Fox Noise messaging that the Republican base uses as its main source of news/entertainment and simultaneously inject Russian disinformation into social media platforms (*including Facebook and twitter, which just previously had received* [huge \"investments\" from a Russian oligarch](https://www.theguardian.com/news/2017/nov/05/russia-funded-facebook-twitter-investments-kushner-investor)*, and are used by a whole lot of older, more conservative Americans*), and use this messaging to inflame racial divides and [help his preferred candidate to win](https://www.politico.com/story/2018/07/16/putin-trump-win-election-2016-722486).\n\nThis effort also included funding a lot of Republican fringe candidates including Trump (*some through the National Rifle Association, money provided via* [a now deported Russian spy](https://en.wikipedia.org/wiki/Maria_Butina)*---so patriotic for them to use Russian money to undermine America!*), along with the hacking efforts that yielded DNC emails that could be weaponized by the RNC, and hacking the RNC server (*but not releasing it, perhaps holding onto that for kompromat on individuals like Leningrad Lindsey Graham*).\n\nSince Ukraine is in the news, Trump also accepted Paul Manafort to work for free as his campaign manager -- *nothing stinky there, of course every campaign wants a foreign kompromised operative to run the campaign for free, not sure why Hillary didn't do it first!*\n\nManafort [previously worked side by side with the Kremlin to install a Russian puppet government in Ukraine](https://www.propublica.org/article/lets-recall-what-exactly-paul-manafort-and-rudy-giuliani-were-doing-in-ukraine), and would as campaign manager [share campaign data with another Russian spy](https://thehill.com/opinion/white-house/548794-there-was-trump-russia-collusion-and-trump-pardoned-the-colluder/) to help the Russians better target their social media disinformation campaign to help Trump win (*but no collusion...none at all!*) For all of his patriotic acts (on behalf of Russia), Manafort earned a pardon from Trump…\n\nTrump bumbled into the perfect situation for himself, he could be a flagrant racist and sexist blowhard (*ignoring the \"political rules\"*) and the Republican base, primed on years of Fox Noise, were eager to have someone who finally gave them permission to let their inner racist freak flag fly -- the Trump administration was best time for the Republican base since the confederacy!",
            "title_similarity": "0.68338865",
            "sentiment_compound": 0.9877
        },
        {
            "id": "i4a2h1n",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a171s",
            "score": 12,
            "text": "[deleted]",
            "title_similarity": "0.115936294"
        },
        {
            "id": "i4a1wlb",
            "score": 37,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a2u2h",
            "score": 50,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4acp7c",
            "score": 5,
            "text": "I always wonder who these studies are for. All of us already know this and Trump supporters won't read this or care.",
            "title_similarity": "0.48141724",
            "sentiment_compound": 0.7269
        },
        {
            "id": "i4a1167",
            "score": -72,
            "text": "[deleted]",
            "title_similarity": "0.115936294"
        },
        {
            "id": "i4a2tay",
            "score": -36,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a2k9w",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a3i5r",
            "score": -21,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a1u4q",
            "score": 45,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a2iyu",
            "score": -30,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aat93",
            "score": 1,
            "text": "Remember when all these idiots said Obama increased division in this country by simply acknowledging that racism still existed?",
            "title_similarity": "0.71296585",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i4a25h0",
            "score": 25,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a3vfh",
            "score": -21,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a7dz3",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a4zhm",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a7vk2",
            "score": -11,
            "text": "This was kind of slam dunk research - any reasonable person with a social media account observed this unfold in real time.",
            "title_similarity": "0.31422067",
            "sentiment_compound": -0.4391
        },
        {
            "id": "i4a4r10",
            "score": -42,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a1egk",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a6e7h",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a6f8g",
            "score": -27,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4ajadw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a4rmd",
            "score": -37,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a3dlp",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4abred",
            "score": -4,
            "text": "Someone somewhere in these comments made a very good point. We do not have a left wing political party right now. We have moderates posing as left wingers because the bar has been skewed. \n\nAnd while it is also true that there are some actual left wing leaning movements, they are very small, and do not hold political office. Meanwhile, right wing politicians are very much in evidence in our highest political offices. That's a problem. \n\nTrump weaponized racism in this country that was already here. He emboldened people who already held these beliefs, or alternatively do not see anything wrong with voting for politicians who do. Their reasoning may be that it doesn't affect them, and they may choose to disregard the harm it does, but at the end of the day if you ignore the harm your political leaders do and continue to vote for those people either in ignorance or with foreknowledge, you are complicit.",
            "title_similarity": "0.7106679",
            "sentiment_compound": -0.9157
        },
        {
            "id": "i49siyh",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4ajvpv",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i49t8z1",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4a8wrh",
            "score": -1,
            "text": "The attitudes and legislation against the LGBTQ community seems like an enormous step backwards.",
            "title_similarity": "0.6045226",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4addgm",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i49x2eh",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4abvvw",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4a4g9v",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.11593631"
        },
        {
            "id": "i4a3vsa",
            "score": 79,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4a5vm3",
            "score": 27,
            "text": "This seems pretty suspect.\n\nDid they research people from both groups right before Trump to get a baseline, then study the same people throughout the presidency?",
            "title_similarity": "0.64110345",
            "sentiment_compound": 0.25
        },
        {
            "id": "i4a2ia9",
            "score": 36,
            "text": "I hate it when the exact extent of the differences in numbers aren't mentioned. And also opposing Trump doesn't necessarily mean being a good person.\n\n>a significant increase in prejudice towards a range of social, racial and religious minoritized groups.\n\nHow much is significant? Cause someone told me if 10 people are discussing with 1 Nazi at a table, there are 11 Nazis at the table. So is 1 a significant number?",
            "title_similarity": "0.70661926",
            "sentiment_compound": 0.3094
        },
        {
            "id": "i4anrx5",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4b2lx7",
            "score": 1,
            "text": "You people never cease to amaze me…",
            "title_similarity": "0.17055032",
            "sentiment_compound": -0.431
        },
        {
            "id": "i4a0v20",
            "score": 256,
            "text": "Whilst it's great that data can be used to corroborate the claims that fascism and hate-rhetoric is on the rise across the world, I very much doubt this could be used to try and pull back some of those who are falling down this rabbit hole of this evil. It seems, to me now at least, people amongst both the extreme political left and the right (but particularly and mostly the right) like to ignore evidence-based reasoning and rational discussion in favour of whatever perceived reality they have chosen to concoct for themselves.\n\nNow we have US Congresspeople shouting and screaming that anyone who disagrees with them must be a pedophile or pedophile enabler, with no evidence whatsoever of course. These people don't get voted in if this deranged set of views isn't at least sympathised with amongst a broad base of people. Furthermore, I am of the mindset that many of these people don't even know that what they are spouting are very obvious lies. They have genuinely been led down this pathway long enough to where any independent rationale or reasoning they once possessed has been utterly stripped away from them.\n\nWe now have actors in media and politics so wilfully misinforming the public about the world around them the public are not even questioning the absolute nonsense they are being fed, and I find this truly terrifying. To say it is reminiscent of 1930s Europe again is an understatement in my mind.\n\nEDIT: For those accusing me of a 'both-sides-ism' based on a single sentence in my comment I implore you to consider...\n\n1. Reading my comment in its entirety, as I hope you might see how my intention is not to in any way legitimise this far-right hateful rhetoric at all.\n2. What I said might have some grounds outside the context of a US politics discussion as well and I wanted to allow for that too.\n3. Separating the right-wing supporter you may encounter in your life from the right-wing politician espousing the hateful rhetoric, lest you create a straw man for your argument nobody could possibly defend, and you cut off swathes of people in your life from ever being reached out to and brought out of this nonsense. Whilst I stated my fear is many are too far gone, I think we need to still try at least.",
            "title_similarity": "0.691823",
            "sentiment_compound": -0.9735
        },
        {
            "id": "i4a7k6l",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4a5zy4",
            "score": 20,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4ag77v",
            "score": 8,
            "text": "Lololol. \n\nI’m sure this dynamic can best be understood through interracial violence and crime.\n\nNope, still a 20x multiple “one way” \n\nJust like liberal college admissions, Asians are hardest hit. Literally. By that “95%” group.",
            "title_similarity": "0.62192416",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i4aae48",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4a8lk0",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.11593631"
        },
        {
            "id": "i4a9ax7",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4afeq2",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4a9pgj",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4a37ri",
            "score": -13,
            "text": "If everything on the internet is being run by AI, and AIs have a past of churning out racism (see the Harry Potter book and the YouTube algorithm) then at least a portion of this problem can be fixed by instituting changes to publicly available AI features.\n\nIt won't fix the problem, but it's a start.",
            "title_similarity": "0.5893664",
            "sentiment_compound": -0.4558
        },
        {
            "id": "i4aolob",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4asyxi",
            "score": -1,
            "text": "Did some digging into the sources. The entire thing is lacking the hard empirical data to back it up. It’s like they all assumed the answer before they started the research, and made the results fit. \n\nThe whole point is racism is and prejudice is on the rise in the US, and the articles are all making the same assumption that it HAS to be Trump and Trump supporters at fault. They take very little, if anything else, into account for the cause, and drew conclusions based on their own assumptions. \n\nIs racism, sexism, and prejudice on the rise? Sure. Is the problem Trump and his supporters? Possibly. Could there be another reason for the rise? Certainly. As long as people go into it thinking they already know the answer, we’ll never find it.",
            "title_similarity": "0.736711",
            "sentiment_compound": -0.8243
        },
        {
            "id": "i4a9nss",
            "score": 29,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aahhz",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4b2l58",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a9374",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a8dx8",
            "score": 20,
            "text": "So what were the questions? What is this rhetoric they mention? Sounds to me that they just arbitrarily equated prejudice with trump policies and asked people if they support trump policies.\n\nAlso, are they saying trump supporters are more politically intelligent because they are able to recognize prejudice in their preferred politicians whereas other voters can't see it in their politicans?",
            "title_similarity": "0.76680636",
            "sentiment_compound": 0.425
        },
        {
            "id": "i4ac4o9",
            "score": 16,
            "text": "JFC, I’m here to read about fusion, climate change, space, and other science. Not politics. Can we keep it isolated to the subs it belongs in please?",
            "title_similarity": "0.28669316",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4a6wu1",
            "score": 35,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a1q7c",
            "score": -46,
            "text": "Prejudice increased on both sides, just aimed at different groups.",
            "title_similarity": "0.5737288",
            "sentiment_compound": -0.296
        },
        {
            "id": "i4a8edb",
            "score": 25,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4agl2b",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a7vsp",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4agk5x",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a3chb",
            "score": 18,
            "text": "I feal that people who hate felt emboldened to come out and say it, while people who were already less \"ist\" realised that we all need to work together.",
            "title_similarity": "0.49423856",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i4abmlp",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4afyql",
            "score": 6,
            "text": "Can we get a non political science sub like the Twitter sub? This is just ridiculous and the posts on this sub that make the front page are so terrible and unscientific.",
            "title_similarity": "0.4997443",
            "sentiment_compound": -0.6113
        },
        {
            "id": "i4aq2dh",
            "score": 8,
            "text": "These researchers clearly have no idea what endogeneity is.. And there is no way experiments can be used to answer this question",
            "title_similarity": "0.2583515",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i4a8jyq",
            "score": 0,
            "text": "Give them Texas and let them figure it out. They wouldnt survive without the southern border to whine about.",
            "title_similarity": "0.45080146",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i4a8yzd",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4afbw1",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.09769954"
        },
        {
            "id": "i4a92qh",
            "score": -1,
            "text": "With one caveat…my prejudice against Trump supporters increased.\n\nI mean it was already there, but seeing their idiot faces on blast every single day, only increased my disdain of the stupid.",
            "title_similarity": "0.73700595",
            "sentiment_compound": -0.9042
        },
        {
            "id": "i4ad7mw",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4cc5ws",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a57fo",
            "score": 165,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i49tbha",
            "score": 25,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4b2g7r",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a8jgp",
            "score": 31,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aaj35",
            "score": 33,
            "text": "And he has an excellent chance at getting re- elected which tells you how fucked up a huge part of this country is.",
            "title_similarity": "0.6342063",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i4aahsz",
            "score": 20,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4b1roe",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aaf1o",
            "score": 14,
            "text": "Yeah, I want to know what counts as explicit racial prejudice for this study because it became vogue to make comments against white people because trump was apparently the avatar for an entire race…",
            "title_similarity": "0.7771783",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i4alvtq",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.09769954"
        },
        {
            "id": "i4aa2j3",
            "score": 16,
            "text": "[deleted]",
            "title_similarity": "0.11593634"
        },
        {
            "id": "i4apc44",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.09769954"
        },
        {
            "id": "i4b1kj3",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i49wiym",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aae39",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4ac68t",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a8w6i",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4adurk",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4acnqf",
            "score": 8,
            "text": "Honestly I bet nothing changed.  It became more of a source of pride for supporters, and more of an embarrassment for detractors.  Everyone is probably about as prejudiced as they ever were deep down.",
            "title_similarity": "0.5491914",
            "sentiment_compound": 0.3041
        },
        {
            "id": "i4a67k5",
            "score": -16,
            "text": "[deleted]",
            "title_similarity": "0.115936294"
        },
        {
            "id": "i4ajmea",
            "score": 19,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aj4gt",
            "score": 0,
            "text": "Good that there was studies done on this because many of us noticed",
            "title_similarity": "0.30600342",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4b0tk2",
            "score": 0,
            "text": "Looking at the questions it seems to be focused specifically on the participants' views on Islamic extremism and illegal immigration, not racism or prejudice in general. Of course you would expect Trump supporters to have harsher views on these issues as they were major issues of Trump's.",
            "title_similarity": "0.66308534",
            "sentiment_compound": 0.5713
        },
        {
            "id": "i4bik45",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aeg01",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4awyw3",
            "score": 3,
            "text": "Could it be a false correlation? I would think that the racism and religious intolerance would have gotten worse due to how the media has behaved over the last 6 years than anything. Being vilified 24/7 surely is a source for resentment and radicalization.",
            "title_similarity": "0.6932266",
            "sentiment_compound": -0.802
        },
        {
            "id": "i4b3y9h",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a47kx",
            "score": 36,
            "text": "I find this fascinating, but my thoughts before reading the article...\n\n> Was this actually the case, or did it happen that Trump made people just be more open about their opinion? Like, did racists just feel emboldened, and the same for antiracists?\n\n> If this is true, I find it rather unexpected that it would occur on both sides. Trump definitely fomented racial tensions, but I think that the decrease in prejudice seems to be more of a \"not trump\" thing.\n\n> So...did trump make more racists and antiracists? Or just cemented people that were already there?",
            "title_similarity": "0.7880477",
            "sentiment_compound": -0.8333
        },
        {
            "id": "i4a85wb",
            "score": -7,
            "text": "People that support Trump want special treatment.\n\nPeople that oppose tRump want equal treatment.",
            "title_similarity": "0.6190604",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i4b2bfv",
            "score": -5,
            "text": "I was raised by a conservative bigot. If you're a minority, or a woman, or someone without religion, please listen:\n\nBigots are using you. Conservative men want power. They don't want anyone OTHER than conservative men to hold or have power. \n\nYou may agree on some issues, you may think you should stand with them because some hyperbolic argument has you scared. Trust me when I say, you are a useful idiot. A tool. I heard my father say to his \"good ol boys\" more than once, \"use them until they're useless\"\n\n\nThis isn't the right place for this post, but I feel it's important for people to understand, you're being used by people who hate you. We're stronger together.",
            "title_similarity": "0.6574094",
            "sentiment_compound": -0.2124
        },
        {
            "id": "i4aod3q",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a7a4h",
            "score": 0,
            "text": "Did the prejudice increase? Seems that it was always there, just under the surface, and it was suddenly okay to say hateful thing out loud.  \n\nAlso, what's the over/under on how long before this thread gets locked?",
            "title_similarity": "0.54160166",
            "sentiment_compound": -0.5661
        },
        {
            "id": "i4abyxj",
            "score": -2,
            "text": "He showed us where all the Nazi’s are. It’s almost like he was a sleeper for the left.",
            "title_similarity": "0.4449767",
            "sentiment_compound": 0.2975
        },
        {
            "id": "i4ajb84",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4af4ga",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4altdn",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4ammcp",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aaklp",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aqicw",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4ab30u",
            "score": -9,
            "text": "What kind of “science” is this? The headline reads like a CNN article. This is the problem with our current political climate. People want this to be true so bad they don’t even challenge this so called science. Why do we keep trying to create more and more racial tension with nonsense like this?",
            "title_similarity": "0.68075585",
            "sentiment_compound": -0.5154
        },
        {
            "id": "i4apzcz",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a9k9u",
            "score": -1,
            "text": "It was already there. He was just the catalyst. \n\nIn an odd way it was a good thing. Sometimes it's better to puke to get it over with instead of walking around nauseous. \n\nMark my words; Nikki Haley, if she decides to run, will redeem the Republican Party. The bigots were the loud ones. The rest of his support was due to the Republicans having an innate ability to rally around their nominee. In other words he was tolerated for his political potency in the face of Hillary Clinton. They disliked her more than can be appreciated by the left. \n\nIf the Republicans nominate Trump over Nikki Haley I will be proven wrong.",
            "title_similarity": "0.70794046",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i4abw27",
            "score": 1,
            "text": "Eh i found myself more prejudiced against trump supporters themselves so i cant say im less prejudiced. They always seem to want to hang their trump flags and announce their love for trump in such a douchebaggy way......like i get it, you love the pathological liar who made your bank accounts look better; essentially making a deal with the devil. Stop making him part of your identity (there goes that prejudice again.....)",
            "title_similarity": "0.70865726",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i4b1st9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4b5xg1",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4bidqj",
            "score": -1,
            "text": "Now do a study on the same two demographics on how successful they are in life. Or how many of those demographics we're trump supports as well as racial and religious minorities. Now cross reference the two and see how many successful minorities supported trump's ideologies. To say trump is to blame while minorities are prospering under him is truly biased after that.",
            "title_similarity": "0.7880169",
            "sentiment_compound": 0.9169
        },
        {
            "id": "i4bmqi1",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.115936294"
        },
        {
            "id": "i4ae2fm",
            "score": 23,
            "text": "speaking for myself i learned a LOT about racism during his presidency and the blm protests. It kind of brought a lot of the quiet parts out into the open and made it almost impossible to avoid or ignore.",
            "title_similarity": "0.6065198",
            "sentiment_compound": -0.8568
        },
        {
            "id": "i4afska",
            "score": 126,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4cfbpe",
            "score": 17,
            "text": "Upon examination of the actual survey they used, it is extremely misleading and uninformative. It asks a lot of religious questions, like whether or not Islam is old/primitive compared to Christianity. Further, it asks opinions on immigration, which is a social discussion not related to prejudice, instead safety, job security, and ability to accommodate immigrants. The surveyors are obviously biased and the questionnaire presents faulty data production. Not a reputable study.",
            "title_similarity": "0.6634754",
            "sentiment_compound": 0.6496
        },
        {
            "id": "i4a6ekt",
            "score": 105,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4adx48",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4a3v24",
            "score": 499,
            "text": "There’s conservatives making ads invoking MLK as if he’s their hero/creation and openly arguing with his daughter on Twitter about what her father REALLY stood for……",
            "title_similarity": "0.61161745",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i4acsz1",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4afe18",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.09769954"
        },
        {
            "id": "i4a9ia4",
            "score": 2,
            "text": "Research was def not required to arrive at that simple conclusion about Trump supporters.",
            "title_similarity": "0.38123947",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4ag3e7",
            "score": 3,
            "text": "The actual study is behind a paywall, this article discusses the methodology of the studies, the authors conclusions but very little else. \n\nWhat were the questions they were asked? What were the time1 and time2 responses which reflected such a significant change in prejudice? \n\nDoes anyone have the actual study for review?",
            "title_similarity": "0.49528176",
            "sentiment_compound": -0.5845
        },
        {
            "id": "i4as5t5",
            "score": -2,
            "text": "Step 1: Increase division & political polarisation\n\nStep 2: Convince the side with the older demographic to stop getting vaccines, during a pandemic\n\nIn the long run, I wonder if Trump has done more harm to the GOP than the DNC ever could.",
            "title_similarity": "0.7269635",
            "sentiment_compound": -0.4005
        },
        {
            "id": "i4b8ck8",
            "score": -3,
            "text": "I worry this country is headed straight for a civil war. A real civil war with people firing on each other. The new Republican Party is NOT American anymore.",
            "title_similarity": "0.6412157",
            "sentiment_compound": -0.8591
        },
        {
            "id": "i4be583",
            "score": 1,
            "text": "Thinking critically for a second, I will play devil's advocate: \n\nI'm not going to pay $32 for this literature or spend too much time going through the sources, so I will base my criticism off the abstract. \n\n&#x200B;\n\n1. We do not know what the researcher means by prejudice or how they quantify the term. prejudice is defined as \"preconceived opinion that is not based on reason or actual experience\". Is this the same definition they used? How did they decide what someone said was prejudice and how did they record that? There seems to be a lot of wiggle room here. It is very easy to stay vague about the article and still heavily imply what they want you to think.\n2. The article is suggesting \"substantial change in the topography of prejudice in the United States\". The problem I see with this is the false equivalence. We are talking about a change in the public perception of social issues within a specific period of time. Yes trump was president, but there were a lot of other significant events that took place in the last 5-6 years that could be contributing factors. I could make the argument that the rise in anti-trump rhetoric led to just as much prejudice as trump himself. \n\nI can't stand Trump for MANY reasons, but I think it is very important to keep a level head and think critically about any article or data that we come across. \n\nCheers!",
            "title_similarity": "0.5704064",
            "sentiment_compound": -0.5744
        },
        {
            "id": "i4bmfv1",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4clcl5",
            "score": 1,
            "text": "Ah. Lies. With 47k sheep to gobble it up.",
            "title_similarity": "0.3427403",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i4akbrh",
            "score": 1,
            "text": "Hate speech as consequences; rhetoric is how we negotiate our world, language is repository for culture, frames our perceptions and understanding; ergo hate speech and bigoted slurs function to cultivate an ideology of hate and bigotry - it normalizes it.  Out of the gate Trump used bigoted language and racial smears to tap into peoples anxieties around their living situation by manufacturing various scapegoats - “Mexicans”, “muslims”, “the radical left”, etc. etc.  he never once talked about policies it was all straw man blame for The Other.",
            "title_similarity": "0.609306",
            "sentiment_compound": -0.9477
        },
        {
            "id": "i4as0mm",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4abzk3",
            "score": -3,
            "text": "I just think what people consider prejudice or racist has changed drastically in the last several years.",
            "title_similarity": "0.682848",
            "sentiment_compound": -0.8074
        },
        {
            "id": "i4ahjx6",
            "score": 0,
            "text": "[Cool piece of movie trivia that coincides with this study](https://m.imdb.com/title/tt0063442/trivia)\n\nLike minded people have always gravitated towards each other.",
            "title_similarity": "0.34554327",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i4ajq1i",
            "score": 0,
            "text": "Is this not more or less a practical example of polarisation?",
            "title_similarity": "0.24554498",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4alqkj",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4atajp",
            "score": 4,
            "text": "General prejudices may have decreased but my anecdotal opinion of a political party storming the nation's capitol significantly deteriorated.",
            "title_similarity": "0.7291174",
            "sentiment_compound": 0.3919
        },
        {
            "id": "i4atzuk",
            "score": 0,
            "text": "Where can I see this article that isn't behind a paywall?",
            "title_similarity": "0.22818029",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4c0th4",
            "score": 0,
            "text": "Don't forget he inspired and supported domestic terrorism with the attack on the capitol before getting banned from Twitter and is still being supported by a significant group of voters. I understand it wasn't anything close to a \"major attack\" with what happened, but that doesn't justify anything he did.",
            "title_similarity": "0.6003751",
            "sentiment_compound": -0.7029
        },
        {
            "id": "i4c9kdy",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4cplwz",
            "score": 0,
            "text": "The onlyist thing that thrived under the formerf***k was racism!",
            "title_similarity": "0.41942796",
            "sentiment_compound": -0.6588
        },
        {
            "id": "i4e76jy",
            "score": 0,
            "text": "Its true! I stopped locking my car doors when I see a black person.  That's crazy! How the hell do you become less bigoted?",
            "title_similarity": "0.5254586",
            "sentiment_compound": -0.7707
        },
        {
            "id": "i4a3pcc",
            "score": 2015,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i49x37q",
            "score": 20,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4abatn",
            "score": -6,
            "text": "i mean if you think the ok sign is the sign of white power you truly would think its up. kamala harris, joe biden and many more did it.",
            "title_similarity": "0.41353256",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i4aazt0",
            "score": 74,
            "text": "I wonder if the real catalyst of this change, came from Obama’s presidency? I imagine that made a lot of already prejudiced people pretty aligned come the end of Obama’s terms.",
            "title_similarity": "0.7775394",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i4amuxy",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4bvqpq",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aa3oh",
            "score": 1,
            "text": "I didn’t know i sided as/with the Republican Party for many many years, I just voted however I felt, up until 2017/2018 when I simply got tired of them. I made the conscience choice to register as a Democrat to even the sides. I told myself at the time that I would remove my registration once the Republican Party changed their ways and became the Party I once thought they had been before Trump.",
            "title_similarity": "0.6272453",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i4aagt8",
            "score": 1,
            "text": "Did people's prejudices change, or did people's willingness to signal their opinions change?",
            "title_similarity": "0.45466697",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i4agf14",
            "score": 1,
            "text": "Is this prejudice against minorities? Or prejudice against any group?\n\nMany references in this article specifically mention minorities. And I wonder if trans related issues are considered prejudice or not, and why that would be",
            "title_similarity": "0.548835",
            "sentiment_compound": -0.8823
        },
        {
            "id": "i4amsa1",
            "score": 1,
            "text": "Since he ended the job at 34% approval, and never crossed above 50% after 2 weeks in the job, this means he decreased prejudice among more people than he increased it. \n\nIronic.",
            "title_similarity": "0.5222988",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i4axorq",
            "score": 1,
            "text": ">a significant increase in prejudice towards a range of social, racial and religious minoritized groups\n\nStatistical significance doesn't mean a damn thing and should be banned from most scientific publications. Some of the studies mentioned in the article had a high enough sample size, that any statistician could tell you that the results would be statistically significant...even before the first datum was collected. \n\nSo did anyone read the primary sources to see if any of the results were practically significant?",
            "title_similarity": "0.6811534",
            "sentiment_compound": 0.2401
        },
        {
            "id": "i4az9nm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4azxiu",
            "score": 1,
            "text": "The \"topography\" of racism hasn't changed.  When the US electorate decided to elect a racist, then all the racists who were \"quiet\" felt free to express themselves.  In a way, that's a good thing.  Because then you can identify them and understand just how racists a society is.",
            "title_similarity": "0.52157617",
            "sentiment_compound": -0.872
        },
        {
            "id": "i4b6qwb",
            "score": 1,
            "text": "Prejudice decreased among those that are against him politically*",
            "title_similarity": "0.52335197",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i4b8vyn",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.09769954"
        },
        {
            "id": "i4basra",
            "score": 1,
            "text": "How do you trust a post that is based on surveys and pulling with no percentages or demographics are shared?  Why would love to believe anecdotal evidence that some people are just more vocal than they used to be I'm not sure that it has nothing to do with the previous occupant",
            "title_similarity": "0.53177094",
            "sentiment_compound": 0.7742
        },
        {
            "id": "i4bbj6i",
            "score": 1,
            "text": "\"When we defined opposition to the left as prejudice and prejudice against the right as opposition, we manufactured the result we wanted.\"",
            "title_similarity": "0.49274176",
            "sentiment_compound": -0.765
        },
        {
            "id": "i4bc254",
            "score": 1,
            "text": "I apologize, I am having trouble tracking down the source. \n\nThere was an NPR piece. Possibly Hidden Brain, possibly another show. Came out a few weeks/months after Trump was elected and it discussed 2 key topics.\n\n1. That Trump made racist people feel comfortable in their beliefs.\n2. That the US discovered there is indeed a sort of \"Racist Vote\"  \n\n\nMy googling has failed me. If anyone know the piece or show please link it below and i will edit my comment with it as well.",
            "title_similarity": "0.7301296",
            "sentiment_compound": -0.8016
        },
        {
            "id": "i4bl2d3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4bm1hq",
            "score": -1,
            "text": "Link to the actual study: https://doi.org/10.1038/s41562-021-01287-2\n\n> In 13 studies including over 10,000 participants, we tested how Americans’ prejudice changed following the political ascension of Donald Trump. We found that explicit racial and religious prejudice significantly increased amongst Trump’s supporters, whereas individuals opposed to Trump exhibited decreases in prejudice. Further, changing social norms appear to explain these changes in prejudice. These results suggest that Trump’s presidency coincided with a substantial change in the topography of prejudice in the United States.",
            "title_similarity": "0.86882555",
            "sentiment_compound": -0.836
        },
        {
            "id": "i4bmzna",
            "score": 1,
            "text": "Doesn't matter if you're a lib or a conservative. We're all in this together. It's the government, corporations, big tech and the globalists that are destroying everything.  Too many people are blinded to what's happening. Before 90% of the people in this country realize what they supported, it'll be too late. We'll all be living like slaves.",
            "title_similarity": "0.64225185",
            "sentiment_compound": 0.0325
        },
        {
            "id": "i4bqjnc",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4by2jf",
            "score": -1,
            "text": "Anecdotally, I am one of the people who is living this finding. I went from \"Systemic racism isn't real, and trans issues are overblown\" to fully supporting the dismantling of systemic racism, reforming police, and fully supporting trans rights, and even believing in microaggressions. I feel as well this was not just because Trump was president, but because these concepts were examined and explained in a much more comprehensible way then they were back in 2016, leading them to be way more digestible to the average person.",
            "title_similarity": "0.7488737",
            "sentiment_compound": -0.0918
        },
        {
            "id": "i4byqep",
            "score": 1,
            "text": "They do understand that the phrase \"We need more people of color to be represented\" is prejudice, Right?\n\nRacial discrimination through federal law is literally part of the Democrat party platform.\n\nDemocrat National Platform: \"Democrats are committed to standing up to racism and bigotry in our laws, in our culture, in our politics, and in our society, and recognize that **race-neutral policies are not sufficient to rectify race-based disparities.**\"\n\n[https://democrats.org/where-we-stand/party-platform/healing-the-soul-of-america/](https://democrats.org/where-we-stand/party-platform/healing-the-soul-of-america/)\n\nThe Civil Rights Act of 1964.\"No person in the United States shall, on the ground of race, color, or national origin, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any program or activity receiving Federal financial assistance.\"",
            "title_similarity": "0.6557774",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i4czrh0",
            "score": 1,
            "text": "I don’t believe he had as much influence as people give him credit for",
            "title_similarity": "0.31941146",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i4d3bkh",
            "score": 1,
            "text": "Meanwhile prejudice about (whether for or against) Trump supporters has skyrocketed",
            "title_similarity": "0.77735865",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i4d9y6f",
            "score": 1,
            "text": "Why do people hate him? His arrogance? Or because he wasn’t one of them? Yes, he’s crude. He loves his country. The economy did well, loaf fuel prices. He wasn’t perfect, but he was better than the pedo in the office now. Flame me if you will, I stand by him.",
            "title_similarity": "0.6223881",
            "sentiment_compound": 0.6798
        },
        {
            "id": "i4dehr4",
            "score": -1,
            "text": "Democrats are the only reason this b.s is even talked about. Democrats will lose the house and the senate In a few short months.",
            "title_similarity": "0.503605",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i4e6p52",
            "score": 1,
            "text": "they excluded from the data set those with knowledge that Hillary Clinton funded the sectors of BLM that promoted violence and division. \n\nLet's poll who likes golf. Ask anyone coming into the golf course anti-trump if they like golf and a poll of those opposing trump and disliking golf from the homeless shelter.\n\nThats what this is.",
            "title_similarity": "0.62330055",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i4awfio",
            "score": 72,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4ad7yp",
            "score": 206,
            "text": "The first finding doesn’t really surprise me but the second finding is interesting. Seems to suggest that people whom do have some implicit biases or who were *mildly* prejudiced saw their internalized prejudiced reflected outwardly by or put into stark relief by the Trump administration and did some self-evaluation. Suggests that outside the extreme edges, people *can* adjust their biases/prejudices and that people who may have been previously passive in regards to civil rights may have been moved to become more engaged as a result of just how crass and awful the Trump world is.",
            "title_similarity": "0.7138777",
            "sentiment_compound": 0.4378
        },
        {
            "id": "i4a35bi",
            "score": -10,
            "text": "When I saw that penis photo, I thought the NSFW settings were turned off in Reddit.  - Just need a new prescription for my glasses.",
            "title_similarity": "0.5292494",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4a8tl0",
            "score": 2,
            "text": "I’m not convinced that it was an actual change in prejudice but rather a feeling or willingness to speak up on their opinions on the topic.",
            "title_similarity": "0.42077646",
            "sentiment_compound": 0.1583
        },
        {
            "id": "i4a9s2g",
            "score": 2,
            "text": "This gangster fraud drove a hatchet between everything in this country. Split everything right down the middle",
            "title_similarity": "0.49958664",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i4acmou",
            "score": 2,
            "text": "Some of those that work forces, are the same that burn crosses",
            "title_similarity": "0.33894837",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4adqzv",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4ai1fs",
            "score": -2,
            "text": "This is a very narrow and bias study. I believe that the bias media has more to do with national division.",
            "title_similarity": "0.5647409",
            "sentiment_compound": -0.2648
        },
        {
            "id": "i4ai5dw",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aigvm",
            "score": -2,
            "text": "does it apply to prejudice on the basis of party affiliation? because that has increased in all fronts",
            "title_similarity": "0.58618224",
            "sentiment_compound": 0.128
        },
        {
            "id": "i4an10c",
            "score": 2,
            "text": "Definitely matches the eye test of increasing political polarization",
            "title_similarity": "0.58408386",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i4aqwza",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4b0zr1",
            "score": 2,
            "text": "A basic and easily observed observation that can be made (in my experience). Interestingly, those who have become more racist, anti-Semitic, etc. simply have too little self awareness to even acknowledge the phenomenon",
            "title_similarity": "0.46277297",
            "sentiment_compound": -0.0498
        },
        {
            "id": "i4aa74p",
            "score": 18,
            "text": "Common enemies create fast friends.",
            "title_similarity": "0.33851188",
            "sentiment_compound": 0.25
        },
        {
            "id": "i4acpa9",
            "score": 414,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4adrk1",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aft4t",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4ap4vi",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aqj5c",
            "score": -3,
            "text": "Could this be correlated to people being locked up in their homes for two years getting purely feed info from the internet or was that that not into account. \n\nI’m sorry I won’t pay to view this garbage but at first glance it seems full of bias and reaches for its claims.",
            "title_similarity": "0.5550075",
            "sentiment_compound": -0.1655
        },
        {
            "id": "i4bn1pj",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4a4dog",
            "score": 2469,
            "text": "Every major police union in the country endorsed Trump. \n\n85%+ of law enforcement voted Trump.",
            "title_similarity": "0.5365679",
            "sentiment_compound": 0.25
        },
        {
            "id": "i4ab4ap",
            "score": -3,
            "text": "Note that the study looks at how people perceive minority groups.  \nIn part, part of the questions were looking at how people look at black population, lanito, LGBTQ, etc.  \nSo it seems a reduction of prejudice toward those groups by either side of the political range, based on who and what side they voted for.  \n  \nOne of the things that are sore in the study, is there is no look of the minority or majority toward the majority.  \nMeaning it doesn't look to mark in it's conclusion if for example the left side of the political map is more prejudice toward white people.  \n  \nFor example the trump supporting group is looked as more cohesive (mostly white of course, republicans, middle america origins, higher religious connection) and look more against minority groups.  \nWhile trump opposition group is different (more diversify, democrats or other, more from the large metropolitan areas), but, their answers to some of the questions suggest that they are more prejudice toward white people (which is understandable but that is also racial based). They would prefer to work with minority groups than with white people, they are more suspicious of them.  \n  \nSo I think while their premise is true toward minorities, the claim that there is less racial prejudice seems to be untrue. It is just directed the opposite way.  \nIn terms of religious prejudice, it is pretty spot on. The more religious the people, the worse their believes are. And with minorities, the more religious they are, they are actually more accepting and supportive.",
            "title_similarity": "0.67313707",
            "sentiment_compound": -0.9006
        },
        {
            "id": "i4aeqp2",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4asant",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4ab6al",
            "score": -6,
            "text": "What about the other things that increased alot? Let's not mention anything contrary to your opinion, right?",
            "title_similarity": "0.33237833",
            "sentiment_compound": 0.3527
        },
        {
            "id": "i4ce7jk",
            "score": 5,
            "text": "I find it quite strange how this directly contradicts the results of other studies, such as [this one.](https://psyarxiv.com/pv2ab/). How did the researchers define an “increase in prejudice”?",
            "title_similarity": "0.611565",
            "sentiment_compound": -0.5413
        },
        {
            "id": "i4abmvx",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4apktg",
            "score": 24,
            "text": "Prejudice a living metric, not a milestone. Some people inspire their followers to increase it because it’s the only way they can justify themselves.",
            "title_similarity": "0.45295978",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i4a9ohe",
            "score": -8,
            "text": "Weirdly, I dont recall prejudiced growing until the Obama raceway when there was a real attempt to criminalize non-conformity. \n\nEvery political action creates push back, so when you threaten Americans on Race or Climate or gender or Mandates, they'll push back \n\nAnd when you try to criminalize the push back you're destroying our civilization. \n\nAnd it doesn't help when you call political polling 'science' and push it out like truth.  \n\nThe US and western culture at large are the most diverse and open cultures on earth and not coincidentally the wealthiest. \n\nTamper with that at your own risk.",
            "title_similarity": "0.73555684",
            "sentiment_compound": -0.7822
        },
        {
            "id": "i4abppn",
            "score": -7,
            "text": "\"prejudice decreased amongst those that opposed him\". Wow...I really can't believe there's no bias in this study whatsoever and all the variables are controlled for. Prejudice, through my own lens, absolutely increased against conservatives that supported him from people that opposed him. It feels more polarized now than it ever has in my life. Prejudice increased overall from either side. Truml supporters attempted to casual stage an insurrection. Anti-Trump people got into regular fist-fights with Trump supporters, antifa became a thing nationally in that time frame.",
            "title_similarity": "0.7921262",
            "sentiment_compound": 0.4193
        },
        {
            "id": "i4a15k7",
            "score": 649,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4a85pj",
            "score": 730,
            "text": "If someone feels inclined to go past the paywall and provide a summary of how they measured things, that'd be awesome of you.\n\nEdit- The link to the [questionnaire materials used](https://osf.io/x29bs/) is here, for anyone who wants to read them. It's quite extensive, and will take time to go through.",
            "title_similarity": "0.44884104",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i4a8r7u",
            "score": 5794,
            "text": "“She (Susan Sontag) was asked what she had learned from the Holocaust, and she said that 10 percent of any population is cruel, no matter what, and that 10 percent is merciful, no matter what, and that the remaining 80 percent could be moved in either direction\"\n\n- Kurt Vonnegut",
            "title_similarity": "0.5767508",
            "sentiment_compound": -0.6057
        },
        {
            "id": "i4a9rso",
            "score": 1,
            "text": "But moreso associated in a complete lack of faith in our current politicians",
            "title_similarity": "0.5050015",
            "sentiment_compound": 0.1901
        },
        {
            "id": "i4aasxd",
            "score": 1,
            "text": "So there appears to be some kind of prejudice equilibrium where we can have no more but also no less.",
            "title_similarity": "0.4182394",
            "sentiment_compound": -0.7263
        },
        {
            "id": "i4ac2e1",
            "score": 1,
            "text": "Go before Trump, what caused his rise?",
            "title_similarity": "0.48943773",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4adqqn",
            "score": 1,
            "text": "Now we need that weighted net result: so how much did it increase or decrease, NET?",
            "title_similarity": "0.39219713",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4af65h",
            "score": 1,
            "text": "Anyone have the subscription to view the statistics they used? Would like to view their model",
            "title_similarity": "0.25459912",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4ao2t6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4ar38q",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09769955"
        },
        {
            "id": "i4aw27j",
            "score": 1,
            "text": "Considering **how much he lost** in 2020, does that mean he brought a net-good decrease in prejudice?",
            "title_similarity": "0.50878596",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i4awg81",
            "score": 1,
            "text": "I wonder if \"prejudice decreased\" means an increase in apathetic attitude, or an increase in positive prejudice towards the races and religions that were a subject of the study. Y'know, I should just read the study.",
            "title_similarity": "0.74195206",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i4ax238",
            "score": 1,
            "text": "People felt marginalized and frustrated by Obama’s policies and the moment they thought they had a candidate who would reverse that and align closer with their own, they jumped on it.  It became an echo chamber, it got worse, and people became radicalized.\n\nWho knew circumventing congress and making broad sweeping changes that people are diametrically opposed to, lying to them about keeping their healthcare, and making secretive trade agreements they deemed unfavorable forced them to resort to extremism and madness. \n\nSource:  Grew up in a small town where people felt marginalized and frustrated by Obama’s policies and the moment they thought they had a candidate who would reverse that and align closer with their own, they jumped on it.  It became an echo chamber, it got worse, and people became radicalized.",
            "title_similarity": "0.69585526",
            "sentiment_compound": -0.9648
        },
        {
            "id": "i4ay31n",
            "score": 1,
            "text": "I would like to see their specific prejudice measures",
            "title_similarity": "0.2862764",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i4ay3br",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4aztoh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4b0hf1",
            "score": 1,
            "text": "I am curious- did a similar trend show on previous republican (or even democrat) presidents?",
            "title_similarity": "0.5490485",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4bg6q8",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4bhasu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4bll8s",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4bsss9",
            "score": 1,
            "text": "Could it be a self fulfilling prophecy? I recall all the media calling him racist and so on maybe the people who were slightly racist or on the edge of being so were pulled over there because of what they were seeing and hearing I don't know Americans and their media are odd",
            "title_similarity": "0.68780243",
            "sentiment_compound": -0.8752
        },
        {
            "id": "i4bvuy4",
            "score": 2,
            "text": "Is there a link to this? I’ve seen it said the other way around and would love to read it.",
            "title_similarity": "0.3071533",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i4bygia",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4c1r8r",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.09769949"
        },
        {
            "id": "i4cicnl",
            "score": 2,
            "text": "The sooner both the left and the right realize that it is not the people that got us into this big mess, it was the politicians from both sides of the aisle that divided us and made us feel the way we feel about each other. Governments don’t like a free people. All the people want to do is earn a living, come home to their families and be at peace with each other and be free. I think that’s what people all over the world want; just to be at peace with each other in the world. But it seems like every time a government gets involved, there is war and more war and discontentment and the people end up suffering while the politicians and their lobbyists/benefactors get rich.",
            "title_similarity": "0.66178155",
            "sentiment_compound": -0.2592
        },
        {
            "id": "i4cxqpa",
            "score": 1,
            "text": "Getting sick of both political sides tbh. I'd gladly sit back and watch them kill each other off tbh. Tired of all this childish tribalism",
            "title_similarity": "0.4804581",
            "sentiment_compound": -0.9001
        },
        {
            "id": "i4d0boq",
            "score": 1,
            "text": "What!? This is suprising!",
            "title_similarity": "0.1579094",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4d62i3",
            "score": 2,
            "text": "Canada has been infected by trumpistan, we have the flags on trucks now and today I saw a truck with Let’s go Brandon in the back window.",
            "title_similarity": "0.5576634",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i4d7pen",
            "score": 1,
            "text": "XD How, i have never seen so many openly toxic, revolting and vile people as people who dislike or oppose trump.  But maybe, its not classified as a ... no, that is a prejudice.",
            "title_similarity": "0.6591373",
            "sentiment_compound": -0.7213
        },
        {
            "id": "i4d8hrf",
            "score": 1,
            "text": "This does not surprise me in the least.",
            "title_similarity": "0.06093727",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i4d9jx4",
            "score": 1,
            "text": "Hahaha what garbage is this?",
            "title_similarity": "0.16140807",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i4dakkk",
            "score": 1,
            "text": "That’s the dumbest thing I’ve ever heard and totally untrue.  What nonsense.",
            "title_similarity": "0.26188672",
            "sentiment_compound": -0.7402
        },
        {
            "id": "i4dbdj3",
            "score": 1,
            "text": "By any means necessary",
            "title_similarity": "-0.015428824",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dlcpa",
            "score": 1,
            "text": "Why the heck are people still obsessed with trashing Trump, he lost, its over, get over it. Honestly it’s getting pathetic.",
            "title_similarity": "0.59954107",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i4dotfs",
            "score": 1,
            "text": "Gee, I wonder who sponsored that study? Hint: A liberal source.\n\nThe increase in racism been largely on the left...just look at the rantings of the BLM groups..pure hatred.",
            "title_similarity": "0.6790745",
            "sentiment_compound": -0.7906
        },
        {
            "id": "i4dpsel",
            "score": 1,
            "text": "Some people grow and become better people and then there's those who choose to stagnate and fall apart as humans.",
            "title_similarity": "0.51213783",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4dqlno",
            "score": 1,
            "text": "Study behind a paywall which was generously shown only to reveal it lists “studies have shown” also with no real data in the studies in this study. All generalizations and no hard data. Great post OP. Fits right into the sub",
            "title_similarity": "0.3372715",
            "sentiment_compound": 0.7181
        },
        {
            "id": "i4drr1n",
            "score": 1,
            "text": "Hateful movements produce hate, more at 10",
            "title_similarity": "0.5512389",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i4dvxo7",
            "score": 1,
            "text": "Hmmm idk about all that... I've seen a lot of anti white racism from people who hate Trump.",
            "title_similarity": "0.74034995",
            "sentiment_compound": -0.8885
        },
        {
            "id": "i4dxgj3",
            "score": 1,
            "text": "Correct sub is r politics, not r science.",
            "title_similarity": "0.28155762",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4dznqt",
            "score": 1,
            "text": "Still justifying orange bad man, sore losers are usually sore winners",
            "title_similarity": "0.49990338",
            "sentiment_compound": -0.8316
        },
        {
            "id": "i4e2cbu",
            "score": 1,
            "text": "The fact that any amount of time went into this research reminds me of how far behind humans are in mental evolution.",
            "title_similarity": "0.44977617",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4e6eif",
            "score": 2,
            "text": "This is politics, not scholarship..That study was paid for by the Democracy Fund Voter Study Group, a project of liberal EBay founder Pierre Omidyar, best known for creating several phony “GOP” groups “Republicans for the Rule of Law” “Republican Voters Against Trump” & “ Republicans for Voting Rights” All of these groups are fronted by washed up 1980s Republicans paid to serve on the boards of these Democrat sock puppets…",
            "title_similarity": "0.59026116",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i4e6m1e",
            "score": 2,
            "text": "I've often said that the biggest drive behind people voting for trump and sticking to him is racism. We had a good streak going where the country felt less racist at the surface, not to say anything to the undercurrents. But like if you had a certain kind of uncle, he probably was brow beaten into being less racist openly before trump. \n\nThat racist didn't really go away, it just wasn't acceptable to be casual about it, then trump came around and made it ok to speak your mind on such things again. It made all the other insane, terrible things he did ok to those people, because they didn't feel shunned for being racist anymore.",
            "title_similarity": "0.76007456",
            "sentiment_compound": -0.9725
        },
        {
            "id": "i4ebvkm",
            "score": 2,
            "text": "That was his whole philosophy. Accentuate differences, divide everyone into us vs them.  Then enjoy the fighting. A truly terrible person.",
            "title_similarity": "0.47736567",
            "sentiment_compound": 0.128
        },
        {
            "id": "i4eg53m",
            "score": 2,
            "text": "Yep, he gave them all a license to spew their hatred.",
            "title_similarity": "0.40832937",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i4eklzu",
            "score": 1,
            "text": "They propaganda machine knows no bounds.",
            "title_similarity": "0.08335262",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i4ey6l8",
            "score": 1,
            "text": "I find this really hard to believe. People voted him into office and immediately the democrats were fighting him in court and congress. How can this report be accurate in saying prejudice increased in the right when the left was bashing and non stop fighting him from day one. He wanted everyone to work together but he was met with such stiff opposition from day 1 that it would never happen. In the past both parties worked together but since he stopped Hillary from taking the White House and everyone in government wanted her to win because the government is full of democrats , no one would work with trump. I think the basis for this “scientific” report is flawed from the start.",
            "title_similarity": "0.66280246",
            "sentiment_compound": -0.5569
        },
        {
            "id": "i4g6nz3",
            "score": 1,
            "text": "Prejudice sure increased against whites among those who opposed him",
            "title_similarity": "0.6712984",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i4g7y5w",
            "score": 1,
            "text": "So why would anyone vote for a Republican this year. If they control Congress things will get even more difficult for Most Americans. That is unless you’re in the top 10%.",
            "title_similarity": "0.6818179",
            "sentiment_compound": -0.2484
        },
        {
            "id": "i4g91ov",
            "score": 1,
            "text": "This must be true and accurate. It’s Science!!",
            "title_similarity": "0.1360639",
            "sentiment_compound": 0.5242
        },
        {
            "id": "i4vp3b6",
            "score": 1,
            "text": "So pretty much all liberals are big bad people, got it.",
            "title_similarity": "0.54539746",
            "sentiment_compound": -0.0018
        },
        {
            "id": "i5pgysm",
            "score": 1,
            "text": "As usual, the opposite of the post is true.",
            "title_similarity": "0.16775364",
            "sentiment_compound": 0.4215
        }
    ]
}