{
    "Men are less religious in countries with more gender equality, shows study\n": [
        {
            "id": "i4f2kyp",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue to be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.39233023",
            "sentiment_compound": 0.7088
        },
        {
            "id": "i4fqhlj",
            "score": 9,
            "text": "\"men like to dominate women and use scripture to legitimate their power fantasies\"",
            "title_similarity": "0.40304652",
            "sentiment_compound": 0.25
        },
        {
            "id": "i4ffzdw",
            "score": 23,
            "text": " grew up Roman catholic and couldn't get with it, maybe it has to be with being black, but anywho... All religions at the end of the day have the same message. A super conservative guy, who hates any and all changes unless they are allowed by him or they'll do it anyways behind your back. It keeps a power structure in place from pure fear of \"hell\" whatever the religion. It gives an extreme amount of power to a person and like a TON of old popes allowed the crusades, pay into heaven, help the Nazi's, etc..religion is the exact reason women don't have rights, minorities are treated like crap and taken advantage of, technology hasn't advanced at a faster clip. Religion is waaaaayyy worse than racism in terms of world history.",
            "title_similarity": "0.4584962",
            "sentiment_compound": -0.8782
        },
        {
            "id": "i4flxzj",
            "score": 2,
            "text": "I kinda feel like its the other way around, men see women as fellow humans and equals in countries with less religion",
            "title_similarity": "0.78696805",
            "sentiment_compound": 0.3008
        },
        {
            "id": "i4fiir0",
            "score": 23,
            "text": "In other words - religion drives gender inequality?",
            "title_similarity": "0.57472837",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fncyp",
            "score": 5,
            "text": "Turns out that gender inequality and religion goes hand in hand - what a twist!",
            "title_similarity": "0.5118943",
            "sentiment_compound": 0.7712
        },
        {
            "id": "i4fn25z",
            "score": -1,
            "text": "Or is there better gender equality in countries where men are less religious?\n\nI think cause and effect are swapped in the title",
            "title_similarity": "0.8676932",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4f92gl",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.24890341"
        },
        {
            "id": "i4frqeq",
            "score": 1,
            "text": "It’s almost like…and stay with me here…that in countries with fewer religious zealots, men are more likely to treat women as equals.  Weird",
            "title_similarity": "0.81712466",
            "sentiment_compound": 0.1189
        },
        {
            "id": "i4fcb2o",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.24890341"
        },
        {
            "id": "i4fnb2g",
            "score": 7,
            "text": "Men perform better at the Olympics in countries with more gender equality.\n\nGender equality is just a good metric to know how modern a country is.",
            "title_similarity": "0.6640492",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i4fn6do",
            "score": 0,
            "text": "Can't wait for this to get brought up ad nauseam at family get-togethers.",
            "title_similarity": "0.14126813",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fco9l",
            "score": 19,
            "text": "Interesting article, posted as science but written by someone who's education is law,  they fail to account for correlation resulting from economic conditions etc but still interesting",
            "title_similarity": "0.51953626",
            "sentiment_compound": -0.09
        },
        {
            "id": "i4fcs1t",
            "score": 104,
            "text": "It's almost as if educated countries are more likely to abondon their medieval believes",
            "title_similarity": "0.5153797",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fpdrg",
            "score": -15,
            "text": "Correlation ≠ causation btw",
            "title_similarity": "0.20812687",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fjvxq",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.24890341"
        },
        {
            "id": "i4fia71",
            "score": 21,
            "text": "Educated, progressive countries tend to be less religious.\n\nEducated, progressive countries tend to be more egalitarian.\n\nCorrelation  doesn't equal Causation.",
            "title_similarity": "0.81704086",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fepla",
            "score": 2,
            "text": "OR! In less religious countries, there is more gender equality.",
            "title_similarity": "0.7908448",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fex7h",
            "score": 8,
            "text": "Are we confusing the cause and effect I wonder?",
            "title_similarity": "0.31678835",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i4frts2",
            "score": 7,
            "text": "Religion is a tool of control, so it tracks. I would argue there is more equality BECAUSE men are less religious.",
            "title_similarity": "0.7865001",
            "sentiment_compound": -0.34
        },
        {
            "id": "i4fdsq4",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.24890341"
        },
        {
            "id": "i4g5a8l",
            "score": 4,
            "text": "We were all well aware that religion reinforces gender inequality",
            "title_similarity": "0.4385559",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i4ge570",
            "score": 1,
            "text": "Not all religions are the same. By and large, where Christianity has spread, women have had more rights. Where Islam has spread, women have had fewer rights. You can’t lump all religions together. They have very different worldviews.",
            "title_similarity": "0.61698633",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fauzy",
            "score": 43,
            "text": "[removed]",
            "title_similarity": "0.24890341"
        },
        {
            "id": "i4frvtf",
            "score": 0,
            "text": "Hey mods, what's with the deletion without notification of comments that don't go against the rules here, & that aren't even controversial?",
            "title_similarity": "0.47562072",
            "sentiment_compound": 0.1511
        },
        {
            "id": "i4fyh7m",
            "score": 0,
            "text": "This research gives no evidence that higher gender equality reduces religiosity.     \n        \nThis research presents zero evidence suggesting that lower religiosity results in more gender equality.     \n       \nIt doesn't rule out any external variables that may result in both the lowering of religiosity and increase of gender equality in a given culture. Just to speculate, that could be anything like economic growth, access to education, democracy, climate, popular media, access to the internet, materialism, income inequality, access to birth control, and cultural sexual trends.       \n      \nThe 90% religion=bad comments here show how bad reddit is at social science.",
            "title_similarity": "0.61962426",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i4h6gzy",
            "score": 0,
            "text": "Let’s pick two random statistics and find a correlation",
            "title_similarity": "0.35104176",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fh5n7",
            "score": 9,
            "text": "Maybe just me, but feels like most correlation observation studys on this sub result in a huge comment thread of people assuming causality and just sounding off on their opinions?  Feels that way.  Correlation tag add any value?  Dunno.  Seems persistent issue of quality here.",
            "title_similarity": "0.39826903",
            "sentiment_compound": 0.8645
        },
        {
            "id": "i4fjbxb",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.24890341"
        },
        {
            "id": "i4foo9u",
            "score": 4,
            "text": "I would title that in reverse.  There is more gender equality in countries with less religious adherence. \n\nNot really surprising, considering how oppressive more religions are on women.",
            "title_similarity": "0.7846793",
            "sentiment_compound": -0.5763
        },
        {
            "id": "i4fqve9",
            "score": 4,
            "text": "This article is trying really hard to say men bad instead of religion bad.",
            "title_similarity": "0.5809225",
            "sentiment_compound": -0.8268
        },
        {
            "id": "i4fysr4",
            "score": 8,
            "text": "It's correlation - not causation.  We can't do causation studies on people. Like we can't subject an area to religion and another area to no religion and study the outcomes. Cause it's unethical. We can only look\nAt correlation which doesn't show what causes what -\nOnly the interlink that two things are going in certain directions together or opposing directions. \n\nThat being said. If anyone were to sit and read religious texts from a lens of looking for elements that teach control of women, female children, reproduction, sexuality, economics for women, etc then you will find that most religious texts paint a bleak structure for women to live under. So the correlation makes sense. More gender equality and less organized religion are interlinked.",
            "title_similarity": "0.49223003",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i4finfl",
            "score": 57,
            "text": "It seems to me that religion is often used as a means of \"keeping women in line\", either with the concept of \"traditional values\" or literal rules about women keeping quiet and doing what the man says. In a society with more equality or female empowerment, I would expect the traditional religious views would have less sway and be at conflict with society norms. The concept of equal and empowered women directly contradicts many religious texts- which are often are just representations of their source cultural attitudes at the time they were written. \n\nSeems to me a more progressive society would be a less religious one overall.",
            "title_similarity": "0.68394864",
            "sentiment_compound": -0.25
        },
        {
            "id": "i4fp78w",
            "score": 1,
            "text": "I think this switches cause and effect?  More religious male societies have lower gender equality",
            "title_similarity": "0.86286736",
            "sentiment_compound": -0.296
        },
        {
            "id": "i4frz5o",
            "score": 1,
            "text": "I think they have that backwards.  There is more gender equality in places where people are less religious.",
            "title_similarity": "0.87026197",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fw2fi",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.24890341"
        },
        {
            "id": "i4fw2b8",
            "score": 5,
            "text": "It’s like religious fundamentalism IS the root problem, but no that couldn’t be, we should just allow misinformation and grift masquerading as spirituality to continue unabated.",
            "title_similarity": "0.36420015",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i4fodcj",
            "score": 29,
            "text": "1. Why link to a highly opinionated fluff recap rather than the study?\n\nhttps://royalsocietypublishing.org/doi/10.1098/rspb.2021.2474\n\n2. Since I can't read the article, and the abstract gives no clue, I have no idea what they measure for \"gender equality\". This type of vague terminology that can encapsulate a huge variety of items does not help reach any scientific conclusion.\n\n3. Even the study itself appears to be very opinionated, with the abstract stating \"We interpret results through a rational choice lens, *which assumes* that people are more drawn to religion when it is consistent with their reproductive goals.\" [italics mine]",
            "title_similarity": "0.5163566",
            "sentiment_compound": -0.5903
        },
        {
            "id": "i4g8z4u",
            "score": 3,
            "text": "Conservative ideas - \n\n- High focus on religion \n\n- Male lead society \n\nProgressive ideas - \n\n- Move away from religion \n\n- Equality between genders\n\nThis is like saying countries that revive gold in snowboarding also received gold in skiing. The two have very little to do with each other outside of needing more access to snowy weather.",
            "title_similarity": "0.54400975",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i4gj4s4",
            "score": 3,
            "text": "It's crazy that religions get a free pass to propagate their views without scrutiny when they can clearly do harm to society.",
            "title_similarity": "0.43386245",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i4gf9x6",
            "score": 1,
            "text": "Well, surprise, surprise, surprise! And the average person is happier in countries where the wealth is the most spread.. and there are places where both of these things happen, and people there are generally, quite content; like Holland, or anywhere in Scandinavia.",
            "title_similarity": "0.50779593",
            "sentiment_compound": 0.9439
        },
        {
            "id": "i4gh1lm",
            "score": -1,
            "text": "I’m Judaism, the women is the most important person. It is through her which religion flows to the next generation. Even though men seem to have more responsibilities (tefillin, tallit and the bulk of the prayer), the reason stems how women are perceived as above the need for these acts as they are generally holier.",
            "title_similarity": "0.5800485",
            "sentiment_compound": 0.2716
        },
        {
            "id": "i4gnxbi",
            "score": 1,
            "text": "Countries with greater gender equality have a lower percentage of female STEM graduates (called the \"gender equality paradox\") https://www.sciencedaily.com/releases/2018/02/180214150132.htm",
            "title_similarity": "0.7558704",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i4grxgb",
            "score": -1,
            "text": "The most progressive cities have significantly higher rates of crime, drug abuse and despair than religious communities.",
            "title_similarity": "0.583694",
            "sentiment_compound": -0.875
        },
        {
            "id": "i4fbos4",
            "score": 23,
            "text": "Or another way to look at it; countries where men are less religious have more gender equality.",
            "title_similarity": "0.93237305",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fkxov",
            "score": 6,
            "text": "Men in progressive, secular countries are less religious. Who would have guessed",
            "title_similarity": "0.7735321",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fmfzg",
            "score": 7,
            "text": "If you believe the world order is something decided and passed down by an all-knowing entity it would make sense to be more conservative. If you believe the world is  but an amalgamation of the arbitrary you'd feel more responsibility for making that reality a decent place.",
            "title_similarity": "0.52428424",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gnfk2",
            "score": 36,
            "text": "Correct me if I'm wrong, but 3/3 major Abrahamic religions have scriptures in their holy books about men's superiority and authority over women. Gender equality and these religions simply are not compatible.",
            "title_similarity": "0.563623",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4fk3hk",
            "score": 5,
            "text": "People are gonna draw the wrong conclusions from this I think it is more a matter of correlation than cause. Generally countries that are more developed (in the western sense) are more atheists and have more equality.",
            "title_similarity": "0.7321553",
            "sentiment_compound": -0.4062
        },
        {
            "id": "i4fmnr5",
            "score": -5,
            "text": "Is it really in that order?",
            "title_similarity": "0.22494027",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gftj5",
            "score": 3,
            "text": "In other words. Religion is oppressive to women?",
            "title_similarity": "0.48670626",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i4focz8",
            "score": 1,
            "text": "Seems like they've got cause and effect confused",
            "title_similarity": "0.31265235",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i4gqg48",
            "score": 3,
            "text": "Religion is a cancer to society and theism is a mental disease",
            "title_similarity": "0.44323108",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i4gql1i",
            "score": -2,
            "text": "Just remember this is as valid as saying more ice cream sales = higher murder rates. Correlation does not mean causation",
            "title_similarity": "0.5387262",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i4gs4hu",
            "score": -2,
            "text": "We are not equal. Anything that goes against nature goes against god. Note, I'm not even a christian but I do believe in god. Were just to stupid to know him as we are focusing on gender squables and propaganda.",
            "title_similarity": "0.51673985",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i4hf0wq",
            "score": 2,
            "text": "Obviously.\n\nAtheists are more reasonable, caring and understanding.",
            "title_similarity": "0.54778343",
            "sentiment_compound": 0.539
        },
        {
            "id": "i4fv4s9",
            "score": 20,
            "text": "Isnt it more \"I believe in God so you came from my rib woman!\" versus \"we are both brains controlling meatsacks who just want to survive so lets work together.\" Obviously very cut and dry in my example but this could be any mixture of cause and effect.",
            "title_similarity": "0.32084975",
            "sentiment_compound": 0.0761
        },
        {
            "id": "i4gp5by",
            "score": 9,
            "text": "If this was true, the politicians in my country that align with religious nuts would also be the sexist ones trying to control women, trans women, gay women, oh wait they do.",
            "title_similarity": "0.514592",
            "sentiment_compound": 0.128
        },
        {
            "id": "i4fv2lb",
            "score": 37,
            "text": "We should talk directly about hierarchy, because where it exists it encourages more of itself. God over man, man over woman— there are many more iterations but it’s all from the same corrupting structure of one above another.",
            "title_similarity": "0.5248389",
            "sentiment_compound": 0.3883
        },
        {
            "id": "i4gm4bd",
            "score": 26,
            "text": "I have no idea how a modern women can believe In Christianity. Genesis tells us that a *woman* was created because Adam was lonely (Genesis 2:18.) Then we find out, contrary to reality, that the first women was created and birthed through a man (a rib bone for some reason.) And not only did women come from man (Genesis 2:23) but women are responsible for *original sin.* It's worth noting that Eve wasn't even present when God told Adam not to eat from the tree of Knowledge, but when God confronted Adam about the incident he straight up blamed Eve (Genesis 3:9-13, *verse 12 originally translated to \"the women you doth gave me, she gave me fruit from the tree and I ate it.\"*) and apparently the omniscient God bought it, because he punished women. Occording to the Bible, the pain women feel during childbirth is punishment for giving humans self-awareness; that makes all sorts of sense. But that's punishment..because you're a women, you didn't originally create life, men did, and it's your fault that we have fallen from grace.\n\nAbrahamic religions are a huge reason women have been relegated to proverbial 2nd class citizens. Many pagan religions and cultures recognized women, as there were plenty of women rulers and even oracles.\n\nEdit: *minor typos*",
            "title_similarity": "0.42364746",
            "sentiment_compound": -0.8431
        },
        {
            "id": "i4fkhad",
            "score": 3,
            "text": "Ita more likely that countries have more gender equality BECAUSE men are less religious",
            "title_similarity": "0.9142256",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fo047",
            "score": 3,
            "text": "So religion affects gender equality or vice versa?",
            "title_similarity": "0.5287415",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fztxw",
            "score": 3,
            "text": "Wow its almost like religion perpetuates sexism. Who could have guessed?",
            "title_similarity": "0.5663196",
            "sentiment_compound": 0.719
        },
        {
            "id": "i4g0x22",
            "score": 5,
            "text": "I'd suspect there is more of a causal relationship in the other direction.",
            "title_similarity": "0.44536465",
            "sentiment_compound": -0.296
        },
        {
            "id": "i4g4hru",
            "score": -3,
            "text": "Unfair premise  One ideology is replacing another. There is nothing to compare, it is the same.",
            "title_similarity": "0.49148694",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i4fiq1k",
            "score": 6,
            "text": "Isn't it because most religions were written in very Patriarchal societies?   So regardless of causation, it isn't that surprising.  Whether more gender equality progresses from a lack of religion, or whether gender equality makes people turn their back on the bronze age nonsense of most religions.",
            "title_similarity": "0.59835815",
            "sentiment_compound": -0.7017
        },
        {
            "id": "i4f7xii",
            "score": 1111,
            "text": "Religion can be viewed as a form of social control and historically it’s by men to control women as one aspect.",
            "title_similarity": "0.5430937",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fbo3t",
            "score": 225,
            "text": "I think they got that backwards — countries that are more religious have less gender equality.",
            "title_similarity": "0.80253935",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gixgu",
            "score": 8,
            "text": "Everything is better with less religion. Do your thing but stay out of my life with passing laws and burning books,",
            "title_similarity": "0.5713796",
            "sentiment_compound": 0.2382
        },
        {
            "id": "i4fgh3d",
            "score": 4,
            "text": "countries with men that are less religious, have more gender equality",
            "title_similarity": "0.9340526",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g2cw7",
            "score": -3,
            "text": "The article calls out India specifically. And if we ruled out extreme outliers such as Saudi Arabia or any other country that makes your husband equal to god, how relevant are these findings? Most of the world follows some form of Christianity and these are the same countries that have a large scale of equality among male and females. \n\nMy 2 cents is article headline is purposefully antagonizing to allow non religious to feel superior",
            "title_similarity": "0.50209916",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4g950g",
            "score": 0,
            "text": "All I'm gonna say is things would look less clear-cut if it weren't for Christianity and Islam having virtually or completely erased hundreds of other religious traditions. To think religion in itself is always misogynistic is to give organized Abrahamisms and Shaiva/Vaishnava Hinduisms a monopoly on religious discourse that they don't deserve.",
            "title_similarity": "0.47794637",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g9qg4",
            "score": 3,
            "text": "Religion gives people excuse to turn their brains off. Questioning things and actually thinking critically doesn’t work for them.",
            "title_similarity": "0.54070663",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i4gfyzt",
            "score": 5,
            "text": "Organized religion is horrible period. No matter what gender you are. Because gender is real, and religion is lies.",
            "title_similarity": "0.49922827",
            "sentiment_compound": -0.7487
        },
        {
            "id": "i4gi7vc",
            "score": 5,
            "text": "I mean, gender equality is pretty much the opposite of what all religions teach.....",
            "title_similarity": "0.6096298",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i4fk3u9",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.24868245"
        },
        {
            "id": "i4f4idx",
            "score": 38,
            "text": "[removed]",
            "title_similarity": "0.24890341"
        },
        {
            "id": "i4gd34w",
            "score": -6,
            "text": "There's a lot of religion posts lately.  Pretty odd to me, but I think people are taking religion out of context.  Religious zealots are the prime offenders.  Those are normally Catholics, but all religions have them.  \n\nThe main goal of Christianity is the bring people to God in a way that's pure and loving.  It is not meant to control people.",
            "title_similarity": "0.49090016",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4frsow",
            "score": 32,
            "text": "When committing genocide, the bible spells out the godly way to sort people into two groups, those to be killed and those to be made into sex slaves. His instructions: Everyone except young girls goes into the kill group. When some officers allow older women to live, Moses reprimands them:\n\n\"Have you allowed all the women to live?” he asked them. 16 “They were the ones who followed Balaam’s advice and enticed the Israelites to be unfaithful to the Lord in the Peor incident, so that a plague struck the Lord’s people. 17 Now kill all the boys. And kill every woman who has slept with a man, 18 but save for yourselves every girl who has never slept with a man.\"\n\nNumbers 31:7",
            "title_similarity": "0.35721222",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i4fs8h0",
            "score": 6,
            "text": "AKA, Authoritarian, misogynistic men use religion as a vehicle for their regressive views.",
            "title_similarity": "0.43765634",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g5xzi",
            "score": 5,
            "text": "Not really surprised at this conclusion, but it helps to have an actual study done. Definitely an expected result when a significant amount of religions preach that women and children are property",
            "title_similarity": "0.43214247",
            "sentiment_compound": 0.8275
        },
        {
            "id": "i4felbt",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.24868247"
        },
        {
            "id": "i4fo7te",
            "score": 1,
            "text": "It's like religion slows down progression. Also why is religion creeping up more in the states at the government level?",
            "title_similarity": "0.6554354",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4fp5vz",
            "score": 1,
            "text": "So more religion = less gender equality.",
            "title_similarity": "0.7653074",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fytp7",
            "score": 1,
            "text": "Religion fuels regression",
            "title_similarity": "0.3783098",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fza1n",
            "score": 1,
            "text": "Should read: Countries have more gender equality when men are less religious.",
            "title_similarity": "0.9136811",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g9uvi",
            "score": 1,
            "text": "Well as it turns out, the countries with the worst record on gender equality all exist in a third world region known for fundamentalism under one particular religion. I think that one region and religion heavily, heavily skews the data",
            "title_similarity": "0.5138936",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i4g9zzx",
            "score": 1,
            "text": "What do they mean with gender equality?",
            "title_similarity": "0.5050373",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gjp8b",
            "score": 1,
            "text": "Men who are more religious influence countries to have less gender equality, study shows*",
            "title_similarity": "0.81226945",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4goivb",
            "score": 1,
            "text": ">Countries where men are less religious have greater gender equality.\n\n\nThere.&nbsp; Fixed.",
            "title_similarity": "0.9064623",
            "sentiment_compound": 0.3041
        },
        {
            "id": "i4h4c71",
            "score": 1,
            "text": "Yes, we are more progressive for giving up religion. Everyone give yourself a pat on the back for being a model society...",
            "title_similarity": "0.48520875",
            "sentiment_compound": 0.6557
        },
        {
            "id": "i4h6jo6",
            "score": 1,
            "text": "I think people often take religion as the implementation of all social and cultural values that have been established throughout civilisation. In which case, it would be completely appropriate and fair to say that progress is not compatible with religion. The fact that some people simply change the meaning of some holy texts only to rule better over people or to implement their own values as the status quo is the living proof of this theory in my opinion. \nBut what we must not forget is that religion does not necessarily mean culture or tradition. Some people (actually a good part of them in our era) tend to live their faith very personally not trying to impose their values upon other people, thus allowing progress. \nI think that we should understand that religion is not a big stop sign to progress, rather it is all the social and cultural norms that the society implement to religion.\nAs a religious man myself, I understand why people feel that way about religion, but saying that the fault is all on religion is kinda extremist tbh, it like putting every religious person on earth in the same bag and label them as “anti-progress” which is obviously not the case for many of us. Additionally by doing so, you’re labeling religion as the representation of a conservative society while it is in reality a very deep and complex topic still subject to many studies and interpretations.",
            "title_similarity": "0.522429",
            "sentiment_compound": 0.9837
        },
        {
            "id": "i4heoog",
            "score": 1,
            "text": "Let me fix that headline.   In countries with lower gender equality men are more religious.   \n\nReligion is an ancient relic.  An antidote to our unique human ability to imagine our own deaths.  Everything else in religion was coded into it later by man to justify tribal hierarchies",
            "title_similarity": "0.54307234",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i4hfozu",
            "score": 1,
            "text": "Oooor less religion means more equality. It's kind of built into the system, right?",
            "title_similarity": "0.73905754",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hftgd",
            "score": 1,
            "text": "Isnt this just common sense since most religions explicitly say men are superior to women (albeit some are trying the \"Ah we are just re interpreting it now to mean something else\" method)",
            "title_similarity": "0.6014515",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i4hkcim",
            "score": 1,
            "text": "That’s because equal societies are smarter and more successful than unequal ones. The women’s common sense tends to rub off onto the men.",
            "title_similarity": "0.67945504",
            "sentiment_compound": 0.6629
        },
        {
            "id": "i4hl4me",
            "score": 1,
            "text": "The cause and effects seem to be mixed up. Actually in less religious countries, there is more gender equality. \n\nI'm not saying it's the fault of religion and antiquated beliefs and culture. .. but well..... Draw your own conclusions.",
            "title_similarity": "0.7964404",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i4hl5yk",
            "score": 1,
            "text": "Shocking. It’s almost like the majority of religion texts treat women like secondary citizens...oh wait.",
            "title_similarity": "0.51249593",
            "sentiment_compound": 0.5729
        },
        {
            "id": "i4huxvw",
            "score": 1,
            "text": "If it wasn’t for religion the world would be a better place.",
            "title_similarity": "0.5559169",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4injhf",
            "score": 1,
            "text": "Maybe people finally are realizing religion is created as a tool for control if they have not already ;)",
            "title_similarity": "0.48978508",
            "sentiment_compound": 0.0859
        },
        {
            "id": "i4iu9uj",
            "score": 1,
            "text": "\n> More gender equality in countries with men are less religious\n\nFixed.",
            "title_similarity": "0.9350093",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fb379",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.24890341"
        },
        {
            "id": "i4fl8ge",
            "score": 2,
            "text": "I think it goes the other way around. There is more gender equality in countries where men are less religious",
            "title_similarity": "0.9430022",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ftmrb",
            "score": -2,
            "text": "Imagine carrying out a study that has inherent circular logic and not even realising it then publishing the results. Everyone knows Religion oppresses women (no condoms for Catholicism, don't even get started on Islam) so obviously there will be more gender inequality present in heavily religious countries. I doubt there is a single popular religion that isn't oppressive to women in some way or another.\n\nI dont understand who is carrying out these studies and how its not vetted for its obvious inherent flaws?",
            "title_similarity": "0.5144551",
            "sentiment_compound": 0.3732
        },
        {
            "id": "i4g23m3",
            "score": 2,
            "text": "Really?? I never would have figured that out!",
            "title_similarity": "0.25157753",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g5e2j",
            "score": 2,
            "text": "Seems like an obvious correlation.  Just the nature of the majority of religions is that you are adhering in some fashion to very old texts/practices/dogma and lets be honest, the past was not very kind to women.  So if you are practicing really anything that is rooted in the past, some of the old biases and such will bleed in no matter how righteous your intentions are.  The Bible or Quran don't get amendments like the Constitution to account for the social change in society.  So I would expect any country deeply rooted in religion to be lagging behind somewhere that isn't in social change.",
            "title_similarity": "0.5630663",
            "sentiment_compound": -0.1222
        },
        {
            "id": "i4g7v68",
            "score": 2,
            "text": "Could we please stop using politics and religion in an area purportedly for Science?",
            "title_similarity": "0.40707046",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i4g8eje",
            "score": -2,
            "text": "This is most likely correlation without causation.",
            "title_similarity": "0.4206318",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4glv91",
            "score": -2,
            "text": "Those men were praying for equal rights, once they achieved their goal, they shifted their focus",
            "title_similarity": "0.48014286",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4h6wp8",
            "score": -2,
            "text": "That's because the women tend less to be goddesses",
            "title_similarity": "0.6754935",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4f8wxn",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.24890344"
        },
        {
            "id": "i4ffmup",
            "score": -21,
            "text": "[removed]",
            "title_similarity": "0.24890344"
        },
        {
            "id": "i4fu3hz",
            "score": 3,
            "text": "That’s not surprising. In fact, the opposite is true as well. The more religious men are, the more sexist they are. My opinion from being an American citizen.",
            "title_similarity": "0.64474624",
            "sentiment_compound": 0.4742
        },
        {
            "id": "i4fz0wi",
            "score": 3,
            "text": "Religions tend to put women in servant status which explains why gender equality is less present in religious societies.  Are there any religions that have female heads or in which women have significant decision making power? I can’t think of any.",
            "title_similarity": "0.6973133",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i4g1l3y",
            "score": -3,
            "text": ">Many Indians have grown up hearing things like “Pati parmeshwar hota hai” (your husband is your god), so it is hardly a revelation to learn that men are more religious in countries with poor gender equality.\n\nThis statement makes no sense. Is the author suggesting that Indian men are increasingly disinclined to view their husbands as deific? \n\n&#x200B;\n\n>A new sex-based global analysis seeks to understand how religiousness among men and low levels of gender equality are interlinked with each other.\n\nBut not studying how religiousness among, say, adults or people in general relates to gender equality? Mmmk. \n\nFile under junk sociology.",
            "title_similarity": "0.66588044",
            "sentiment_compound": -0.4234
        },
        {
            "id": "i4gaqz6",
            "score": 3,
            "text": "Religion is basically meant to control people so it makes sense. At least in the US I’ve found that the most bigoted people are also the ones who are the most religious.",
            "title_similarity": "0.5511822",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4grnj9",
            "score": 3,
            "text": "Cuz those countries are more developed and more ppl know that religion is like believing that santa is real",
            "title_similarity": "0.4368443",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4h2oj6",
            "score": 4,
            "text": "Countries with hyper religious men tend to fear womens rights, so the opposite kind of forces it to correlate.",
            "title_similarity": "0.5954679",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i4h2pzz",
            "score": 2,
            "text": "Wait let me fix that, “Countries where men are less religious have more gender equality.”",
            "title_similarity": "0.91832066",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4h2wg5",
            "score": 4,
            "text": " Organized Religion = Control.",
            "title_similarity": "0.3695581",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hlrgc",
            "score": 3,
            "text": "More like, in countries where men are less religious, there is more gender-equality.",
            "title_similarity": "0.90680337",
            "sentiment_compound": 0.4201
        },
        {
            "id": "i4gru06",
            "score": 13,
            "text": "Religion does not have a great record when it comes to gender equality, another basic ethics problem",
            "title_similarity": "0.6360888",
            "sentiment_compound": -0.7179
        },
        {
            "id": "i4gg1bz",
            "score": 4,
            "text": "Ofcourse. Religion is by far the biggest contributor to gender inequality.",
            "title_similarity": "0.46328908",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4giu85",
            "score": 4,
            "text": "I am not a religion expert but one common theme I find with a lot of religions is their distain for women.",
            "title_similarity": "0.47029722",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4f5cko",
            "score": 408,
            "text": "The article points out that it doesn’t mean that there is gender inequality because of increased religiousness, or even the other way round. They speculate that there is a bit of back and forth between the two. I think there are multiple ways it could be interpreted and no way to say which one is right definitively",
            "title_similarity": "0.6206134",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i4f9dwe",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.24890344"
        },
        {
            "id": "i4g4ubc",
            "score": -4,
            "text": "Propaganda disguised as science curates stupid people having confidence which is dangerous. This sub has its head so far up its ass it doesn't even realize how anti-science it really is.",
            "title_similarity": "0.42829537",
            "sentiment_compound": -0.8689
        },
        {
            "id": "i4go4od",
            "score": -5,
            "text": "Religious faith is not about believing in angels in the sky. Faith is the road that you choose to come together with others in order to be able to work as a unity for betterment and to unite values",
            "title_similarity": "0.45084044",
            "sentiment_compound": 0.8074
        },
        {
            "id": "i4fb68l",
            "score": -32,
            "text": "Religion is good for you.",
            "title_similarity": "0.38078266",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4fbxn9",
            "score": 207,
            "text": "[removed]",
            "title_similarity": "0.24890344"
        },
        {
            "id": "i4g8srp",
            "score": -7,
            "text": "...Immoral people are more likely to be gender benders?\n\nAin't it funny when science and religion agree?",
            "title_similarity": "0.6499991",
            "sentiment_compound": -0.505
        },
        {
            "id": "i4hgus0",
            "score": 8,
            "text": "Could it be the other way around? A more secular society promotes gender equity/equality?",
            "title_similarity": "0.62879753",
            "sentiment_compound": 0.4631
        },
        {
            "id": "i4f85bw",
            "score": 123,
            "text": "[removed]",
            "title_similarity": "0.24890344"
        },
        {
            "id": "i4fey2v",
            "score": -14,
            "text": "That's because those countries are more ahead with the overall plan of the NWO.",
            "title_similarity": "0.42043215",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g30lr",
            "score": 781,
            "text": "Please remember, this is a correlational study and we can't infer causation. There are confounding variables. For instance, religiousness tends to be lower in countries with a robust social safety net than in countries without one. I've seen it hypothesized that this is one of the reasons that the USA is so much more religious than European countries despite them all being rich, industrialized democracies. European countries generally have stronger safety nets than the USA does. The same countries that have stronger safety nets also have more gender equality. This is a confounding variable; we can't really say that more gender equality causes men to be less religious or vice versa when it's possible that a strong and secure middle class is the cause of both. There are obviously any number of other variables that could be influencing this as well.",
            "title_similarity": "0.74191415",
            "sentiment_compound": 0.9771
        },
        {
            "id": "i4f3sqe",
            "score": 11972,
            "text": "Just reacting to the title without having read the article:\n\nWouldn't it be more likely that men (or people in general, really) who are less religious elicit more gender equality in the countries in which they reside?",
            "title_similarity": "0.82888174",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ff2bf",
            "score": -25,
            "text": "That title implies that there isn’t gender equality in the US, and that is 100% wrong.",
            "title_similarity": "0.48714697",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i4fiwhd",
            "score": 2,
            "text": "[the baltic countries seems to be a lot less religious than poland, not sure about equality though apart from polan being big anti abortion and all]\n(https://www.churchpop.com/2014/10/09/10-maps-religion-europe/)",
            "title_similarity": "0.61869496",
            "sentiment_compound": -0.5043
        },
        {
            "id": "i4fo0ns",
            "score": 1,
            "text": "Countries where men are more religious have less gender equality?",
            "title_similarity": "0.85504323",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fpgci",
            "score": 1,
            "text": "More gender equality you say. Probably a byproduct of education of the population. Religion historically was a closed door system. Education for the religious but not the common man or woman.",
            "title_similarity": "0.7540707",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fqvpt",
            "score": 1,
            "text": "It's because we have no reason to thank God for our blessings anymore, we have to do it ourselves.",
            "title_similarity": "0.35255224",
            "sentiment_compound": 0.7096
        },
        {
            "id": "i4fsal9",
            "score": 1,
            "text": "I think they meant \"There is more gender equality where there are less religious males\"",
            "title_similarity": "0.89019847",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ft09w",
            "score": 1,
            "text": "higher gender equality -> higher female participation in economy-> better economy -> life is better -> no need to pray for better life -> religious influence wanes -> higher gender equality",
            "title_similarity": "0.6938534",
            "sentiment_compound": 0.8316
        },
        {
            "id": "i4ft2tv",
            "score": 2,
            "text": "Women are more religious than men almost everywhere in the world. Pew came out with this info in 2016:\n\nhttps://www.pewresearch.org/religion/2016/03/22/the-gender-gap-in-religion-around-the-world/",
            "title_similarity": "0.45311153",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ftcmf",
            "score": 1,
            "text": "Does gender equality and religious observance correlate more than gendered breakdown of religious observance?",
            "title_similarity": "0.62655216",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ftfnp",
            "score": 1,
            "text": "Religion promotes the nuclear family mentality. Marriage is a matrimony or a sacred sacrament provided to humanity by god. They think the man and woman were both made by god to fulfill specific functions. \n\nLiterally saw over the weekend that a US congresswoman was saying that women are the weaker sex and women serve their husbands and that women were created from the rib of a man. From the very beginning of the Bible, there is inherent sexism and the implication that males are at the pinnacle.",
            "title_similarity": "0.46559548",
            "sentiment_compound": 0.765
        },
        {
            "id": "i4ftg9d",
            "score": 2,
            "text": "Less religious, more Spiritual, perhaps?  It is easier to develop your own Spirituality when you aren’t distracted by controlling or influencing other people’s belief systems.",
            "title_similarity": "0.62266403",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i4ftq8q",
            "score": 2,
            "text": "That makes sense. I'm a Christian and you can't be a Christian who reads their Bible and not accept things like gender roles.",
            "title_similarity": "0.34648913",
            "sentiment_compound": -0.5096
        },
        {
            "id": "i4fttg9",
            "score": 1,
            "text": ">***Abstract***\n>\n>Sex differences in religiosity are cross-culturally common and robust, yet it is unclear why sex differences in some cultures are larger than in others. Although women are more religious than men in most countries, religions frequently provide asymmetrical benefits to men at the expense of women. Two global analyses (51 countries and 74 countries) found that country-level gender equality was consistently and negatively associated with religiousness (i.e. religious attendance, reported importance of God and frequency of prayer) for men, more than for women, leading to a larger sex difference in religiousness in more gender-equal countries. Results were especially robust for religious attendance, and hold accounting for country-level wealth, as well as individuals' religious affiliation, the moralization of sexuality, age and education level. **We interpret results through a rational choice lens, which assumes that people are more drawn to religion when it is consistent with their reproductive goals.**\n\nwhat",
            "title_similarity": "0.6856819",
            "sentiment_compound": 0.9273
        },
        {
            "id": "i4fu9ih",
            "score": 1,
            "text": "I wonder if they title should read “gender equality exists more frequently in places where men aren’t religious”",
            "title_similarity": "0.7758969",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fuhpa",
            "score": 2,
            "text": "Or less religious countries have more gender equality.",
            "title_similarity": "0.81472874",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fwbpv",
            "score": 2,
            "text": "I can only speak for Christianity as I've been a part of a church in it, but religion is very obviously sexist. And not hiding it. So why is this a surprise?",
            "title_similarity": "0.47013992",
            "sentiment_compound": 0.6101
        },
        {
            "id": "i4fwck0",
            "score": 1,
            "text": "Its because if there isn't gender equality then Men have to go through the religious systems to get a mate.",
            "title_similarity": "0.5066376",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fx1ae",
            "score": 1,
            "text": "egg/chicken in the wrong order here",
            "title_similarity": "0.29560107",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i4fxfeq",
            "score": 2,
            "text": "Reasonable people are less likely to have an imaginary friend.\n\nFixed it.",
            "title_similarity": "0.6872488",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i4fxfqd",
            "score": 1,
            "text": "Or in other words, less religious countries have more gender equality.",
            "title_similarity": "0.8490675",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fxxs8",
            "score": 1,
            "text": "The article writes about gender defined as male and female. It doesn't mention anything about lgbtq++.",
            "title_similarity": "0.57855374",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4fy69e",
            "score": 1,
            "text": "I feel like that title is backwards",
            "title_similarity": "0.3542249",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4fyv7v",
            "score": 1,
            "text": "Gender equality makes men stop believing in God.  Not exactly a newsflash,  but whatever.",
            "title_similarity": "0.71408916",
            "sentiment_compound": -0.0129
        },
        {
            "id": "i4fyxrb",
            "score": 1,
            "text": "Having grown up religious myself, I noticed that the girls in my church have stayed religious in greater numbers through college than the guys that I knew.",
            "title_similarity": "0.41207236",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4fyyj7",
            "score": 1,
            "text": "I wonder if being religious is part of the reason for the inequality. I just wonder. I dunno yet.\n\nMaybe it has something to do with indoctrination from a very young age. Who knows?",
            "title_similarity": "0.47731382",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g02g1",
            "score": 2,
            "text": "Headline implies this is a correlation but it seems more likely to be a causal relationship to me. Those countries have more gender equality Because people are less religious",
            "title_similarity": "0.8369878",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g02pi",
            "score": 2,
            "text": "I know it's just a correlation, but it feels like it should be rather: countries where men are less religious, have more gender equality. Religion being very much the reason for a lot of gender inequality and all that...",
            "title_similarity": "0.7967787",
            "sentiment_compound": 0.5023
        },
        {
            "id": "i4g04hm",
            "score": 1,
            "text": "I'm aware that religion teaches gender roles from era where women were regarded as property.\n\nI think when you think about another gender as property, you don't see them as equal. Does a dog have equal importance to you or if you had a child, that child? No, the dog is property no matter how much you love it and regard it as family.",
            "title_similarity": "0.46173066",
            "sentiment_compound": 0.7668
        },
        {
            "id": "i4g09d9",
            "score": 2,
            "text": "Isn't it the other way around? Countries with less religious people have more gender equality",
            "title_similarity": "0.85153276",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g0k39",
            "score": 1,
            "text": "You mean men are less likely to adopt extremist sexist ideologies in cultures where that isnt the accepted norm? Color me shocked.",
            "title_similarity": "0.7890583",
            "sentiment_compound": -0.3975
        },
        {
            "id": "i4g0kcd",
            "score": 1,
            "text": "Other way round, I'd think you'd find.  Less religious men are more open to a non-patriarchal society.",
            "title_similarity": "0.8336962",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g0w8c",
            "score": 1,
            "text": "Well you wouldn’t want the knights Crusade beating down your door.",
            "title_similarity": "0.3563915",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i4g12ng",
            "score": 1,
            "text": "Gee, I wonder if there's a connection to the fact that there's more gender equality in countries where they don't closely follow a book instructing women to step to the sidelines so a bloke can take centre stage. Nah that's just silly, it must be a coincidence/s",
            "title_similarity": "0.6595992",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i4g14ne",
            "score": 1,
            "text": "It should read more like “men who don’t believe in imaginary beings are more prone to use logic when it comes to gender equality”",
            "title_similarity": "0.76160336",
            "sentiment_compound": 0.4201
        },
        {
            "id": "i4g15fg",
            "score": 1,
            "text": "Or is there more gender equality in country’s that are less religious",
            "title_similarity": "0.84119505",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g1hhy",
            "score": 1,
            "text": "That's genius insite. See this is why we should be led by social scientists, like geographers....not chemists and computer scientists nor mathematicians. The obvious can go unsaid, or unstudied.",
            "title_similarity": "0.45821905",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4g1xxv",
            "score": 2,
            "text": "Or, countries with less Religion have more gender equality.\n\n1 came first, and it wasn't the women's equality part.",
            "title_similarity": "0.7403373",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g299w",
            "score": 1,
            "text": "Religiosity and gender inequality correlate?  I am shocked.",
            "title_similarity": "0.5217591",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i4g29re",
            "score": 1,
            "text": "I wonder if the same study has been done for women too - and if it has info in the article then egg on my face",
            "title_similarity": "0.39975625",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g2onw",
            "score": 1,
            "text": "Or maybe it’s that there’s more gender equality in countries where people are less religious?",
            "title_similarity": "0.86870384",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g2usx",
            "score": 1,
            "text": "So in general gender equality comes with education.. reduced religious belief is associated with higher levels of education. \n\nSo did anyone do the adjustment for the education of the people surveyed?",
            "title_similarity": "0.670184",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g2wob",
            "score": 1,
            "text": "... Or men use religion to create and perpetuate gender inequality in their own favour.",
            "title_similarity": "0.5621691",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i4g2yny",
            "score": 1,
            "text": "Religious people are fossils mentally, like gender inequality",
            "title_similarity": "0.54063255",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4g43m4",
            "score": 1,
            "text": "Pretty sure less religious men overall leads to more gender equality",
            "title_similarity": "0.88041973",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i4g47d9",
            "score": 1,
            "text": "Well yeah, take away the patriarchal benefits and there’s no reason to continue with religion.",
            "title_similarity": "0.3909554",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i4g4s7r",
            "score": 1,
            "text": "Nearly all religions were made up by people way before any of the gender fanatics started gaining popularity. Religions are just a reflection of the culture that conceived them, its just not many new religions get made in a post-science world. That part of humanity is replaced by arbitrary interpretations of science and attempting to skew ambiguous measurements to fit your own worldview.",
            "title_similarity": "0.50432044",
            "sentiment_compound": 0.8126
        },
        {
            "id": "i4g4yfl",
            "score": 1,
            "text": "Oh nooo the shock of it. Truly. We need more studies like this to show us all the ways religion, no not religion, but something is bad and making people assholes.",
            "title_similarity": "0.44561833",
            "sentiment_compound": -0.8888
        },
        {
            "id": "i4g50ff",
            "score": 1,
            "text": "Couldn't the title just be \"people are less religious in higher educated countries\"?",
            "title_similarity": "0.75255746",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g52y0",
            "score": 1,
            "text": "Everyone is less religious in countries with equality, isn't that so?",
            "title_similarity": "0.778557",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g57my",
            "score": 3,
            "text": "More religious countries have less gender equality, common sense study.",
            "title_similarity": "0.8299489",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g5oga",
            "score": 1,
            "text": "Are we sure we haven't put the cart in front of the horse on this one?",
            "title_similarity": "0.24921554",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i4g6szx",
            "score": 1,
            "text": "Which is why religions are fighting gender equality with everything they have!!!  Religion is all about power and money, equality of any kind isn't really their thing.",
            "title_similarity": "0.50174457",
            "sentiment_compound": 0.4168
        },
        {
            "id": "i4g7ijx",
            "score": 1,
            "text": "I believe it probably the other way around…",
            "title_similarity": "0.3230303",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g7q1v",
            "score": 1,
            "text": "There's been studies that show that more intelligent people are typically less religious.  It's probably fair to assume more intelligent men are also not as bigoted as less intelligent ones.",
            "title_similarity": "0.8661153",
            "sentiment_compound": 0.8908
        },
        {
            "id": "i4g7xl0",
            "score": 1,
            "text": "Is that the right way round? Surely it’s that there is more gender equality in countries where men are less religious?",
            "title_similarity": "0.87134236",
            "sentiment_compound": 0.504
        },
        {
            "id": "i4g8cs5",
            "score": 1,
            "text": "Countries with more gender equality are less religious",
            "title_similarity": "0.9020758",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g8csu",
            "score": 2,
            "text": "There’s more gender equality in countries where men are less religious. \n\nFixed it for you.",
            "title_similarity": "0.89865327",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g8g1t",
            "score": 1,
            "text": "Loved the picture of women laying asphalt by hand in the soviet union",
            "title_similarity": "0.14085613",
            "sentiment_compound": 0.7964
        },
        {
            "id": "i4g9ifj",
            "score": 1,
            "text": "may be that’s why there’s more gender equality in these countries ?",
            "title_similarity": "0.60116667",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4g9lnc",
            "score": 2,
            "text": "Well that could be because most religious texts or religion \"people\" (like priests in christianity) push the dominance of the man over the woman as one of their values",
            "title_similarity": "0.43790233",
            "sentiment_compound": 0.7964
        },
        {
            "id": "i4ga0uo",
            "score": 1,
            "text": "I would flip the headline. People who are less religious are more likely to believe in gender equality.",
            "title_similarity": "0.782329",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ga4er",
            "score": 1,
            "text": "There are men who want to have absolute control over women.  Religion is a primary tool for that in some cultures and subcultures.\n\nIf you introduce gender equality, then religion is not as useful a tool for control and becomes less interesting to that sort of man.",
            "title_similarity": "0.73866755",
            "sentiment_compound": 0.0775
        },
        {
            "id": "i4gaf70",
            "score": 1,
            "text": "abrahamic religions are male-centered (vs female centered religions that arose previously) so if you aren’t religious then that eliminates one source of gender bias, makes sense this correlates as the headline suggests",
            "title_similarity": "0.66720545",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i4gaq0q",
            "score": 2,
            "text": "I definitely think it’s the lack of religion that leads to equality, not the other way around",
            "title_similarity": "0.60073185",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i4gb3mz",
            "score": 1,
            "text": "Not really much reason to be religious if you can't use that religion to make women pseudo property",
            "title_similarity": "0.50839114",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gbd3s",
            "score": 1,
            "text": "Countries Have More Gender Equality When Men Are Less Religious",
            "title_similarity": "0.9370272",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gczu3",
            "score": 3,
            "text": "Ya, because they can't use the bible to make their wives do exactly what they say. Besides, people are starting to see that everything in the Bible is made up by man, and nobody will every know what happens after we die, until we die. I mean we're smart enough to know that a man didn't spend 3 days in the belly of a whale, a man didn't blow his trumpet, walk around it 7 times, and knock down a city, e.t.c. and most people say just they just believe the new testament, but pick and choose what is right and wrong in their opinion.",
            "title_similarity": "0.44824806",
            "sentiment_compound": -0.802
        },
        {
            "id": "i4gdztz",
            "score": 1,
            "text": "Is it a secret that there’s an inverse relationship between the level of education and the amount of religious folk in the populace?",
            "title_similarity": "0.57358456",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gf2uj",
            "score": 1,
            "text": "Inversely: countries in which men are MORE religious, have less gender equality. I can't say with certainty where the cause/effect relationship lays, but I don't think equality CAUSES men too be less religious, I'd think it more likely the other way around: religious orthodoxy negatively impacts gender equality.",
            "title_similarity": "0.77982545",
            "sentiment_compound": -0.0951
        },
        {
            "id": "i4gf6pj",
            "score": 1,
            "text": "Back up. Reverse that.   \n\"Countries that are less religious have higher gender equality.\"  \nExcept China. They just don't talk about it and no one calls them out on it.",
            "title_similarity": "0.6647853",
            "sentiment_compound": -0.296
        },
        {
            "id": "i4gfw7v",
            "score": 1,
            "text": "Religion does specify gender roles and responsibilities, with the core teachings that men and women ARE different. In countries where the genders are equal, you should expect there to be an absence of religion.",
            "title_similarity": "0.68959856",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gia2s",
            "score": 2,
            "text": "I would say that people who tend to be religious are not those who tend to be feminist",
            "title_similarity": "0.6344552",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gixk1",
            "score": 1,
            "text": "Religions spread harmful inequality between men and women. If a culture grows to the point where they acknowledge that men and women are not physically and psychologically equal but they have equal rights to everything, that culture stops distancing itself bit by bit from religion. Men who have arrived at this point, are the most aggressive when it comes to accepting the change.",
            "title_similarity": "0.61749256",
            "sentiment_compound": 0.0414
        },
        {
            "id": "i4gj2cw",
            "score": 1,
            "text": "Isn't it the other way around obviously? Religious countries will induce less gender equality laws/rights...",
            "title_similarity": "0.7109208",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gkhek",
            "score": 1,
            "text": "That headline has the cause and effect reversed.",
            "title_similarity": "0.34407854",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gl6y2",
            "score": 1,
            "text": "Also, separate from the contents of this specific article, there’s this interesting finding that there are some countries that have higher percentages of men who are in favor of legalized abortion as compared to women because women in general tend to be more religious on average and more churchgoing. If my memory serves me, I believe Ireland and Mexico are two where the numbers are reversed (i.e., more men than women support abortion) than what we normally would expect.",
            "title_similarity": "0.65847665",
            "sentiment_compound": 0.8188
        },
        {
            "id": "i4glanj",
            "score": 2,
            "text": "I think it is the other way around. There is more gender equality when men are less religious.",
            "title_similarity": "0.9217612",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gllv2",
            "score": 2,
            "text": "Or..... countries that are less religious tend to have greater gender equity.",
            "title_similarity": "0.80230325",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4gm681",
            "score": 3,
            "text": "Yes, that's understandable, the gain or profit would be way lager. These muslim men living like kings while their women and girls are keep away from society with few or no options, all because of Muhammad's outdated book of madness. Poor girls!  Funny how very few of  western feminist recognise and addresses that.",
            "title_similarity": "0.5838333",
            "sentiment_compound": 0.7574
        },
        {
            "id": "i4gp7j1",
            "score": 2,
            "text": "What an interesting way of saying that countries where men are more religious have more gender inequality.",
            "title_similarity": "0.72775847",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i4gpe50",
            "score": 1,
            "text": "Yea because they have been nurtured",
            "title_similarity": "0.19742474",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4gpg21",
            "score": 2,
            "text": "Countries has higher gender equality when people are less religious because religion by definition overrule your common sense with blind faith.  So any corrupt (religious) leader can easily abuse this.\n\nThis includes regime's that create pseudo religion such as communist countries that treat communism as a state religion.",
            "title_similarity": "0.6797606",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i4gq1to",
            "score": 2,
            "text": "These two are likely correlated in so many different ways. For instance religion is often used to enforce and maintain gender inequality.",
            "title_similarity": "0.4524691",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gqncl",
            "score": 2,
            "text": "Wow.  Shocking, especially considering less gender equality exists in places like the Middle East?",
            "title_similarity": "0.65984726",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i4gqs47",
            "score": 1,
            "text": "Because they get laid more there.",
            "title_similarity": "0.41442445",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gshja",
            "score": 1,
            "text": "“In countries with more gender equality men tend to be less religious.”",
            "title_similarity": "0.96208155",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gup9o",
            "score": 1,
            "text": "Did you also know you are less hungry when you eat?",
            "title_similarity": "0.6057524",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gw1kt",
            "score": 2,
            "text": "Better title: religious countries are backwards",
            "title_similarity": "0.58845925",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4gw67s",
            "score": 1,
            "text": "\"religion is the opiate of the masses\" -Karl Marx",
            "title_similarity": "0.4615199",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gwgew",
            "score": 1,
            "text": "I'm guessing it's the opposite.. there is more gender equality in countries with fewer religious men.",
            "title_similarity": "0.9389482",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gx4gk",
            "score": 1,
            "text": "A lot of men just use religion as an easy justification for treating women as less than men",
            "title_similarity": "0.6955583",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4gx8hn",
            "score": 1,
            "text": "That’s actually known as progress.",
            "title_similarity": "0.21419558",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4gxt6q",
            "score": 1,
            "text": "And for some reason the people who are less hungry are growing more food in their countries.\nTalking about confusing cause and effect.",
            "title_similarity": "0.6003358",
            "sentiment_compound": -0.1189
        },
        {
            "id": "i4gxyp3",
            "score": 1,
            "text": "Duuuuuuuuuuuuuuuuhhhhhhhhh",
            "title_similarity": "0.16040361",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gy7vc",
            "score": 1,
            "text": "So the West isn't as bad as its made out to be by certain groups",
            "title_similarity": "0.5767642",
            "sentiment_compound": 0.6059
        },
        {
            "id": "i4gydut",
            "score": 1,
            "text": "Sounds like a win-win to me",
            "title_similarity": "0.27160895",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4gyo6s",
            "score": 2,
            "text": "https://royalsocietypublishing.org/doi/10.1098/rspb.2021.2474\n\nWhy not assume that less religious men are more prone to equality?",
            "title_similarity": "0.7149452",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gz28t",
            "score": 1,
            "text": "Thus the problem with progressives.",
            "title_similarity": "0.38447458",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i4gzjk6",
            "score": 2,
            "text": "This suggests to me that religion is viewed by men as a tool to subjugate women. \n\nIs that a reasonable conclusion to take?",
            "title_similarity": "0.50972027",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4gzujj",
            "score": 1,
            "text": "So...what you saying with that title is that as more gender equal laws are created, men increasingly believe that 'There is No God'??!!",
            "title_similarity": "0.6951035",
            "sentiment_compound": 0.2801
        },
        {
            "id": "i4h02qy",
            "score": 1,
            "text": "Couldn’t that also be interpreted as the less religion the more gender equality?\n\nLike...I think the “less religious “ bit comes first rather than the other way around",
            "title_similarity": "0.77925324",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4h0mfj",
            "score": 2,
            "text": "Surely it's 'More men believe in gender equality in less-religious countries.'",
            "title_similarity": "0.863945",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4h103d",
            "score": 2,
            "text": "Coincidence? I think NOT!",
            "title_similarity": "0.31191468",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4h10sp",
            "score": 1,
            "text": "Maybe both are a result of having better access to internet? And not related.",
            "title_similarity": "0.5668532",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4h1f71",
            "score": 1,
            "text": "Not really a surprise",
            "title_similarity": "0.3053306",
            "sentiment_compound": -0.2547
        },
        {
            "id": "i4h1u3m",
            "score": 1,
            "text": "Or do countries with less religious people have more gender equality?",
            "title_similarity": "0.8341377",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4h2r5h",
            "score": 2,
            "text": "Religion is fading as spiritualism is growing",
            "title_similarity": "0.5079705",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i4h3vpl",
            "score": 2,
            "text": "Title should be \"there is more gender equality in countries where the men are less religious \".",
            "title_similarity": "0.86538815",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4h52lb",
            "score": 1,
            "text": "I know it's a correlation, but I suspect the headline should be the **other way around**. There's more equality between genders where religion is less practiced by men.",
            "title_similarity": "0.83408344",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i4h55gx",
            "score": 1,
            "text": "What are the odds that places with greater gender equality are less likely to promote/enforce religious doctrine?",
            "title_similarity": "0.7895353",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4h5bkb",
            "score": 1,
            "text": "I think these two things are reversed...",
            "title_similarity": "0.3293134",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4h5tpp",
            "score": 1,
            "text": "In those same countries they replace religion with something else.",
            "title_similarity": "0.5413441",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4h5u8v",
            "score": 1,
            "text": "Isn’t this common sense?",
            "title_similarity": "0.24129656",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4h5u8z",
            "score": 1,
            "text": "Gotta be because religion is/reinforces dominator culture.",
            "title_similarity": "0.37405053",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4h5wsm",
            "score": 2,
            "text": "Is the other way around. The less religious a country is, the better it is in general.",
            "title_similarity": "0.73308074",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i4h6ufe",
            "score": 1,
            "text": "Do we need studies to demonstrate the obvious?",
            "title_similarity": "0.23266245",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4h6v0u",
            "score": 1,
            "text": "This is the second best reason I have heard for gender equality.",
            "title_similarity": "0.50987804",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i4h74x8",
            "score": 1,
            "text": "My faith has never made me believe I’m better than anyone else, faith or not. Regardless of gender, ethnicity, skin color, or beliefs. It doesn’t make me more, and it doesn’t make anyone else somehow less.\n\nFaith is the literal acknowledgment that I’m far from perfect, and have a need for something better than humanity.\n\nEDIT: confusing grammar, fixed",
            "title_similarity": "0.5109316",
            "sentiment_compound": 0.9404
        },
        {
            "id": "i4h7or8",
            "score": 1,
            "text": "This doesn’t necessarily mean the two are connected directly. It could mean both are caused by a common factor",
            "title_similarity": "0.48006186",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4h8am3",
            "score": 3,
            "text": "don’t think it should come as much of a shock that religion correlates to sexism",
            "title_similarity": "0.6253921",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i4h8ipx",
            "score": 2,
            "text": "Causation is not causality. \nPerhaps. \nThe more non-religious countries has more gender equlity as an outcome of a non-religious society, but the non-religious society is a symptom of a generel loosening of traditional normative roles, enforced through challenging gender roles, as they did in my country (Denmark) in the sixties with \"the red socks\" movement. The first country to give women their voting rights in the early 1900' hundreds and the first country to legalize porn. \n\nThere is no telling if it's one way or another. But a strongly religious society is a symptom of a highly tradition society, therefore a society that values older social norms quite high. \nReligion might have nothing to do with it at all. \n\n(coming from one of the most non-religious societies in the world, Denmark)",
            "title_similarity": "0.637349",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i4h9tv6",
            "score": 1,
            "text": "Or is it really gender equality and nonreligious people naturally go together?\n\nSometimes research is just a waste of time.",
            "title_similarity": "0.73654425",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i4h9ulh",
            "score": 1,
            "text": "There’s a direct correlation between religion (at least monotheistic religions) and gender inequality and oppression.",
            "title_similarity": "0.48225242",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4habl8",
            "score": 2,
            "text": "No real surprise there honestly. Most religions on Earth have a long and storied history of discrimination.",
            "title_similarity": "0.26491886",
            "sentiment_compound": -0.0036
        },
        {
            "id": "i4hbg2x",
            "score": 1,
            "text": "How about more gender equality in countries where men are less religious.",
            "title_similarity": "0.92482245",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hbly2",
            "score": 1,
            "text": "Pretty sure it's the other way around. Religion is what causes a decrease in gender equality.",
            "title_similarity": "0.6882005",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i4hdbp7",
            "score": 1,
            "text": "From what I’ve gathered in the time that I’ve had on this planet, I can see very clearly that most organized religion is a detriment to society as a whole. People are slowly realizing this subconsciously I think, and are losing their minds trying to maintain “belief/faith.”",
            "title_similarity": "0.49878347",
            "sentiment_compound": 0.101
        },
        {
            "id": "i4hdr4m",
            "score": 1,
            "text": "Or in countries without equality, men are more religious.",
            "title_similarity": "0.6922602",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hds17",
            "score": 1,
            "text": "Might read bette if it said something like, more secular countries have more gender equality.",
            "title_similarity": "0.62919015",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4hdwmp",
            "score": 2,
            "text": "I mean.. Are women not also?\n\nI would think the obvious trend is: the more religious a country is the more gender inequality there will be.",
            "title_similarity": "0.61882186",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4heton",
            "score": 1,
            "text": "Do you really need a PHD to figure this out?",
            "title_similarity": "0.31142196",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hf2wv",
            "score": 1,
            "text": "That's if the religion is patriarchal and preaches feminine subservience to masculine. I'm really curious what this \"study\" is supposed to accomplish beyond spooking conservatives with gender equality.",
            "title_similarity": "0.55895597",
            "sentiment_compound": 0.659
        },
        {
            "id": "i4hggoy",
            "score": 1,
            "text": "Can speak for this. I'm Norwegian dude and Norway is very secular (most people only ever go to church for funerals and weddings) Gender equality is high here and my impression most younger men view women as equal. \n\nThere always outliers of course.",
            "title_similarity": "0.4754488",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i4hicrz",
            "score": 1,
            "text": "What about gender equality makes men want to throw away the shackles of religion, I wonder",
            "title_similarity": "0.6223972",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i4hiumq",
            "score": 1,
            "text": "Or is there just more gender equality in countries where men are less religous",
            "title_similarity": "0.906092",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hiwjg",
            "score": 1,
            "text": "As soon as I read the title, my first thought was, \"They've got this backwards\".",
            "title_similarity": "0.22819686",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hkxdl",
            "score": 1,
            "text": "Other way around. Less religion equals more gender equality.",
            "title_similarity": "0.80708146",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hl009",
            "score": 1,
            "text": "(incoming atheists doing the same thing as religious extremists by acting superior for their views)",
            "title_similarity": "0.3660379",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i4hliyk",
            "score": 1,
            "text": "Who needs a god when you have a wife?!?  God I hope my wife sees this…",
            "title_similarity": "0.32366014",
            "sentiment_compound": 0.7752
        },
        {
            "id": "i4hlm14",
            "score": 1,
            "text": "You mean gender equality is more prevalent in less religious societies?",
            "title_similarity": "0.8508254",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hmj5f",
            "score": 1,
            "text": "In countries with more gender equality, men are less religious. One of the main preaching points in the churches where I live (mostly Baptist) is that women are to be submissive to men. Attend one for a month, and you’ll hear that topic at least once.",
            "title_similarity": "0.62794536",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i4hnmzc",
            "score": 1,
            "text": "What a backwards way to put it. I think you mean that there’s more equality when religious presence is lower.",
            "title_similarity": "0.7472986",
            "sentiment_compound": -0.296
        },
        {
            "id": "i4hofvg",
            "score": 1,
            "text": "Immediately thinking of the Middle East XD",
            "title_similarity": "0.104453355",
            "sentiment_compound": 0.6739
        },
        {
            "id": "i4hp2xt",
            "score": 1,
            "text": "The correct title is “there is more gender equality in countries where men are less religious”",
            "title_similarity": "0.8932545",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hp30i",
            "score": 1,
            "text": "the title should be \"there is more gender equality where men are less religious\"",
            "title_similarity": "0.8607921",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hpfpm",
            "score": 1,
            "text": "Let me fix that. There's more gender equality where men are less religious\\*",
            "title_similarity": "0.9098195",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hprdp",
            "score": 1,
            "text": "Western Europe, don't know a single men nor women under 40 that is religious. Feels great.",
            "title_similarity": "0.4277087",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i4hq24h",
            "score": 1,
            "text": "Wow, the Christians were right, these devil worshipping hussies really will turn us all into godless heathens.",
            "title_similarity": "0.32005447",
            "sentiment_compound": 0.25
        },
        {
            "id": "i4hrdv9",
            "score": 1,
            "text": "Us kind of countries have more us kind of values, big surprise right there.\n\nThe west european minded is worshiping atheism, gender equality, science and technology.\n\nDoes he live better? According to his criteria of course. But that means nothing, because for example a Indian Sadhu has a entirely different set of values - like pulling a car with testicles > health and long life.\n\nHe is probably also more spiritual and less interested in equality if this example Sadhu makes a study he will probably discover that the country with the biggest tolerance for naked monks will also have the biggest Holi festivals. And that's surprisingly a positive outcome and a show of superior values.",
            "title_similarity": "0.5937171",
            "sentiment_compound": 0.9888
        },
        {
            "id": "i4hs1gw",
            "score": 1,
            "text": "I always ask with respect if someone believes living for eternity in the afterlife would be torture or not.",
            "title_similarity": "0.26250502",
            "sentiment_compound": -0.2023
        },
        {
            "id": "i4hst9v",
            "score": 1,
            "text": "Makes sense to me. Religion is a means to control the people, specifically those who are not in power. For millennia, women had absolutely no power, and men used religion to reinforce that.",
            "title_similarity": "0.52537763",
            "sentiment_compound": -0.3597
        },
        {
            "id": "i4hsug0",
            "score": 1,
            "text": "If your God says you are allowed to be a jerk to women, guess where that’s gonna have greater appeal :)",
            "title_similarity": "0.6144512",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i4htpo4",
            "score": 1,
            "text": "Ahh that explains all the frantic attempts to bring religion back into law.",
            "title_similarity": "0.17760575",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i4htq1h",
            "score": 1,
            "text": "More like there is more gender equality where men are less religious",
            "title_similarity": "0.92128",
            "sentiment_compound": 0.4201
        },
        {
            "id": "i4huiaz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.24890344"
        },
        {
            "id": "i4huo6j",
            "score": 1,
            "text": "Less religious dudes, more incels. Probably. It’s because small weak minded men who can’t use religion to control women blame society and become whining “woe is me” individuals.",
            "title_similarity": "0.65162015",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i4huz5r",
            "score": 1,
            "text": "I think maybe you mean, “Less religious countries have more gender equality.”",
            "title_similarity": "0.7980549",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4huzpj",
            "score": 1,
            "text": "Given the inherent sexism baked into most organized religion, this should not be surprising.",
            "title_similarity": "0.52665764",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i4hv2sn",
            "score": 2,
            "text": "So like... What about China? An almost fully atheist country, largest population in the world, and definitely not a gender equal society.",
            "title_similarity": "0.40341195",
            "sentiment_compound": 0.6697
        },
        {
            "id": "i4hv6pe",
            "score": 1,
            "text": "And vice-versa. The causality arrow, if there is one, could point either way.",
            "title_similarity": "0.2807043",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hxebu",
            "score": 1,
            "text": "What a long-winded way to say that religion is oppressive to women.",
            "title_similarity": "0.3933658",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i4hxw71",
            "score": 1,
            "text": "…and other obvious statements",
            "title_similarity": "0.1738689",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hy66l",
            "score": 2,
            "text": "Religion tends to oppress women so with out it gender equality can flourish",
            "title_similarity": "0.58250284",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4hy6cu",
            "score": 1,
            "text": "Should state: religious countries have less gender equality.",
            "title_similarity": "0.7097996",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4i0ebs",
            "score": 2,
            "text": "I think everyone is less religious in countries with more gender equality.",
            "title_similarity": "0.8539845",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4i0gh2",
            "score": 2,
            "text": "Agree, I'm agnostic and firmly believe in equal rights at all levels among the genders.",
            "title_similarity": "0.33049238",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i4i0h0f",
            "score": 1,
            "text": "Feels more like the inverse to me. There is more gender equality where there is less religion.",
            "title_similarity": "0.8416123",
            "sentiment_compound": 0.4201
        },
        {
            "id": "i4i106k",
            "score": 1,
            "text": "In countries with more gender equality, men are less religious.\n*fixed",
            "title_similarity": "0.9663379",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4i2eom",
            "score": 1,
            "text": "Religion and institutionalized gender inequity where “invented” by the same scared men. Wild we cling to these anachronistic things but left charriote races behind",
            "title_similarity": "0.5246736",
            "sentiment_compound": -0.2382
        },
        {
            "id": "i4i3it0",
            "score": 1,
            "text": "Just read that title backwards. More Gender Equality in countries with less religious men.",
            "title_similarity": "0.8855767",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4i3ky8",
            "score": 1,
            "text": "It’s probably that there is more gender equality because people as a whole in those countries are less religious.",
            "title_similarity": "0.8813998",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4i3nta",
            "score": 1,
            "text": "There is no proof of God there is no proof of Santa Claus beneficial side effect of God he has more power than Santa Claus",
            "title_similarity": "0.41973287",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i4i3y7a",
            "score": 1,
            "text": "Religion is often used as a tool to control women so that’s not a surprise.",
            "title_similarity": "0.3801508",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i4i4psa",
            "score": 1,
            "text": "I always believe that organized religion was another means of control and oppression - I am not saying their is no god or great creator but I don’t need to keep someone down, congregate with a bunch of people in a church or dish out a lot of money to minister to have a conversation with god - to bathe in his glory - and marvel at his creations",
            "title_similarity": "0.4022786",
            "sentiment_compound": 0.9177
        },
        {
            "id": "i4i50c4",
            "score": 1,
            "text": "Definitely an expected result when a significant amount of religions preach that women and children are property",
            "title_similarity": "0.30382362",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i4i57h5",
            "score": 2,
            "text": "I always wonder why people are concerned about religious people in the name of science?  \n\nObjective of religion is to answer the question what will happen after we die. \n\nObjective of science is to answer why and how something happen or what it is made of, purely a quest for a mechanistic explanation of the material things. \n\nThese two don't overlap. I have observed that people who mix these two are confused about the objectives of the two.",
            "title_similarity": "0.43596557",
            "sentiment_compound": -0.7351
        },
        {
            "id": "i4i58as",
            "score": 1,
            "text": "Or maybe its the other way around...\n\nCountries with less religious men have more gender equality",
            "title_similarity": "0.9198631",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4i6foh",
            "score": 1,
            "text": "Interesting idea. Sounds like an absolute nightmare research/study wise.",
            "title_similarity": "0.27009845",
            "sentiment_compound": 0.8074
        },
        {
            "id": "i4i6jgu",
            "score": 2,
            "text": "Likely correlation.  I don't see how the two are ALWAYS connected.  Yes, a lot of religious countries treat women like second class citizens.",
            "title_similarity": "0.6007732",
            "sentiment_compound": 0.7845
        },
        {
            "id": "i4i6wc2",
            "score": 1,
            "text": ">Men are less religious in countries with more gender equality, shows study\n\nOr, in countries where there is less religion, people treat each other with more equality?",
            "title_similarity": "0.96767056",
            "sentiment_compound": 0.3477
        },
        {
            "id": "i4i7254",
            "score": 1,
            "text": "Women have more equality in countries where people are less religious*",
            "title_similarity": "0.808069",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4i8kgu",
            "score": 1,
            "text": "It’s actually makes sense if you think about it. Religion was originally created by man to control a populist that was intentionally under educated keeping a small group in power. When education level rises you start to see science rule where religion used to thinks make a lot more sense backed with evidence rather than faith.",
            "title_similarity": "0.5819403",
            "sentiment_compound": 0.6344
        },
        {
            "id": "i4i8kst",
            "score": 1,
            "text": "As many others have pointed out, univariate associate observational studies such as this are very flawed, and one cannot infer causation at all. For those interested, there is actually quite a decent body of research suggesting that intrinsic religiosity entails multitudinous pro-social benefits.",
            "title_similarity": "0.5514517",
            "sentiment_compound": 0.228
        },
        {
            "id": "i4ib986",
            "score": 1,
            "text": "There are a lot of pigeons where there are tourists.",
            "title_similarity": "0.22779793",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ibh8m",
            "score": 1,
            "text": "You could almost say, less religious men display more gender equality.",
            "title_similarity": "0.9174584",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4icke6",
            "score": 2,
            "text": "Countries with higher educated populace have less religious populations. This is known. Countries with higher education also have more gender equality. Education is more likely the causal factor of the correlation.",
            "title_similarity": "0.8086772",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4icw22",
            "score": 1,
            "text": "I don’t think one caused the other. Life is just better in non religion countries for innumerable reasons. Science, empathy, equality, freedom, prosperity, the list is pretty much never ending",
            "title_similarity": "0.5723417",
            "sentiment_compound": 0.8834
        },
        {
            "id": "i4ievb3",
            "score": 1,
            "text": "Who knew that guys who were less misogynistic where also less religious?",
            "title_similarity": "0.79897094",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ifkfw",
            "score": 2,
            "text": "Completely unsurprising, especially considering most religions are very patriarchal. It also is also completely unsurprising the right-wings of their countries tend to be the most religious.",
            "title_similarity": "0.47566295",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4igp2f",
            "score": 1,
            "text": "Not a great side of this stat to be on, if you happen to be religion.",
            "title_similarity": "0.50059044",
            "sentiment_compound": -0.5096
        },
        {
            "id": "i4ihkgm",
            "score": 1,
            "text": "Or is it: less religious countries have higher gender equality?",
            "title_similarity": "0.81013966",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ihqx4",
            "score": 1,
            "text": "The more religious the more knuckle dragging going on folks.",
            "title_similarity": "0.46376866",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ilnfj",
            "score": 2,
            "text": "This title has things backwards, it’s the saturation of religion in cultures and statehood which keeps certain corners of society stuck in the past… states which have better gender equality have a less religious public, because there is no given religion tying people down to teachings best kept in old books…",
            "title_similarity": "0.70001113",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i4ilz17",
            "score": 2,
            "text": "These titles with correlation suggesting causation are part of the everything problem.",
            "title_similarity": "0.21101044",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i4ioa89",
            "score": 2,
            "text": "If you consider that western countries tend to be more gender equal, and that western countries also tend to be more atheist, it isn’t really surprising that this would correlate. Gender attitudes are absorbed from your surrounding culture, so I am inclined to think that religious men in western countries would also support more gender equality than religious men in non-western countries. Would definitely be interesting to test for.",
            "title_similarity": "0.73142475",
            "sentiment_compound": 0.8588
        },
        {
            "id": "i4iovok",
            "score": 1,
            "text": "How about there’s more gender equality when men are less religious?",
            "title_similarity": "0.897274",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4iowlj",
            "score": 1,
            "text": "Religion exists in part because a large part of humanity has a visceral need to believe in something or someone that promises or shows them a path to bliss, eternal salvation, or even unimaginable carnal delights. \n\nOn the other hand, logic and rational thought promise no joy and suffer no hope. It takes a rare mind to accept the lure of logic’s flaccid allure.",
            "title_similarity": "0.45219585",
            "sentiment_compound": 0.8137
        },
        {
            "id": "i4ioysv",
            "score": 3,
            "text": "Man can’t wait to see my religion ridiculed in the comments because of this post",
            "title_similarity": "0.33925766",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i4ipzsr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.24890344"
        },
        {
            "id": "i4itxqp",
            "score": 1,
            "text": "So its killing god ironically enough",
            "title_similarity": "0.36545652",
            "sentiment_compound": -0.513
        },
        {
            "id": "i4iu65s",
            "score": 1,
            "text": "Hmm I wonder if those institutions play a role in perpetuating a gender hierarchy",
            "title_similarity": "0.45420432",
            "sentiment_compound": 0.34
        },
        {
            "id": "i4iyn54",
            "score": 1,
            "text": "That has nothing to do with gender equality but a higher education level. It's more the other way around. There is more equality with less religious people",
            "title_similarity": "0.73956007",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4iyx5b",
            "score": 2,
            "text": "That makes sense.  Striving for gender equality is a rational thing to do.",
            "title_similarity": "0.4296545",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4j23ku",
            "score": 1,
            "text": "Isn't it that gender equality is more common when you have less religious men trying to stop it?",
            "title_similarity": "0.87002075",
            "sentiment_compound": -0.296
        },
        {
            "id": "i4j44sx",
            "score": 1,
            "text": "No, they do not claim causation.\nBut to me it makes sense, because very religious communities tend to be more conservative and as we know there is always a bellcurve of people, so these communities have more ‚hardcore‘ conservatives and they usually still hold pretty old believes about gender and the vastly different roles they have to have.",
            "title_similarity": "0.6065252",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i4j7pt3",
            "score": 2,
            "text": "Most religions try to control people. If there is gender inequality within the religion, half of the population is already easier to control",
            "title_similarity": "0.636001",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i4jdnsx",
            "score": 1,
            "text": "I'm always skeptical of papers that make sweeping statements like this for the following reason\n\nhttps://en.m.wikipedia.org/wiki/Replication_crisis",
            "title_similarity": "0.2984401",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i4jebkv",
            "score": 1,
            "text": "The 2 clauses of this sentence are more insightful when read in reverse order.",
            "title_similarity": "0.51722497",
            "sentiment_compound": 0.0964
        },
        {
            "id": "i4jf81x",
            "score": 1,
            "text": "It’s supposed to be: “There’s more gender equality in countries where people are less religious”",
            "title_similarity": "0.84346926",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4jg647",
            "score": 1,
            "text": "Always remember,\n\nChristianity hegemony Theocracies = Islam hegemony Theocracies.\n\nSay NO to THEOCRACIES & MONARCHIES for the betterment of humanity.",
            "title_similarity": "0.36905617",
            "sentiment_compound": -0.4466
        },
        {
            "id": "i4js01n",
            "score": 2,
            "text": "Aren't more progressive people less religious and vice versa? Religion is in my view conservative per definition. So it makes sense that this is the case. I don't think that more equality makes people less religious. Less religious makes you more progressive and thus there's more equality.",
            "title_similarity": "0.7354293",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4js75s",
            "score": 1,
            "text": "Almost all religion serves, at least in part, to regulate the reproductive value of women. “That religion is used to oppress women is more of a fact than a mere theory.” \n\nWe in anthropology have long understood this to be fact and regularly examine the mundane and functional aspects of religion in society. Controlling women is the key to controlling a group as men have very little reproductive value and are basically disposable. \n\nThe example I give to my intro class: if all the men but one in this class die in a battle our group might still survive. If the reverse were true, we would go extinct in a single generation.",
            "title_similarity": "0.54641354",
            "sentiment_compound": -0.5658
        },
        {
            "id": "i4jsf9h",
            "score": 1,
            "text": "I believe some people try too hard to be THEIR flawed idea of God when in reality. We shouldn’t put too much thought into besides how our actions may affect others",
            "title_similarity": "0.5202937",
            "sentiment_compound": -0.34
        },
        {
            "id": "i4ju8bj",
            "score": 1,
            "text": "And another groundbreaking study shows that men are less religious in countries with more gay rights.",
            "title_similarity": "0.87392044",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4jv3vt",
            "score": 1,
            "text": "I think you got the cause and effect backwards.",
            "title_similarity": "0.36121553",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4jvy6k",
            "score": 1,
            "text": "Isn’t that sort of generalized? Pretty sure that everyone’s less religious in more developed countries. Something about science and technology dethroning a big bearded man?",
            "title_similarity": "0.6499858",
            "sentiment_compound": 0.6775
        },
        {
            "id": "i4jyu06",
            "score": 1,
            "text": "Or, absence of religion increases gender equality…",
            "title_similarity": "0.6448183",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4k21ee",
            "score": 1,
            "text": "Ofc  coz name me one religion that allows women to enjoy the same as men.",
            "title_similarity": "0.56231254",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i4k2zrn",
            "score": 1,
            "text": "I would think women are too…",
            "title_similarity": "0.25456575",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4ku7b9",
            "score": 1,
            "text": "After studying the subject of professional ethics. I came to know that religion is a framework to teach morality (even though having achieved morality is not equal to following a religion). Thus in less progressive countries if someone wants to achieve morality they tend to choose religion as their means. Even though the downsides are the restrictions of the framework. \n\nI am myself from a less “progressive” country. And when i attained the sense of morality by learning and figuring things out by myself i am no longer believing in the concept of religion. I do believe there is a higher deity that exists due to events that happened in my life. Thus putting me into an agnostic.\n\nThis whole thing is happening visibly in younger generations in my country.",
            "title_similarity": "0.591272",
            "sentiment_compound": -0.296
        },
        {
            "id": "i4lkobg",
            "score": 1,
            "text": "This title implies that gender equality is having a negative impact on religion.\n\nI’d say the reality is basically the inverse of that, meaning that religion holds us back as a society and that countries that are less religious allow more progression and that a single specific example of this would be gender equality.",
            "title_similarity": "0.69447863",
            "sentiment_compound": -0.4728
        },
        {
            "id": "i4lzjf8",
            "score": 1,
            "text": "It’s more likely that countries with better gender equality are more developed and with a higher HDI. Which means the education is better and statistically people with a higher education are less religious",
            "title_similarity": "0.7799549",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i4mjgho",
            "score": 1,
            "text": "So, China and counties like Uruguay are exceptions?",
            "title_similarity": "0.33873925",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i5lt4e9",
            "score": 1,
            "text": "Someone discovered America...",
            "title_similarity": "0.17414036",
            "sentiment_compound": 0.0
        }
    ]
}