{
    "Girls raised by Jewish parents are 23 percentage points more likely to graduate from college than those with a non-Jewish upbringing, even after accounting for their parents’ socioeconomic status, research finds. They tend to \"articulate a self-concept marked by ambitious career goals.\"\n": [
        {
            "id": "i5kawp1",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue to be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.4081607",
            "sentiment_compound": 0.7088
        },
        {
            "id": "i5kjju8",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "-0.034596086"
        },
        {
            "id": "i5kmvf9",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5klkgo",
            "score": -32,
            "text": "[deleted]",
            "title_similarity": "-0.034596086"
        },
        {
            "id": "i5kxe5h",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kneq4",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.034596086"
        },
        {
            "id": "i5kmoud",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5knf23",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kmlzm",
            "score": 4,
            "text": "Its kind of dangerous territory getting into cultural comparisons as it dances awfully close to race.  Even though the two are inextricably linked in a decent majority of cases.\n\nI imagine a study comparing african american lower rates of the same when controlling for socio economic status might be met with some resistance.\n\nBut I think its important to talk about cultural differences.  Obviously there are historical ibequities and epigenetic factors at play (some pretty major, higher exposure to childhood trauma etc) which are disproportionately weighted by ‘race’.  But a culture closely associated with a race of people (VERY closely linked for Jewish folk) is a very reasonable thing to discuss in comparing race based outcomes.\n\nCertain cultures are simply not setup to thrive and get ahead in a western individualist society.  And its very hard to break down those racial differences in outcome without destroying or assumilating that associated culture.\n\nFindinga like this do make you ask importabt questions about how far we can push racial equality of outcome as a concept before it becomes culturally dangerous.",
            "title_similarity": "0.56400925",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i5ktjpn",
            "score": -21,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kmqah",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kv0zx",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kgiof",
            "score": -23,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kmnp7",
            "score": -35,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5l1f0f",
            "score": 6,
            "text": "A study about Jewish women conducted mostly by Jews in the field of Jewish studies? Surely this can't pass for science. They say it's not due to culture but rather common practices adopted by the Jewish people i.e culture?",
            "title_similarity": "0.6544786",
            "sentiment_compound": 0.3204
        },
        {
            "id": "i5kkyle",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5l2f25",
            "score": -2,
            "text": "Where? In Israel? I was going to complain about the title, but the whole article is stupid like that. If not said, one can only assume worldwide population.",
            "title_similarity": "0.44521993",
            "sentiment_compound": -0.5362
        },
        {
            "id": "i5loc2v",
            "score": 0,
            "text": "Imagine going to school. Becoming a post grad. Getting funding for you research. And you spend that time and money proving a racist stereotype that 6 million people suffer for 100 years ago.",
            "title_similarity": "0.62738025",
            "sentiment_compound": -0.8689
        },
        {
            "id": "i5ktuth",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kvstq",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kl3l8",
            "score": 8,
            "text": "What’s the point Of this study? Everyone knows this. Most non western cultures put a lot of emphasis on higher education in top field like medical and law. It’s not even a stereotype.",
            "title_similarity": "0.44887152",
            "sentiment_compound": 0.6442
        },
        {
            "id": "i5kqqdq",
            "score": 1,
            "text": "Some cultures see higher education as an absolute. I was raised with it from an early age. My entire family went to college. All of us are middle class, but it was never an option of what we were going to do. My kids are young and already talk about where they want to go, not if they are going. \n\nWe are Jewish, so I suppose we fit the demo.",
            "title_similarity": "0.6537324",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5kmghc",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kg5ce",
            "score": 5,
            "text": "My parents placed no emphasis on higher education whatsoever. Fortunately I learned a skill that’s earned me a very good living.",
            "title_similarity": "0.45235306",
            "sentiment_compound": 0.2484
        },
        {
            "id": "i5kfzok",
            "score": -25,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kgvg5",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5ki819",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "-0.034596086"
        },
        {
            "id": "i5knm3i",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kx3b6",
            "score": 4,
            "text": "Who would believe a culture that values education would produce educated children? \n\nNow how much is education valued by conservative America?",
            "title_similarity": "0.60402864",
            "sentiment_compound": 0.7149
        },
        {
            "id": "i5kmj4f",
            "score": 97,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kwvp7",
            "score": 10,
            "text": "It's culture, not genetics. Look at Asian culture in the U.S., same thing. When you grow up in a family that values education it stacks the odds in your favor.\n\nIdiots will say its race based privilege when they don't understand this. This in itself is a form of bigotry.",
            "title_similarity": "0.5937225",
            "sentiment_compound": 0.7845
        },
        {
            "id": "i5kmy1g",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kju6o",
            "score": 55,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5klqyp",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kxulk",
            "score": -6,
            "text": "And institutionalized self shame and trauma that no one In the family talks about until parents die",
            "title_similarity": "0.3555182",
            "sentiment_compound": -0.9001
        },
        {
            "id": "i5kjf05",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5lyijv",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5mo8vh",
            "score": 0,
            "text": "Yes yes “Jewish guilt” is real. \n\nHow do I know? I am but a humble gentle living with one.",
            "title_similarity": "0.4115698",
            "sentiment_compound": 0.7615
        },
        {
            "id": "i5oqa8h",
            "score": 0,
            "text": "Wait, how many of them were actually jewish, born to jewish parents, and how many were adopted?  \nIs the data only from the US, or other countries too?  \nI guess this will not make me many friends, and maybe get this post deleted, but i dont think this has that much to do with upbringing, and more to do with genetics. The Ashkenazi have a couple IQ points more than white Europeans(like Asians), and both have vastly more than certain other groups, so the differnce in Europe may not be that high, but in the US it will be very distinct if compared with the general population.",
            "title_similarity": "0.73598754",
            "sentiment_compound": 0.6681
        },
        {
            "id": "i5kio5g",
            "score": 47,
            "text": "As far as I see there is no evidence here that “debunks” genetic factors as a contributing factor. Social scientists always be making vague and unsubstantiated claims.",
            "title_similarity": "0.3188773",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i5kjv5y",
            "score": 34,
            "text": "Spicy.  As it turns out, cultural values that are inculcated and preserved among some demographics do ~~result~~ correlate in changes in one's overall life achievements.  Both positive, as observed here, but also negative, something that is very much taboo and maligned to recognize.\n\nEdit: made a correlation/causation fallacy when the data does not (and cannot) demonstrate that, so I've corrected myself.",
            "title_similarity": "0.4439811",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i5khfgc",
            "score": 43,
            "text": "I mean, I know a lot of Jewish women and they are all ambitious and successful. Honestly all pretty happy too. Anecdotal obviously, but my 10 or so Jewish women friends are definitely a successful bunch.",
            "title_similarity": "0.5891335",
            "sentiment_compound": 0.9726
        },
        {
            "id": "i5kgvsc",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "-0.034596086"
        },
        {
            "id": "i5kmrup",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kfsb2",
            "score": 78,
            "text": "So I’ve been reading a book about why Jews are targeted so much by groups for discrimination. One of the reasons is that they highly value educating everyone. This doesn’t surprise me that Jewish people in general are more likely to get an education",
            "title_similarity": "0.5982808",
            "sentiment_compound": 0.5849
        },
        {
            "id": "i5knjxt",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5ml1jh",
            "score": 2,
            "text": "This is true for ashkenazi Jews and less so for Sephardic Jews likely because the genetic components of intelligence likely play a role. I think there was some study done years ago which showed Ashkenazi Jews had the highest IQ of any population segment at more than one standard deviation above the average  (won’t cite due to laziness). So IQ is likely a factor in educational achievement..",
            "title_similarity": "0.78175235",
            "sentiment_compound": 0.8074
        },
        {
            "id": "i5kijl7",
            "score": 22,
            "text": "I think it's because of the long history Jews have in studying (Talmud etc.)",
            "title_similarity": "0.4869582",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ktpjm",
            "score": -20,
            "text": "This is dangerously racist territory, you could say the same of negative statistics and say a race of people is \"more likely\" to do something based on \"culture\". This kind of stuff never ends well, even if you're trying to point out something positive. It opens doorways few people dare walk through.",
            "title_similarity": "0.48677504",
            "sentiment_compound": -0.8366
        },
        {
            "id": "i5lo67z",
            "score": -9,
            "text": "And 100% of college kids realised they wasted years of thier life and lots of money and have to repay 3x the amount in loans back 2 weeks after they graduate. And continue to keep working at Panera bread or Starbucks or the local strip club.",
            "title_similarity": "0.63861036",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i5kpguu",
            "score": 18,
            "text": "Um, it says even when controlling for socio-economic status. But did this study not control for heritability?\n\nIt's not clear from the article or the heading but these seem to be biological children of at least one Jewish parent. \nSo how does this prove its cultural and not genetics?\nAnd if so, isn't it a biased framing to say \"raised by Jewish parents\" instead of \"born to Jewish parents\".\n\nLike if there's a control group with adoptees then indeed that implies culture but I didn't see anything hinting towards that.",
            "title_similarity": "0.5850005",
            "sentiment_compound": 0.4687
        },
        {
            "id": "i5kunbt",
            "score": 15,
            "text": "Science is most fun when it confirms all the stereotypes.",
            "title_similarity": "0.4073444",
            "sentiment_compound": 0.5563
        },
        {
            "id": "i5kyc5w",
            "score": -9,
            "text": "As time goes on, I've started to read \"graduated from college\" as \"paid a lot of money for a degree I can't use.\"",
            "title_similarity": "0.58404195",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5lj3gj",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5l1crl",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kyf6i",
            "score": 11,
            "text": "we can share race statistics, only when its positive",
            "title_similarity": "0.43649745",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i5l6guh",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kuerf",
            "score": 2,
            "text": "It's all about culture",
            "title_similarity": "0.13462736",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5l34te",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kxgaq",
            "score": 68,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kk1yr",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kl8u5",
            "score": -17,
            "text": "Girls raised by Jewish parents or Jewish girls? Genetics matter.",
            "title_similarity": "0.6691192",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i5kvf7a",
            "score": 2,
            "text": "I can gaurentee that this will be the case with almost any conservative household that follows any religion, but has a family that cares about thier childs education and grades. But for sure there will be the presence of coersion by the parents for thier child to pick subjects they(the parents) choose.",
            "title_similarity": "0.589103",
            "sentiment_compound": 0.7876
        },
        {
            "id": "i5kuwij",
            "score": 13,
            "text": "Man this kinda thing could fall down a rabbit hole super quick if you start swapping around other ethnicities, religions, and other traits, but absolutely no one wants to have that conversation.",
            "title_similarity": "0.28660247",
            "sentiment_compound": -0.1997
        },
        {
            "id": "i5kdfz9",
            "score": 37,
            "text": "Curious how do they compare to Asian kids?",
            "title_similarity": "0.38493678",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i5ky4bn",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.034596086"
        },
        {
            "id": "i5l01q9",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5l1b36",
            "score": 0,
            "text": ">Culture plays a large role in educational and socioeconomic success.\n\nIs the inverse true? That's a rhetorical question, btw.",
            "title_similarity": "0.5257234",
            "sentiment_compound": 0.8176
        },
        {
            "id": "i5l7bmn",
            "score": 4,
            "text": "How exactly did they establish causation? Did they take twins, and have one raised by a non jewish family, and another by a jewish one? \n\nDo that experiment, and compare life outcome, and if it closer relates to biological parents or adoptive parents, and we talk again.",
            "title_similarity": "0.6090152",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5lgnkr",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5lqfmq",
            "score": 3,
            "text": "I am Jewish. It’s not because it worked out for our ancestors. In fact, the success of our ancestors is exactly why they were hated so much. \n\nIt comes down to yenta culture in the Jewish community. You will be shamed if you don’t have a white collar job. If you’re a Jewish guy, you will have a really difficult time finding a Jewish wife without a degree. College educated woman won’t even look at you.",
            "title_similarity": "0.6444919",
            "sentiment_compound": -0.7841
        },
        {
            "id": "i5m8tpo",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5nauuj",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5o8dwe",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5qfvq8",
            "score": 0,
            "text": "So basically Jews are the most bothersome, punishing and authoritarian parents in the world. And for some reason this study focuses solely on girls.",
            "title_similarity": "0.5735317",
            "sentiment_compound": -0.7559
        },
        {
            "id": "i5ktee8",
            "score": 10,
            "text": "We are so programmed to be fearful about being attacked for being culturally offensive, it is sometimes difficult to acknowledge that cultures have predispositions.  Even a cursory look at cultural trends reveals it.",
            "title_similarity": "0.299036",
            "sentiment_compound": -0.8934
        },
        {
            "id": "i5kem9k",
            "score": 118,
            "text": "Let me preface this by saying this is an important study and exceptionally well done in linking datasets to mitigate attrition bias.\n\nI’m having a little bit of issues believing they have addressed causality given their estimation techniques and covariates used. SES is important for parents network effects, but it’s not a whole story (even in the Econ literature; there’s a good analysis of this in “Are Ghettos Good or Bad”). It misses some liquidity constraints, notably.\n\nAdditionally, there is still selection bias that they have not addressed (admittedly hugely hard) that is likely positive, suggesting the magnitude of their results is incorrect.",
            "title_similarity": "0.5046853",
            "sentiment_compound": 0.8981
        },
        {
            "id": "i5kn4tf",
            "score": 7,
            "text": "An emphasis on education does wonders for school performance.",
            "title_similarity": "0.43716973",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5l0179",
            "score": 5,
            "text": "They’re ambitious people, hence the hate they get. Instead of hating these people why not copy what has worked for them? It seems to be working pretty well.",
            "title_similarity": "0.47409832",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i5kejbb",
            "score": -18,
            "text": "[deleted]",
            "title_similarity": "-0.034596086"
        },
        {
            "id": "i5kq8mi",
            "score": 6,
            "text": "For my money the real take-home point here is that whatever one's background may be, the real determinant is parental involvement and the sense that a larger family-based community has a vested interest in seeing to the success of every child.  This is, I believe, why the South Asian community in the US is rapidly overtaking or at least equaling Jewish accomplishments in the elite professions.",
            "title_similarity": "0.7005937",
            "sentiment_compound": 0.8176
        },
        {
            "id": "i5kunpc",
            "score": 6,
            "text": "IMO having to learn Hebrew at such a young age and having strong religious practices help kids develop at a younger age. Meanwhile I was watching cartoon in the morning.",
            "title_similarity": "0.45118123",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i5kbopo",
            "score": 702,
            "text": "When young women are told repeatedly from birth that they are smart enough to do the work, they do the work. Quel surprise.",
            "title_similarity": "0.6039084",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i5km8bv",
            "score": 115,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kh8xc",
            "score": 72,
            "text": "Same can be said for those with an “East Asian upbringing”.",
            "title_similarity": "0.27043328",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5kqi2r",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kws1c",
            "score": -1,
            "text": "Is that considered positive racism? Stereotyping (athough) through a scientific study?",
            "title_similarity": "0.40124643",
            "sentiment_compound": -0.2168
        },
        {
            "id": "i5kybpc",
            "score": 1,
            "text": "Do we have any such data for the Indian American populace? They are the highest degree holders per Capita",
            "title_similarity": "0.6432344",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5kzacl",
            "score": 1,
            "text": "Typically speaking if you have more formally educated parents . You are also more likely to be  formally educated . So I’d like to see ; how many of their parents also have a formal education.",
            "title_similarity": "0.61458564",
            "sentiment_compound": 0.4173
        },
        {
            "id": "i5l0uqf",
            "score": 1,
            "text": "Study from the most Jewish large university in the country.  So they have a really large study population.",
            "title_similarity": "0.6424577",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5l10z4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5l1a2k",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5mdywy",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5mw3xp",
            "score": 1,
            "text": "Does this include the ultra Orthodox Jews who don’t believe women should have education and rights though? My guess is probably not",
            "title_similarity": "0.54955804",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5n1loq",
            "score": -1,
            "text": "All that college and they still can't count xd",
            "title_similarity": "0.29496068",
            "sentiment_compound": -0.4717
        },
        {
            "id": "i5n8yfr",
            "score": 1,
            "text": "One of the first things Jewish kids are taught is importance of studying the Old Testament (Torah).\n\nI think this bleeds into a lot of Jewish culture about the importance of studying in general.",
            "title_similarity": "0.5167626",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i5kmvb5",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5lqwmg",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5klihy",
            "score": 164,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5l4hdd",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kphw7",
            "score": 10,
            "text": "I mean, n=3 but this tracks for me and my sisters. Having a degree and being a professional was never not an option.",
            "title_similarity": "0.43551624",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ko1lj",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "-0.034596086"
        },
        {
            "id": "i5krbws",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5ktr8f",
            "score": 2,
            "text": "The abstract:\n\n>This study considers the role of religious habitus and self-concept in educational stratification. We follow 3,238 adolescents for 13 years by linking the National Study of Youth and Religion to the National Student Clearinghouse. Survey data reveal that girls with a Jewish upbringing have two distinct postsecondary patterns compared to girls with a non-Jewish upbringing, even after controlling for social origins: (1) they are 23 percentage points more likely to graduate college, and (2) they graduate from much more selective colleges. We then analyze 107 interviews with 33 girls from comparable social origins interviewed repeatedly between adolescence and emerging adulthood. **Girls raised by Jewish parents articulate a self-concept marked by ambitious career goals and an eagerness to have new experiences. For these girls, elite higher education and graduate school are central to attaining self-concept congruence. In contrast, girls raised by non-Jewish parents tend to prioritize motherhood and have humbler employment aims. For them, graduating from college, regardless of its prestige, is sufficient for self-concept congruence. We conclude that religious subculture is a key factor in educational stratification, and divergent paths to self-concept congruence can help explain why educational outcomes vary by religion in gendered ways.**\n\nAim of the study is to find whether Judaism pushes girls into higher educational achievement, I guess. Still, it's hard to fathom how repetitious and ritualized reading of the Torah translates to better critical thinking and analytical skills that are essential for college.",
            "title_similarity": "0.81337184",
            "sentiment_compound": 0.8271
        },
        {
            "id": "i5kuihw",
            "score": 2,
            "text": "Really makes you think",
            "title_similarity": "0.09260128",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5l7d1x",
            "score": -2,
            "text": "When do we start talking about cultures encouraging others to be liberal (and not studying) but then doing the opposite themselves and then framing themselves as the saviours?",
            "title_similarity": "0.37054062",
            "sentiment_compound": 0.296
        },
        {
            "id": "i5lg4ef",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5lleqx",
            "score": 2,
            "text": "Finishing college doesnt mean you are ambitious about a career. From what Ive seen its more likely a sign that they will just blindly follow their parents vision for their future and may have a career or possibly a career change after a few years acquiring a huge student debt and a completely worthless degree for their future.",
            "title_similarity": "0.60436666",
            "sentiment_compound": 0.1796
        },
        {
            "id": "i5lx6rk",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5ml7zs",
            "score": 2,
            "text": "American Jews are by and large more progressive as well, more progressive communities tend to produce more highly educated women by encouraging them to be more than just a womb. Just want to offer an explanation that doesn't feed into old Bell curve narratives",
            "title_similarity": "0.7403665",
            "sentiment_compound": 0.7239
        },
        {
            "id": "i5mls8t",
            "score": 2,
            "text": "Same goes for Asians too but isn't it bad to stereotype any race/religion even if it's a positive one?",
            "title_similarity": "0.4355199",
            "sentiment_compound": 0.7734
        },
        {
            "id": "i5kyndh",
            "score": 26,
            "text": "Literally everyone knew culture has an impact. That's why if your culture is full of negative things you should take steps to fix it in your local community",
            "title_similarity": "0.27751732",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i5kux0i",
            "score": 10,
            "text": "Girls are already much more likely to graduate college, and have better job prospects straight out of college.",
            "title_similarity": "0.7524841",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i5lc7qc",
            "score": 10,
            "text": "I like how study about racial differences is fine when it highlights some group positive traits but not a beep when it comes to negative difference among races, in fact when it come to negative racial differences everyone is instantly color blind.",
            "title_similarity": "0.4149115",
            "sentiment_compound": -0.9042
        },
        {
            "id": "i5kwlis",
            "score": 4,
            "text": "Maybe the girls were more successful because they had two parent households? Maybe Jewish guys didnt attend college at the rate of girls because they took over a family business instead?  Maybe the predisposition towards a professional education had something to do with Jews being prohibited from owning land in many places throughout history so they tended towards business and professions which didnt require land ownership but did require higher education?",
            "title_similarity": "0.7261498",
            "sentiment_compound": 0.4743
        },
        {
            "id": "i5l2r8t",
            "score": 4,
            "text": "The ground truth is that Jewish parents emphasize on family education as much as Asian parents but their kids won't be classified as Asian.",
            "title_similarity": "0.63317025",
            "sentiment_compound": 0.1655
        },
        {
            "id": "i5l6rue",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5lmmss",
            "score": -3,
            "text": "This sounds like junk science. There are three things that typically get a person through the highest academic/career achievements and that's through resources, connections, and hardwork. And hardwork is never the primary reason even though plenty of people delude themselves to believe that",
            "title_similarity": "0.5801306",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i5lmndr",
            "score": -2,
            "text": "What i do not understand - why humans always think that having big ambitions is nessesarily a good trait? Life without ambitions can be much happier.",
            "title_similarity": "0.47346985",
            "sentiment_compound": 0.743
        },
        {
            "id": "i5lvkf2",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kuvhw",
            "score": 62,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kxlpl",
            "score": 65,
            "text": "It’s almost like culture is important. I’m not Jewish or Asian, but my friends and business partners are. I think their cultures are nothing but something to be revered. They are cultures that appreciate merit and only add to the American experiment. I hope to incorporate as much of their principles as possible to my kids. Hold your kids and family to high standards. Let’s make American culture based on high achievement again. (They are obviously not the only cultures with this but in my personal experience they are consistent with their expectations of excellence )",
            "title_similarity": "0.59513485",
            "sentiment_compound": 0.9824
        },
        {
            "id": "i5kgg7g",
            "score": 293,
            "text": "Also when you realize their grandmothers grandfathers weren't given jobs because they were Jews their family just understood they had to do for themselves.  If you know you aren't working for someone else you start a  business, or get an education so you are needed.  If not you ended up doing something like driving a cab being an independent salesman or hoping to find a job with a Jewish owner.  So this has been the ethos for generations.",
            "title_similarity": "0.5798358",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i5kzccl",
            "score": 37,
            "text": "Well, yeah. That's what happens when a whole culture of women are supported by their community, and know that hateful people expect them to fail. Love, mutual support, and backbones of steel have been powering the jewish communities for centuries, and I doubt we'll stop any time soon.",
            "title_similarity": "0.61597323",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i5l0dvi",
            "score": 3,
            "text": "What a twisted world we live in, where valuing education and promoting independence is seen as intrinsically promoting inequality.",
            "title_similarity": "0.322711",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i5kgwfb",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kyg7c",
            "score": 4,
            "text": "I think people are ignoring some key notes in the study. This isn’t a criticism of the authors since they acknowledge it upfront but it seems like their sample population kept to a pretty specific kind of Jewish family: namely, Eastern European Jewish families that migrated to the United States and then assimilated without losing (or being forced to hide) their Jewish identity. That’s a pretty specific group of people.\n\nIt’s obviously not possible to do a study so broad that it captures the full diversity of Jewish families across the world. But I’m not sure there’s sweeping statements to be made about “Jewish culture” when their sample doesn’t even have a lot of ultra-orthodox American Jewish families. Would a bigger version of this study done in Israel (or even globally) find the same outcomes across the Jewish population(s)? It seems really unlikely that ultra-orthodox settler families are as progressive about gender roles as more secular families in Tel Aviv.",
            "title_similarity": "0.5707424",
            "sentiment_compound": 0.8415
        },
        {
            "id": "i5l22k0",
            "score": 4,
            "text": "OK, that is not really surprising. However, it does lead to an interesting question: the equality of outcomes issue.\n\nPeople, who argue for it, take it as a sign of oppression that certain demographics (race or sex) do not have equal representation in all areas of life (university degrees, whatever). They sometimes go as far as calling sciences (STEM) racist because obviously the reason blacks are underrepresented is the unconscious racism. Pointing out that perhaps culturally a black teenager from a Chicago ghetto will less likely to go to university -by their own choice-, or even if they do they would less likely apply for a STEM degree, rather he or she would go for something that actually earns them money, will get you called a racist.\n\nSo if we can say that certain culture appreciate education, is it not also possible to state that other cultures will not place as much value on it?\n\nSee the difference between blacks of Jamaican descent and West Africans in the UK - the former group is on the bottom when it comes to education (along with white working class males), whereas West Africans -girls especially- do extremely well. Institutionalized racism seems to be not a very likely explanation for this disparity.",
            "title_similarity": "0.55813515",
            "sentiment_compound": -0.8496
        },
        {
            "id": "i5l7eyv",
            "score": 4,
            "text": "Jewish mother: you haven’t met my two children! The three year old is a physician and the two-year-old is a lawyer.",
            "title_similarity": "0.5770896",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5lvxv9",
            "score": 6,
            "text": "Friend of mine, who is Jewish, when I asked about the success of the Jewish people given their historic adversity: educate, educate, educate. We are not big enough to tackle the world, but smart enough to solve the problems. \nIt is absolutely, per my friend, a Jewish pillar of culture to highly value education in all its forms.",
            "title_similarity": "0.635599",
            "sentiment_compound": 0.9183
        },
        {
            "id": "i5klm1w",
            "score": 1188,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kxq0m",
            "score": 126,
            "text": "When people ask me, “why are you Jews so wealthy?” or “why are you Jews so successful?” I explain the Judaic cultural/familial pressure to be educated/successful. If you grow up every day hearing how great you are and how successful you will become, you either internalize and become that maxim or live to defy it. I, as the son of originally broke ass Soviet Jewish immigrants, can safely say that these pressures, both active and undercurrent, do amount to a neuroticism in which aspirations for “success” (not wealth per se, but expertise in a vocation) is viewed as the pinnacle of achievement.\n\nIt is not the healthiest message to internalize in any way, shape, or form. And, if you’re lazy and procrastinate, the internal hell created by this person you feel you’re supposed to be can be very defeating.",
            "title_similarity": "0.7091458",
            "sentiment_compound": -0.9203
        },
        {
            "id": "i5knv8a",
            "score": 28,
            "text": "Ha jokes on you, I dropped out of college. \n\n…. But I have a good job and am continually educating myself independently.",
            "title_similarity": "0.49364537",
            "sentiment_compound": 0.7227
        },
        {
            "id": "i5knyyn",
            "score": 10,
            "text": "It's pretty clear that Cultures that have parents pushing education and achievement do better than those cultures that have parents who are more laissez-faire.  Jewish Moms and Asian Tiger moms pushing high achieving children became a stereotype for a very good reason.",
            "title_similarity": "0.72185874",
            "sentiment_compound": 0.8622
        },
        {
            "id": "i5kho47",
            "score": 773,
            "text": "Jewish culture places heavily emphasis on secular learning.",
            "title_similarity": "0.5115793",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5lrjve",
            "score": 8,
            "text": "They’re raised to not only work hard, but to work in a way that society rewards. They’re also taught why success matters. Oftentimes, it’s the way to survive. Historically, it has been. \n\nEven in modern times, as society gets more complex, education and success in your career still is a major factor in if you’re going to live well and have healthy children, mentally and physically.",
            "title_similarity": "0.56413347",
            "sentiment_compound": 0.9711
        },
        {
            "id": "i5kbo0x",
            "score": 3461,
            "text": "So culture is a thing? \n\nSimilarly, Nigerian immigrants to the US have very high college rates.",
            "title_similarity": "0.62498105",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5kznyg",
            "score": 73,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kzzr6",
            "score": 128,
            "text": "Parenting and education, and a respect for parenting and education, matter. Who knew?",
            "title_similarity": "0.3426344",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i5kllmr",
            "score": 452,
            "text": "Cultures that prioritize education will inevitably see a higher percentage of success stories.",
            "title_similarity": "0.60223967",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5lt340",
            "score": 22,
            "text": "As a Jew with immigrant grandparents who came here with $0, I mean actually $0, they saw education as “freedom.” The ability to learn, better your mind and open up possibilities for your families is and was the priority. A mind is something that can’t be taken. During the holocaust possessions we’re taken. We know money can be earned and having the skills to do that come from hard work and training your brain. It’s not complicated.",
            "title_similarity": "0.6290494",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i5lotqs",
            "score": 141,
            "text": "My mother, a devout Jew, taught me that anything might be stolen from you at any moment, anyplace. No one, however, can take away your knowledge or education.",
            "title_similarity": "0.5328388",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i5komzw",
            "score": 103,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5lxo2l",
            "score": 25,
            "text": "You mean culture plays a large part in the life chances of children?!? You mean families that don't value education are more likely to raise children who don't particularly succeed?!?!",
            "title_similarity": "0.65177107",
            "sentiment_compound": -0.6016
        },
        {
            "id": "i5kf1ea",
            "score": 3293,
            "text": "> But Horwitz argues that Jews value education because “it has worked for them throughout history, not because they are genetically or culturally predisposed to it.”\n\nI notice that I am confused. Isn't \"culturally predisposed\" extensionally the same thing as \"it has worked for them throughout history\"? What distinction does this author intend between \"it has worked for us throughout history\" and \"we are culturally predisposed to do it\"?\n\nI am \"culturally predisposed\" to pound nails with a hammer rather than a rock; by this I mean, cultural sources such as my parents, television shows, and the shop teacher in my government-approved school taught me to use a hammer. However, the *reason* my culture is predisposed to use hammers and not rocks, is that hammers have worked for us throughout history!\n\n(I'm not disagreeing with the author; I'm just confused by the summary of their view in the article.)",
            "title_similarity": "0.62651336",
            "sentiment_compound": -0.6483
        },
        {
            "id": "i5ktmh8",
            "score": 444,
            "text": "The teenage rite of passage is a literacy exercise. Literacy is a path to success.",
            "title_similarity": "0.46824294",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i5knsys",
            "score": 239,
            "text": "Cultural expectations matter.  They have a tremendous impact on your life trajectory.  Probably more than any other factor in your K-12 education.",
            "title_similarity": "0.5547607",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i5ktcxl",
            "score": 7639,
            "text": ">In the study, Horwitz debunks the myth that Jews, like Asian Americans, are predisposed to educational success because of their ethno-racial background. **Framing Jews’ achievement as a cultural trait erroneously spreads the belief that educational success comes from adopting the “right” cultural values**. But ***Horwitz argues that Jews value education because “it has worked for them throughout history, not because they are genetically or culturally predisposed to it.****”*\n\nHow are they sitting there saying it's not a cultural trait, then go on to describe it as a cultural trait?",
            "title_similarity": "0.6397696",
            "sentiment_compound": 0.7184
        },
        {
            "id": "i5kofz8",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5krxpw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5kx5q4",
            "score": 42,
            "text": "When you have cultures that values tight family units and bonding, and values education we shouldn’t be surprised when they perform better in life.",
            "title_similarity": "0.5163443",
            "sentiment_compound": 0.8481
        },
        {
            "id": "i5kxkb8",
            "score": 1,
            "text": "Great. I want to trade my lackluster parents in for the Jewish variety...",
            "title_similarity": "0.50801754",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i5kxqwt",
            "score": 4,
            "text": ">from college \n\nIs this US only or a worldwide thing?",
            "title_similarity": "0.33786282",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5kxt5z",
            "score": 3,
            "text": "Would be fascinated to know if they gathered data on which girls opted to have a bat mitzvah and whether that correlated to a change in their graduation rates within their cohort compared to those who did not have a bat mitzvah.",
            "title_similarity": "0.71626806",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i5l04jh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5l0l9c",
            "score": 4,
            "text": "So culture matters. So not finishing college or hs or  not going can be affected by culture too. Some people be sad to hear that.",
            "title_similarity": "0.41175318",
            "sentiment_compound": -0.5141
        },
        {
            "id": "i5l2mvi",
            "score": 2,
            "text": "It doesn't say what kind of degree they graduate with.\n\nBoth my non-Jewish sisters have college degrees (one with a masters) but neither of them have careers in the field of their degree :D",
            "title_similarity": "0.5455805",
            "sentiment_compound": 0.7615
        },
        {
            "id": "i5l2ofo",
            "score": 1,
            "text": "And us with Irish Catholic heritage started working at 15 and never stopped.",
            "title_similarity": "0.4547767",
            "sentiment_compound": 0.1695
        },
        {
            "id": "i5l2sfu",
            "score": 1,
            "text": "I would like more details on how \"socioeconomic status\" was defined: did it include the education level of the parents or just income/class?\n\nWould also be interested to see if the study controlled for location (rural vs. urban)",
            "title_similarity": "0.4716832",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i5l46ri",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5l5a84",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5l7hx9",
            "score": 1,
            "text": "Should this article really say \"Girls raised by Jewish parents *in America* are 23% more likely to graduate\"?\nI'd kind of like to see if this is replicated in somewhere like, say Eastern Europe.",
            "title_similarity": "0.876248",
            "sentiment_compound": 0.5729
        },
        {
            "id": "i5lampa",
            "score": 1,
            "text": "It's probably true but gonna add that living in Israel, a Jewish country, a lot of people in here slack off in school, dislike school, etc. There is probably a difference but don't think of it like we don't have that.\n\n*No comments about political conflicts will be answered",
            "title_similarity": "0.49527884",
            "sentiment_compound": -0.3919
        },
        {
            "id": "i5lavre",
            "score": 1,
            "text": "I don't note it mentioned but I wonder whether the having to learn and recite a passage in a foreign language as a fundamental part of their religion plays into this?\n\nCould there be a \"right\" religion in the sense of encouraging kids to develop the skills needed to get through school successfully?",
            "title_similarity": "0.5107436",
            "sentiment_compound": 0.9146
        },
        {
            "id": "i5lbinx",
            "score": 1,
            "text": "Call me a dumdum but what's the difference between a percent and a percentage point.",
            "title_similarity": "0.36884308",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5lbt51",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5lcr73",
            "score": 3,
            "text": "I don't believe this type of trait is specific to any one culture, but a trait to families who have come from little or who have seen struggle, especially immigrant families, in order to do well in life and society.\n\nCulturally, being from a Arab and Muslim culture I've seen the same. For me, it was shown to me that an education and ambition is also incredibly important in life. Critical thinking was engrained with reading and understanding the Qur'an and learning about Islamic scholars who invented algebra, surgery, hospitals, chess, clocks, astronomy - the astrolabe, etc.,\n\nOur parents and families encourage education as a means of upward mobility in society in order to do well in life. Over 90% of kids in Muslim communities are in the fields of law, medicine, business, education. This is especially true if the children are from immigrant families and are afforded more opportunities than their parents had. Not going to college was not even an option.\n\nMy best friend is Mexican who's parents didn't have an education when they came to the states but encouraged him to pursue his. He's working on his PhD currently. \n\nIn college, I worked with an amazing human being - this man from Ghana who's four children were all in medical school with straight A's and graduated with honors from their respective universities. All four have completed successful residencies and are practicing medicine now.",
            "title_similarity": "0.56681126",
            "sentiment_compound": 0.9945
        },
        {
            "id": "i5ld9sm",
            "score": 2,
            "text": "Did they control for genetic differences? Or at least discuss it? It's well-established that Jews have a bit higher IQs on average, especially some subgroups.\n\nI am not Jewish and I am ready for the ignorant downvoters who will deny irrefutable scientific evidence.",
            "title_similarity": "0.6241746",
            "sentiment_compound": -0.3313
        },
        {
            "id": "i5le0qw",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5lf3uo",
            "score": 1,
            "text": "Probably because we’ve been taught that we are only worthy of safety and respect if we can contribute to society. Also for many of the great grandparents who grew up in the ghettos, I think education was seen as a way out.",
            "title_similarity": "0.48143578",
            "sentiment_compound": 0.9169
        },
        {
            "id": "i5lfzl5",
            "score": 1,
            "text": "Does it account for geographic location not just income? Because i bet people who live in coastal cities are more likely to attend college than people in the midwest/south, where the Jewish population is minimal.",
            "title_similarity": "0.7584678",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5lhplh",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5lijxg",
            "score": 1,
            "text": "I’m a bit confused as to why they are saying “girls raised by Jewish parents” as opposed to just “Jewish girls”. Is this an adoption study? If so, I can’t see that stated anywhere.",
            "title_similarity": "0.62951344",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i5ll5hk",
            "score": 2,
            "text": "In ultra orthodox Jewish families often the woman is the one feeding the family while the man is studying the Tora instead of working, which might also be a factor.",
            "title_similarity": "0.4840769",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ln3av",
            "score": 1,
            "text": "Does 'girls raised by Jewish parents' include adoptees then?",
            "title_similarity": "0.62889934",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5lnuzr",
            "score": 1,
            "text": "What does it mean to: articulate a self-concept?",
            "title_similarity": "0.1373848",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5lojyq",
            "score": 1,
            "text": "Typically disciplined families. Structural upbringing prepares them for 16+ years of academics.",
            "title_similarity": "0.55892456",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5loko0",
            "score": 24,
            "text": "? Is this supposed to be a joke. This study is supposed to “debunk[] the myth that Jews, like Asian Americans, are predisposed to educational success because of their ethno-racial background” while literally only surveying ethnically/racially Jewish children raised by Jewish parents. This study is trash, redo it with Jewish parents raising only non Jewish ethnic and or racial minorities and then get back to us",
            "title_similarity": "0.65451217",
            "sentiment_compound": 0.8126
        },
        {
            "id": "i5lqetw",
            "score": 7,
            "text": "Education is inherently part of the culture - it is valued in it's own right.   \n\nSo is the study of Law ( Justice) and Medicine\n\nThe power of a social construct is greater than financial incentive.",
            "title_similarity": "0.450777",
            "sentiment_compound": 0.8834
        },
        {
            "id": "i5lsjzp",
            "score": 4,
            "text": "I couldn't find any limitations listed in the actual study..This is not a well constructed study.",
            "title_similarity": "0.22668333",
            "sentiment_compound": -0.2057
        },
        {
            "id": "i5lswiv",
            "score": 1,
            "text": "I wonder why the headline highlights the effect on girls. How exactly are Jewish boys raised? :|",
            "title_similarity": "0.6254966",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i5ltqzo",
            "score": 1,
            "text": "Did this study actually investigate why this phenomenon is happening or simply document it? The explanation in the article is incoherent.",
            "title_similarity": "0.27933154",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5lwupe",
            "score": 2,
            "text": "Fascinating. Would be interesting to see this data compared to the number of children these women have and their age at the time of their first child's birth. My guess is they have fewer children and have them later in life, on average.",
            "title_similarity": "0.72762513",
            "sentiment_compound": 0.7579
        },
        {
            "id": "i5lx1v0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5lx7o0",
            "score": 5,
            "text": "I would be interested in reading the breakdown on how different sects of Judaism (Reform, Conservative, Orthodox) did here, as well as other religions.\n\nI’d also be interested in seeing a study done comparing groups who have been victims of genocide to see if there is a similar emphasis on continued education.",
            "title_similarity": "0.46850362",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i5lxepm",
            "score": 1,
            "text": "Yeah but which group are they being compared to?",
            "title_similarity": "0.15073459",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i5lxixg",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5lxqyh",
            "score": 1,
            "text": "This is very ironic because in the more religious sects of Judaism (orthodox, ultra orthodox/chasidic), most girls do not get above a high school education. They are not allowed to go to college or study beyond that.",
            "title_similarity": "0.6300765",
            "sentiment_compound": -0.2006
        },
        {
            "id": "i5lzk0q",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5m0dv5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5m10qj",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5m1khd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5m1uhw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5m3lzl",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5m5i8t",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5m6aby",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5m75zm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5mafpe",
            "score": 1,
            "text": "They mention \"... He said religious upbringing is a key factor...\"  \nI wonder if they just compared to women of other religions, or included non-religious upbringing in there as well.",
            "title_similarity": "0.51475847",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i5mgcvi",
            "score": 2,
            "text": "Respect for learning, knowledge, and study are tenets of Judaism as exemplified in Torah and Talmud.",
            "title_similarity": "0.3092789",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i5miljc",
            "score": 1,
            "text": "“Raised by Jewish parents”. Gee thanks, Jewish dad, for giving me all the Jewish looks to get bullied for but never being around to give me socioeconomic advantages. I still graduated from college early though, so I guess I’m doing alright.",
            "title_similarity": "0.6491152",
            "sentiment_compound": 0.705
        },
        {
            "id": "i5miqz0",
            "score": 2,
            "text": "Also the number of Jewish people who have won Noble price is rather high. Also Jewish people seems to be outliers in academics and other fields \n\nhttps://en.wikipedia.org/wiki/List_of_Jewish_Nobel_laureates",
            "title_similarity": "0.6576948",
            "sentiment_compound": 0.7906
        },
        {
            "id": "i5mjlt8",
            "score": 13,
            "text": "Hey, Jew here. We have a history of valuing education. There really isn't much more to it. Thank you for attending my TEDTalk.",
            "title_similarity": "0.5042201",
            "sentiment_compound": 0.6326
        },
        {
            "id": "i5mn41x",
            "score": 1,
            "text": "There was another post this morning about how homosexuals go on to finish college at higher rates than heterosexuals and typically do better in school.\n\nI'd like to see how Jewish lesbians perform when it comes to education and IQ.",
            "title_similarity": "0.83052814",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i5mnhzf",
            "score": 1,
            "text": "Seeing a despairing lack of non-theist mentions throughout this study. I guess theists gotta rank their theologies somehow...",
            "title_similarity": "0.32049593",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i5mnkku",
            "score": 1,
            "text": "What's happening I just saw one of these same things expect instead of girls raised by Jewish parents its gay men.",
            "title_similarity": "0.6116373",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5mp3fq",
            "score": 5,
            "text": "Don’t forget colleges also unsurprisingly discriminate against Jewish admissions just like Asians groups because “they have too many of them”",
            "title_similarity": "0.5530287",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i5mq3ol",
            "score": 4,
            "text": "I love how there have been two posts about this study & the writers of both news articles wrote the wrong headline. The headline should be “Demographics of higher education are not representative of society as a whole”. Academia and Society have gotten way out of sync and as a result it’s causing the cultural polarization we’re seeing today.",
            "title_similarity": "0.45703536",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i5mqav1",
            "score": 7,
            "text": "They can take everything away from you except your intelligence and your knowledge. Jews know this.",
            "title_similarity": "0.34946188",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i5mr4b7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5mrlbd",
            "score": 6,
            "text": "don't start looking at effects of family, upbringing, culture, etc. can't paralyze the world with facts!",
            "title_similarity": "0.18496135",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ms8gi",
            "score": 2,
            "text": "Wow , couple this with the survey of gay men being more educated. If you’re a gay Jewish male, watch out Einstein! .",
            "title_similarity": "0.5422026",
            "sentiment_compound": 0.6239
        },
        {
            "id": "i5mu863",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5mxcxk",
            "score": 1,
            "text": "I'm Jewish so I allow myself to say something that might sound offensive: Jews were selectively bred for smarts, entrepreneurship and education. That's the sad truth. If you weren't good with your brains, you had higher chances of being murdered by anti-Semites...",
            "title_similarity": "0.6149894",
            "sentiment_compound": -0.7208
        },
        {
            "id": "i5my1av",
            "score": 1,
            "text": "Is \"23 percentage points\" just a fancy way of saying 23% or am I just an idiot?",
            "title_similarity": "0.5075503",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i5mzbdk",
            "score": 6,
            "text": "Culture matters more than socioeconomic status, Chinese kids I grew up with that didn’t study in High School were social outcasts in the Chinese community",
            "title_similarity": "0.53985256",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i5n0r62",
            "score": 2,
            "text": "The most interesting finding is the proposed “egalitarian” Jewish view of gender juxtaposed with self-concept. “For non-Jewish women, graduating from any college is enough.” I didn’t read very closely so I wonder if they’re conflating two different things, being a Jewish woman and being raised by at least one Jewish parent. The important part to me is the egalitarian focus, not so much the being Jewish. Since the researchers are saying this *is not* “inherent” to being Jewish, it’s something all people can strive for.",
            "title_similarity": "0.77073276",
            "sentiment_compound": 0.5849
        },
        {
            "id": "i5n2zkq",
            "score": 1,
            "text": ">articulate a self-concept marked by ambitious career goals.\"\n\nFancy way of saying my parents are hard a***es.   \n\nHave two sets of sibling cousins who are doctors simply because their parents are difficult. The one cousin sibling who isn't became a rebel and constantly fought with his mother.",
            "title_similarity": "0.56414413",
            "sentiment_compound": -0.167
        },
        {
            "id": "i5n78k5",
            "score": 2,
            "text": "Unfortunately, most degrees people are focusing on these days have very little value.",
            "title_similarity": "0.35500732",
            "sentiment_compound": -0.0038
        },
        {
            "id": "i5nac0l",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.07227084"
        },
        {
            "id": "i5naj1h",
            "score": 1,
            "text": "Seems to be because of parenting traditions and the family professions instilling these values.",
            "title_similarity": "0.33764467",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i5nar7z",
            "score": 7,
            "text": "Looking around my Jewish family (MDs, software company owner, lotta grad degrees, etc.), can absolutely relate.",
            "title_similarity": "0.48274058",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5nd9lq",
            "score": 2,
            "text": "So does this mean colleges are going to start requiring higher entrance qualifications to limit the number of Jews being accepted in the name of \"diversity, equity and inclusion\" like they do with Asian students?",
            "title_similarity": "0.61098087",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i5nkel3",
            "score": 1,
            "text": "Since we’re all just anecdoting into the wind here, I’ll add mine: I think part of this is generational. \n\nIn my family’s experience, Jews were more likely to support women in the professional workforce before Christians in America. My grandmother was a Catholic who worked in a law firm in the 40s. She was on her way to becoming a lawyer, but gave it up because her parents were seriously concerned that everyone would think she was a lesbian. Her friends who did become lawyers, some of the first women in their local offices, were mostly Jewish, and their families supported them. \n\nSo it wouldn’t surprise me if it turned out that a community who had a head start on supporting women in professional fields was still ahead of the game today.",
            "title_similarity": "0.73825884",
            "sentiment_compound": 0.9316
        },
        {
            "id": "i5no2fq",
            "score": 1,
            "text": "But ultra orthodox Jewish girls aren't allowed to pursue certain careers because they are girls.  There were signs in Williamsburg, Brooklyn, telling women to walk on the street if men are walking in their direction on the sidewalk.  The city stopped that though.",
            "title_similarity": "0.47804832",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i5nr7k0",
            "score": 1,
            "text": "Link to the medical journal.[link to medical journal](https://journals.sagepub.com/doi/full/10.1177/00031224221076487)",
            "title_similarity": "0.1822519",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ntn0w",
            "score": 1,
            "text": "The argument is that culture is a huge factor in cognitive performance. By this I mean more than \"you must go to school\", but down to reading to/with/engaging/questioning and asking and taking children's answers seriously. And by extension the primacy put on education in certain Asian cultures. This would then imply that a large part of the underperformance of other groups is not directly systematic, but cultural (which can be indirectly systematic -- for example, southern culture is more authoritarian towards children -- seen and not heard, behave! Which is not good cognitively). I grew up in a rich literary environment and, though my parents never said it, the thought that one could not go to college never occurred to me.  \n\n\nAnyhow, this large cultural component to cognitive performance is well supported by adoption studies and animal's deprived environment studies. It is almost certainly correct -- you can't build a good cognitive house on a bad literary foundation. Then we have to deal with best parental practices as a euphemism for \"your cultural child-rearing practices suck\"",
            "title_similarity": "0.56799597",
            "sentiment_compound": 0.1985
        },
        {
            "id": "i5nwlsq",
            "score": 2,
            "text": "I guess this is the main point of this article: \"He said religious upbringing is a key factor that can help explain why some people are not only much more likely to go to college than others but also more likely to go to more selective schools.\n“Just as we shouldn't ignore things like class, race, or gender when trying to understand the educational landscape we shouldn't ignore religion,” Schnabel said.\nThis is the first study to show that the level of embeddedness in and exposure to a religious subculture through parents matters for educational outcomes.\"",
            "title_similarity": "0.6658014",
            "sentiment_compound": 0.5669
        },
        {
            "id": "i5o4cuk",
            "score": 1,
            "text": "Maybe education imprinted with morality gives more willpower: but is it valid for orthodox Jews or others?",
            "title_similarity": "0.52051073",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5o4t8d",
            "score": 2,
            "text": "Pierre Bourdieu a while ago that economic capital wasn't the only kind of capital that's heritable and that can lead to social reproduction or upward social mobility.\n\nThere's also social capital (i.e. relationships, useful social ties) and cultural capital (i.e. knowledge about \"legitimate\" forms of culture like books, plays, opera rather than mangas, rap and tv shows. Families with low economic capital but high social capital can be teachers, people working in museums, libraries, etc)",
            "title_similarity": "0.6300086",
            "sentiment_compound": 0.3919
        },
        {
            "id": "i5o4w02",
            "score": 3,
            "text": "Girls raised by Jewish parents are, generally speaking, Jewish girls. Also, Ashkenazi Jews (are we talking about these jews?) are the highest IQ population. High IQ strongly correlates with educational success.\n\nTherefore, upbringing may be a factor but also may have little to do with their academic success.",
            "title_similarity": "0.85249674",
            "sentiment_compound": 0.8381
        },
        {
            "id": "i5o5bul",
            "score": 1,
            "text": "That’s a nice way of saying they’re competitive AF.",
            "title_similarity": "0.27006662",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i5ody0d",
            "score": 1,
            "text": "This is very interesting. I helped peer-review a post-graduate thesis on the factors that lead to academic success (i.e., high school and college graduations) with migrant farm workers and their children. Migrant farm workers have among the highest drop out rates for both high school and college.\n\nIt seems that the strongest correlation that we found when analyzing such success came with families who had at least one parent who was proactive when it comes to the academic success of their child/children. \n\nThere was even greater success when those children were part of a two-parent household and both parents were proactive with the education of their child/children.\n\nIntelligence is obviously an important variable. However, it was less decisive in determining college graduation than the variable of proactive families during adolescence and into college.",
            "title_similarity": "0.7705097",
            "sentiment_compound": 0.9872
        },
        {
            "id": "i5oj62a",
            "score": 2,
            "text": "They are culturally predisposed towards getting a higher education. Same with many Asian ethnic groups like Chinese and Indian. There is great cultural pressure to succeed which has helped them get ahead of most people in America despite being minorities (some of whom may have come from poor or middle class backgrounds too).",
            "title_similarity": "0.6600703",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i5oly80",
            "score": 1,
            "text": "Girls raised by parents with a college education are likely to get a college education.",
            "title_similarity": "0.65619385",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5ompuf",
            "score": 3,
            "text": "Im not a girl but I am of Jewish upbringing and I can tell you exactly why this is. Its very simple, we are tought to try even with a high possibility of failing, we are taught not to fear failure but rather embrace it as a learning opportunity.",
            "title_similarity": "0.5074151",
            "sentiment_compound": 0.8479
        },
        {
            "id": "i5oo2nb",
            "score": 1,
            "text": "Succeeding in education depends on traits like intelligence and conscientiousness, which have a huge genetic component. \n\nUnless they're comparing adopted children, particularly twins raised by different parents, the study is useless as they're not isolating variables. Jewish parents could actually be **worse** than average in promoting education, but their children make up for it through inherited traits. \n\nNot surprised that no one on r/science brought this up, because of the huge US bias toward behavioralism.",
            "title_similarity": "0.6493965",
            "sentiment_compound": 0.7213
        },
        {
            "id": "i5ovonp",
            "score": 2,
            "text": "oh good my childhood trauma is now backed by ~*~science~*~",
            "title_similarity": "0.45228302",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i5p0wnn",
            "score": 1,
            "text": "But not Hasidic. They like to keep their girls educated to what a 3rd grade level?",
            "title_similarity": "0.61591566",
            "sentiment_compound": -0.395
        },
        {
            "id": "i5p2707",
            "score": 1,
            "text": "Status chasing, a long Jewish tradition.",
            "title_similarity": "0.43504077",
            "sentiment_compound": 0.0
        },
        {
            "id": "i5pay7x",
            "score": 1,
            "text": "Evidence of Jewish privilege?",
            "title_similarity": "0.3746702",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i5pwpq3",
            "score": 2,
            "text": "Doesn’t have much to do with being a girl. Jewish people are far more involved in higher education than nearly every other group. How do you think tropes come around? Somebody getting jealous of somebody else killing it.",
            "title_similarity": "0.7514319",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i5rie6r",
            "score": 1,
            "text": "The proper thing to account for here is accounting for IQ - not SES. It's been well established in intelligence research that Jews have considerably higher intelligence than the average for every level of SES, and intelligence is a strong predictor of likelihood of college graduation.\n\n&#x200B;\n\nThis is suspected because there is a strong cultural selection for traits correlated with intelligence (source: https://web.mit.edu/fustflum/documents/papers/AshkenaziIQ.jbiosocsci.pdf)",
            "title_similarity": "0.75666904",
            "sentiment_compound": 0.9611
        },
        {
            "id": "i5w8k25",
            "score": 1,
            "text": "does it have to be their child? or can any Jewish parents raise any girl?",
            "title_similarity": "0.6338426",
            "sentiment_compound": 0.0
        }
    ]
}