{
    "Drought-hit California orders Nestlé to stop pumping millions of gallons of water\n": [
        {
            "id": "gw27cl7",
            "score": 2,
            "text": "Make the conpany pay $200K/day or $500K per week. It is non-neogotiable and comes out of the higher-ups paychecks. If they leave the company, doesn't matter, they were responsible during their previous position at Nestle and continously fine them until they are dead broke. Hit these non-caring assholes where it hurts the most.",
            "title_similarity": "0.7093412",
            "sentiment_compound": -0.9113
        },
        {
            "id": "gw1xj2v",
            "score": -2,
            "text": "Serious question - how feasible would it be to build water pipelines going from the south eastern US to the west coast? We are going to run out of water in 10-20 years, especially in places like Phoenix. When I lived in Houston, there is nothing but water. I know it’s the same in Florida. I wonder if we could build some sort of water treatment and transportation infrastructure and have pipelines for water instead of oil. Even if the water leaks, it’s just going to create oasis’s.",
            "title_similarity": "0.6820156",
            "sentiment_compound": 0.5239
        },
        {
            "id": "gw28e3i",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.22236207"
        },
        {
            "id": "gw2twgg",
            "score": -12,
            "text": "I live in California. The government here is incompetent because it's wholly controlled by Democrats, with no real competition, so the political leaders don't fear being thrown out of office if they do a bad job.\n\nCalifornia has more than enough rain to sustain its huge agriculture sector, but that rain doesn't fall consistently. The obvious answer is to build and maintain more reservoirs and cisterns to greatly increase storage capacity in order to get California through the lean years.\n\nInstead, the politicians do NOTHING, and then when there is a shortage, as there always is periodically because of weather patterns and cycles, they freak out and (1) demand regular people drastically cut back water usage, and (2) attack corporations who are not in any way responsible for the shortage.\n\nThe article says Nestlé takes out 58m gallons... but the Santa Ana River volume is over 125 million gallons per day! So **Nestlé is taking less than 0.1% of the water.**\n\nBut Reddit has an irrational hatred of Nestlé so no one cares.",
            "title_similarity": "0.5830963",
            "sentiment_compound": -0.9836
        },
        {
            "id": "gw2807y",
            "score": 2,
            "text": "Why is Nestle a business? They steal water and use slave labor, what does it take for a company to shut down?",
            "title_similarity": "0.52107143",
            "sentiment_compound": -0.5514
        },
        {
            "id": "gw2m2du",
            "score": -4,
            "text": "Reddit, explain to me why it's OK for farms to use 95% of the fresh water supply and sell it back to you in the grocery store as food, but it's not OK for Nestle to use 5% of the supply and sell it back to you as drinking water. Isn't it kind of the same thing? We need food and water. I get that there are easier ways to get drinking water, but why get mad at Nestle? It's not like they are shipping CA water to China. If you don't agree with bottled water Just drink tap water, that's what I do. No need to get riled up.",
            "title_similarity": "0.5491792",
            "sentiment_compound": -0.8631
        },
        {
            "id": "gw237p3",
            "score": 8,
            "text": "I know in some towns folks need to buy water because our broken, corrupt system that lacks proper infrastructure to deliver potable water (think Flint, MI) but if you are one of the brain dead fools on display at the local grocery buying cases of plastic bottles filled with water you are part of the problem. Yes, fuck Nestle and the rest (coke, kroger, etc) for choking our planet with plastic, but the citizen aka consumer in this case doesn't need to buy this toxic crap. Most cities and towns have safe, drinkable water (we already pay for this) and all you have to do is put it into a reusable container to drink. If you're enterprising enough you can save the money you waste on plastic and purchase a basic filter to make some of the more heavily chlorinated water taste better...or not. If you want to buy water use a service that reuses and delivers. Your children and the planet will love you for it.",
            "title_similarity": "0.6108523",
            "sentiment_compound": -0.893
        },
        {
            "id": "gw25m0v",
            "score": -35,
            "text": "Dumb political move. Bottled water is sold locally and is only a tiny fraction of total water usage. Drinking water should be the absolute last thing to be restricted during a drought.",
            "title_similarity": "0.5047653",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gw2dx21",
            "score": 2,
            "text": ">But a 2017 [investigation](https://www.waterboards.ca.gov/waterrights/water_issues/programs/enforcement/complaints/docs/nestle/4_23_2021_nestle_roi.pdf) found that Nestlé was taking far more than its share. Last year the company drew out about 58m gallons, far surpassing the 2.3m gallons per year it could validly claim.\n\nHoly crap... why has the state of California not sued the shit out of Nestle yet?",
            "title_similarity": "0.64820135",
            "sentiment_compound": 0.7427
        },
        {
            "id": "gw21p1e",
            "score": 19,
            "text": "If people stopped buying bottled water Nestle would stop bottling it.",
            "title_similarity": "0.59552956",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gw21so5",
            "score": 4,
            "text": "Can we improve our city water systems so people don’t need bottled water?  Fuck this business model based on a resource that belongs to us all.",
            "title_similarity": "0.5103861",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gw28pgk",
            "score": 6,
            "text": "Here's a thought. If you know your region is privy to yearly droughts, maybe dont sell your water to mega corporations at all.",
            "title_similarity": "0.70707697",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw282pa",
            "score": 7,
            "text": "Nestle always wins, this company literally still uses slave labour. Bottling and selling water from drought hit regions is a regular Tuesday for them.\n\nLast time they just moved the plant to a native reserve so they wouldn't have to report water usage anymore.\n\nhttps://www.businessinsider.com/nestle-is-bottling-water-from-california-2015-4",
            "title_similarity": "0.5819417",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gw29vk7",
            "score": 7,
            "text": "Bottled water simply shouldn't exist. There is not a single non-emergency use of a single use plastic bottle of water that is appropriate or not better solved with other solutions like fixing clean water infrastructure or keeping personal emergency backup reservoirs",
            "title_similarity": "0.41710275",
            "sentiment_compound": 0.0207
        },
        {
            "id": "gw293oi",
            "score": 2,
            "text": "fuck nestle all the way. They need to be charged with crimes against humanity and shut down forever.",
            "title_similarity": "0.6176721",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gw2joeg",
            "score": -1,
            "text": "They need to order the alfalfa farmers to stop exporting subsidized water to China as cheap feed. Force real water rights changes that make the use it or loose it into a race to the bottom. People bitch about almonds but almonds are flowering trees that produce nutrient dense food. Alfalfa uses more water only do the farmers don't lose their historic water rights and are basically sold at a lose. Put the water in trust and reward farmers for water capture and retention and building soil. We can offset global warming just in topsoil creation ffs.",
            "title_similarity": "0.5682475",
            "sentiment_compound": 0.548
        },
        {
            "id": "gw32eqa",
            "score": -1,
            "text": "Yeaaaaahhhh CALIFORNIA!!!!! Why don’t they just Raise Taxes again! The problem is their leaving in groves, and they bring their Liberal bullshit to other states.",
            "title_similarity": "0.6752792",
            "sentiment_compound": -0.8257
        },
        {
            "id": "gw3vcyy",
            "score": 0,
            "text": "Maybe this will make the vegans that continue to believe that the meat industry uses all the water. It doesnt, here is a short video \n\nhttps://youtu.be/sGG-A80Tl5g",
            "title_similarity": "0.5125873",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3vh0h",
            "score": 0,
            "text": "California should just admit they founded themselves in a dessert and stop drinking water.  I needs my nesquick!",
            "title_similarity": "0.5958613",
            "sentiment_compound": -0.1759
        },
        {
            "id": "gw2b8vk",
            "score": 9,
            "text": "I'm of the opinion that if you want to make bottled water then build a desalination plant on the coast and convert seawater into freshwater.\n\nAny groundwater shouldn't be something that cant be commercialized plain and simple. That should be for the public to use and nothing else.",
            "title_similarity": "0.4717678",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gw2ba6v",
            "score": 3,
            "text": "Nestle had a swarm of bees on their ice cream property in Bakersfield CA. I charge $160 for the service. They stiffed me. The guys there said they do that all the time.",
            "title_similarity": "0.5806352",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2duii",
            "score": 5,
            "text": "A little off topic, but since this comes up every gorram thread about drought in California, let me just TIL you: [dairy and beef consume more water than almonds, for less output](https://www.truthordrought.com/almond-milk-myths).\n\nSo yeah, while it's not ideal that 80% of the world's almonds are produced in California, it only uses 8% of agricultural water. Dairy produced in California is 1.4% of worldwide production, for 15% of the water. This is before we get to GHG gas emissions and land usage, all worse for animal products than plant products.\n\nIf you really care about water in California, work towards ~~banning~~reducing dairy and other animal agriculture before even beginning to talk about almond water consumption.",
            "title_similarity": "0.6488009",
            "sentiment_compound": 0.0594
        },
        {
            "id": "gw2c08m",
            "score": 2,
            "text": "If they have been taking 25 times as much water as they are entitled to, they have accumulated a massive water debt.  That should be enough to shut them down until the ecosystem has recovered.",
            "title_similarity": "0.7289962",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw2co82",
            "score": 2,
            "text": "Step in and close Nestlé down.  The world would never miss  it.",
            "title_similarity": "0.10426858",
            "sentiment_compound": 0.1139
        },
        {
            "id": "gw32jna",
            "score": 2,
            "text": "Nestle takes this water and bottles it for people to drink it.  They aren't selling it to rich people for their toilets and swimming pools, leaving pooor Californians with no drinking water.  There is no more important use for water than drinking.\n\nI'll agree bottling is an expensive and inefficent method of distributing water (vs the good ol' tap), but why do people get butthurt that Nestle is taking water and making it availble for people to drink?  Is there a better use?",
            "title_similarity": "0.6102779",
            "sentiment_compound": 0.7627
        },
        {
            "id": "gw1vxvk",
            "score": 101,
            "text": "Water should be charged progressively.  The more you consume as a business or household, the more your going rate per gallon should be.  The first 100 gallons each month should be sold below cost, but probably not free.",
            "title_similarity": "0.5085708",
            "sentiment_compound": -0.6063
        },
        {
            "id": "gw2run2",
            "score": 11,
            "text": "Nestle uses less than 0.008% of the yearly water usage in California. \n\nThis will literally do nothing. \n\nDownvote me all you want: residential and agricultural use drive droughts, not bottled water. \n\nhttps://www.lamag.com/citythinkblog/nestle-gets-away-pumping-californias-water-next-nothing/",
            "title_similarity": "0.7032107",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gw31ii9",
            "score": 6,
            "text": "Cali is like the rich kid who's parents gave them everything and they just end up smoking crack and ruining anything successful",
            "title_similarity": "0.59174323",
            "sentiment_compound": 0.836
        },
        {
            "id": "gw215sd",
            "score": 1,
            "text": "\"Yeah, sure, ok. We'll get right on that. *snicker\"*  \nNestle probably.",
            "title_similarity": "0.16261034",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gw287bs",
            "score": 1,
            "text": "Should increase exponentially with each fine.",
            "title_similarity": "0.16009411",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gw2b8el",
            "score": 1,
            "text": "I'm fine with the fines, but how about people who have access to clean tap water stop drinking bottled water.",
            "title_similarity": "0.499164",
            "sentiment_compound": 0.2846
        },
        {
            "id": "gw2j2up",
            "score": 1,
            "text": "In California 80% of the water is held by the farmers and whenever the remaining 20% goes down they start panicking saying we are in a drought. We are far from it. Very far!",
            "title_similarity": "0.79701936",
            "sentiment_compound": -0.4926
        },
        {
            "id": "gw2bh4v",
            "score": -9,
            "text": "Along with Nestle's dumb shit, Stop supporting animal agriculture if you want to, well, possibly not suffer during a drought. Livestock requires more water than humans and it's completely unnecessary when you can shop plant based. Get with it and go vegan, and fuck Nestle. Let's fucking fix this planet.\n\n>According to a report from the Natural Resource Defense Council, around [80 percent](http://pacinst.org/publication/ca-water-supply-solutions/#issuebriefs) of water in California is used for agriculture. While a percentage of this water goes to growing crops, the bulk is used in the [animal agriculture industry](http://www.onegreenplanet.org/animalsandnature/eat-for-the-planet-meat-and-the-environment/). Not only do these animals consume “virtual” water in the form of the water used to grow their feed, but excess water is also needed to hydrate animals and keep factory farm facilities and slaughterhouses clean.  \n>  \n>California is the country’s leading dairy producer, yet an individual dairy farm can use up to [150 gallons](http://www.onegreenplanet.org/animalsandnature/the-dairy-industry-and-the-environment/) of water per cow, per day simply to keep that cow’s stall clean. Coupled with the water needed for feed and hydrating the cows, it has been estimated that the average farm uses [3.4 million gallons of water a day](http://www.onegreenplanet.org/animalsandnature/the-dairy-industry-and-the-environment/). To put this in practical terms,the water needed to produce just one single gallon of milk is equivalent the amount used by an [entire month’s worth of showers](http://www.onegreenplanet.org/animalsandnature/the-dairy-industry-and-the-environment/).  \n>  \n>Meat production is similarly water intensive. According to the Water Education Foundation, every pound of California beef requires [2,464 gallons](http://www.onegreenplanet.org/news/californias-drought-whos-really-using-all-the-water/) of water to produce. In shower scale, that’s around [six MONTHS](http://www.onegreenplanet.org/news/californias-drought-whos-really-using-all-the-water/) worth of water.",
            "title_similarity": "0.7341853",
            "sentiment_compound": 0.8491
        },
        {
            "id": "gw22zmr",
            "score": 18,
            "text": "Nestle is a pariah and should be dissolved.",
            "title_similarity": "0.4966161",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2j0ps",
            "score": 4,
            "text": "Sir, California has said they're going to fine us .001% of our daily revenues if we don't comply with their order to stop pumping water. \n\n(Whole board room erupts in laughter as $100 bills are used to light massive cigars)\n\n[Probably]",
            "title_similarity": "0.65807474",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gw2m5nh",
            "score": -1,
            "text": "Isnt this what Americans want tho? Capitalism? Hate the system too, not only the players",
            "title_similarity": "0.45665962",
            "sentiment_compound": -0.5803
        },
        {
            "id": "gw273uo",
            "score": 9,
            "text": "Nestle takes ALL that water and doesn't pay for any of it. Why the author couldn't point this out is a mystery to me.",
            "title_similarity": "0.46816847",
            "sentiment_compound": 0.0762
        },
        {
            "id": "gw226en",
            "score": 93,
            "text": "Almost no one should be buying bottled water anyway. It's so unnecessary for the majority of people who buy it.\n\nJust buy a water filter or something if you don't like the taste of tap water. Tap water in the US is generally very safe and it's easy enough to figure out if you live where it isn't.",
            "title_similarity": "0.4288702",
            "sentiment_compound": 0.4724
        },
        {
            "id": "gw2iuqu",
            "score": 11,
            "text": "I know everyone loves to hate on Nestle.\n\nBut they are pumping millions of gallons of water for *people to drink.*\n\nWhile billions of gallons are used to grow almonds, billions on landscape irrigation and billions for beef cattle.\n\nIf you're looking for water waste, you're looking in the wrong place.",
            "title_similarity": "0.7303918",
            "sentiment_compound": -0.8338
        },
        {
            "id": "gw272y2",
            "score": 3,
            "text": "Obligatory Fuck Nestle.",
            "title_similarity": "0.39033094",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw2e8d4",
            "score": 3,
            "text": "Stop buying All Nestle products. That's a start. It's really not that hard to put your money where your mouth is.",
            "title_similarity": "0.3907486",
            "sentiment_compound": -0.1631
        },
        {
            "id": "gw2s30s",
            "score": 3,
            "text": "Charge them with crimes against humanity. They are depriving people of a basic human need. Fuck Nestle!",
            "title_similarity": "0.49158794",
            "sentiment_compound": -0.7777
        },
        {
            "id": "gw2uspe",
            "score": -3,
            "text": "\"Drought hits la, the biggest shit hole in American and orders nestle to stop pumping millions of gallons of water so they can make sure celebrities  can fill their pools \"",
            "title_similarity": "0.8763317",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw23nge",
            "score": -13,
            "text": "That’s funny, doesn’t California steal their water from other places, too?",
            "title_similarity": "0.43501973",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gw2b9ux",
            "score": -3,
            "text": "solar powered desalination plants when? droughts are a solved problem that's being fought against by ruthless capitalists.",
            "title_similarity": "0.5624554",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gw2e96j",
            "score": 0,
            "text": "Hint: they won't stop",
            "title_similarity": "-0.031409495",
            "sentiment_compound": 0.2235
        },
        {
            "id": "gw2lvgg",
            "score": 0,
            "text": "Good start.  Now stop the almond farmers from sending most of their products to China using our water to grow it.",
            "title_similarity": "0.56398296",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gw2nhte",
            "score": 0,
            "text": "Suprise suprise, nestle with another piece of shit, selfish, greedy move.",
            "title_similarity": "0.2969036",
            "sentiment_compound": -0.8402
        },
        {
            "id": "gw2oikg",
            "score": 0,
            "text": "Mother nature gave us this beautiful planet full of resources and humans found a way to Fight over it all for money. We are doomed",
            "title_similarity": "0.47270316",
            "sentiment_compound": -0.2903
        },
        {
            "id": "gw2or2u",
            "score": 0,
            "text": "Well huh... easy solutions for complex problems.",
            "title_similarity": "-0.07613427",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gw2pjyj",
            "score": 0,
            "text": "Their water tastes gross. Who keeps on buying it?",
            "title_similarity": "0.45972458",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gw2plx4",
            "score": 0,
            "text": "58 million gallons a year might sound like a lot, but the river has an average flow of 1438 million gallons every single day.",
            "title_similarity": "0.5247289",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gw2rqgo",
            "score": 0,
            "text": "california being dogshit yet again 😹",
            "title_similarity": "0.39313233",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw2u3jx",
            "score": 0,
            "text": "Literally the worst tasting water by far. Kick them out of CA please",
            "title_similarity": "0.5789625",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gw2vyux",
            "score": 0,
            "text": ">Nestlé, which is based in Switzerland\n\n\neuropeans stealing American resources\n\n\nfuck them",
            "title_similarity": "0.52323186",
            "sentiment_compound": -0.802
        },
        {
            "id": "gw304zy",
            "score": 0,
            "text": "Really? Now they restrict Nestle??",
            "title_similarity": "0.33895016",
            "sentiment_compound": -0.5273
        },
        {
            "id": "gw34s9b",
            "score": 0,
            "text": "It seems as if it's about time",
            "title_similarity": "-0.033169776",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw34zjm",
            "score": 0,
            "text": "Fuck nestle the fucking pieces of dicks",
            "title_similarity": "0.33377767",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw35myy",
            "score": 0,
            "text": "It'd be great if the rest of the states would do this before the groundwater tables ran dry.  Stop fracking while they're at it.",
            "title_similarity": "0.5558528",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw35nze",
            "score": 0,
            "text": "If the State of California is making this illegal then why don't they seize all the water that gets bottled from there? Seems like they could just confiscate every bottle.",
            "title_similarity": "0.6211616",
            "sentiment_compound": -0.4118
        },
        {
            "id": "gw35o0m",
            "score": 0,
            "text": "You mean to tell me draining an entire states water supply and selling it at an inflated price to other states is a bad thing that has consequences?!?",
            "title_similarity": "0.62930375",
            "sentiment_compound": -0.6312
        },
        {
            "id": "gw367y8",
            "score": 0,
            "text": "I live in Columbus Ohio. We have very clean and very safe tap water. Sometimes it tastes too much like chlorine, so I bought a big ass Brita filter and I save my filters to send back to them once a year with their free shipping label to be recycled. It absolutely infuriates me when I see people buying packages upon packages of water bottles in this area. There is no use for it at all. Stop fucking buying bottled water. Get yourself a filter if you have issues with the taste or some crystal light powder and get a nice double walled reusable water bottle or tumbler. It will keep ice in your water for over 24 hours if not in direct sunlight. \n\n&#x200B;\n\nFUCK I hate Nestle.",
            "title_similarity": "0.6119703",
            "sentiment_compound": -0.4098
        },
        {
            "id": "gw36axp",
            "score": 0,
            "text": "Come on guys give Nestle a break. They posted the blackout Tuesday box on theri social media. They practically deserve the water. This is obviously being pushed as a backlash for Nestles strong support of social justice.",
            "title_similarity": "0.4962607",
            "sentiment_compound": 0.8555
        },
        {
            "id": "gw39826",
            "score": 0,
            "text": "This is good, but we also need to stop dumping trillions of gallons of fresh water into the ocean hoping to save these 4 or 5 small fish.",
            "title_similarity": "0.5830061",
            "sentiment_compound": 0.7992
        },
        {
            "id": "gw3ec91",
            "score": 0,
            "text": "Why do y'all live in desert?",
            "title_similarity": "0.25003794",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3hji2",
            "score": 0,
            "text": "Mean while California politicians in local and state positions, still allows new housing developments to be built.",
            "title_similarity": "0.3911081",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3j0eg",
            "score": 0,
            "text": "Water for bottling does not impact general water availability. Bottling takes very little water. Bottling plants are situated in spots that are not drought prone. Stopping Nestle from bottling will have no effect on water availability. Its only a political ploy",
            "title_similarity": "0.32036313",
            "sentiment_compound": -0.1916
        },
        {
            "id": "gw3oud7",
            "score": 0,
            "text": "California and drought, name a more iconic duo",
            "title_similarity": "0.41290182",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3tfyb",
            "score": 0,
            "text": "Another drought in California? I can’t believe it",
            "title_similarity": "0.6278653",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3v1s9",
            "score": 0,
            "text": "Reddit love to bitch and moan, but continues to buy their products",
            "title_similarity": "0.29962745",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gw3zqhy",
            "score": 0,
            "text": "California doesn’t own the water",
            "title_similarity": "0.41741282",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4fsm3",
            "score": 0,
            "text": "58 million gallons a year is nothing.  It's a small creek.  A hundred acres of farmland uses that much for irrigation.",
            "title_similarity": "0.5506485",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4t5z3",
            "score": 0,
            "text": "Nestle using 58 million of gallons of water isn't going to make a difference in California's water supply. Not saying that they should be going that far over their limit, not saying they should be legally allowed to use that much water during a drought, but 1 million gallons isn't much at all, and 58 million gallons in a year is a drop in a bucket. However, something like tackling a drought is a group effort",
            "title_similarity": "0.5942514",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw4zvvp",
            "score": 0,
            "text": "You all are hilarious.  You know 100% of their water... is for people to drink right?  What does everyone want, for humans to stop drinking water?\n\nIf we need to ban something it should be car washes, or showers, or washing machines or golf courses.  The last thing you want to stop is drinking water.  \n\nBut I get it.  It’s Reddit so Big company bad.",
            "title_similarity": "0.6990421",
            "sentiment_compound": -0.8341
        },
        {
            "id": "gw26abu",
            "score": 82,
            "text": "Single use plastic water bottles should be banned.",
            "title_similarity": "0.4965402",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gw2bg9m",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.22236207"
        },
        {
            "id": "gw2aqo4",
            "score": 6,
            "text": "That mount Shasta water is being tapped by several bottling companies.",
            "title_similarity": "0.4235699",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw27vfs",
            "score": 33,
            "text": "Everyone can high-five themselves, but stopping Nestle from pumping 58 million gallons a year isn’t going to mean squat when hundreds of Billions are lost just due to evaporation; not to mention farming and golf course watering.\n\nIf Nestle went bankrupt tomorrow and didn’t draw another drop, California would still be screwed because their water problems are climate driven, not industry driven.",
            "title_similarity": "0.6827785",
            "sentiment_compound": -0.965
        },
        {
            "id": "gw1yrg3",
            "score": 5,
            "text": "That's only twenty years overdue.",
            "title_similarity": "0.29267213",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw29p83",
            "score": 6,
            "text": "All will be forgotten when nestle slips them a few million dollars right?",
            "title_similarity": "0.6145058",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gw24sve",
            "score": 186,
            "text": "Cool! Now dissolve the fucking company",
            "title_similarity": "0.5023732",
            "sentiment_compound": 0.3802
        },
        {
            "id": "gw27sgy",
            "score": 1,
            "text": "Nestle needs to pack their shit and get out...of existing",
            "title_similarity": "0.371657",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gw29at5",
            "score": 1,
            "text": "Send in the national guard and shut em down. They’ve been stealing our water for too long.",
            "title_similarity": "0.669685",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gw29bhc",
            "score": 1,
            "text": "Nestle should invest in desalination technology study to see if there's a way to pop a plant on the shoreline, instead of stealing water from other places",
            "title_similarity": "0.3403515",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gw2a8f1",
            "score": 1,
            "text": "Earlier we read about Nestle’s easy access to California fresh water. A bit earlier than that, we read about unprecedented drought in the pacific north west. It’s not rocket science",
            "title_similarity": "0.6296774",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gw2aeyx",
            "score": -1,
            "text": "Arrowhead should abide by this mandate too!",
            "title_similarity": "0.04916255",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2al88",
            "score": -1,
            "text": "Is there an emergency declaration? Seems scary that the government can control a company in this way.",
            "title_similarity": "0.4551462",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gw2b77a",
            "score": -1,
            "text": "'Last year the company drew out about 58m gallons, far surpassing the 2.3m gallons per year it could validly claim.'\n\nImagine if youre not a billion dollar company and do 200mph on a 10mph road, youd never be allowed to drive, get sent to jail.. etc.\nHowever if you are a Nestle sized company you pay some relatively miniscule fine an keep extorting resources (human, environmental, whatever).",
            "title_similarity": "0.68416023",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gw2blod",
            "score": 1,
            "text": "We should probably just switch to forcing these companies to desalinate either seawater, or have to clean and decontaminate domestic wastewater and storm drains to use as bottled water.\n\nNo more artisinal / creek / river water. Only absolutely dumped effluent, or the toilet that never flushes - the ocean, as a source for bottled water.",
            "title_similarity": "0.6222494",
            "sentiment_compound": -0.3597
        },
        {
            "id": "gw2e5ax",
            "score": -1,
            "text": "I get the outrage but agriculture is by far the biggest water waster. What Nestle is doing is probably orders of magnitude less than farmers.",
            "title_similarity": "0.6103785",
            "sentiment_compound": -0.2846
        },
        {
            "id": "gw2e6km",
            "score": 1,
            "text": "I wonder if anyone knows how much water is being used daily? People love getting riled up about \"millions of gallons\" but it's honestly nothing. \n\nDo you drink alcohol? That takes more water to produce. Do you wear clothes? That takes more water to produce. Do you eat fruit? That takes WAAAAAAAAY more water to produce. By weight, bottled water is about the least water-consuming product out there.",
            "title_similarity": "0.5724507",
            "sentiment_compound": 0.8205
        },
        {
            "id": "gw2ed0c",
            "score": 1,
            "text": "Let’s remember that Nestlé is the definition of a piece of shit company that deserves nothing but failure",
            "title_similarity": "0.49545604",
            "sentiment_compound": 0.3078
        },
        {
            "id": "gw2gfcy",
            "score": 1,
            "text": "How about Nestle just fuck off in general.  How does that sound?  — Former Great Lakes State Resident",
            "title_similarity": "0.48090163",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gw2iv4y",
            "score": 1,
            "text": "the whole idea of bottled water is a huge slap in the face for anyone who cares about the environment. but the water consumption of $58 million gallons per YEAR is not the problem. California manages 1.3 x 10^13 gallons of water a year.  this is 0.0005% of the water for the state.  One semiconductor fab can use about 5 million gallons per DAY.",
            "title_similarity": "0.6204414",
            "sentiment_compound": 0.8701
        },
        {
            "id": "gw2j5uq",
            "score": 1,
            "text": "r/fucknestle\n\nActual sub with over 104k subscribers, so... relevant?",
            "title_similarity": "0.4074977",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2j6p8",
            "score": 1,
            "text": "Awwwwwww is sumudys fwee market being bad!",
            "title_similarity": "0.3660314",
            "sentiment_compound": -0.5848
        },
        {
            "id": "gw2k0s0",
            "score": 1,
            "text": "It's sad that they have to be ordered. Like deadproof conscience and business don't often go hand in hand  like if they dont look at news reports and just stop OR have a built in mechanism to tell them when they should stop thats just blatant greed.",
            "title_similarity": "0.4512782",
            "sentiment_compound": -0.5615
        },
        {
            "id": "gw2l0yf",
            "score": 1,
            "text": "Yet another headline that we should have read back in 2010.",
            "title_similarity": "0.21701615",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2lrsz",
            "score": -1,
            "text": "If you guys think Nestle is bad you should see how much water the irrigation districts pump *monthly* in the Central Valley.",
            "title_similarity": "0.68033504",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw2lw88",
            "score": -1,
            "text": "Why didn't they do this a long time ago? Lmfao",
            "title_similarity": "0.27757895",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gw2o4n8",
            "score": -1,
            "text": "Looks like its time for another major corporation to leave CA.",
            "title_similarity": "0.43268394",
            "sentiment_compound": 0.2585
        },
        {
            "id": "gw2ocow",
            "score": 1,
            "text": "Nestle isn't known for following orders. May need to call in a drone strike.",
            "title_similarity": "0.37336814",
            "sentiment_compound": -0.128
        },
        {
            "id": "gw2osif",
            "score": 1,
            "text": "And maybe let’s get rid of the thousands of golf courses that use so much water.... that would be cool too",
            "title_similarity": "0.49339357",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw2ppc9",
            "score": 1,
            "text": "Stop “stealing” water - helped edit your headline",
            "title_similarity": "0.43797153",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2pzxb",
            "score": -1,
            "text": "Are regular citizens penalized in similar manner? I don't think so. Nestle should sue.",
            "title_similarity": "0.4679805",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2rcfx",
            "score": 1,
            "text": "Why do people even buy bottle water anymore?",
            "title_similarity": "0.44252908",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2vkkp",
            "score": -1,
            "text": "The amount of water Nestlé takes is inconsequential compared to the amount used by agriculture.\n\nEdit: dairy and beef being the worst offenders",
            "title_similarity": "0.55671585",
            "sentiment_compound": -0.765
        },
        {
            "id": "gw34u49",
            "score": 1,
            "text": "Tony Won Lee is the person to look up here. He's the face of one rock, the company that purchased Poland spring and two other companies owned by nestle that bottle water.",
            "title_similarity": "0.438484",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gw364wi",
            "score": 1,
            "text": "Obligatory r/FuckNestle",
            "title_similarity": "0.27275702",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3g894",
            "score": 1,
            "text": "Hey fucking morons: Stop buying bottled water. You're destroying the planet.",
            "title_similarity": "0.6903942",
            "sentiment_compound": -0.8258
        },
        {
            "id": "gw3ktat",
            "score": 1,
            "text": "Don’t buy from Nestle. It’s really that simple. Unfortunately, America.......",
            "title_similarity": "0.30760914",
            "sentiment_compound": -0.3947
        },
        {
            "id": "gw3n31r",
            "score": -1,
            "text": "This is so dumb. You guys would be shocked at how much water it takes to irrigate just 1000 acres of almonds. And then go see how many acres of walnuts and almonds and pecans we have in the valley. Then compare that to how much water is bottled. This is bullshit.",
            "title_similarity": "0.6788434",
            "sentiment_compound": -0.8845
        },
        {
            "id": "gw3neoe",
            "score": -1,
            "text": "If the money grubbing scum that oversee the distribution of water and irrigation would build a few desalination plants and pipelines to deliver water where its needed, there wouldn't be a water problem in Calif*ckya. Shithole.",
            "title_similarity": "0.44743136",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gw3ph7x",
            "score": -1,
            "text": "Too many people are in southern Cali drinking our American water",
            "title_similarity": "0.46688646",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3psaw",
            "score": 1,
            "text": "Yet people still water fields for cattle.",
            "title_similarity": "0.19842847",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3rpeq",
            "score": 1,
            "text": "I see it so often everyone hates nestle for taking all the water.  But isnt 58 million gallons like... nothing?  It sounds like a large amount but its literally 0.1% of the smallest Lake in CA.  Its not only irrellevant, its a scapegoat.",
            "title_similarity": "0.68508184",
            "sentiment_compound": -0.6183
        },
        {
            "id": "gw3t8no",
            "score": 1,
            "text": "I live in Michigan near several springs that Nestle pumps waters from. They are liars for selling their way in through promises of jobs that never came to be. They blew right through the small time inexperienced township councils to take our natural resources and give little compensation back to the environment they are taking it from. I went on travel to FL High Sorings this year to find them siphoning it off there. I didn’t realize how much of this country is just giving this liquid gold away. It is heartbreaking.",
            "title_similarity": "0.6649558",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gw42y5b",
            "score": -1,
            "text": "The Millions of Gallons that they pump sounds like lot.. But it isn't. Compared with How much water is wasted on stupid shit elsewhere.",
            "title_similarity": "0.6477593",
            "sentiment_compound": -0.9331
        },
        {
            "id": "gw4750w",
            "score": 1,
            "text": "People that buy water are stupid. End of discussion.",
            "title_similarity": "0.5328658",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gw2agwa",
            "score": 47,
            "text": "The amount of water being used by them is less than a single golf course in California.  https://www.cbsnews.com/news/california-drought-takes-toll-golf-course-water-supply/",
            "title_similarity": "0.5481127",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw29p1q",
            "score": 23,
            "text": "I still remember back in 2015 or so when California was in the same drought situation, the local government focused on making the people aware to take shorter showers, use less when washing dishes or your car, etc. And then it was found the entire general population of the state use an insignificant amount of water compared to corporations....\n\nHeck they even tried to go after farms before corporations. Hope they dont make the same mistake",
            "title_similarity": "0.6802459",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gw2a1eo",
            "score": 8,
            "text": "Nestle's usage of water is literally a drop in the bucket compared to how much water agriculture uses.",
            "title_similarity": "0.49100572",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gw2dm2p",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.22236207"
        },
        {
            "id": "gw21o1y",
            "score": 2,
            "text": "About goddamned time. Holy shit, the last major drought Nestle was bottling our water and selling it out of state and the government did absolutely nothing about it.",
            "title_similarity": "0.78720844",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gw2548d",
            "score": 2,
            "text": "That's good news but it really doesnt seem like that much.\n\n58 million gallons is about 220k m³, or about a 500 square meter area 1 meter deep. Enough to cover about 50 football fields in 1 meter of water or 37 acres.\n\nStill its enough to supply some 750k people, or 370 million bottles of water a year. \n\nHopefully see see more cases like this.",
            "title_similarity": "0.49657077",
            "sentiment_compound": 0.7275
        },
        {
            "id": "gw26bs7",
            "score": 2,
            "text": "Why let them do it in the first place?",
            "title_similarity": "0.08533673",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw27u07",
            "score": -2,
            "text": "About effing time!! Stop nestle from robbing states water!!!!!!",
            "title_similarity": "0.60761327",
            "sentiment_compound": -0.5642
        },
        {
            "id": "gw27uf0",
            "score": -2,
            "text": "Taking water from rivers, leaving plastics in our landfills, remind me again what good these companies do for our society?? \n\n/s",
            "title_similarity": "0.52377963",
            "sentiment_compound": 0.504
        },
        {
            "id": "gw2axqo",
            "score": 2,
            "text": "Fuck Nestle.\nThat is all",
            "title_similarity": "0.29986537",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw2bpyc",
            "score": 2,
            "text": "Don't forget to order the farmers to stop growing almonds too. Each almond takes about a gallon of water to grow.",
            "title_similarity": "0.61245334",
            "sentiment_compound": 0.0428
        },
        {
            "id": "gw2bq4v",
            "score": 2,
            "text": "It might be better if everyone stopped buying bottled water.\n\nI know there have been some notable exceptions, however, Municipally treated water has standards that must be met.\n\nAFIK - No mandated standards exist for bottled water, and we also have the whole stored in plastic and waste issues added in.",
            "title_similarity": "0.503704",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gw2c1a9",
            "score": 2,
            "text": "We need to abolish privatized water",
            "title_similarity": "0.53677183",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2d5a6",
            "score": -2,
            "text": "Since when did water, sth vital to living beings, become someone's assets to exploit?",
            "title_similarity": "0.30309838",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw2dv8p",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.2774773"
        },
        {
            "id": "gw2g6i6",
            "score": 2,
            "text": "Not sure what they pay in California but Nestle pays about C$3.75 per MILLION liters in Canada, citing free trade as a reason they can absolutely rape the earth and only pay pennies for it.\n\nThese companies need to be held the the same standards and laws as everyone else, they've given way too many freedoms because of their lobbying power.",
            "title_similarity": "0.5284499",
            "sentiment_compound": -0.5378
        },
        {
            "id": "gw2j1xa",
            "score": 2,
            "text": "God I fucking hate nestle with every fiber of my being",
            "title_similarity": "0.49398583",
            "sentiment_compound": -0.4391
        },
        {
            "id": "gw2mbeg",
            "score": 2,
            "text": "This company is an embarrassment to society. They should be shut down for all the lives they intentionally ruined. The fact that people still buy nestle products is fucking insane. They would flat out murder you and your children if it meant they could make an extra dime. Fuck them. Boycott all nestle products.",
            "title_similarity": "0.66165483",
            "sentiment_compound": -0.9612
        },
        {
            "id": "gw2nsxf",
            "score": 2,
            "text": "58 million gallons per year. For context, Californians use 38 billion gallons of water per day. So this makes absolutely no difference in terms of a drought.",
            "title_similarity": "0.6046954",
            "sentiment_compound": -0.3597
        },
        {
            "id": "gw2o54u",
            "score": -2,
            "text": "Not that I like corporations or anything, wouldn’t you first clamp down on all those idiots with pools, fake lakes around their homes, and car washes before drinking water?",
            "title_similarity": "0.6346165",
            "sentiment_compound": -0.6381
        },
        {
            "id": "gw2o7f0",
            "score": -2,
            "text": "And now food prices go up",
            "title_similarity": "0.17225067",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2sl5t",
            "score": 2,
            "text": "Why does everyone pick on Nestle? What about the entire soft drink industry? Cuz you know, it's all water.",
            "title_similarity": "0.46247348",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw34n7m",
            "score": -2,
            "text": "Way too many people live in California. There is not enough water to support them all and if climate change is as bad as the democrats says than the problem will only get worse",
            "title_similarity": "0.69068515",
            "sentiment_compound": -0.765
        },
        {
            "id": "gw34x7g",
            "score": 2,
            "text": "Increase the fines to 100k and 1 million a day during a drought. Implement criminal punishment for senior leadership for willful disobedience.",
            "title_similarity": "0.6881361",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gw4a307",
            "score": 2,
            "text": "Fuck Nestle!! Let’s kick them out of this country entirely.",
            "title_similarity": "0.524272",
            "sentiment_compound": -0.6229
        },
        {
            "id": "gw4aadz",
            "score": 2,
            "text": "Bout time fuck nestle",
            "title_similarity": "0.31339952",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw5m5rz",
            "score": 2,
            "text": "Eat shit Nestle. While you're at it get the fuck out of the Great Lakes, too.",
            "title_similarity": "0.533224",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gw64fps",
            "score": 2,
            "text": " If it's that bad, which it is, stop buying Nestle.  In my day 'canceling' someone was called a boycott and they worked when people put their outrage into their wallets and changed their buying habits.  \n\nThe last major Nestle boycott I'm aware of was in the 80s when Nestle was selling baby formula to impoverished women in Africa who had no potable water.  Their babies were sick and dying from the bad water and because they had already been weaned the mothers had no milk to switch back to.  Nestle kept promoting to them.  European mothers heard what was happening and were furious and they started boycotting first.  The states were late to the boycott but joined in too.  Eventually Nestle quit.  Not because of corporate fines but because of consumer activism.  You hold the same power today.  In fact, your dollar is worth more than your presidential vote.  Don't get mad at the corporations for doing what makes them money.  Get mad at your neighbor for  buying Nikes.  Get mad at your mom for buying Nestle water.  The corporations are going to do whatever works to get your dollar.  I don't blame them.  I blame the people who encourage and enable the practices.",
            "title_similarity": "0.7063544",
            "sentiment_compound": -0.933
        },
        {
            "id": "gw6a0xq",
            "score": 2,
            "text": "Nestle is not the only bad apple out there. Almonds are a water-intensive crop and CA is\nResponsible for 80% of the WORLD’s supply! \n\nHere’s another: growing rice requires lots of water too, and Californian farmers not only grow it, but also EXPORT their crop to Japan, who is so not in need of foreign rice it’s not even funny. You have to have a wet climate with a proper rainy season to be able to grow rice, and CA most certainly doesn’t have that. \n\nSeriously, fuck the Central Valley.",
            "title_similarity": "0.64223325",
            "sentiment_compound": -0.6353
        },
        {
            "id": "gw2cy9x",
            "score": 10,
            "text": "[deleted]",
            "title_similarity": "0.2774773"
        },
        {
            "id": "gw28v8i",
            "score": 59,
            "text": "Ban the sale and export of bottled water in CA.",
            "title_similarity": "0.61048406",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gw2at0z",
            "score": -2,
            "text": "I live in CA and I’m surprised we are in a drought. It’s been very rainy this season. Also, not sure if the sale of nestle water has anything to do with this decision...  \n\nIn case you were curious:\n\nhttps://www.globenewswire.com/news-release/2021/02/17/2176702/0/en/Nestlé-continues-strategic-transformation-of-water-business-agrees-on-sale-of-Nestlé-Waters-North-America-brands.html",
            "title_similarity": "0.634852",
            "sentiment_compound": 0.1643
        },
        {
            "id": "gw2gl5q",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.2774773"
        },
        {
            "id": "gw2lcch",
            "score": 3,
            "text": "I hate Nestle and everything about them and every company they own.",
            "title_similarity": "0.5928732",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gw2nvs2",
            "score": 3,
            "text": "This company can’t be contributing anything near the amount of money and resources they suck from the state. It’s clear they have politicians in their pockets, in which case the voters need to boot anyone in support of this company or they’ll suck the state fucking dry.",
            "title_similarity": "0.6104551",
            "sentiment_compound": -0.128
        },
        {
            "id": "gw2r9eb",
            "score": 3,
            "text": "Daily reminder that Fuck Nestlé. 😊",
            "title_similarity": "0.41888136",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw2w97n",
            "score": -3,
            "text": "> 58m gallons\n\nThat's what, 1/1000th of 1% of all the water CA uses on agriculture? Drought solved by the genius politicians, thanks guys!",
            "title_similarity": "0.54371643",
            "sentiment_compound": 0.6476
        },
        {
            "id": "gw2whvc",
            "score": 2,
            "text": "Stop buying this company's products. They are a menace.\n\nhttp://www.babymilkaction.org/nestle-boycott-list",
            "title_similarity": "0.57828057",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw3srgu",
            "score": -3,
            "text": "Why the hell is Nestle under the gun here? 1 Liter water makes 1 Liter drinkable water. (And much of that water ends up irrigation parks etc)    \nHowever:   \n1 kg beef requires 20 000 Liters   \n1 kg almonds requires 16 100 Liters   \n1 L Wine requires 5 liters of water   \n\nMaybe there are many companies we should stop  before Nestle here?",
            "title_similarity": "0.69249785",
            "sentiment_compound": -0.7029
        },
        {
            "id": "gw3xpp8",
            "score": 4,
            "text": "Nestle needs to go. Go pump water from the damn Amazon or something. You cant syphon off people's water, and then try to sell it to them. This some fucking \"old white guy whith a handlebar moustache\" shit right here. How the fuck is this legal?!? Like \"Oh, you ain't got no water?!? You wanna buy this water? I definently didnt drain your reservoir to get it. Just give me a dollar, bitch.\" This is fucking clown shit.",
            "title_similarity": "0.66482234",
            "sentiment_compound": -0.9375
        },
        {
            "id": "gw1upxw",
            "score": 372,
            "text": "I wish they would do the same thing in Florida for Nestle and other companies pumping water out of the springs while the rest of the state is concerned about fresh water.  Sadly the governor down here will do anything to line his own pockets, so the citizens don't stand a chance.",
            "title_similarity": "0.56807125",
            "sentiment_compound": 0.1179
        },
        {
            "id": "gw24kto",
            "score": 5,
            "text": "Nestlé: “How bout I do, anyways?”",
            "title_similarity": "-0.0046828203",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2aemt",
            "score": -5,
            "text": "No, the company should be seized if they continue to pump water during a drought. You die after 3 days without water.\n\nNestle is playing God and this is not only a threat to the US national security but also an infringement on the rights of every American for the right to life, liberty, and the pursuit of happiness.\n\nWe are quickly approaching a climatic apocalypse, any company taking control of or polluting resources so important to human existance should be considered a threat.",
            "title_similarity": "0.76270664",
            "sentiment_compound": 0.7084
        },
        {
            "id": "gw2ia2x",
            "score": 4,
            "text": "They don't stop pumping, shut them down. Fines don't work for multi billion dollar company's. Shut them the fuck down.",
            "title_similarity": "0.6943232",
            "sentiment_compound": -0.3843
        },
        {
            "id": "gw2nuay",
            "score": 4,
            "text": "I worked for Nestle. My facility received fines monthly for polluting the water. Just another monthly business expense at the cost of the local environment.",
            "title_similarity": "0.68427867",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2jab9",
            "score": 5,
            "text": "Nestlé doesn't sell water, they sell plastic bottles that will float around our oceans for a thousand years.",
            "title_similarity": "0.61436987",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2jyaz",
            "score": 5,
            "text": "Who tf is still buying bottled water? Stop. For so many reasons.",
            "title_similarity": "0.5319969",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2mhww",
            "score": 5,
            "text": "Fffuuccckkk nestle. Stopped drinking their water like 10 yrs back",
            "title_similarity": "0.67713237",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gw2xp69",
            "score": 5,
            "text": "Seriously, fuck Nestle.\n\nI grew up eating their candy bars and sometimes when I see one at the store I get the urge to purchase one but then I remember how evil they are and I withhold my purchase.\n\nBoycott Nestle products. Nothing they do is good or good for the planet.",
            "title_similarity": "0.53221285",
            "sentiment_compound": -0.6059
        },
        {
            "id": "gw37c8x",
            "score": 4,
            "text": "Nestle is the first company that needs the government to roll in and just take over their whole fucking operation and shut that kind of shit down. Nestle has proven it is a literal danger to human life on this planet and needs to be reined the fuck in.",
            "title_similarity": "0.5663572",
            "sentiment_compound": -0.8955
        },
        {
            "id": "gw3k0be",
            "score": 4,
            "text": "Those fines are laughable.  How about this instead:\n\nThe fine starts at $1000 on the first day.  Then it doubles.  Every day.\n\nThat's a million dollar fine for the 11th day alone.  A billion dollars on the 21st day.  Half a trillion by the end of the month.",
            "title_similarity": "0.5698893",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw3le2e",
            "score": 5,
            "text": "Stop fining businesses and revoke their entire privilege to conduct business. See how far Nestle gets when *each* business transaction is grounds for lawsuits",
            "title_similarity": "0.59004664",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gw3qmio",
            "score": 4,
            "text": "I feel like I'm going to live long enough to see large scale war over resources, especially water and aerable land",
            "title_similarity": "0.39426726",
            "sentiment_compound": -0.34
        },
        {
            "id": "gw3urff",
            "score": 6,
            "text": "Just send in the military and shut the place down. Turn off the taps on the outside.",
            "title_similarity": "0.5944911",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw31ffn",
            "score": 7,
            "text": "People should be beyond outraged at this. Nestle shouldent even be allowed to any draw water from a drought prone area to begin with.",
            "title_similarity": "0.5093308",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw2pp69",
            "score": 7,
            "text": "It’s about goddamn time. Fuck nestle",
            "title_similarity": "0.26057452",
            "sentiment_compound": -0.765
        },
        {
            "id": "gw3msgu",
            "score": 8,
            "text": "So the states can use eminent domain to seize private property to build highways, sports stadiums and whatever the fuck.  Why don't they use eminent domain to retake the State's water supplies from these assholes so the citizens of the state have some fucking water to drink?",
            "title_similarity": "0.55188185",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gw2h8v5",
            "score": 46,
            "text": "[deleted]",
            "title_similarity": "0.2774773"
        },
        {
            "id": "gw2jczf",
            "score": 11,
            "text": "Seriously, if you’re buying a home. It needs to include a well or some type of free flowing water. The fact water is being traded on the stock market is a sign of bad things to come for your families later generations.",
            "title_similarity": "0.5724045",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gw2sf6k",
            "score": 11,
            "text": "Many of the companies doing this shit are so obscenely rich that the fines do less than nothing.  It's time to put jail on the table, if they violate environmental laws and steal resources the company execs should face actual criminal charges with the possibility of incarceration.  If we're going to back off the edge of an environmental precipice, it's time to come down hard on conglomerates and the entire system of overproduction and waste.",
            "title_similarity": "0.55998826",
            "sentiment_compound": -0.9379
        },
        {
            "id": "gw2b174",
            "score": 34,
            "text": "As long as there is a demand for bottled water, companies will do whatever they can to fulfill that demand...Imagine if we just stopped buying Costco pallets of bottled water.",
            "title_similarity": "0.44122094",
            "sentiment_compound": 0.128
        },
        {
            "id": "gw2b0u0",
            "score": 17,
            "text": "Fuck Nestlé obviously but isn't animal agriculture, especially beef, using up the vast majority of water in California?",
            "title_similarity": "0.64442843",
            "sentiment_compound": -0.3071
        },
        {
            "id": "gw26sux",
            "score": 18,
            "text": "Yeah they aren't going to stop until executives get arrested and the national guard blows up the extraction and bottling facilities.\n\nFibes don't work on multiple billionaire dollar corporations",
            "title_similarity": "0.64993984",
            "sentiment_compound": -0.0031
        },
        {
            "id": "gw1y9vj",
            "score": 335,
            "text": "Probably ~~Nestle~~  Metropoulos & Co: We are too big to fail, but California isn't.",
            "title_similarity": "0.3043969",
            "sentiment_compound": -0.3071
        },
        {
            "id": "gw1yyor",
            "score": 862,
            "text": "> It paid the Forest Service a permit fee of $2,100 per year, but had been pumping water for free.\n\nMy small business pays more for its water bills at our commercial building than this. And we barely use any water.",
            "title_similarity": "0.5748484",
            "sentiment_compound": 0.6652
        },
        {
            "id": "gw2cot8",
            "score": 462,
            "text": "Friendly reminder that Nestle doesn't make water, they make plastic.",
            "title_similarity": "0.28828162",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gw2gs2e",
            "score": 61,
            "text": "Ah yes, the avocado trees.\n\n320 liters of water for one avocado...\n\nAvocado is stealing our water",
            "title_similarity": "0.6867315",
            "sentiment_compound": -0.25
        },
        {
            "id": "gw1xojp",
            "score": 1482,
            "text": "They literally can send the sheriff to shut it off. And I hope they padlock it",
            "title_similarity": "0.50329196",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw1zg23",
            "score": 2785,
            "text": "this quote is kind of relevant, and it blew my mind when I read it:\n\nbottled water companies don't make water; they make plastic bottles.",
            "title_similarity": "0.4690982",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2hoa3",
            "score": 69,
            "text": "No private company should have unlimited use of a public necessity. All contracts should be clear that the public need supercedes their own, and their level of supply will be continually reviewed as need changes.",
            "title_similarity": "0.3993972",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gw2dqg1",
            "score": 28,
            "text": "Fuck Nestle but read the article. They sold their water brands off last year so they are no longer owned by them. \n\nI don't know why people don't just buy a water filter and stop buying bottled water (assuming the tap water is fine) but that's an entirely different debate.",
            "title_similarity": "0.7033419",
            "sentiment_compound": -0.7223
        },
        {
            "id": "gw2ggng",
            "score": 33,
            "text": "It’s really time for consumers to stop buying bottled water. There are ways to drink great, filtered water that’s eco friendly and avoid corporations like Nestle to make profits at the expenses of public welfare.",
            "title_similarity": "0.55560064",
            "sentiment_compound": 0.8519
        },
        {
            "id": "gw26sw9",
            "score": 648,
            "text": "Unless they are being fined  BILLIONS, they won't give a shit.",
            "title_similarity": "0.46585315",
            "sentiment_compound": 0.4449
        },
        {
            "id": "gw2bsku",
            "score": 982,
            "text": ">\tNestlé has maintained that its rights to California spring water dates back to 1865. But a 2017 investigation found that Nestlé was taking far more than its share. Last year the company drew out about 58m gallons, far surpassing the 2.3m gallons per year it could validly claim.\n\n>\tNestlé has sucked up, on average, 25 times as much water as it may have a right to, according to the Story of Stuff Project, an environmental group that has been fighting to stop the bottled water company’s pumping in California for years\n\nFuck Nestlé so hard.\n\nEdit: a word",
            "title_similarity": "0.719484",
            "sentiment_compound": -0.928
        },
        {
            "id": "gw1x0ud",
            "score": 7757,
            "text": "They should do this whenever there is a drought. Also, whenever there is not a drought.",
            "title_similarity": "0.2163845",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2bgp2",
            "score": 3879,
            "text": "This is why fines as a deterrent don't work.  All fines should be based on income in this case the amount that nestle and all of its subsidiaries make per day.",
            "title_similarity": "0.5252711",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw276ew",
            "score": 3221,
            "text": "The fine should be a percentage of profits. Or company value.",
            "title_similarity": "0.25896734",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gw2b5dv",
            "score": 434,
            "text": "I swear I read this headline every year",
            "title_similarity": "0.387493",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gw1xzt5",
            "score": 31413,
            "text": "Nestle could face a $1000 a day fine.  $10,000 if a drought is declared. \n\nSomehow I don't think that's gonna stop them.",
            "title_similarity": "0.56366944",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw21628",
            "score": 2,
            "text": "This calls for plausible deniability.",
            "title_similarity": "-0.078349456",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw21862",
            "score": 2,
            "text": "*Fog nets above the warming oceans,\ncondense the mist of fresh water*",
            "title_similarity": "0.3341822",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw251ns",
            "score": 2,
            "text": "I saw this same news article, but titled in a way that made it seem like Nestle was making a good decision because they WANTED to, not because they had to. 🙄",
            "title_similarity": "0.20155725",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gw25olj",
            "score": 2,
            "text": "Isn't there a governor that can do something about this? lol",
            "title_similarity": "0.1403828",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gw26h5o",
            "score": 1,
            "text": "Calculate the Total Environmental Cost of each day of operation and make the fine equal to that plus $1000 each day. When you figure out that withdrawing 150k gallons of water a day causes $50k (this is a complete guess, whatever the calculated amount is) of environmental damage over a lifetime and fine Nestle more money than they would make from withdrawing that amount of water, they'll stop.",
            "title_similarity": "0.7356179",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gw2707u",
            "score": 1,
            "text": "🤣 when will states learn?",
            "title_similarity": "0.016083468",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gw271xv",
            "score": 1,
            "text": "Well that took WAY TOO LONG",
            "title_similarity": "0.26171398",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw272u9",
            "score": 1,
            "text": "About 30years too late",
            "title_similarity": "0.38939047",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw275zb",
            "score": 1,
            "text": "Good start, now correct them.",
            "title_similarity": "-0.04528699",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw27n95",
            "score": 2,
            "text": "On average, farms around the world account for 70% of all water that is consumed annually. Of that 70% used by farmers, 40% is lost to the environment due to poor irrigation systems, evaporation, and overall poor water management. But hay let's go after Nestle.",
            "title_similarity": "0.62942475",
            "sentiment_compound": -0.5789
        },
        {
            "id": "gw27oi2",
            "score": 1,
            "text": "$1,000 fine? Sure. Why not? Nestle's just gonna sell the water back to us with a little more sugar for a $10,000 profit.",
            "title_similarity": "0.5738681",
            "sentiment_compound": 0.7476
        },
        {
            "id": "gw27v0a",
            "score": 1,
            "text": "It's about fucking time.",
            "title_similarity": "0.05356741",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw27vfo",
            "score": 1,
            "text": "Why does California, a state that has disputes over water as some of the defining events in state history, allow water bottling operations?",
            "title_similarity": "0.571751",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gw2817g",
            "score": 1,
            "text": "Let's play a game! \n\nIt's called hide and go fuck yourself Nestlé",
            "title_similarity": "0.27243775",
            "sentiment_compound": -0.4753
        },
        {
            "id": "gw286p1",
            "score": 2,
            "text": "Nothing will change, this has been going on for the past 5-10 years.",
            "title_similarity": "0.24079113",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw287nr",
            "score": 1,
            "text": "Water bottling companies should pay at least 20% of the sticker price to pump.",
            "title_similarity": "0.578263",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw28ds7",
            "score": 1,
            "text": "Nestle water sucks anyway",
            "title_similarity": "0.3698128",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gw29awx",
            "score": 2,
            "text": "Probably should’ve done this long ago.",
            "title_similarity": "0.16351245",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw29ja4",
            "score": 1,
            "text": "Nestle: Steals even more water",
            "title_similarity": "0.47575188",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gw29o7p",
            "score": 2,
            "text": "Closing the stable door after the horse has bolted...",
            "title_similarity": "0.46420315",
            "sentiment_compound": 0.296
        },
        {
            "id": "gw29snn",
            "score": 2,
            "text": "They should have never allowed them to build out there in the first place... Now they will claim job loss..",
            "title_similarity": "0.49576697",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gw2aaas",
            "score": 1,
            "text": "Nestle* im gonna do whats called a pro gamer move",
            "title_similarity": "0.116149224",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2aly4",
            "score": 1,
            "text": "why dont they just cut their power like they did for covid for a  HUGE party",
            "title_similarity": "0.5813165",
            "sentiment_compound": 0.8421
        },
        {
            "id": "gw2au76",
            "score": 1,
            "text": "Note that Nestle sold their NA water company off. \nSource - https://www.usnews.com/news/business/articles/2021-02-18/nestle-selling-north-american-bottled-water-brands-for-43b",
            "title_similarity": "0.60687876",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2av36",
            "score": 2,
            "text": "Watch out Nestle! You might face a fine of up to 5% of the profits you're making on that water!",
            "title_similarity": "0.4291299",
            "sentiment_compound": 0.6467
        },
        {
            "id": "gw2ayxy",
            "score": 2,
            "text": "they can also m just close more than half of the gulf courses in Cali. They utilize so much damn water and provide no good profit.",
            "title_similarity": "0.55041593",
            "sentiment_compound": -0.7776
        },
        {
            "id": "gw2b1kr",
            "score": 2,
            "text": "**Somehow i don't believe the rich Californians will conserve water.**\n\nSure you can put a sign up, no one gonna do it lol",
            "title_similarity": "0.53178596",
            "sentiment_compound": -0.0062
        },
        {
            "id": "gw2b5bx",
            "score": 2,
            "text": "Nestlé: But we’re a corporation. You’re just a government.",
            "title_similarity": "0.32284647",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2beiq",
            "score": 3,
            "text": "Good, this parasite company got what was coming to them for not following the law for 30-odd years",
            "title_similarity": "0.5543543",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw2bgnm",
            "score": 2,
            "text": "Should have happened over a decade ago.",
            "title_similarity": "0.3519099",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2bslj",
            "score": 3,
            "text": "Where the hell is Captain Planet?",
            "title_similarity": "0.20046264",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gw2bta2",
            "score": 2,
            "text": "Fuck nestle, all my homies hate nestle",
            "title_similarity": "0.5514351",
            "sentiment_compound": -0.802
        },
        {
            "id": "gw2btws",
            "score": 1,
            "text": "Idk, 180 acre-feet is basically the same thing as 7.058 AF if you think about it. That's the difference between a household and a 100 acre farm.....",
            "title_similarity": "0.36706984",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw2bvtt",
            "score": 1,
            "text": "So CA's drought really is going on 30 years now?..",
            "title_similarity": "0.5416571",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2bw82",
            "score": 1,
            "text": "What’s Flint gonna drink now?!?",
            "title_similarity": "0.2694596",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2c1l2",
            "score": 2,
            "text": "Maybe do that but forever...",
            "title_similarity": "0.06656484",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2c4c5",
            "score": 1,
            "text": "Unless some actual law enforcement agency goes there to physically stop them, the law means nothing.\n\n'Oh we'll hit them in their pockets!'\n\nGood luck with that. Nestle could buy out California's debt",
            "title_similarity": "0.50589097",
            "sentiment_compound": 0.3595
        },
        {
            "id": "gw2c782",
            "score": 1,
            "text": "Keanu chungus is happy to see corporation fail",
            "title_similarity": "0.33198553",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gw2c7ko",
            "score": 1,
            "text": "Go pump a state with an abundance of water 💦, Why California??",
            "title_similarity": "0.47048026",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2c7rr",
            "score": 1,
            "text": "They should have done this a long time ago.\n\nI'm actually shocked California didn't tell them to stop sooner.\n\nIt must have been worth the money.",
            "title_similarity": "0.39287132",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gw2cjh6",
            "score": 1,
            "text": "How does a company get the rights to water in a forest?",
            "title_similarity": "0.23306185",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2ck48",
            "score": 2,
            "text": "Considering this country caters to corporations - nothing will happen.",
            "title_similarity": "0.33070314",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2cl9b",
            "score": 1,
            "text": "Wow! Finally! I always thought it was fucking stupid how the average person got hit with stringent water conservation rules, but Nestle could pump out water a ton of water for practically nothing.\n\n\nI can't wash my clothes when I want, but this huge company can just take millions of gallons of water out. Makes sense.",
            "title_similarity": "0.68544525",
            "sentiment_compound": 0.6171
        },
        {
            "id": "gw2cr2p",
            "score": 2,
            "text": "Is it illegal to tamper with illegally operating machinery?",
            "title_similarity": "0.16401598",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gw2czv4",
            "score": 1,
            "text": "Theyll keep doing it and just pay the 500k dollar fine. Pocket change",
            "title_similarity": "0.41158602",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gw2d2nz",
            "score": 2,
            "text": "I just had to comment and say r/FuckNestle.",
            "title_similarity": "0.24823278",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2d9yt",
            "score": 1,
            "text": "Honest question: have agricultural uses also been halted?",
            "title_similarity": "0.3112424",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gw2dbn7",
            "score": 1,
            "text": "I’m reading more on the Great Lakes compact and now REALLY appreciate why that happened after reading this.",
            "title_similarity": "0.23261772",
            "sentiment_compound": 0.8438
        },
        {
            "id": "gw2dc2o",
            "score": 2,
            "text": "Walmart water comes from san Diego municipal water. Says it on package. Why the hell are people buying so much bottled water for home use is confusing. All those plastic bottles with water sucked out of far away states.",
            "title_similarity": "0.64423704",
            "sentiment_compound": -0.8591
        },
        {
            "id": "gw2de5a",
            "score": 2,
            "text": "About time.\n\n*looks at the potential fines*\n\nOh. Fuck.",
            "title_similarity": "0.28864223",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw2dglx",
            "score": 1,
            "text": "How much water does it take to grow pot? Maybe that where the water is going.",
            "title_similarity": "0.34527737",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2dh5y",
            "score": 1,
            "text": "Too much money given to CA legislators by Nestle. Will never change unless you eliminate the lobbyist.",
            "title_similarity": "0.6312246",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2dof3",
            "score": 1,
            "text": "Why did they give them the go ahead in the first place?",
            "title_similarity": "0.039605558",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2dt1o",
            "score": 2,
            "text": "Absolutely fuck nestlé.",
            "title_similarity": "0.384001",
            "sentiment_compound": -0.5849
        },
        {
            "id": "gw2dz93",
            "score": 39,
            "text": "\"Sure thing!\"  \n  \n*Turns to workers and spins finger in motion to keep pumping.*",
            "title_similarity": "0.22397505",
            "sentiment_compound": 0.3802
        },
        {
            "id": "gw2dzf6",
            "score": 1,
            "text": "Man we’re in another drought? I didn’t even know lmao",
            "title_similarity": "0.4883929",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gw2e8lo",
            "score": 3,
            "text": "This is projected to be one of the worst droughts in a long time, and worse than the 2011-2017 drought which was pretty intense.",
            "title_similarity": "0.594555",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gw2e98h",
            "score": 3,
            "text": "Someone needs to hayduke tf out of their operation.",
            "title_similarity": "0.41087312",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2ebds",
            "score": 2,
            "text": "\"Water is not a human right\" - CEO Nestlé",
            "title_similarity": "0.49694854",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2eig9",
            "score": 1,
            "text": "Damn what a shame that such an awful company like Nestlé can’t keep being as awful as always",
            "title_similarity": "0.52475023",
            "sentiment_compound": -0.8519
        },
        {
            "id": "gw2el82",
            "score": 2,
            "text": "Yea this is 10 years too late.",
            "title_similarity": "0.40169",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2em0g",
            "score": 4,
            "text": "They ought to pass legislation saying water bottlers can only use desalinated water. They already have 50%-200% profit margins. If it costs twice as much to get the water, their prices would still remain about the same, as the bottles are the most costly part of bottling water.",
            "title_similarity": "0.61860037",
            "sentiment_compound": 0.2975
        },
        {
            "id": "gw2eth0",
            "score": 1,
            "text": "Nothing like being fashionably late to the party, eh?",
            "title_similarity": "0.33724678",
            "sentiment_compound": 0.1506
        },
        {
            "id": "gw2ey3o",
            "score": 2,
            "text": "They were probably paying pennies on the dollar for it to.",
            "title_similarity": "0.2995386",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2ezva",
            "score": 2,
            "text": "Let's shut off peoples drinking water so they can buy bottled water!",
            "title_similarity": "0.586004",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2f0qf",
            "score": 3,
            "text": "It's ok, they'll just drain the eyeballs of orphan children for water.",
            "title_similarity": "0.45899734",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2f4k8",
            "score": 1,
            "text": "Nestlé:  howaboutnnnooo.jpg",
            "title_similarity": "0.13828576",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2f559",
            "score": 1,
            "text": "I demand freedom from mass corporate plundering and pollution.",
            "title_similarity": "0.4074114",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gw2ff3q",
            "score": 1,
            "text": "[What does Bill Burr think about this?](https://youtu.be/w_pb6r8VNWk)",
            "title_similarity": "0.20392026",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2fjth",
            "score": 1,
            "text": "why not use eminent domain to shut them down entirely?  Apply the 2.3M gallon/year valuation, and then perhaps back date the fines on some random studies to devalue their water rights into the ground",
            "title_similarity": "0.7205359",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2fnnx",
            "score": 2,
            "text": "Nestle must be about to announce bottled air.",
            "title_similarity": "0.2099944",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2fo7o",
            "score": 1,
            "text": "Hey! Hey You, Nestlé!\nStop pumping millions of gallons of water right NOW",
            "title_similarity": "0.8000661",
            "sentiment_compound": -0.4184
        },
        {
            "id": "gw2fq3d",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.2774773"
        },
        {
            "id": "gw2ftj0",
            "score": 3,
            "text": "Stop buying bottled ~~water~~ anything!",
            "title_similarity": "0.5129361",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gw2g5k3",
            "score": 1,
            "text": "We should also regulate almond farms",
            "title_similarity": "0.11446894",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2g5rv",
            "score": 2,
            "text": "Should be a 100,000 a day fine",
            "title_similarity": "0.41218397",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw2g729",
            "score": 1,
            "text": "Disposable container bottled water should be illegal.\n\nHonestly, all disposable container drinks should be illegal.",
            "title_similarity": "0.48903733",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gw2g7co",
            "score": 2,
            "text": "I didn't know Nestle was based in Switzerland. I appreciate Switzerland offering encrypted data and stuff like that but it seems likes it's become a haven for shitty corporations and tax evading rich folk.",
            "title_similarity": "0.3761161",
            "sentiment_compound": 0.743
        },
        {
            "id": "gw2g7rr",
            "score": 1,
            "text": "Imagine drinking Nestle water...",
            "title_similarity": "0.284823",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2gai0",
            "score": 1,
            "text": "Can bottled water stop being a thing?",
            "title_similarity": "0.39208096",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2gbnl",
            "score": 2,
            "text": "Dear California don't sell your fucking water. We had drought issues back in the seventies and they never learned",
            "title_similarity": "0.661561",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gw2gchy",
            "score": 2,
            "text": "Maybe don't sell water rights to a corporation.",
            "title_similarity": "0.38353908",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2ges3",
            "score": 1,
            "text": "JUST NOW? This is getting out of hand.",
            "title_similarity": "0.19349024",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gw2gfmy",
            "score": 3,
            "text": "Politician: \"We did a thing!\"\n\nReality: \"No you didn't.  You're just lining your own budget with a PR stunt\"",
            "title_similarity": "0.43377757",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2ggek",
            "score": 3,
            "text": "Fuck Nestle, all my homies drink tap water.",
            "title_similarity": "0.53740245",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw2ghx6",
            "score": 3,
            "text": "If people stopped buying and drinking bottled water this would be a non-issue.",
            "title_similarity": "0.36124963",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gw2glyt",
            "score": 2,
            "text": "Took them long enough.\n\nThis has been a major complaint for years.",
            "title_similarity": "0.35615766",
            "sentiment_compound": -0.3597
        },
        {
            "id": "gw2gtea",
            "score": 1,
            "text": "But won’t the market just create more water out of thin air??",
            "title_similarity": "0.3163647",
            "sentiment_compound": 0.4606
        },
        {
            "id": "gw2gvfo",
            "score": 1,
            "text": "Eww nestle water is gross. Please stop making it. Forget the pumping.",
            "title_similarity": "0.566839",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gw2gzov",
            "score": 1,
            "text": "Man FUCK Nestle.\n\nMe and my homies hate Nestle.",
            "title_similarity": "0.5380738",
            "sentiment_compound": -0.8374
        },
        {
            "id": "gw2h4xn",
            "score": 1,
            "text": "We’re in a drought again?",
            "title_similarity": "0.4854975",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2hlx6",
            "score": 1,
            "text": "Why are they even allowed to pump at all with water conservation for residents being year round?",
            "title_similarity": "0.4609758",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2hmsb",
            "score": 2,
            "text": "We should turn our super aggressive police on these fucks. I want a epa swat team",
            "title_similarity": "0.48013926",
            "sentiment_compound": 0.128
        },
        {
            "id": "gw2hmso",
            "score": 1,
            "text": "Nestle are the biggest pos company out there  ...utter scum .",
            "title_similarity": "0.49397194",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2huey",
            "score": 1,
            "text": "Nestle takes TO MUCH FROM TO MANY \nSHOULD BE STOPPED. THEY DONT PAY ENOUGH",
            "title_similarity": "0.5140492",
            "sentiment_compound": -0.201
        },
        {
            "id": "gw2hxr6",
            "score": 3,
            "text": "A fine ranging from maximums of 365,000-3,650,000$ per year is irrelevant to a company who sold its water production for nearly 5,000,000,000$\n\nWhy can’t we just say no, why do they even have the right to argue the point while continuing to steal our water?",
            "title_similarity": "0.7296114",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gw2hy0t",
            "score": 2,
            "text": "Had a co-worker about ten years ago, who lived in Yucaipa. He had a well for his water supply and took a shower in Arrowhead water every day. \n\nMeanwhile, the farmers in central California are spraying their crops in the middle of the day.",
            "title_similarity": "0.6144136",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw2hy58",
            "score": 2,
            "text": "They’ll bully their citizens and nestle before losing that sweet sweet almond revenue.",
            "title_similarity": "0.47585452",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gw2idc4",
            "score": 3,
            "text": "It's about fuckin' time.",
            "title_similarity": "0.08788955",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2ieyn",
            "score": 3,
            "text": "Corporate lobbyists are literally psychopaths",
            "title_similarity": "0.45539072",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2ifv9",
            "score": 2,
            "text": "Nestle poses a divisive question: is water a basic human right or a commodity?",
            "title_similarity": "0.27260086",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2im6q",
            "score": 1,
            "text": "I never buy Nestle, for other reasons, but 58 million gallons isn’t really that much. 6,000 households maybe",
            "title_similarity": "0.44523746",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2iuog",
            "score": 3,
            "text": "Stop fucking fining them for pocket change and start jailing some of these execs who will 100% flagrantly ignore this. States about to be on fire in a couple months and it’s time to get serious about Nestles water usage, and almond growing in general.",
            "title_similarity": "0.72068864",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gw2j0jt",
            "score": 1,
            "text": "Better late than never I guess",
            "title_similarity": "0.22200584",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw2j3ca",
            "score": 2,
            "text": "I just spoke with the head of Nestle, here is a direct quote. “Nah, fuck you.”",
            "title_similarity": "0.43040648",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw2jh1o",
            "score": 2,
            "text": "ok i need to ask this for reference is converting sea water into fresh water just too much money to be worth while?",
            "title_similarity": "0.49488366",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gw2jl9y",
            "score": 3,
            "text": "Maybe we shouldn’t let corporations control our clean water sources for profit?",
            "title_similarity": "0.47737557",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gw2jpd8",
            "score": 2,
            "text": "Nestle has been pumping free water for years. They won't give that up so easily",
            "title_similarity": "0.36993027",
            "sentiment_compound": 0.7518
        },
        {
            "id": "gw2jsqw",
            "score": 1,
            "text": "Ban Nestle all together from taking public water supplies.",
            "title_similarity": "0.5199447",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gw2k8jo",
            "score": 2,
            "text": "Day late and billions of gallons short.... like it wasn’t obvious this was coming.",
            "title_similarity": "0.520501",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw2kbks",
            "score": 3,
            "text": "-Be Nestlé\n-Laugh\n-Continues",
            "title_similarity": "0.007891517",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gw2keyx",
            "score": 1,
            "text": "Has a claim to 2.3M gallons and drains 58M gallons. That's pretty fucking bold. Almost as if they feel themselves as untouchable. Hopefully they get slapped hard but I doubt it. Seems like everything thrown against Nestle is like water off a duck's back.",
            "title_similarity": "0.58123827",
            "sentiment_compound": 0.7874
        },
        {
            "id": "gw2kg7p",
            "score": 1,
            "text": "This needs to happen now, nestle will otherwise drag the case in court for years and drain California by the time we get results",
            "title_similarity": "0.6118432",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gw2khip",
            "score": 3,
            "text": "Lol Nestlé owns the government this doesn’t mean much.",
            "title_similarity": "0.18978533",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gw2kibs",
            "score": 3,
            "text": "When will society hold Nestle accountable for their actions against humanity.... SMH...",
            "title_similarity": "0.35567862",
            "sentiment_compound": -0.4648
        },
        {
            "id": "gw2kk5y",
            "score": 2,
            "text": "The official Nestle response:\n\n>lol nah",
            "title_similarity": "0.15649702",
            "sentiment_compound": 0.34
        },
        {
            "id": "gw2kldv",
            "score": 1,
            "text": "Nestle, what a kind charity...",
            "title_similarity": "0.023169152",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gw2km8b",
            "score": 2,
            "text": "I wonder which intern they’ll send with their $1000 check daily.",
            "title_similarity": "0.5132866",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2kmbv",
            "score": 1,
            "text": "Nestle, a Swiss Company, was sold to One Rock Capital Partners, and Metropoulos & Company, for 4.3 Billion dollars. (statista.com) Nestle was taking CA water from the mountains in various locations, I lived there, it was on the news quite often for many many years: a $1000.00 a day fine is, a drop in the bucket.",
            "title_similarity": "0.6111761",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gw2kmd5",
            "score": 1,
            "text": "Fuckin finally, fuck nestle",
            "title_similarity": "0.28098568",
            "sentiment_compound": -0.5829
        },
        {
            "id": "gw2kqry",
            "score": 1,
            "text": "They’ve been doing this. Its only news now cause something is finally being done",
            "title_similarity": "0.1538164",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2ksbk",
            "score": 1,
            "text": "This is the exact opposite of supply and demand. It would be better for business and more ethical for Nestle to get their water from places that aren’t facing a drought.",
            "title_similarity": "0.32974765",
            "sentiment_compound": 0.7178
        },
        {
            "id": "gw2kvck",
            "score": 1,
            "text": "Good fight!  I just don’t understand. \n\nI live in the Idaho mountains at the top of the water table. Yet, my organization has water bottle machines in several buildings from a place for south of us? What the hell is the point? We get Mountain runoff water from the tap.",
            "title_similarity": "0.5727388",
            "sentiment_compound": -0.6312
        },
        {
            "id": "gw2l3vr",
            "score": 2,
            "text": "Title if click bait or I am missing something?\n\"The draft cease-and-desist order, which still requires approval from the California Water Resources Control Board\" so no official document.\nAnd... Nestle is no longer involved as they sold that business unit.\nWTF?",
            "title_similarity": "0.68593544",
            "sentiment_compound": -0.8426
        },
        {
            "id": "gw2l6mv",
            "score": 3,
            "text": "Arizona needs to do the same. Fuck Nestlé",
            "title_similarity": "0.3023445",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw2l7fg",
            "score": 3,
            "text": "But... but how else are they supposed to drain the public's water system so they can sell it back to them in plastic that will end up in the ocean further destroying the environment.",
            "title_similarity": "0.60165524",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gw2lfjl",
            "score": 2,
            "text": "How about they stop or their property is seized by the government instead of a small fine.",
            "title_similarity": "0.47465327",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw2ljl4",
            "score": 2,
            "text": "This happened in Ontario too a few years back but I don't remember how it was resolved. I think Nestle just shut down their plant and set up shop elsewhere to leech off their water supply instead. These fuckers.",
            "title_similarity": "0.5998138",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gw2lstw",
            "score": 2,
            "text": "A long as people buy bottled water there will be a nestle destroying everything",
            "title_similarity": "0.64639854",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gw2m5a6",
            "score": 1,
            "text": "It would have been wise to stop this before the drought happened...",
            "title_similarity": "0.35005707",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gw2m6er",
            "score": 1,
            "text": "XD what a fucking joke that must be to nestle",
            "title_similarity": "0.21459168",
            "sentiment_compound": 0.7921
        },
        {
            "id": "gw2m93i",
            "score": 1,
            "text": "What part of the process requires so much water?",
            "title_similarity": "0.26515085",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2mcn1",
            "score": 1,
            "text": "Already a drought?  Wtf",
            "title_similarity": "0.47174406",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gw2mdjb",
            "score": 1,
            "text": "Profit-hit Nestle says no",
            "title_similarity": "0.47778645",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2mho9",
            "score": 1,
            "text": "Something something stable doors, horses bolting",
            "title_similarity": "0.118655086",
            "sentiment_compound": 0.296
        },
        {
            "id": "gw2miic",
            "score": 1,
            "text": "How does Nestle have the rights to pump water? Can California take those rights away?",
            "title_similarity": "0.4726084",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2mk4c",
            "score": 1,
            "text": "Don't worry. Nestle will just sue and sue and sue and bribe until they get their way.",
            "title_similarity": "0.3200247",
            "sentiment_compound": 0.1546
        },
        {
            "id": "gw2mltc",
            "score": 2,
            "text": "I wish the fines would be raised to make companies feel it on the pocket book",
            "title_similarity": "0.35429108",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw2mmfu",
            "score": 3,
            "text": "Let me guess. They'll continue to skirt the order, pay a fine that is dwarfed by the money they'll make by not stopping, and nobody will be held accountable.",
            "title_similarity": "0.50874436",
            "sentiment_compound": 0.2129
        },
        {
            "id": "gw2mnc0",
            "score": 1,
            "text": "Yeah they sold their water arm in North America, probably saw fines and bans coming down the road. They made their buck and are gone.",
            "title_similarity": "0.62169194",
            "sentiment_compound": 0.296
        },
        {
            "id": "gw2mzjp",
            "score": 1,
            "text": "That's not very cash money, Nestlé",
            "title_similarity": "0.19273756",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2n5us",
            "score": 1,
            "text": "They won't.\n\nEdit after seeing the fine: They absolutely will not, ever.",
            "title_similarity": "0.3909546",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw2n8lo",
            "score": 2,
            "text": "if they DO get fined who gets that money? CA?",
            "title_similarity": "0.37465852",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2nc5w",
            "score": 3,
            "text": "Now go back decades and stop them from pumping at all.",
            "title_similarity": "0.6111724",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2ncl3",
            "score": 3,
            "text": "MICHIGAN AND THE MIDWEST HAS TO DO THE SAME OR THEY'LL RUIN THE LARGEST SOURCE OF FRESH WATER ON THE PLANET.\nFUCK NESTLÉ",
            "title_similarity": "0.6646349",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gw2nlwe",
            "score": 1,
            "text": "how about we go and destroy their infrastructure, lol",
            "title_similarity": "0.44770557",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gw2nn2x",
            "score": 2,
            "text": "Boycott everything Nestle. It's friggin hard, but it can be done.",
            "title_similarity": "0.40568876",
            "sentiment_compound": -0.2492
        },
        {
            "id": "gw2nnty",
            "score": 1,
            "text": "Maybe they should do the same here in Canada and boot them out.",
            "title_similarity": "0.32228184",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2nnvk",
            "score": 1,
            "text": "How many total gallons of fresh water are used across California? Is Nestle a large percentage? Or is this a resource problem in general?",
            "title_similarity": "0.621641",
            "sentiment_compound": -0.172
        },
        {
            "id": "gw2nt33",
            "score": 1,
            "text": "Just ban it outright; keep the water and scrap the plastic waste, win win.",
            "title_similarity": "0.4520796",
            "sentiment_compound": 0.296
        },
        {
            "id": "gw2nuzv",
            "score": 3,
            "text": "Bottled water companies should be allowed to operate provided they meet these two criteria:\n\n1) Bottles should be biodegradable.\n\n2) The water should be sourced from the ocean and properly desalinated.\n\nIf you cannot meet these two criteria you should not be allowed to operate.",
            "title_similarity": "0.4274167",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2o3tv",
            "score": 3,
            "text": "Why would Nestle stop taking *their own private water*?   Because, you know, Nestle thinks **ALL** water on earth is theirs.",
            "title_similarity": "0.47340682",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2oell",
            "score": 1,
            "text": "Who would've T H U N K\nAlso, didn't we know they were doing it illegally years ago?",
            "title_similarity": "0.45417863",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2oinc",
            "score": 1,
            "text": "Finally, they did something about it.",
            "title_similarity": "-0.013870882",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2om09",
            "score": 1,
            "text": "Thank fucking goodness!",
            "title_similarity": "0.06474129",
            "sentiment_compound": 0.7257
        },
        {
            "id": "gw2osf9",
            "score": 1,
            "text": "Too little - too late.",
            "title_similarity": "0.20323898",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2oyof",
            "score": 1,
            "text": "This was the plot of Quantum of Solace.....",
            "title_similarity": "-0.01515447",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2p2uz",
            "score": 2,
            "text": "I visited my aunt and remember her telling me about a spring and how anyone can gather water for themselves and to bring a cantine to fill. I’ve never been to one so I thought that was a great idea! I get there and there are three unmarked semi trucks lined up ready to to fill their massive tankers. I wasn’t going to wait for that, I’ll get my spring water in a plastic bottle at a gas station like normal people.",
            "title_similarity": "0.563375",
            "sentiment_compound": 0.8553
        },
        {
            "id": "gw2p40k",
            "score": 3,
            "text": "Maybe we can stop Fiji water next, those guys are *terrible* for the environment.",
            "title_similarity": "0.611601",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gw2p9zd",
            "score": 3,
            "text": "Wait wait. They waited until there is a drought to stop a company from taking the water and selling it across the world.",
            "title_similarity": "0.70298094",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2pezg",
            "score": 2,
            "text": "Should have nixed this long ago",
            "title_similarity": "0.32182804",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2pna7",
            "score": 1,
            "text": "Nestle responds. Nah, we’re good here.",
            "title_similarity": "-0.06866078",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw2pnpc",
            "score": 1,
            "text": "I saw somewhere that the cost to produce bottled water was somewhere around 5 cents. This sounds more like a business expense to an already profitable venture.",
            "title_similarity": "0.37821424",
            "sentiment_compound": 0.6901
        },
        {
            "id": "gw2poq9",
            "score": 2,
            "text": "FINALLY. FFS. It's a few decades late, but yeah, better late than never.",
            "title_similarity": "0.4175381",
            "sentiment_compound": 0.5972
        },
        {
            "id": "gw2q3y5",
            "score": 2,
            "text": "What took them so long?",
            "title_similarity": "0.16538641",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2q5hw",
            "score": 1,
            "text": "can we just get petty with nestle regardless?",
            "title_similarity": "0.19762525",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gw2q7id",
            "score": 1,
            "text": "I wish they would Nestle from pumping water in Michigan too.",
            "title_similarity": "0.4564154",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw2qbm9",
            "score": 2,
            "text": "The fine should be for volume of water removed, if they were getting hit with $1,000/gallon, even $100/gallon would actually hurt them, they might then take it serious. If the fine is the same whether they take 1gal or they take 10,000 gal, they will just up the suck to off set the fine IF they are even bothered to recognize the law is there in the first place.",
            "title_similarity": "0.6303271",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gw2qf7j",
            "score": 1,
            "text": "then Nestle will whine to California’s Supreme Court and things will go back to the same",
            "title_similarity": "0.42542347",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw2qffx",
            "score": 2,
            "text": "If memory serves me they are using an expired license to pump the water from back in the 80s.  Why do we let these companies pump water out of a draught stricken area when the locals are paying hundreds per month in water bills.",
            "title_similarity": "0.7363204",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gw2qgpb",
            "score": 1,
            "text": "Great news; let them pay for it like everyone else.",
            "title_similarity": "0.22981188",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gw2qjju",
            "score": 3,
            "text": "Bottled water is the biggest marketing scam ever devised",
            "title_similarity": "0.44582242",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gw2ql6a",
            "score": 1,
            "text": "Just regulate the single use plastic bottles.",
            "title_similarity": "0.2633715",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2qqsj",
            "score": 2,
            "text": "Well I guess that probably means they're going to start siphoning more water up here in British Columbia. Fuck Nestle.",
            "title_similarity": "0.5218154",
            "sentiment_compound": -0.34
        },
        {
            "id": "gw2qsw8",
            "score": 1,
            "text": "The state should force Nestle out. A majority of people who drink bottled water do it out of convenience and laziness. Stop enabling that bullshit at the expense of the environment.",
            "title_similarity": "0.6253761",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gw2qtud",
            "score": 1,
            "text": "Simple solution - stop providing the demand for bottled water. If we stop drinking it, they can't make money, and they will stop selling it.",
            "title_similarity": "0.6064514",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gw2qu5v",
            "score": 1,
            "text": "Can they write fines off their taxes?",
            "title_similarity": "0.45061827",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2r14l",
            "score": 1,
            "text": "And? Nestle truly doesn't give a shit. Will people actually do something to stop them or is this just bluster from politicians?",
            "title_similarity": "0.40426573",
            "sentiment_compound": 0.6103
        },
        {
            "id": "gw2r1ur",
            "score": 2,
            "text": "If California is 1/10 as aggressive as dealing with Nestle as they do with moving homeless people out of wealthy neighborhood, Nestle would be out of the State by now.",
            "title_similarity": "0.66722965",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gw2r3bo",
            "score": 3,
            "text": "If you drink water out of plastic bottles when you can just as easily fill a reusable bottle, you're a part of the problem.",
            "title_similarity": "0.434918",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gw2r6m6",
            "score": 2,
            "text": "Time to dismantle some pipelines and pumps.",
            "title_similarity": "0.52198297",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2r7bq",
            "score": 17,
            "text": "If only all the people who hated Nestlé would put their money where their mouths are and stop buying bottled water, which is terrible for the environment regardless of brand",
            "title_similarity": "0.6661029",
            "sentiment_compound": -0.8591
        },
        {
            "id": "gw2rk69",
            "score": 1,
            "text": "r/NestleDidNothingWrong about to lose it lol",
            "title_similarity": "0.31784555",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gw2rktf",
            "score": 2,
            "text": "There are pristine rivers dumping untold amounts of water into the ocean and the company has to take water from arid regions and irreplaceable aquifers? \n\nWe have perfectly good water, free from our taps, often it is better than bottled water, who is buying and wasting their money on bottled water? Just proves that you can con people of anything. \n\nWhen I need a bottle of water, I get a bottle and fill it up at my tap.",
            "title_similarity": "0.59631985",
            "sentiment_compound": 0.8645
        },
        {
            "id": "gw2rpqj",
            "score": 1,
            "text": "I try not to use Nestle owned brands, but it can be difficult to boycott them because they own *so* much shit.",
            "title_similarity": "0.35050866",
            "sentiment_compound": -0.9022
        },
        {
            "id": "gw2rswr",
            "score": 2,
            "text": "Say it with me,\n\nF*CK NESTLÉ",
            "title_similarity": "0.15138595",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2rujr",
            "score": 2,
            "text": "I began boycotting Nestlé products in our home when they tapped into Ginnie Springs in Florida- It’s a ‘drop in the bucket,’ considering the size of Nestlé; but I like to think that enough missing drops will eventually make a difference.",
            "title_similarity": "0.5660949",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw2rxmb",
            "score": 1,
            "text": "Ah this is why Burry invested in water & GME",
            "title_similarity": "0.3329499",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2rztr",
            "score": 1,
            "text": "Fuck Nestle. All my homies hate Nestle.",
            "title_similarity": "0.56923866",
            "sentiment_compound": -0.802
        },
        {
            "id": "gw2s1q6",
            "score": 2,
            "text": "Oh come on. This fine bullshit is never gonna stick. They're just gonna buy a new couple of politicians. It's the American way!",
            "title_similarity": "0.49718395",
            "sentiment_compound": -0.4753
        },
        {
            "id": "gw2sej4",
            "score": 3,
            "text": "Can the state take the water rights through eminent domain? I'd argue securing water during a drought is for the public good.",
            "title_similarity": "0.4562694",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gw2sg1v",
            "score": 1,
            "text": "Now they're draining Florida's natural springs.",
            "title_similarity": "0.43956786",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw2sk85",
            "score": 3,
            "text": "This will go to litigation, unfortunately. No need for bottled water, its a waste of fuel (shipping water), plastic waste, and \"outsources\" the environmental impact from the point of consumption to the point of extraction (i.e. consumers outside of California putting environmental burden in California).\n\nUSE A REUSABLE BOTTLE",
            "title_similarity": "0.56364006",
            "sentiment_compound": -0.9169
        },
        {
            "id": "gw2sxxc",
            "score": 2,
            "text": "Can we, as the American public, just delete Nestle from existence. I don’t think anyone would care",
            "title_similarity": "0.4779153",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gw2t1kz",
            "score": 2,
            "text": "\"Uh, there is no money in it, so we won't be doing that.\"",
            "title_similarity": "0.27172288",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2t1lz",
            "score": 3,
            "text": "Who here’s ready for the story 6 months from now that they never stopped? And the fine will be 2 apples and an “I’m Sorry”.",
            "title_similarity": "0.4850141",
            "sentiment_compound": 0.608
        },
        {
            "id": "gw2t4qf",
            "score": 2,
            "text": "Pretty sure I've read this same headline 5+ or so years ago.  And yet, here we are again.",
            "title_similarity": "0.34028983",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gw2t63h",
            "score": 2,
            "text": "So they will just pump 999,999 and get away with it.",
            "title_similarity": "0.3264522",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2t6oz",
            "score": 1,
            "text": "Jajaj $1,000/day, 10k/if a drought is declared...well when the markup on bottled water is fucking 4,000%, I think nestle will continue to do as they please.  Jfc",
            "title_similarity": "0.598362",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw2t8ih",
            "score": 1,
            "text": "So worst case 3m per year? Mhhh",
            "title_similarity": "0.5703997",
            "sentiment_compound": -0.659
        },
        {
            "id": "gw2tbb4",
            "score": 2,
            "text": "Fucks are selling free water to us.",
            "title_similarity": "0.35777932",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gw2tfr1",
            "score": 2,
            "text": "Nestle needs to FEEL the financial punishment such that it outweighs the benefit of ignoring the rules.",
            "title_similarity": "0.31744307",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gw2tgsd",
            "score": 2,
            "text": "They are profiteering off of a public resource - bottled water needs to be outlawed...but water infrastructure is for shit so it is a lose lose situation",
            "title_similarity": "0.5776191",
            "sentiment_compound": -0.8625
        },
        {
            "id": "gw2tn4h",
            "score": 2,
            "text": "How about putting an excise tax on bottled water and soft drinks.   Seems that would cure a lot of problems.",
            "title_similarity": "0.46121034",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gw2tu3b",
            "score": 2,
            "text": "Stick to chocolate you nestle dweebs!",
            "title_similarity": "0.16061805",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2txgl",
            "score": 2,
            "text": "whenever appropriate: Fuck Nestle.",
            "title_similarity": "0.27042374",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw2tywx",
            "score": 2,
            "text": "What's stopping the California government from simply seizing the company's operations and execute it?\n\nIt's public interest, considering there's a drought.",
            "title_similarity": "0.68661314",
            "sentiment_compound": 0.34
        },
        {
            "id": "gw2u3g0",
            "score": 2,
            "text": "For the life of me, I’ll never understand why these companies were ever even allowed to pump water in the first place. Something something something capitalism probably.",
            "title_similarity": "0.4839617",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2u6uj",
            "score": 2,
            "text": "ftfy \"...pumping millions of gallons of water on a permit that expired in the 80s and was never approved for the amount of water they are extracting\".",
            "title_similarity": "0.83048177",
            "sentiment_compound": -0.3252
        },
        {
            "id": "gw2u9lg",
            "score": 2,
            "text": "Nestle knew this was all coming which is why they sold the US brands. And when I say they knew it was coming, I don't just mean California, I mean they knew for years that they've not only been pulling out more than they should have been in most places, but they also knew that they were taking more than could be sustained for years, significantly more than could ever be replenished, and when the droughts started popping up all over the country, along with our nation's aquafiers being sucked to never before seen levels, they knew that it was only a matter of time before the people came for the state, local and federal governments, and those governments would finally be forced to make them own it. So, they sold it off to another sucker that was too greedy to see past Nestlés past 15 years of spring water profitability and recognize that a a real problem was brewing, either that, or they also knew and agreed to play the blame game with Nestlé, they claim it all happened before they owned it, Nestlé claims it's not their problem anymore. Regardless, it once again is us that got fucked while corporate greed literally sucked our freshwater systems dry selling it back to Americans in eternal plastic bottles for 5000% markup over what it cost them to extract, filter and bottle. Any fine won't be a deterrence, it'll just be another line item expensive on their P&L, which you can be sure that they'll pass on the customer.",
            "title_similarity": "0.6742908",
            "sentiment_compound": -0.9728
        },
        {
            "id": "gw2uase",
            "score": 1,
            "text": "About time, they have sucked us dry for years.",
            "title_similarity": "0.55211926",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gw2uc1z",
            "score": 2,
            "text": "Fuck Nestle.  Fuck everything about Nestle.",
            "title_similarity": "0.48776516",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gw2ucf0",
            "score": 1,
            "text": "Go there and cut the fucking lines. Jesus Christ",
            "title_similarity": "0.38729686",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gw2ucg8",
            "score": 1,
            "text": "Someone ELI5 why does California have a water Drought when they’re literally next to the Pacific Ocean?",
            "title_similarity": "0.6696269",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2ukkq",
            "score": 1,
            "text": "Stop supporting this parasite of a company",
            "title_similarity": "0.47800058",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gw2umio",
            "score": 1,
            "text": "If you ask me they should arrest anyone they catch working the pumps or having anything to do with them. I don't care if it's your livelihood you don't have the right to break the law just because nestle pays you to. We need forced boycotts of shit like this.",
            "title_similarity": "0.48656708",
            "sentiment_compound": -0.8667
        },
        {
            "id": "gw2uoxk",
            "score": 1,
            "text": "Hell yeah, fuck you nestle.",
            "title_similarity": "0.28714365",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gw2uwry",
            "score": 2,
            "text": "maybe Nestle should have been ordered to stop this water pumping years ago.",
            "title_similarity": "0.63609296",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2uz58",
            "score": 1,
            "text": "They’ve been stealing water for about thirty years now.",
            "title_similarity": "0.59595865",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gw2v06b",
            "score": 1,
            "text": "Shut it down. Fuck Nestle. End of.",
            "title_similarity": "0.43243495",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw2v1em",
            "score": 3,
            "text": "They are limited to 2.3 million gallons but got away with 53 million. That's a big up yours to the water authorities.",
            "title_similarity": "0.5411152",
            "sentiment_compound": -0.1154
        },
        {
            "id": "gw2v2fy",
            "score": 2,
            "text": "Great, now do Coca-cola and Pepsi.",
            "title_similarity": "0.2694979",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gw2vacg",
            "score": 2,
            "text": "Or else what? They'll cut .001 out of every $1 Nestle makes off the stolen water?\n\nGood luck with all that.",
            "title_similarity": "0.54650193",
            "sentiment_compound": 0.2406
        },
        {
            "id": "gw2vdmb",
            "score": 2,
            "text": "Make these types of fines a flat % of their yearly gross income and this will change real fast.",
            "title_similarity": "0.5152124",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gw2vgf7",
            "score": 3,
            "text": "Nestle is evil af. CEO wanted to try to own the rain.",
            "title_similarity": "0.5006788",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw2vrc7",
            "score": 1,
            "text": "Nestle had the creepy CEO who said [water is \"foodstuff\" and not a human right] (https://www.snopes.com/fact-check/nestle-ceo-water-not-human-right/)",
            "title_similarity": "0.60811687",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2w807",
            "score": 2,
            "text": "Single use bottle water should be universally banned and only used in emergency situations.",
            "title_similarity": "0.53629375",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gw2wcrm",
            "score": 3,
            "text": "I think $1000 per fluid ounce of water pumped out with any kind of man made object would do the trick. \n\n$1000 per day? Shit. Everybody and their mother could profit off that.",
            "title_similarity": "0.5662912",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gw2wls3",
            "score": 1,
            "text": "I am super familiar with this watershed, as a local resident and outdoor enthusiast. It's really a shame how dry it is further downstream. It's near the historic Arrowhead Hot Springs resort.",
            "title_similarity": "0.40548575",
            "sentiment_compound": 0.4627
        },
        {
            "id": "gw2wmsx",
            "score": 1,
            "text": "Gosh it's almost like water is a public resource that should be used for the good of everyone rather than just powerful corporations",
            "title_similarity": "0.29244494",
            "sentiment_compound": 0.785
        },
        {
            "id": "gw2wq4k",
            "score": 2,
            "text": "Don't just fucking tell them to stop. Just yank their goddamn permit and ensure they're not trying to pump it across Stateline. They had several years to stop Nestlé. They ain't gonna stop.",
            "title_similarity": "0.63030016",
            "sentiment_compound": -0.461
        },
        {
            "id": "gw2wrge",
            "score": 3,
            "text": "The entire world should tell nestle to stop pumping millions of gallons of water.",
            "title_similarity": "0.8192929",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2xdip",
            "score": 1,
            "text": "hmmmmm Nestle sold their US water interests two months before the cease and desist order.... what miraculous timing.",
            "title_similarity": "0.63317573",
            "sentiment_compound": 0.25
        },
        {
            "id": "gw2xe1l",
            "score": 2,
            "text": "Revoke all licences. Oh.. wait. They have no real valid license...\n\nDo I smell corruption?",
            "title_similarity": "0.61147475",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2xg9t",
            "score": 1,
            "text": "Why were they waiting so long for ?",
            "title_similarity": "0.15257657",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2xgx2",
            "score": 1,
            "text": "Fuck nestle and all these bottled water companies.",
            "title_similarity": "0.6252255",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw2xjxj",
            "score": 1,
            "text": "Nestle is evil. Go look up what they did to promote their baby formula. I love Nesquick, but I can no longer in good conscience use those products.",
            "title_similarity": "0.49862978",
            "sentiment_compound": 0.4118
        },
        {
            "id": "gw2xkmo",
            "score": 1,
            "text": "Remember when Coca Cola's Dasani got booted out of the UK. Taking our treated tap water and reselling it back to us with a sprinkle of bollocks. Go fuck yourselves.",
            "title_similarity": "0.6320944",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw2xutv",
            "score": 2,
            "text": "You know, if nestle was gone today, I wouldn't have any issues with it. \"Oh no! No more kit kat!\"  ya no\n\nEdit: I looked through all the products they have and stand by what I said.",
            "title_similarity": "0.44069475",
            "sentiment_compound": -0.6103
        },
        {
            "id": "gw2xvj6",
            "score": 1,
            "text": "Maybe it’s time to start acknowledging California as an arid desert climate. The state is in a drought most years and there’s zero precipitation pretty much from March until December for most places, which is why the whole state catches on fire in the fall. There’s a mild wet season in the winter and incidental precipitation if you’re in a coastal area.",
            "title_similarity": "0.65634507",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw2y4n4",
            "score": 2,
            "text": "Hold those accountable and arrest them for not following the order to stop. That would really disincentivize those working to stop.",
            "title_similarity": "0.4823964",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gw2y6a8",
            "score": 1,
            "text": "Watch nestle file a lawsuit saying they are infringing on their rights or some shit.",
            "title_similarity": "0.47930464",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gw2y985",
            "score": 1,
            "text": "Yeah they won't stop, they are above the law.",
            "title_similarity": "0.05326238",
            "sentiment_compound": 0.4745
        },
        {
            "id": "gw2y9t7",
            "score": 1,
            "text": "Freaking scum, I hope this spreads across socials and they catch hell for it across all their brands.",
            "title_similarity": "0.4709916",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gw2yba2",
            "score": 2,
            "text": "Oh gee, just now? NOT A FUCKING DECADE AGO?! GET ENOUGH PROFITS FINALLY?!?!",
            "title_similarity": "0.34946346",
            "sentiment_compound": 0.7557
        },
        {
            "id": "gw2yd5s",
            "score": 2,
            "text": "Make it $1000 a minute fine",
            "title_similarity": "0.4303273",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw2yo5n",
            "score": 1,
            "text": "California has been in a drought for a long time why is California letting any company pump water from its land!? All politicians are puppets of the elite in one way or another!",
            "title_similarity": "0.78473973",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2yoab",
            "score": 1,
            "text": "Yet society is left to clean up the disaster left behind when nature gets destroyed due to corporate greed.",
            "title_similarity": "0.58945805",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gw2yp4l",
            "score": 1,
            "text": "Meanwhile locally Toll Bros is putting in 5,000 homes with insufficient parking, no landscaping and only partial K-12 school fee. \n\nWho OK's that water use?",
            "title_similarity": "0.61207414",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2ys0r",
            "score": 2,
            "text": "Also it's not just bottled water that is the problem.  Literally any soda, tea, beer, juice, etc. that you buy is 90% or more water, pumped the same way.",
            "title_similarity": "0.42914242",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gw2ysdl",
            "score": 1,
            "text": "Again, Nestle no longer has a stake in water bottling. They sold.",
            "title_similarity": "0.5577026",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2z10x",
            "score": 3,
            "text": "Bottom line - Bottled water is terrible. Also, this is a big business who needs to pay their fair share. \n\nCounterpoint - 50M gallons sounds like a lot, but it’s probably less water than a single farm. \n\nCrops like soybeans needs about 10 acre inches of water for each planting. An acre inch is about 25,000 gallons of water.  So, that’s 500,000 gal/acre/ year. \n\nLooking at another way - most farms in the United States use about 1.5 acre feet of irrigation water per year. That is 326,000 gal/acre/year\n\nThe first figure is rain plus arrogation, the second one is just irrigation\n\nThe average US farm is about 500 acres. \n\nSo, that means one farm uses between 160 and 250 M gallons of irrigation water per year.",
            "title_similarity": "0.64382964",
            "sentiment_compound": 0.8271
        },
        {
            "id": "gw2z9pn",
            "score": 3,
            "text": "What a fucked up place. Fucked up corporation, fucked up government, just a fucking mess this shit version of free market capitalism. Why must it be about the benefits of the very few all the fucking time?",
            "title_similarity": "0.48554802",
            "sentiment_compound": -0.9491
        },
        {
            "id": "gw2zhow",
            "score": 2,
            "text": "Nestle is not a company that concerns itself with the \"common good\". They are focused on profitability only and if it ruins the environment or exacerbates a drought... oh well. If it's true that they will face a maximum $1,000/day fine, then don't expect them to modify their behavior based on the fine or public opposition.",
            "title_similarity": "0.48345232",
            "sentiment_compound": 0.8807
        },
        {
            "id": "gw2zhw6",
            "score": 2,
            "text": "These corporations are the biggest villains of our modern day.",
            "title_similarity": "0.47259098",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw3089k",
            "score": 2,
            "text": "Nestle is a bunch of assholes.",
            "title_similarity": "0.4092555",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gw30c29",
            "score": 1,
            "text": "**Nestlé:** \"Hm... I don't know, looks like e might have to u the price of our products if we do that. We wouldn't want that, would we?\"",
            "title_similarity": "0.3807241",
            "sentiment_compound": -0.3252
        },
        {
            "id": "gw30cuc",
            "score": 2,
            "text": "Not to mention the billions of gallons a day the hundreds of golf courses there require",
            "title_similarity": "0.52231073",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw30e5f",
            "score": 1,
            "text": "Big deal! 10,000 bucks is nothing to Nestle.\nIf you really want to stop big business from excess or pollution we have to make it hurt.",
            "title_similarity": "0.63430953",
            "sentiment_compound": -0.677
        },
        {
            "id": "gw30ipd",
            "score": 1,
            "text": "They need up max fines for corporations massive. For something like this it needs to be minimum of 100k a day. That is the only way fines will be effective",
            "title_similarity": "0.5851489",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gw30mm9",
            "score": 3,
            "text": "Wait, there is a region with severe, frequent droughts and they allow a private corporation to take 50 million gallons of water more than the allowed 2 million with almost no repercussions?\n\n\nHow has a mob not destroyed Nestle yet?",
            "title_similarity": "0.6868568",
            "sentiment_compound": 0.0979
        },
        {
            "id": "gw30rfr",
            "score": 1,
            "text": "They will just pump more from Michigan now. SMH",
            "title_similarity": "0.33626613",
            "sentiment_compound": -0.4648
        },
        {
            "id": "gw30w6q",
            "score": 3,
            "text": "Until the populations start massively boycotting Nestle as a whole, they won't care about Gov fines or anything like that. \n\nWho would've thought that corporations would start becoming reckless and exploiting everything and everyone.",
            "title_similarity": "0.63230854",
            "sentiment_compound": -0.814
        },
        {
            "id": "gw30yb4",
            "score": 2,
            "text": "I'm pretty sure Nestle doesn't care.",
            "title_similarity": "0.18284564",
            "sentiment_compound": 0.4352
        },
        {
            "id": "gw31ee7",
            "score": 1,
            "text": "Would have been really cool if they did this *during the drought*.",
            "title_similarity": "0.3029167",
            "sentiment_compound": 0.3804
        },
        {
            "id": "gw31qey",
            "score": 1,
            "text": "Pumping? You mean siphoning. Do you know English?",
            "title_similarity": "0.2074846",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw31uqd",
            "score": 1,
            "text": "Good. They are parasites.",
            "title_similarity": "0.102833614",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw324g0",
            "score": 1,
            "text": "This is great but now those leeches are gonna move somewhere else to fuck up the watershed.",
            "title_similarity": "0.43902826",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gw324h3",
            "score": 1,
            "text": "That's a decent step but do we NEED to grow so many almonds? What a waste",
            "title_similarity": "0.35696664",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gw328ta",
            "score": 1,
            "text": "Go after the real heavy water users: agricultural & mining companies.",
            "title_similarity": "0.44686058",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3294i",
            "score": 1,
            "text": "Woooow big bucks fine there. Why not make it a million a day? Trying to act like they are actually incentivising change but its going to do nothing. \"Look! Look! we are doing something guys!\"",
            "title_similarity": "0.471458",
            "sentiment_compound": 0.4635
        },
        {
            "id": "gw32ei7",
            "score": 1,
            "text": "Fuck, are all corporations evil? Jesus crispies.",
            "title_similarity": "0.50934225",
            "sentiment_compound": -0.836
        },
        {
            "id": "gw32euo",
            "score": 1,
            "text": "The company makes millions a day and they want to charge them 1000-10000. Cali is a joke lmao",
            "title_similarity": "0.5403188",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gw32l1m",
            "score": 2,
            "text": "Nestle water taste like tap, I'm surprised they sold millions of gallons of that stuff anyway",
            "title_similarity": "0.61598516",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gw32nne",
            "score": 1,
            "text": "And stop buying nestle products. Especially water. Vote with your money",
            "title_similarity": "0.63620025",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw32qzp",
            "score": 2,
            "text": "Is there a feasible way to boycott Nestlé? I’m aware that they own shit tons of products.",
            "title_similarity": "0.6021786",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gw32r2d",
            "score": 4,
            "text": ">Last year the company drew out about 58m gallons, far surpassing the 2.3m gallons per year it could validly claim.\n\nUhh, that should lead to criminal charges. This isn't an \"Oops, our water meter wasn't calibrated.\" This is flat out theft.",
            "title_similarity": "0.60067",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gw32wjj",
            "score": 2,
            "text": "Bottled water is a disaster. Nestle is just evil.",
            "title_similarity": "0.5181727",
            "sentiment_compound": -0.8591
        },
        {
            "id": "gw337in",
            "score": 2,
            "text": "Nationalize the water!",
            "title_similarity": "0.32251903",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw33b96",
            "score": 2,
            "text": "They should have been told to stop years ago.",
            "title_similarity": "0.4664014",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw33dz8",
            "score": 2,
            "text": "This sounds like a big deal, unless you live here and have been watching farmers turn thousands of acres of farmland into almond orchards. (1900gal per 1 pound of almonds, or 1.1 gal. per single almond) And most of those almonds will be sold to China.  But I’m sure the residents of my town will be told to start conserving any day now. The funny thing is, if you use too much water they up your rate past a certain amount, but when everyone followed the rules and conserved water they raised everyone’s rates because  residents weren’t using enough water.",
            "title_similarity": "0.58315885",
            "sentiment_compound": 0.8807
        },
        {
            "id": "gw33jqu",
            "score": 2,
            "text": "Fuck nestle or whoever owns nestle water now, but California is not in a draught. They should still be fined, but there's no need to embellish the story by saying the same old scare tactics story of CA drying up. Half the state is a goddamn desert. It's normal to not get rain there.",
            "title_similarity": "0.5795592",
            "sentiment_compound": -0.926
        },
        {
            "id": "gw33k7f",
            "score": 2,
            "text": "I've never understood bottled water except in cases of emergency. It's FOOKING WATER. All the damn plastic we're eating/drinking/breathing and we need cold tap water in a plastic bottle for what reason? Because money and because laws don't apply if they're not profitable. I wonder how far away we are from companies selling us \"breathing\" air, Spaceballs/The Lorax style.",
            "title_similarity": "0.6234331",
            "sentiment_compound": -0.7721
        },
        {
            "id": "gw33mdb",
            "score": 2,
            "text": "“Mega corporation that was created by government has now come under fire by the government for doing what the government wanted them to do”",
            "title_similarity": "0.55957514",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw33pyl",
            "score": 1,
            "text": "free fucking water and slap fine. holy fucking governmental incompetence across the board.",
            "title_similarity": "0.5806124",
            "sentiment_compound": 0.3368
        },
        {
            "id": "gw33rbi",
            "score": 1,
            "text": "Crazy enough, 15 years ago I read a small conspiracy blog about how large corporation were secretly buying up bodies of fresh water and just sitting on it. They predicted a water shortage 50 years down the line and were moving pre-emptively so that the government couldn't buy them back.",
            "title_similarity": "0.7185735",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gw33tzf",
            "score": 1,
            "text": "Damn pay wall. Can anyone share the article?  Much appreciated!!",
            "title_similarity": "0.19670442",
            "sentiment_compound": 0.4559
        },
        {
            "id": "gw33ypv",
            "score": 1,
            "text": "This is stupid that Nestlé can do this shit and roll the fine into an operating cost.",
            "title_similarity": "0.47648033",
            "sentiment_compound": -0.7814
        },
        {
            "id": "gw344vj",
            "score": 3,
            "text": "As if Nestle couldn’t be more of a piece of shit company, they HAVE to do this too :/",
            "title_similarity": "0.3204639",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gw3471g",
            "score": 1,
            "text": "Check out the movie También la lluvia.",
            "title_similarity": "0.18485115",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw34dga",
            "score": 1,
            "text": "The only way to stop them is to physically remove them",
            "title_similarity": "0.3078968",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw34ni6",
            "score": 1,
            "text": "*Nestlé, which is based in Switzerland, *\nMost companies just move their shady banking operations to Switzerland. Nestlé moved the whole company?",
            "title_similarity": "0.47358268",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw35kyb",
            "score": 2,
            "text": "**California:** nestle, stop pumping our water. We're in a drought situation!\n\n**Also California:** *out of the side of their mouth* just kidding nestle, we needed to save face. You're going to send this month's check right?",
            "title_similarity": "0.78888464",
            "sentiment_compound": 0.4003
        },
        {
            "id": "gw35mmp",
            "score": 1,
            "text": "It blows my mind away they didn't do this 15 years ago when we're going through our longest and worst historic drought ever. Newsome is an asshole and is literally doing anything and everything he can to not get kicked out like Davis did. My speculation anyway as to why we see this now and not then",
            "title_similarity": "0.68991375",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gw36236",
            "score": 1,
            "text": "We’re actually having a full unit on this in my science class.",
            "title_similarity": "0.33836132",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw36j7s",
            "score": 2,
            "text": "Lol nestle will surely sue them for more than the fine. Blame the irresponsible government for making the deal with them in the first place.",
            "title_similarity": "0.5571079",
            "sentiment_compound": 0.3535
        },
        {
            "id": "gw36q72",
            "score": 1,
            "text": "What about Crystal geyser and Arrowhead?  Are they owned by Nestlé?",
            "title_similarity": "0.28339648",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw36tfd",
            "score": 1,
            "text": "Isn't California by the ocean? Couldn't they just build desalination plants and solve their water shortage problems for a while? At least the local farmers could use the desalinated water for their crops in case it's not potable.",
            "title_similarity": "0.54897875",
            "sentiment_compound": -0.504
        },
        {
            "id": "gw371mw",
            "score": 2,
            "text": "ITT: Nestle shills and people who think Flint never had poisoned water.",
            "title_similarity": "0.34729713",
            "sentiment_compound": 0.3875
        },
        {
            "id": "gw3729p",
            "score": 2,
            "text": "That fine needs to be waaaaaaay more for it to have any form of deterrent for a multi-billion dollar company. Like \"a percentage of their gross income\" level of fine. And that fine needs to go back towards fighting the legal battle of stopping their pumping. Or infrastructure improvements. Cities can always use more/newer infrastructure.",
            "title_similarity": "0.57353824",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gw376jo",
            "score": 1,
            "text": "Oh wow 10000 a day while they are making millions a day, creating tons if plastic and turning consumer loves that they are paying 1000% markup on water. \n\nHow about we dont let evil companies profit in what should be a public resource.",
            "title_similarity": "0.6049615",
            "sentiment_compound": 0.9443
        },
        {
            "id": "gw37954",
            "score": 1,
            "text": "What I don't get about this is why it is even necessary for them to do this where there is a shortage of water. Why don't they just move their bottling operation to the shore of one of the Great Lakes? There's more freshwater in those than they could use in a thousand years.",
            "title_similarity": "0.58047616",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gw379jd",
            "score": 1,
            "text": "Bill burr clip about Nestlé water on Conan. https://youtu.be/w_pb6r8VNWk",
            "title_similarity": "0.30683705",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw37eey",
            "score": 3,
            "text": "This isn’t new. But if you’re just hearing about it, and you’re outraged, thank you for being a good human and welcome to the fight.",
            "title_similarity": "0.2228485",
            "sentiment_compound": 0.4497
        },
        {
            "id": "gw37owy",
            "score": 1,
            "text": "Nestle tried to tap my local spring in northern ny about 10 years ago. So happy the town sent them packing",
            "title_similarity": "0.4779392",
            "sentiment_compound": 0.6948
        },
        {
            "id": "gw37s30",
            "score": 3,
            "text": "Good because /r/fucknestle",
            "title_similarity": "0.14536814",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw37wt8",
            "score": 2,
            "text": ">Last year the company drew out about 58m gallons, far surpassing the 2.3m gallons per year it could validly claim.\n\nWow, what the fuck.",
            "title_similarity": "0.48685554",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gw37yxr",
            "score": 2,
            "text": "They sell us our own tap water, what a racket",
            "title_similarity": "0.36910626",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw37zdp",
            "score": 3,
            "text": "Why tf do they need so much water??",
            "title_similarity": "0.35156003",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw380o6",
            "score": 2,
            "text": "Stop fracking\n\nStop almond industry \n\nStop bottled water.",
            "title_similarity": "0.64210737",
            "sentiment_compound": -0.7089
        },
        {
            "id": "gw384x7",
            "score": 2,
            "text": "As they should have long long ago",
            "title_similarity": "0.141353",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw388mg",
            "score": 1,
            "text": "Make it a million a day and maybe they'll move to Texas",
            "title_similarity": "0.41890904",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw389pe",
            "score": 2,
            "text": "\"Oh yea, we will get right on that.\" \n<goes back to snorting coke off whore bodies and drinking the tears of African villagers>",
            "title_similarity": "0.4446832",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gw38dfa",
            "score": 1,
            "text": "r/hydrohomies is pleased",
            "title_similarity": "0.026091855",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw38jgx",
            "score": 1,
            "text": "Nestle: “Go fuck yourselves” (continues to pump)",
            "title_similarity": "0.400272",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw38mh5",
            "score": 1,
            "text": "Nestlé is to water what EA is to games. And somehow the US is okay with that.",
            "title_similarity": "0.09866119",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gw38ncy",
            "score": 1,
            "text": "This: \n[r/FuckNestle](https://www.reddit.com/r/FuckNestle?utm_medium=android_app&utm_source=share)",
            "title_similarity": "0.23335141",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw38o2i",
            "score": 1,
            "text": "r/fucknestle is jizzing themselves as we speak",
            "title_similarity": "0.3014279",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw38s3q",
            "score": 1,
            "text": "Nestle should pump itself out of existence",
            "title_similarity": "0.33944803",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw38z38",
            "score": 1,
            "text": "O wow, a company that murdered literal babies in africa, and stole water from the natives cousing deaths will get a 10k fine for pumping water in california... Wow, that will really stop them.",
            "title_similarity": "0.70962995",
            "sentiment_compound": 0.3626
        },
        {
            "id": "gw394cb",
            "score": 1,
            "text": "The real problem is plastic lobbyists buying politicians. The plastics industry is ginormous, water is pricey , but the plastic bottle you buy to drink it? Now thats some real deal money. Theres a reason water isnt sold in aluminum cans. Its too profitable to the plastics industry \n\nWe need to figure out how to really punish big corps that want to spend millions on lobbying the politicians who write our laws. Get the money out of politics and watch the country(and the world!)  change for the better. \n\nI honestly think this is a hill that both democrats and conservatives can agree to approach. (There are plenty of conservatives that dont like big business fucking up the world) \n\nhttps://www.brookings.edu/blog/fixgov/2015/04/13/americas-lobbying-addiction/amp/",
            "title_similarity": "0.5626873",
            "sentiment_compound": 0.7709
        },
        {
            "id": "gw395wh",
            "score": 1,
            "text": "Must mean they are almost done draining it...we’ve been in drought for a decade and every time it came up politicians didn’t have the will cough course donations time but now that it’s empty - the corporations okayed it and of course with an exit tax payment to themselves",
            "title_similarity": "0.6951117",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw39bc5",
            "score": 1,
            "text": "Now do that when there isn't a drought, see, it's not hard",
            "title_similarity": "0.008874916",
            "sentiment_compound": 0.0762
        },
        {
            "id": "gw39hd8",
            "score": 1,
            "text": "Wtf is California doing allowing Nestle to pump water there in the first place?",
            "title_similarity": "0.47584987",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gw39imo",
            "score": 2,
            "text": "If the meme of Jeremy Clarkson saying “Oh no... Anyway.” Was a corporate reaction it would definitely be Nestle’s response to this news.",
            "title_similarity": "0.43289563",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw39m5n",
            "score": 1,
            "text": "Arrowhead water taste like shit anyway. They should stop producing it.",
            "title_similarity": "0.55918014",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gw39xyb",
            "score": 1,
            "text": "TIL Nestlé owns Arrowhead Water. Interesting.",
            "title_similarity": "0.18904322",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw3a1be",
            "score": 2,
            "text": "Everyone should just steal nestle water bottles and dump it back in there",
            "title_similarity": "0.5851021",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gw3a800",
            "score": 1,
            "text": "Wish we could get this done in Florida.",
            "title_similarity": "0.1248286",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw3a8ho",
            "score": 1,
            "text": "Fuck them slave owners. Yes nestle uses slavery not just a shit ton of water.",
            "title_similarity": "0.37494776",
            "sentiment_compound": -0.5684
        },
        {
            "id": "gw3aied",
            "score": 2,
            "text": "This is why fine should be based on the net income of the entity",
            "title_similarity": "0.16027638",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw3auu6",
            "score": 1,
            "text": "Nestle is owned by shitty share owners.",
            "title_similarity": "0.4152264",
            "sentiment_compound": -0.34
        },
        {
            "id": "gw3ax7w",
            "score": 1,
            "text": "https://slatestarcodex.com/2015/05/11/california-water-you-doing/",
            "title_similarity": "0.35963917",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3axi3",
            "score": 1,
            "text": "Fuck this dog shit company",
            "title_similarity": "0.44292304",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gw3b4ig",
            "score": 1,
            "text": "They have been taking out water for years. Nestle water comes from LA municipal sources. They are taking taxpayer funded resources and selling them to people for profit. Fuck nestle. Fuck them for slavery use too.",
            "title_similarity": "0.6215585",
            "sentiment_compound": -0.872
        },
        {
            "id": "gw3b4t1",
            "score": 1,
            "text": "Stop taking Michigan’s as well",
            "title_similarity": "0.4642458",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gw3bahy",
            "score": 2,
            "text": "Fines don't work. Their license to operate as a business in California should be at stake.",
            "title_similarity": "0.5534814",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3bbov",
            "score": 1,
            "text": "Fuck nestle. Bankrupt them",
            "title_similarity": "0.5562582",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gw3bcur",
            "score": 2,
            "text": "Can someone please just nuke Nestle already?",
            "title_similarity": "0.25068194",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw3bj97",
            "score": 2,
            "text": "But.. how am I going to drink water if I can't lug it home from the grocery store??  From the tap!?",
            "title_similarity": "0.44739455",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3bjia",
            "score": 1,
            "text": "Nestle' is fucking evil. I stopped buying their chocolate a long time ago, and that goes the same for the bottled water I should be getting for free. Fuckers.",
            "title_similarity": "0.6255534",
            "sentiment_compound": -0.8155
        },
        {
            "id": "gw3c42t",
            "score": 2,
            "text": "Why do I only see bad news about this company and how they are destroying or disrupting the environment, towns and more? Even worse, why is there so many companies exactly like this and they continue to post record profits? Do most people just not know about this?",
            "title_similarity": "0.586081",
            "sentiment_compound": -0.7662
        },
        {
            "id": "gw3c5dy",
            "score": 2,
            "text": "Bottled water companies don't sell water, they sell plastic bottles.",
            "title_similarity": "0.42168456",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3c75b",
            "score": 3,
            "text": "The standard for fines for business should be a an exponentially increasing percentage of revenue.",
            "title_similarity": "0.3730144",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3cgr1",
            "score": 2,
            "text": "Sorry, try adding another 0 or two to the end of that fine.",
            "title_similarity": "0.27137232",
            "sentiment_compound": 0.128
        },
        {
            "id": "gw3clax",
            "score": 1,
            "text": "Don’t fine them, tell them no!",
            "title_similarity": "0.32426277",
            "sentiment_compound": 0.2714
        },
        {
            "id": "gw3clre",
            "score": 1,
            "text": "There are lots of places that take advantage of these old water rights in California. IIRC the UAE grows their cows food here with cheap water then ships it to their pastures in the Middle East.",
            "title_similarity": "0.4336984",
            "sentiment_compound": 0.25
        },
        {
            "id": "gw3cmmk",
            "score": 1,
            "text": "Doesn’t stop them from draining Michigan’s Great Lakes. Fuck those people",
            "title_similarity": "0.5075743",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gw3coft",
            "score": 1,
            "text": "How the hell are they allowed to have a business where they bottle tap water and sell it back to you?!",
            "title_similarity": "0.4575817",
            "sentiment_compound": -0.7088
        },
        {
            "id": "gw3ctpc",
            "score": 1,
            "text": "Nestle really be evil",
            "title_similarity": "0.30832627",
            "sentiment_compound": -0.6887
        },
        {
            "id": "gw3cx26",
            "score": 1,
            "text": "Just kick them out of California",
            "title_similarity": "0.5031667",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3d14r",
            "score": 1,
            "text": "Why does it seem like it's only Nestle though? What about the countless other beverage companies with products that everyone drinks? It appears to me that Nestle wouldn't be considered the demon they are if their product contained high fructose corn syrup or barley and hops.",
            "title_similarity": "0.46812475",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gw3d3d7",
            "score": 1,
            "text": "I swear their CEO is becoming more and more like Dominic Greene from “Quantum of Solace” every time",
            "title_similarity": "0.34380698",
            "sentiment_compound": 0.4323
        },
        {
            "id": "gw3d6u3",
            "score": 1,
            "text": "How about instead just adding a zero on the end for every day?",
            "title_similarity": "0.44977355",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3d7kw",
            "score": 2,
            "text": "/r/fucknestle, without lube.",
            "title_similarity": "0.3396705",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3d9nb",
            "score": 1,
            "text": "Nestle doesn’t give a fuck. Fine or no fine they profit. Big corporations have created a society with blinders on. No one cares to stop them. We’re all doomed.",
            "title_similarity": "0.5311569",
            "sentiment_compound": -0.8581
        },
        {
            "id": "gw3dg3n",
            "score": 1,
            "text": "Why are they allowed to take our natural resources to profit off, in the first place?!",
            "title_similarity": "0.39445537",
            "sentiment_compound": 0.69
        },
        {
            "id": "gw3dixy",
            "score": 2,
            "text": "So they stealing people's water and making that nasty-ass arrowhead bottled water. They should be fine 1 billion dollars. hehe",
            "title_similarity": "0.71580166",
            "sentiment_compound": -0.4902
        },
        {
            "id": "gw3dky1",
            "score": 3,
            "text": "Water should not be privatized change my mind.",
            "title_similarity": "0.33718574",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3dop9",
            "score": 2,
            "text": "California should be suing them for every penny of revenue they made from selling water Nestle didn't have a valid license to pump from California.  Add a hefty fine on top of it.  Then, everyone who works for Nestle who was involved in the decision to steal water should be brought to court and charged with theft and sentenced accordingly.",
            "title_similarity": "0.6973231",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gw3dqvd",
            "score": 1,
            "text": "You can look up executives on Linkedin and ask them to stop abusing corporate powers that degrade our planet.",
            "title_similarity": "0.5352042",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gw3dsr0",
            "score": 1,
            "text": "Can’t wait to move to mars to get away from this corrupt world we live in.",
            "title_similarity": "0.36891034",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3dt6t",
            "score": 1,
            "text": "More like \"politely asks\" tbh. Jail those Fuckers!",
            "title_similarity": "0.39466405",
            "sentiment_compound": -0.3397
        },
        {
            "id": "gw3dwzv",
            "score": 1,
            "text": "People drink water from bottles.. during drought, what possible better use would there for water than for people to drink it?  Nestle puts 5 billion gallons of water in bottles?  Aka people drink 5 billion gallons of water.  GL putting a stop to that.  They'll drink it one way or another.\n\nPerhaps create law making it illegal to export water during drought.",
            "title_similarity": "0.6699431",
            "sentiment_compound": 0.3804
        },
        {
            "id": "gw3dxkh",
            "score": 2,
            "text": "Here’s a wild idea: what if we all stopped drinking bottled water?",
            "title_similarity": "0.60222775",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gw3e0mf",
            "score": 1,
            "text": "Force them to pump it from the ocean. It's their responsibility to treat it and bottle it. They've had enough free product over the years imo....",
            "title_similarity": "0.47155246",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gw3e6l7",
            "score": 2,
            "text": "If Nestle bothers you, stop buying their products boycott them",
            "title_similarity": "0.49982768",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gw3ed6l",
            "score": 2,
            "text": "FUCKING FINALLY. Maybe they will finally prosecute these fuckers.",
            "title_similarity": "0.30241963",
            "sentiment_compound": -0.765
        },
        {
            "id": "gw3ehla",
            "score": 2,
            "text": "What a joke. Nestle has been ignoring the rules for a decade or longer. Why stop now!??!",
            "title_similarity": "0.62604403",
            "sentiment_compound": -0.5638
        },
        {
            "id": "gw3elj7",
            "score": 1,
            "text": "People could always boycott Nestle and their products in protest. They are a massive, globally diverse company with their fingers in a lot of pies.",
            "title_similarity": "0.5979551",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gw3f2le",
            "score": 2,
            "text": "Nestle has been Reddit Enemy #1 for at least a decade. Either they have been repeatedly getting away with murder because every state/country is in on it, or we're only hearing one side of the story.",
            "title_similarity": "0.5933304",
            "sentiment_compound": -0.8481
        },
        {
            "id": "gw3f5hd",
            "score": 1,
            "text": "Whaaaaat? Nestlé a shitty corporation? I never would have guessed.",
            "title_similarity": "0.38655913",
            "sentiment_compound": -0.6072
        },
        {
            "id": "gw3f9c6",
            "score": 1,
            "text": "Fines like this need a sliding scale.",
            "title_similarity": "0.19052398",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw3fcar",
            "score": 2,
            "text": "I don’t understand how people drink nestle that shit is gross",
            "title_similarity": "0.43477786",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gw3forj",
            "score": 2,
            "text": "\"If the state water board approves the cease-and-desist order against BlueTriton, the company could face fines of up to $1,000 a day, or up to $10,000 a day if a drought is declared in the area.\"\n\nUm...yeah they will laugh at that and say ok cost of doing business.  Now if it's say $1,000,000 a day and $10,000,000 if a drought is declared THEN it MIGHT register on their radar.\n\nBut think about it how much $ will they make off 53 million gallons.\n\nLets say they pump 350 days a year.  Or on avg 150,000 gallons a day.  That would mean they reach their cap in 15 days, 3 weeks into the year.  So now they pay a $335,000 fine without a drought.  Or at most $3,350,000 with one for a whole year.  I don't think even the $3.3 million dollar fine would worry them in the slightest bit.",
            "title_similarity": "0.71165586",
            "sentiment_compound": 0.3516
        },
        {
            "id": "gw3fs15",
            "score": 1,
            "text": "so instead they're gonna have to ship in truckloads of water from somewhere else to satisfy local demand\n\nenjoy the extra carbon emissions and higher prices for no benefit",
            "title_similarity": "0.57719386",
            "sentiment_compound": 0.4973
        },
        {
            "id": "gw3fssc",
            "score": 1,
            "text": "They need to change the walls Nestlé shouldn’t be taking order to begin with",
            "title_similarity": "0.37237498",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3fv9e",
            "score": 1,
            "text": "Nestle will sue and win based on some bogus reason",
            "title_similarity": "0.21120495",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gw3fvea",
            "score": 2,
            "text": "Yo nestle stays fuckin with peoples water what the hell",
            "title_similarity": "0.33712995",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gw3fywd",
            "score": 1,
            "text": "Who runs Nestle? Do they have a family?",
            "title_similarity": "0.14127143",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3g0h1",
            "score": 1,
            "text": "Change the fine to 1000$ per gallon and we it’ll stop them.",
            "title_similarity": "0.670128",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw3g3h3",
            "score": 2,
            "text": "Nestle steals Michigan’s water and sells it back to us\n\nI almost NEVER buy bottled water.  \n\nI urge everyone to put a filter on their tap because fuck Nestle",
            "title_similarity": "0.7111905",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gw3g56o",
            "score": 1,
            "text": "I wish that sentence would have ended at stop.",
            "title_similarity": "0.3728146",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw3gk59",
            "score": 1,
            "text": "Serious question, Preferably to someone from California, Does Nestle water taste good at least ? Or is there better local water out there?\nWhen I compare the bottled water brands  that we have here in Canada, Nestle seem to be the worst, in fact worse than the tap water but not sure what’s the source of Nestle water in Canada.",
            "title_similarity": "0.5329738",
            "sentiment_compound": -0.5651
        },
        {
            "id": "gw3gmvg",
            "score": 2,
            "text": "How are people still buying all of these bottles. Wish the states would ban single use already. I understand places like flint need bottle water but the rest of the US should have good water",
            "title_similarity": "0.563637",
            "sentiment_compound": 0.631
        },
        {
            "id": "gw3gofg",
            "score": 2,
            "text": "send in the national guard to stop them from stealing water and reselling it to us with massive mark-ups",
            "title_similarity": "0.5659226",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gw3gp78",
            "score": 2,
            "text": "As the old saying goes \"Fuck Nestlé\"",
            "title_similarity": "0.36664397",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw3gpxh",
            "score": 2,
            "text": "$10,000 dollar a day, or 3.65 million a year is a rounding error for a billion dollar company like Nestle. This will literally doing nothing.\n\nWant to stop Nestle? Do 10 million dollar a day fines.",
            "title_similarity": "0.6625012",
            "sentiment_compound": 0.1195
        },
        {
            "id": "gw3gtyl",
            "score": 1,
            "text": "Man I miss those Crunch bars! Fuck Nestle!",
            "title_similarity": "0.4702027",
            "sentiment_compound": -0.6892
        },
        {
            "id": "gw3gxqd",
            "score": 2,
            "text": "How do we, the people, actually stop this? What can an average person do. Nestle has been doing this for decades and it's evident that nothing will change. I boil over with rage seeing the greed of people yet I feel so powerless. Please, how can somebody make a different to stop this?",
            "title_similarity": "0.5904952",
            "sentiment_compound": -0.9118
        },
        {
            "id": "gw3gyws",
            "score": 2,
            "text": "\"We can't produce water bottles? Ok let's produce alkaline unflavored flavored drinks.\"",
            "title_similarity": "0.47064653",
            "sentiment_compound": 0.296
        },
        {
            "id": "gw3hbb6",
            "score": 2,
            "text": "Sounds like they've already anticipated losing the case and getting hit with a whopping big fine...  \n>The draft order comes two months after Nestlé, which is based in Switzerland, sold its US- and Canada-based water brands to equity firms One Rock Capital Partners and Metropoulos for $4.3bn\n\nThat way they can throw the North American branch to the wolves and let the Equity firms absorb the damage. And if they win the case, they'll probably buy that arm back.",
            "title_similarity": "0.67069715",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw3hgtv",
            "score": 4,
            "text": "If you are concerned about the droughts in California please consider doing the following:  \n\\* If you live in California, reduce your own luxury water consumption.  Don't water your lawn, consider sharing backyard pools with a neighbor instead of each of you filling your own.    \n\\* If you live anywhere, reduce the amount of meat and dairy you consume, as these industries use the largest share of California's water for luxury.  Almonds also get pointed out as being egregious for water use.  California's almond crop uses about 11% of the state's water, while the meat and dairy industries use upward of 30%.  California's almond crops are used to fill 80% of the world's almond demand, while the beef supply accounts for only 9% of the national demand.   \n\\* Hold the industries themselves accountable with your local governments!",
            "title_similarity": "0.66626203",
            "sentiment_compound": 0.68
        },
        {
            "id": "gw3hidc",
            "score": 2,
            "text": "Well I'm boycotting them I guess. \n\nEdit: didn't realize how many shit brands they own. It won't be hard to boycott them lol",
            "title_similarity": "0.49063236",
            "sentiment_compound": -0.5274
        },
        {
            "id": "gw3hkip",
            "score": 3,
            "text": "Even at $10,000 a day, Nestle will still make the money back by drawing 158,904 gallons a day!",
            "title_similarity": "0.49047586",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3hrqu",
            "score": 3,
            "text": "All together now, FUCK NESTLE",
            "title_similarity": "0.23929535",
            "sentiment_compound": -0.6408
        },
        {
            "id": "gw3htp1",
            "score": 3,
            "text": "A lot of Cali’s Agra-business should ALSO be scrutinized.\n\nAs cited in an article in the New York Times, it takes approximately 15 gallons of water to produce just 16 almonds",
            "title_similarity": "0.48977768",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3hyfc",
            "score": 2,
            "text": "Thank you for stopping this. Get your water somewhere else nestle.",
            "title_similarity": "0.30406064",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gw3hykb",
            "score": 3,
            "text": "I hate Nestle. The concept of bottling our water to sell it back to us is abhorrent.",
            "title_similarity": "0.5496558",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gw3i1g5",
            "score": 3,
            "text": "The same shitty company that can’t make chocolate without slave labor. Fuck nestle",
            "title_similarity": "0.51449496",
            "sentiment_compound": -0.1901
        },
        {
            "id": "gw3i5sy",
            "score": 3,
            "text": "they got 58 million gallons when they were only supposed to get about 2 million. thats insane",
            "title_similarity": "0.5606922",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gw3icyl",
            "score": 2,
            "text": "Nestle isn’t even in the Top 100 when it comes to businesses pumping fresh water in California.",
            "title_similarity": "0.6345103",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gw3ifpl",
            "score": 5,
            "text": "Say it with me......\n\nFUCK NESTLE",
            "title_similarity": "0.28329283",
            "sentiment_compound": -0.6408
        },
        {
            "id": "gw3ifzf",
            "score": 2,
            "text": "coming from a county that nestle takes water from, GOOD!",
            "title_similarity": "0.26754946",
            "sentiment_compound": 0.6027
        },
        {
            "id": "gw3ih6b",
            "score": 6,
            "text": "I was just watching the episode of bottled water in Rotten on Netflix and they showed how Nestle  sucks dry bodies of water. Makes you rethink buying bottled water.",
            "title_similarity": "0.55499685",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gw3irfu",
            "score": 2,
            "text": "It’s been raining lately but as soon as summer months roll around. God help us all. Utilities ramp up to more than my car payment and I barely use the AC in a 2 bedroom apartment. The sun comes around boils through my windows and slowly reminds me how fucked we are because we failed Mother Nature.",
            "title_similarity": "0.64969265",
            "sentiment_compound": -0.7469
        },
        {
            "id": "gw3izwj",
            "score": 2,
            "text": "**tldr estimating 600k-591k in profit per day after fine**\n\nthe work\n\nif that 58 million gallons a year number is accurate thats 439,289,940.8 water bottles a year assuming standard 16.9 oz and 1,202,710.3 bottles per day. profit margins are between 50% and 200% but assuming low 50% with the bottles retailing for 1$ each that 601,355.15$ in profit per day before a 1,000-10,000$ fine. some water bottles are sold individually and some [are nto for individual sale](https://i.redd.it/buowhokub6x11.jpg) sold in bulk. i suspect the 50%-200% profit is due to this with individuals bringing in 200% and bulk bringing in 50% but those articles quoting profit margins dont show the sources  ¯\\\\\\_(ツ)\\_/¯",
            "title_similarity": "0.56419325",
            "sentiment_compound": 0.9144
        },
        {
            "id": "gw3jvjv",
            "score": 2,
            "text": "It's about time ! I read a couple years ago that their permit ran out in the late 80s, nobody in CA. seemed to be interested while Nestle pumped the aquifer dry, paid zero for it, and made billions selling it.",
            "title_similarity": "0.74536943",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gw3jxjg",
            "score": 4,
            "text": "Fox News: Socialist California bullies white-owned baby food company with rich heritage dating back to 1866.",
            "title_similarity": "0.4994294",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gw3jzod",
            "score": 1,
            "text": "Why is nestle taking water from the land and selling it making millions of dollars. That just seems like a weird concept to me.",
            "title_similarity": "0.6175349",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw3k2se",
            "score": 2,
            "text": "Narrator: They didn't",
            "title_similarity": "0.059005518",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3k9xz",
            "score": 2,
            "text": "Yeah. We need to stop letting companies sell our water. Times up.",
            "title_similarity": "0.6491484",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3kqw2",
            "score": 2,
            "text": "Nestle should start building water treatment facilities, win people over and help the environment.  \nLmao in what world would that even happen.",
            "title_similarity": "0.37177664",
            "sentiment_compound": 0.886
        },
        {
            "id": "gw3llsd",
            "score": 1,
            "text": "Fucking Nestle fucking the world.",
            "title_similarity": "0.39959168",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3lwal",
            "score": 5,
            "text": "If they’re fine with slavery, they’re fine with using water during a drought and paying a fine.",
            "title_similarity": "0.37764466",
            "sentiment_compound": -0.34
        },
        {
            "id": "gw3m057",
            "score": 1,
            "text": "people need to stop that shit or it wont go away",
            "title_similarity": "0.29789943",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gw3m1lz",
            "score": 1,
            "text": "So water is going to go up because they will just up the price to pay for the fine. Make it a percent of gross revenue and it might actually work.",
            "title_similarity": "0.32777643",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gw3m8ye",
            "score": 2,
            "text": "Make this order permanent",
            "title_similarity": "-0.023227798",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3myf5",
            "score": 2,
            "text": "I fucking hate Nestle",
            "title_similarity": "0.45606807",
            "sentiment_compound": -0.6115
        },
        {
            "id": "gw3nai6",
            "score": 3,
            "text": "Send police over there and shut them the fuck down. It’s your god damn state not Nestles. Let them fight it in court. If it were anyone else we’d be in damn jail.",
            "title_similarity": "0.5152434",
            "sentiment_compound": -0.8555
        },
        {
            "id": "gw3nbk8",
            "score": 1,
            "text": "Wow this might bankrupt Nestle lol. Is this for real? We're talking about California here , which doesn't get much rain to start with. It's bullshit in Michigan too, but I don't think they're going to run out of water ...The lack of urgency is unreal. Cal needs to be saving every last drop.",
            "title_similarity": "0.54481345",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gw3njn2",
            "score": 1,
            "text": "I mean golf courses and vineyards and numerous other businesses need to cut back too.",
            "title_similarity": "0.51175916",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gw3nkgo",
            "score": 3,
            "text": "Fuck the privatization of fresh water and the politicians that support it",
            "title_similarity": "0.58576095",
            "sentiment_compound": 0.128
        },
        {
            "id": "gw3nkny",
            "score": 1,
            "text": "It took them long enough!",
            "title_similarity": "0.20652287",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3o0zo",
            "score": 3,
            "text": "Why? So they can just go pump somewhere else? God, human greed is a curse.",
            "title_similarity": "0.4441455",
            "sentiment_compound": -0.6662
        },
        {
            "id": "gw3o12b",
            "score": 2,
            "text": "Nestle is the most parasitic company out there. They have no respect for local environment, people or culture. It is the epitome of what's wrong with corporate greed. We should all boycott this company.",
            "title_similarity": "0.6037477",
            "sentiment_compound": -0.8643
        },
        {
            "id": "gw3o4k9",
            "score": 2,
            "text": "The 81k people who upvoted this should also all agree to stop buying single use water bottles.",
            "title_similarity": "0.6142825",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gw3obuw",
            "score": 1,
            "text": "In my opinion, Nestlé processed water doesn’t have a good taste to it. That bias could stem from the fact that I’ve been drinking filtered well water for currently all my life, but with all of the processed food products they have underbelt, you’d think they’d ease up on the water harvesting.",
            "title_similarity": "0.55436087",
            "sentiment_compound": 0.6757
        },
        {
            "id": "gw3od8d",
            "score": 5,
            "text": "Isn't nestle a huge contributor to plastic pollution in the ocean as well?",
            "title_similarity": "0.436773",
            "sentiment_compound": 0.0356
        },
        {
            "id": "gw3ohj8",
            "score": 1,
            "text": "Welcome to Europe, where shit like this would be fined based on company profits and value instead of a 10'000$ fine to a company that has a profit margin in billions.(at least where I'm from)",
            "title_similarity": "0.53419966",
            "sentiment_compound": 0.872
        },
        {
            "id": "gw3op1w",
            "score": 3,
            "text": "If only California had a really large source of water nearby.  Maybe one that they could clean the impurities out of, and it wouldn't make any difference at all how much they used.",
            "title_similarity": "0.52866113",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw3os9z",
            "score": 2,
            "text": "They should just seize the machinery and shut it down. What is it with these bullshit fines?",
            "title_similarity": "0.5199285",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gw3oye8",
            "score": 1,
            "text": "Let's just let them turn all of our water into chocolate",
            "title_similarity": "0.30985284",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3p7og",
            "score": 1,
            "text": "just dont drink any bottled stuff people. No salty sweetened water called sports drink either. \n\n*beer is exempt",
            "title_similarity": "0.4306994",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gw3p9xr",
            "score": 1,
            "text": "The fine needs to be 3x gross receipts for product illegally obtained. \n\nAll personnel and contractors involved in water extraction should be required to verify a valid permit via phone or web prior to extracting water and violators should be arrested and their equipment impounded.",
            "title_similarity": "0.5761769",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gw3pl1b",
            "score": 2,
            "text": "About fucking time, but also, not nearly enough.",
            "title_similarity": "0.1440127",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3ps6l",
            "score": 3,
            "text": "If the punishment is a fine then it’s not a punishment for rich people and corporations. It’s just another expense",
            "title_similarity": "0.34464675",
            "sentiment_compound": 0.5897
        },
        {
            "id": "gw3pvgw",
            "score": 3,
            "text": "They'll just raise the price out the door which in turn will be our problem. Here's a thought, stop drinking bottled water.",
            "title_similarity": "0.5713261",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gw3q36a",
            "score": 1,
            "text": "nestle: its only a flesh wound",
            "title_similarity": "0.16823345",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3qcdl",
            "score": 2,
            "text": "Must be an election coming.....\n\n\nOh wait",
            "title_similarity": "0.14243768",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3qm2i",
            "score": 2,
            "text": "That’s such a low number I’m sure they’ll just pay the fines and keep on keepin on.",
            "title_similarity": "0.32158",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gw3qp23",
            "score": 2,
            "text": "Nestle does this the world over.",
            "title_similarity": "0.12645231",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3r0zv",
            "score": 1,
            "text": "Forget it Jack it's Chinatown",
            "title_similarity": "0.32250142",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gw3ros6",
            "score": 2,
            "text": "Just curious, but can California pull in ocean water and desalinate it for drinking?\n\nI know Israel does this pretty successfully, and could be a viable option for the west coast.",
            "title_similarity": "0.37066543",
            "sentiment_compound": 0.9017
        },
        {
            "id": "gw3rqi1",
            "score": 2,
            "text": "Water futures about to 📈 this isn’t going to end well for us regular people.",
            "title_similarity": "0.4048218",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw3rwff",
            "score": 1,
            "text": "I've been looking into getting a small under-the-sink water purifier, there are a ton of them. Any suggestions?",
            "title_similarity": "0.31554142",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3rxrz",
            "score": 1,
            "text": "Papagian & McBride got this. r/GoliathTV",
            "title_similarity": "0.13413544",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3s4in",
            "score": 2,
            "text": "This is the company that thought water wasn't a right but a privilege right? Yeah good luck.",
            "title_similarity": "0.32187966",
            "sentiment_compound": 0.9313
        },
        {
            "id": "gw3skbf",
            "score": 2,
            "text": "\" If the state water board approves the cease-and-desist order against BlueTriton, the company could face fines of up to $1,000 a day, or up to $10,000 a day if a drought is declared in the area.\"\n\n&#x200B;\n\nThats PENNIES for theses Assholes!",
            "title_similarity": "0.757619",
            "sentiment_compound": -0.3382
        },
        {
            "id": "gw3skx7",
            "score": 2,
            "text": "And imagine how much plastic is used for those millions of gallons of water bottles",
            "title_similarity": "0.5886237",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3sqaw",
            "score": 2,
            "text": "$1000/day will never stop those assholes. Make it $100,000/day, hell maybe even a million/day would actually make them reconsider",
            "title_similarity": "0.49712056",
            "sentiment_compound": -0.163
        },
        {
            "id": "gw3srf5",
            "score": 1,
            "text": "Seems kinda redundant to say \"drought-hit California\"",
            "title_similarity": "0.5640453",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3t09c",
            "score": 2,
            "text": "Nestle: opens nipple flaps and rubs nipples",
            "title_similarity": "0.16669232",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3tf5d",
            "score": 2,
            "text": "I hear all about nestle being a terrible company, but I buy bottled water. I know not buying it is best but if I am going to who is a better company?",
            "title_similarity": "0.5127731",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gw3thtj",
            "score": 3,
            "text": "Stop buying bottled water. It's that simple. Fuck nestle capitalising on something as important and basic as water....",
            "title_similarity": "0.52705944",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gw3titz",
            "score": 3,
            "text": "As someone who grew on Nestle Powder Milk... FUCK NESTLE",
            "title_similarity": "0.51686096",
            "sentiment_compound": -0.6408
        },
        {
            "id": "gw3tkks",
            "score": 1,
            "text": "Give us seeds not corporate greed!",
            "title_similarity": "0.12277012",
            "sentiment_compound": 0.3716
        },
        {
            "id": "gw3tmlw",
            "score": 1,
            "text": "Water is a human right!",
            "title_similarity": "0.0074544735",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3ty52",
            "score": 1,
            "text": "I highly doubt Nestlé cares.",
            "title_similarity": "0.22497171",
            "sentiment_compound": 0.1206
        },
        {
            "id": "gw3tzkk",
            "score": 1,
            "text": "Excellent! I have been waiting and waiting for this!",
            "title_similarity": "0.035857316",
            "sentiment_compound": 0.6467
        },
        {
            "id": "gw3unnt",
            "score": 2,
            "text": "What a concept: we don't have to sell of our resources at a pittance of their value, we could keep them for the people....",
            "title_similarity": "0.08996104",
            "sentiment_compound": 0.34
        },
        {
            "id": "gw3uquv",
            "score": 2,
            "text": "The sad part is Governor Brown gutted the state ability to weather drought. Then they elected him for a third time. \n\nAt this point they kinda deserve to be parched",
            "title_similarity": "0.69800013",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gw3v178",
            "score": 3,
            "text": "They have a \"right\" to 2.3 million gallons a year?  And they took 58 million last year?  And how much the year before that?\n\nCap it.  \n\n\"But we have the right to 2.3 million gallons a year!\"\n\n\"And last year you took out your allocation for the next 25 years. Ask again in 26 years.\"",
            "title_similarity": "0.5482743",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3vg8a",
            "score": 1,
            "text": "Glad that the government is finally taking action on the shit that Nestle has been taking for almost 8 fucking years now. [Not that they haven't had the opportunity to do something about it at any point during that time](https://www.npr.org/2018/06/28/624156334/nestl-offered-permit-to-continue-taking-water-from-california-stream). Fucking pathetic.",
            "title_similarity": "0.67599255",
            "sentiment_compound": 0.1717
        },
        {
            "id": "gw3w0y8",
            "score": 2,
            "text": "I always forget nestle is also doing this to california and not just exploiting middle eastern countries resources. Ahh well, I wonder how their child slavery lawsuit is going",
            "title_similarity": "0.5000998",
            "sentiment_compound": -0.6242
        },
        {
            "id": "gw3w4as",
            "score": 1,
            "text": "“Orders” as if they couldn’t just refuse.",
            "title_similarity": "-0.023023814",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw3w5df",
            "score": 3,
            "text": "Fines aren't going to do it.   \n\n\nCan't the state just padlock the plant? By force if necessary?",
            "title_similarity": "0.41403034",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3w6g5",
            "score": 1,
            "text": "Rarely ever buy Arrowhead water, the generic brands you get at Costco or Safeway are cheaper,  just as good and tastes like water.",
            "title_similarity": "0.29773277",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gw3wa87",
            "score": 2,
            "text": "Stop drinking bottled water people!",
            "title_similarity": "0.58802426",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gw3wdg5",
            "score": 2,
            "text": "Ah so Bill Burr wasn't spouting random crap a few years back",
            "title_similarity": "0.2473908",
            "sentiment_compound": 0.2924
        },
        {
            "id": "gw3weln",
            "score": 6,
            "text": "And the Hundreds of Golf Courses...",
            "title_similarity": "0.23580912",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3x8lk",
            "score": 2,
            "text": "Hallelujah hit em where it hurts their wallet $$$",
            "title_similarity": "0.593418",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gw3xa0w",
            "score": 1,
            "text": "I’m just here so I don’t get fined",
            "title_similarity": "0.00037106872",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3xzg4",
            "score": 1,
            "text": "Narrator:  They did not",
            "title_similarity": "0.08234572",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3yhvm",
            "score": 1,
            "text": "they should have moved out of California long time ago",
            "title_similarity": "0.46849647",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3ymxg",
            "score": 2,
            "text": "There's a weird phenomenon where people see the word \"drought\" and \"California\" in the same sentence and go \"of course.\" But there isn't the same association with states like Colorado, or New Mexico, or Utah, or Arizona, even though these states have WORSE overall drought conditions right now than California does. But when big progressive California does something, that's what generates the news. If they aren't allowed to in California, Nestle will probably go right back to sucking the water out of Oregon or Colorado, even though, again, these states are also in extreme drought. Stop singling out California as the Droughty McWildfire state, just because they're DOING SOMETHING about it. *The whole southwest right now* should be telling Nestle to fuck off. Show me *that* headline.",
            "title_similarity": "0.70312476",
            "sentiment_compound": -0.9035
        },
        {
            "id": "gw3ytop",
            "score": 3,
            "text": "They need a MUCH bigger stick. $10,000/day is nothing to these leeches. They should put in a better monitoring system, reduce the amount drawn to the actual agreed figure, then make them prorate all the overdraws until they have \"paid\" back their overdraws or risk being shut down completely. This is the main reason I don't buy anything Nestle.",
            "title_similarity": "0.68942994",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw3yutx",
            "score": 1,
            "text": "Time for Nestlé to move",
            "title_similarity": "0.055487815",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3zd5w",
            "score": 2,
            "text": "This should of been done years ago.",
            "title_similarity": "0.29408604",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3zisp",
            "score": 1,
            "text": "The article mentions that’s its water they sell as Arrowhead. Don’t know who drinks that nasty tasting water.",
            "title_similarity": "0.5045935",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gw3znr0",
            "score": 1,
            "text": "Nestle is a eco terrorist even in times of blight to drought for profit.\n\n&#x200B;\n\n\\-------------\n\nScandalous History Of Infant Formula, Nestle ended up killing babies.\n\n[https://www.businessinsider.com/personal-finance/nestles-infant-formula-scandal-2012-6](https://www.businessinsider.com/personal-finance/nestles-infant-formula-scandal-2012-6)",
            "title_similarity": "0.6629404",
            "sentiment_compound": -0.891
        },
        {
            "id": "gw4060y",
            "score": 1,
            "text": "Ah, a small cost in production on the downstream activities that can be pass down to the consumer.",
            "title_similarity": "0.100710586",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw40k67",
            "score": 1,
            "text": "Why not move their operations?",
            "title_similarity": "0.16347405",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw40moi",
            "score": 1,
            "text": "Honestly at this point, if you dont check products for a nestle tag, god help you float thru life.",
            "title_similarity": "0.3684469",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gw40yo9",
            "score": 2,
            "text": "In Finland, the fine correlates fits your salary. Nestle’s will find a loop hole to mark these fines for business expenditures - or loophole their fines into claims that will eventually be waivered off.",
            "title_similarity": "0.3512748",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw415tm",
            "score": 1,
            "text": "Are we really surprised that Nestlé is being a garbage company....yet again?",
            "title_similarity": "0.3798429",
            "sentiment_compound": 0.2944
        },
        {
            "id": "gw41a00",
            "score": 1,
            "text": "Fucking finally. What an obscene deal this has always been",
            "title_similarity": "0.29597163",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gw41bhz",
            "score": 3,
            "text": "Nestle is a true enemy of humanity and the climate.California should kick them out of the state . They’re just gonna keep bottling that water until they drying out the spring. Than they’ll just pack their shit and leave Cali hanging high and dry.",
            "title_similarity": "0.74120146",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gw41hmr",
            "score": 1,
            "text": "Isn't this a little late? Like by 20 years?",
            "title_similarity": "0.40041643",
            "sentiment_compound": 0.3781
        },
        {
            "id": "gw41k0w",
            "score": 2,
            "text": "Nestlé pumps the water in Colorado where I live—don’t buy bottled water!",
            "title_similarity": "0.6395829",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw41mqa",
            "score": 1,
            "text": "Hell, it’s about time!",
            "title_similarity": "0.08286722",
            "sentiment_compound": -0.7088
        },
        {
            "id": "gw422ah",
            "score": 1,
            "text": "I am really surprised Nestle water plants haven’t been the (to use the word lightly) “victims” of eco-terrorism. Nestle must have armed guards around those pipes like Rockefeller did with his oil pipelines.",
            "title_similarity": "0.51565886",
            "sentiment_compound": 0.5709
        },
        {
            "id": "gw4240x",
            "score": 1,
            "text": "Time for Nestle to pull up, sell off the buildings and move to a new state. I like my chocolate to much for a crazy price increase.",
            "title_similarity": "0.3825151",
            "sentiment_compound": 0.34
        },
        {
            "id": "gw42kar",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.2774773"
        },
        {
            "id": "gw42uq0",
            "score": 1,
            "text": "Gr8. Theyll probably just up the consumption of canadian water to offset.",
            "title_similarity": "0.38674092",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gw42x9o",
            "score": 2,
            "text": "I’ve said it before I’ll say it again. \n\nFuck Nestle and everything they stand for.",
            "title_similarity": "0.47896934",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw430gi",
            "score": 2,
            "text": "Just kick the evil company out of your state.",
            "title_similarity": "0.5107472",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw43i0z",
            "score": 3,
            "text": "Nestle should just be stopped all together.",
            "title_similarity": "0.40294445",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gw4404o",
            "score": 1,
            "text": "Lmao. And where these fines will go? Straight to politicians pockets. And when they declare a drought and raise up the water bills, who actually suffer? Oh that is right the hard working citizens. Nothing but a joke.",
            "title_similarity": "0.6793016",
            "sentiment_compound": -0.3054
        },
        {
            "id": "gw44aih",
            "score": 1,
            "text": "Great. Means they’ll pump more out of MI.",
            "title_similarity": "0.25823435",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gw44f18",
            "score": 2,
            "text": "This is the same Corp that tried to say water wasn't a human right when they got a wrist slap for child slavery and  making water unaffordable to the people whose water they were stealing and trying to sell back to them...right?",
            "title_similarity": "0.5887792",
            "sentiment_compound": -0.836
        },
        {
            "id": "gw44j23",
            "score": 1,
            "text": "Who is buying the water Nestle is selling? If it’s consumed locally isn’t that similar from a water consumption point of view as drinking from the tap?  I totally understand the harm from the bottles though.",
            "title_similarity": "0.4821246",
            "sentiment_compound": -0.6278
        },
        {
            "id": "gw44ji4",
            "score": 3,
            "text": "Can we make this Permanently California please ??? Ban Nestle permanently !",
            "title_similarity": "0.5180142",
            "sentiment_compound": -0.4822
        },
        {
            "id": "gw44jyx",
            "score": 1,
            "text": "Zero effort zero effect\n\nWhy isn't this proportional",
            "title_similarity": "0.19022822",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw44ur6",
            "score": 1,
            "text": "I'm sure Nestle a multinational corp. will heed the order and not countersue while simultaneously giving vast sums of money to Californian politicians to press the order into being eliminated.  That's what democracy is about.",
            "title_similarity": "0.55475104",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gw44van",
            "score": 1,
            "text": "Why are they pumping water?",
            "title_similarity": "0.27942398",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw450a6",
            "score": 2,
            "text": "How many people are actually willing to simply stop giving them money though? \n\nMost consumers don't care :(.",
            "title_similarity": "0.42919117",
            "sentiment_compound": -0.4003
        },
        {
            "id": "gw45247",
            "score": 3,
            "text": "Well that only took, what, 10 years?",
            "title_similarity": "0.3390417",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw45byi",
            "score": 2,
            "text": "For some reason I'm tempted to steal a truck load of Nestlé water and pour it back to the rivers. I'm not even from the US.",
            "title_similarity": "0.6290309",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gw45ext",
            "score": 2,
            "text": "Stop buying water! Use a filter and a hydro flask",
            "title_similarity": "0.58875555",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gw463n0",
            "score": 5,
            "text": "It's capitalism run amok when a corporation controls a water supply and then sells it back to us. I know I'm not alone in thinking that is utter madness. Water belongs to the people, and someday we're going to have take it back.",
            "title_similarity": "0.49284667",
            "sentiment_compound": -0.3513
        },
        {
            "id": "gw46gpv",
            "score": 1,
            "text": "It’s weird how in 2021 science still hasn’t worked out how to make new water in bulk cheaply. It’s such an important resource.",
            "title_similarity": "0.40925065",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gw46iq0",
            "score": 3,
            "text": "Nestle is scummy as hell. They drained a whole lake somewhere abroad and the village nearby had nothing to drink. Mega corps are evil. Most.",
            "title_similarity": "0.67666656",
            "sentiment_compound": -0.91
        },
        {
            "id": "gw46msy",
            "score": 1,
            "text": "They've been doing this for 45 years! Fucking burn them down.",
            "title_similarity": "0.528763",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw471kf",
            "score": 1,
            "text": "What? We're not in a drought right now.",
            "title_similarity": "0.030828584",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw47uhq",
            "score": 1,
            "text": "They’ll just charge more for bottled water",
            "title_similarity": "0.3715257",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw480kd",
            "score": 2,
            "text": "Psst. It's no longer owned by Nestle, but by BlueTriton\n\nhttps://www.prnewswire.com/news-releases/nestle-waters-north-america-becomes-bluetriton-brands-301263552.html\n\nThis time, it may actually work?",
            "title_similarity": "0.32064277",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gw481nn",
            "score": 2,
            "text": "The irony behind this is that Nestle has deleveraged the water brand, Nestle no longer owns it, they sold it to private equity.  I am sure that portfolio is super happy with this order.",
            "title_similarity": "0.43078595",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gw48ddf",
            "score": 1,
            "text": "Is there a way for people to turn the pumps off or sabotage their systems? Unless they start getting fined big %'s then I don't see what else will make them stop besides forcing them.",
            "title_similarity": "0.5725107",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gw48k2f",
            "score": 4,
            "text": "I like how states are fighting businesses for fucking water.... let's kill Nestlé. Where are my apes? Who wants to short the hell outta Nestlé stock? Because, i don't like the stock. Business model is horrible.",
            "title_similarity": "0.5854579",
            "sentiment_compound": -0.948
        },
        {
            "id": "gw48meq",
            "score": 1,
            "text": "Nestle says \"Lol, ok.  Your fines are a small fraction of our profits.\"",
            "title_similarity": "0.32361138",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gw48xm7",
            "score": 2,
            "text": "$1,000,000,000 fine every minute",
            "title_similarity": "0.5448738",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw497rz",
            "score": 1,
            "text": "Yes. Texan here but fk nestle for this shit",
            "title_similarity": "0.35691303",
            "sentiment_compound": -0.7206
        },
        {
            "id": "gw497xv",
            "score": 1,
            "text": "Isn’t there areas with plenty of water that they could pump from? Why were they pumping there anyways",
            "title_similarity": "0.2884472",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw49jcs",
            "score": 1,
            "text": "Nestle pays the fine, pumps more water to stockpile it and just passed on the cost and California runs out of water. So needing more bottled water $$$",
            "title_similarity": "0.74302983",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw49jna",
            "score": 1,
            "text": "/hydrohomies has consistently hated on nestle.  Hydrate pals.  Hydro homies know best.",
            "title_similarity": "0.5622996",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw49yni",
            "score": 2,
            "text": "Where I live the industries use millions of gallons of water each day for production and cooling. Then the officials turn to you and scold you for watering your plants on the wrong day. Total BS!",
            "title_similarity": "0.78341633",
            "sentiment_compound": -0.7263
        },
        {
            "id": "gw4aig6",
            "score": 3,
            "text": "I'm not saying Anon should attack Nestle, But if they did, It would surely be interesting.",
            "title_similarity": "0.0924646",
            "sentiment_compound": 0.7469
        },
        {
            "id": "gw4akow",
            "score": 1,
            "text": "We can bitch about Nestlé, but a big part of the problem is consumer demand for bottled water.   I personally avoid PET bottled drinks of any type, particularly water.  But it’s really hard to give up the convenience.",
            "title_similarity": "0.48790047",
            "sentiment_compound": -0.8895
        },
        {
            "id": "gw4b0xi",
            "score": 1,
            "text": "The Poland Spring must flow.",
            "title_similarity": "0.17386617",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4bjpf",
            "score": 1,
            "text": "Probably sue the state for breach of contract or something",
            "title_similarity": "0.3630484",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4bwkx",
            "score": 5,
            "text": "How about people hold retailers and themselves responsible for selling/buying things like bottled water. They are not only selling a resource that should be owned by the public, but also contributing heavily to the plastic ecological disaster.",
            "title_similarity": "0.45512718",
            "sentiment_compound": -0.6428
        },
        {
            "id": "gw4dfkp",
            "score": 1,
            "text": "58 million gallons for a full year in the whole scheme of things isn’t that much.  That’s about as much LA uses in 1 day.",
            "title_similarity": "0.45127937",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4e6wv",
            "score": 1,
            "text": "Just think about how much money they spend lobbying to keep this exactly how it is....   It's not like the government doesn't understand what they are doing.  They are absolutely complicit in the act.  Regardless of what they say publicly.  Everyone blames the company and yes they are at fault but the politicians happily take their money and are paid to keep it exactly how it is.",
            "title_similarity": "0.42782217",
            "sentiment_compound": 0.5179
        },
        {
            "id": "gw4efqy",
            "score": 1,
            "text": "Fuck Nestlé! All my hydrohomies hate Nestlé! 🖕",
            "title_similarity": "0.60612786",
            "sentiment_compound": -0.8309
        },
        {
            "id": "gw4elmi",
            "score": 2,
            "text": "Nestle is a POS company. It's crazy the amount of injustice that happens because of stupid people who religiously buy their products. Don't get me wrong, clean water is a necessity, but most people who buy it could easily find fair trade alternatives for any of items produced by slave trade. Also people work there rely on their job, it's an ugly world with almost no winners.",
            "title_similarity": "0.5283091",
            "sentiment_compound": -0.6571
        },
        {
            "id": "gw4fqur",
            "score": 2,
            "text": "How come these fucks are still getting away with this crap?",
            "title_similarity": "0.2560119",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gw4fsrw",
            "score": 1,
            "text": "Nestlé is SWISS. Knowing the Swiss, I have less than zero sympathy. $10 K/day  under normal circumstances, or $100 K/day if there is a drought. Or they can fly in the water from Lac Leman. Taking the water from beloved Switzerland would make them stop very, very quickly.",
            "title_similarity": "0.57828355",
            "sentiment_compound": 0.5165
        },
        {
            "id": "gw4gjo4",
            "score": 1,
            "text": "nestle already owns the water, california cant do anything unles they grow some balls. what is biden going to do for stopping a shitty child labor company for real, send in the fucking military? this isn't russia or china, california needs to charge a million a day, full stop",
            "title_similarity": "0.6507361",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gw4h7yu",
            "score": 2,
            "text": "‘But water is a privilege, not a right’",
            "title_similarity": "0.22256121",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw4hm1v",
            "score": 1,
            "text": "America really is a third world country. With its only natural resources taken by big corp",
            "title_similarity": "0.4694999",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw4ko0x",
            "score": 2,
            "text": "From Michigan, fuck Nestle",
            "title_similarity": "0.37849307",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw4kt9o",
            "score": 3,
            "text": "Nestweee is being tweated so unfwair! You took away owr zipples! Nestweee needs water declared a commodity and not a human Wight!",
            "title_similarity": "0.5510404",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4kxlc",
            "score": 4,
            "text": "Nestle believes drinkable water is a privilege and not a right to humans. They really only care about profits. Unfortunately they will not stop pumping spring water even with this declaration.",
            "title_similarity": "0.46430036",
            "sentiment_compound": 0.8109
        },
        {
            "id": "gw4l47y",
            "score": 2,
            "text": "Don’t buy Nestle products. You’ll be a wealthier person and a healthier person. Just search up the thousand brands they have and try to steer clear. Gg",
            "title_similarity": "0.5081078",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gw4lqtt",
            "score": 3,
            "text": "We’re in a drought again?  SHIT",
            "title_similarity": "0.50847507",
            "sentiment_compound": -0.6523
        },
        {
            "id": "gw4lusx",
            "score": 3,
            "text": "How many times is California going to go through a drought before they actually fucking do something about it? What exactly are they spending all that tax money on?  Cause it sure as shit isn't fixing the homelessness or housing problem.  Maybe instead of pissing away a hundred billion of taxpayers dollars on failed  high speed rail projects you should build a hundred desalination plants.  One of the most useless state governments in the country.",
            "title_similarity": "0.8069794",
            "sentiment_compound": -0.9253
        },
        {
            "id": "gw4ma8l",
            "score": 3,
            "text": "Maybe go with jail time for those in charge of Nestlé instead of fines, see if that works.",
            "title_similarity": "0.28871825",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4n0ap",
            "score": 1,
            "text": "So does this mean Nestle is providing safe water to African mothers to mix with their baby formula?",
            "title_similarity": "0.32443935",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw4nbfj",
            "score": 1,
            "text": "California points finger north and says, “try Oregon”.  Oregon says, “fuck you nestle and go home California, you’re drunk”",
            "title_similarity": "0.6582174",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4nphs",
            "score": 2,
            "text": "Someone should do some forensics on this deal, cause guaranteed some scumbag got paid. Really well.",
            "title_similarity": "0.34164098",
            "sentiment_compound": -0.4228
        },
        {
            "id": "gw4oaaa",
            "score": 2,
            "text": "God I fucking hate them.",
            "title_similarity": "0.3574459",
            "sentiment_compound": -0.4391
        },
        {
            "id": "gw4ojl8",
            "score": 3,
            "text": "Hardly the only thing that Nestles is just plain evil on.",
            "title_similarity": "0.219767",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw4pk8h",
            "score": 1,
            "text": "Who buys nestle water 🤡",
            "title_similarity": "0.2843476",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4pnn5",
            "score": 3,
            "text": "Don't care what brand or marketing gimmick employed (flavors, electrolytes, vitamins, celebrity spokespeople, etc.), I don't think I've ever seen anyone finish a full bottle of water (exc for disasters, unsafe water orders, etc). What a waste.",
            "title_similarity": "0.57241833",
            "sentiment_compound": -0.8413
        },
        {
            "id": "gw4ptm9",
            "score": 1,
            "text": "I'm not sure if California is expecting Nestle to stop or if they're just expecting an extra source of income.",
            "title_similarity": "0.32383138",
            "sentiment_compound": -0.4874
        },
        {
            "id": "gw4qibp",
            "score": 1,
            "text": "It’s only right I share what I know about this abhorrent company. Water is the business. As well as baby powered milk. Now you need to buy both. A mother who literally cannot save herself, lacks milk. Nestle solution. In court, big ceo fought to say water should not be a right and the only way it needs to be done is through privatization. These are just a few I know of. They also have tons of sub companies. Same applies to Coca Cola, Unilever, J&J. \n\nCoca Cola tried to sell Dasani water in the UK but ultimately failed as the public found out it’s from the tap lol\n\nI encourage all to look more into Nestle and please correct me if I have things wrong.",
            "title_similarity": "0.66644925",
            "sentiment_compound": -0.0262
        },
        {
            "id": "gw4qo0r",
            "score": 1,
            "text": "Idiots drinking bottled water for years with no thought about the environment or that tap water is perfectly safe",
            "title_similarity": "0.5385989",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gw4r20i",
            "score": 1,
            "text": "We're not going through a drought right now",
            "title_similarity": "0.12625843",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4rhtc",
            "score": 1,
            "text": "Keep ya head up california",
            "title_similarity": "0.24561898",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4rr3b",
            "score": 2,
            "text": "They tried to open a water plant in Arizona. Yes in the desert, that company is ruthless!",
            "title_similarity": "0.5892811",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gw4s4lp",
            "score": 2,
            "text": "Meanwhile western Canada is planning another round of epic floods and spending billions to get rid of excess water. The country already has 22% of the world’s fresh water supply and lakes/reservoirs are full. It seems that moving excess fresh water to the ocean is the only alternative.",
            "title_similarity": "0.67057896",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gw4s7m2",
            "score": 1,
            "text": "Glad they finally went after the problem...",
            "title_similarity": "0.068293124",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gw4shie",
            "score": 1,
            "text": "No just never let them start again.",
            "title_similarity": "0.31138557",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw4t88a",
            "score": 2,
            "text": "You there, reading this right now.  Why do you need bottled water when you're not on a road trip or something?\n\nWe shouldn't settle for municipal supplies we can't trust, the answer is not to buy bottled water, in the long run.\n\nBut why not get a filter?  Convenience is very expensive :(",
            "title_similarity": "0.497168",
            "sentiment_compound": -0.7564
        },
        {
            "id": "gw4v1lc",
            "score": 1,
            "text": "When people realize we are bottling the water in the US and shipping it to countries like China because they are not able to drink their own water due to polluting everything things might change.",
            "title_similarity": "0.65783226",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw4vmfe",
            "score": 4,
            "text": "Fine them 500,000,000 a day. That might actually stop them",
            "title_similarity": "0.4881165",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw4wg4r",
            "score": 2,
            "text": "Just sue them for damages to the public. Why play these games with penalties and fines",
            "title_similarity": "0.43783498",
            "sentiment_compound": -0.128
        },
        {
            "id": "gw4xbdx",
            "score": 2,
            "text": "*I’m sorry, I can’t hear you with all this pumping going on*",
            "title_similarity": "0.34819844",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gw4ytim",
            "score": 2,
            "text": "Everyone in the world : Yeah I feel like people should be able to live comfortably and not have to work 7 days a week just to live paycheck to paycheck.                                     Nestle: We own the water that comes from the earth",
            "title_similarity": "0.44506606",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gw4z3mo",
            "score": 3,
            "text": "When I worked for a large company, we had a license to operate. Rather than fines, why doesn’t the sheriff or whatever rep of the government walk in and say, “This place is no longer allowed to operate per order XXXXXXX.”?????",
            "title_similarity": "0.5572736",
            "sentiment_compound": -0.4871
        },
        {
            "id": "gw4zt8r",
            "score": 1,
            "text": "Nestle should be nationalized",
            "title_similarity": "0.165897",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw503wz",
            "score": 2,
            "text": "California has been fighting nestle bottling water for a decade as it makes millions off of destroying the environment and worsening fire seasons, that’s why seeing nestle joined Amazon in some pr stunt to “save” the rainforests rang hollow to most people",
            "title_similarity": "0.8048874",
            "sentiment_compound": -0.8689
        },
        {
            "id": "gw505mv",
            "score": 1,
            "text": "Capitalism makes people do evil things like bottle and sell water to people going through a drought.",
            "title_similarity": "0.6373909",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gw50muy",
            "score": 2,
            "text": "Dear nestle,\n\nMichigan residents would also like for you to stop pumping our lakes an springs dry. Our government likes the money too much even with it being pennys they need to grow a backbone to stop it..\n\nThanks \n\n- a michigangder",
            "title_similarity": "0.56123936",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gw50pt0",
            "score": 1,
            "text": "It’s ducking April. What’s going on here?",
            "title_similarity": "0.2527009",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw51j4k",
            "score": 2,
            "text": "If it was you or me pumping a couple of gallons for the veggie garden and a few more for some stock, we'd have a Swat team rock up with weapons drawn and demanding or water pump and pipes.",
            "title_similarity": "0.52456397",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gw51x4r",
            "score": 1,
            "text": "Glad I installed my own RO system.",
            "title_similarity": "0.16030088",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gw527np",
            "score": 1,
            "text": "I kind of feel guilty af for still enjoying Nesquik to this day.",
            "title_similarity": "0.3388744",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gw529ew",
            "score": 2,
            "text": "Nestle is the worlds worst company.  They gave expired formula in Africa and caused babies to die. They fought to make water not “a right of living” to indigenous people whom would die without it.",
            "title_similarity": "0.6672332",
            "sentiment_compound": -0.9349
        },
        {
            "id": "gw52t9q",
            "score": 1,
            "text": "There have been droughts before this and Nestle is going to keep doing it until something physically stops them. So far, they're not even listening to people. And they own so many different companies, it's very to boycott them. I mean, everything from Nestie Quik to surgical instruments.",
            "title_similarity": "0.6312064",
            "sentiment_compound": -0.4902
        },
        {
            "id": "gw53zr1",
            "score": 1,
            "text": "\"Let them eat cake.\", mocked Marie-Antoinette...",
            "title_similarity": "0.28291065",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gw54jt6",
            "score": 1,
            "text": "You mean the individual water user wasn’t the main problem after all? Who would have thought?",
            "title_similarity": "0.27627078",
            "sentiment_compound": -0.4696
        },
        {
            "id": "gw55r76",
            "score": 1,
            "text": "They should build reservoirs instead of that stupid ass train they have blown untold money on",
            "title_similarity": "0.6281173",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gw55ygp",
            "score": 2,
            "text": "My old mining company used to deal with things like this. It was far more practical in a business sense to take the fine, and continue to produce, rather than stop production for the silly state and pay those same expenses either way. Nestle will surely keep feeding obese America with their sweet treats and profit from the disease non the less. Remember folks... money talks, reality walks, eat a fucking salad.",
            "title_similarity": "0.38851267",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gw564ec",
            "score": 1,
            "text": "The fact just is that people should still be living where resources are *available* and where it makes sense to live.\n\nMuch of New Orleans is below sea-level. Probably not a smart place to live considering the frequent hurricanes. If you live in an area where there's no private flood insurance available, that should be a good indicator to not live there.\n\nDoes it make sense to develop communities/urban areas where droughts frequently occur? Probably not. \n\nHumans used to have to live proximal to the resources they needed and in environments that were safe. Now we just assume that everything will come to us. And bitch when it doesn't. This just simply isn't sustainable. \n\nHell people in this country will literally drive 6 blocks just to bot have to walk any further than necessary.",
            "title_similarity": "0.46472758",
            "sentiment_compound": 0.0788
        },
        {
            "id": "gw57jvn",
            "score": 2,
            "text": "Fuck Nestle. They are absolutely fuckwads.",
            "title_similarity": "0.41854668",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw582ie",
            "score": 1,
            "text": "Look... are we ever going to get the big table in here or am I going to have to cut that fucking tree down myself... we will get right on that... yep number one.",
            "title_similarity": "0.38764417",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gw58qfx",
            "score": 2,
            "text": "Did Nestlé just laugh? Offer the one fingered salute and turn the water pumps up to maximum?",
            "title_similarity": "0.39605778",
            "sentiment_compound": 0.6072
        },
        {
            "id": "gw5ahmk",
            "score": 1,
            "text": "Nestles doing this shit all around the world. 1000 a day is nothing to them. They’re pretty much getting the water for free",
            "title_similarity": "0.47987837",
            "sentiment_compound": 0.3071
        },
        {
            "id": "gw5ai0x",
            "score": 1,
            "text": "Environmental laws are a joke and mysteriously here we are in the middle of a pandemic.",
            "title_similarity": "0.49014986",
            "sentiment_compound": 0.296
        },
        {
            "id": "gw5c184",
            "score": 1,
            "text": "Great news.  Long overdue.  Hope they don’t back down.  Nestle has been shady for years:",
            "title_similarity": "0.40707335",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gw5d3wu",
            "score": 2,
            "text": "If the people of california said \"fuck nestle\" theyd listen. I (37m born in rural San Diego, high school by the beach, Downtown for my 20s) dont buy nestle product. I moved to Alaska in 2010 to live with my grandad. Best decision eva. Nestle products suck anyways.",
            "title_similarity": "0.67042804",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw5hmdf",
            "score": 1,
            "text": "They have been stealing our water for years. Time to stop.",
            "title_similarity": "0.654991",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gw5jjun",
            "score": 1,
            "text": "Even though it is fiction, read The Water Knife.  Very, very apropos.",
            "title_similarity": "0.29925174",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw5kghn",
            "score": 3,
            "text": "Laws, people! Stop bottled water companies from polluting the world and selling your water back to you. We have the science to solve drought, let’s do it.",
            "title_similarity": "0.5983962",
            "sentiment_compound": -0.1759
        },
        {
            "id": "gw5llep",
            "score": 2,
            "text": "That’s ridiculous the fines are 1K a day and if there is a state of emergency 10 K a day for Nestlé… That’s just a drop in the bucket. Do you really honestly think those fines would deter them from continuing to siphon the water?\n\nChange those fines to 100 million a day… That all to get them stopping",
            "title_similarity": "0.7095748",
            "sentiment_compound": -0.5434
        },
        {
            "id": "gw5n4gk",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.22236207"
        },
        {
            "id": "gw5qob6",
            "score": 1,
            "text": "No more water and chocolate for awhile? LOL",
            "title_similarity": "0.48581824",
            "sentiment_compound": 0.3254
        },
        {
            "id": "gw5qq0l",
            "score": 3,
            "text": " \n\nPeople get so offended when you point out that most municipal water supplies are typically under more stringent standards than bottled water. Nestle and Coke probably worked real hard to keep people in the dark on that.\n\nEdit: Yes, I know there are exceptions. That's why I used the word \"most.\" As in *most* US municipal water supplies are better off than wasting your money on water from Nestle, Coca-Cola, and PepsiCo.",
            "title_similarity": "0.52488613",
            "sentiment_compound": -0.03
        },
        {
            "id": "gw5s4cz",
            "score": 1,
            "text": "But what about the avocado and almond farms?",
            "title_similarity": "0.100963555",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw5sose",
            "score": 1,
            "text": "I got a speeding ticket in CA that cost more than what they’ll fine Nestle",
            "title_similarity": "0.51297736",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw5stkq",
            "score": 2,
            "text": "[Fuck Nestle](https://old.reddit.com/r/FuckNestle/)",
            "title_similarity": "0.45750582",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw60jvf",
            "score": 1,
            "text": "They should be required to clean seawater to sell it in bottles.",
            "title_similarity": "0.41073036",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw63bul",
            "score": 1,
            "text": "You all realize the letter doesn’t require Nestle to do anything? The government is simply giving them a heads up that this is the path the government is pursuing. It’s a draft of a cease and desist letter.",
            "title_similarity": "0.34899396",
            "sentiment_compound": 0.34
        },
        {
            "id": "gw69b8d",
            "score": 1,
            "text": "Nestlé hired a new employee for $1000 a day: California",
            "title_similarity": "0.57623625",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6bp7f",
            "score": 1,
            "text": "I think that more areas need to start taking way more seriously the concept that companies coming and taking their water, a precious natural resource, to sell elsewhere for $$$, may not be the best and wisest approach. \n\n&#x200B;\n\n>If  the order is finalized, the company could legally face fines of between  $500 and $1,000 a day for every day it \\[\\] continues to take water after  the order is issued, a water board spokeswoman said.\n\nLol. My HOA charges individuals like 100 a day for replacing their porch light without a permit.",
            "title_similarity": "0.6945375",
            "sentiment_compound": 0.8195
        },
        {
            "id": "gw6emzm",
            "score": 1,
            "text": "Nestle: fuck you, I'll do what I want",
            "title_similarity": "0.10159084",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gw6jfvp",
            "score": 3,
            "text": "They need to force nestle to stop. A few thousand dollars is a joke- ffs",
            "title_similarity": "0.5561367",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gw6jsr0",
            "score": 4,
            "text": "Nestle is the worst and they give zero fucks about a $1000/day fine",
            "title_similarity": "0.6706155",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gw6vyj4",
            "score": 4,
            "text": "Holy shit, ***just now?*** not back in 2016 when we were first in droughts across the country and Nestlé decided to start using our freshwater reserves to charge us for sustenance? Fucking finally.",
            "title_similarity": "0.6296656",
            "sentiment_compound": -0.6072
        },
        {
            "id": "gw7heu5",
            "score": 1,
            "text": "I keep hearing about how water will be THE resource of the future - yet it feels like more and more people keep moving and building  in the mostly arid regions of the USA where water continues to be an issue ?",
            "title_similarity": "0.46615252",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw9835g",
            "score": 2,
            "text": "Companies should not own water",
            "title_similarity": "0.3781284",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9c22w",
            "score": 1,
            "text": "The CEO expressed a long time ago his nazi-like mentality towards the use/access of water which comes from precipitation as a by-product of a natural organic rankine-cycle! Like he thinks the people with power should be in charge of controlling the water source!!! \nWtf man?!!?! Did no one hear this a long time ago???\n$1000/day???? They will gladly pay it!!!!!\nThis shit needs be turned into felony charges!!!! They're hoarding a natural resource, like they're claming the energy harnessed in their corner of the world for free, why the hell doesn't anyone see this?!?! Kick those f@$# swedes outta here with their stupid HotPockets and their Nesquik!!!!!\nDo you guys have any idea how much energy it takes to evaporate water from the ocean, to then have it be transported Hundreds of miles through the atmosphere and then have it saturated enough with a significant enough temperature drop so that it will condesate and then fall from 15,000ft from up in the air??? And the Swedes moved into our homeland to come and lay claim to THAT NATURAL PHENOMENA?!?!?!!!!!!! That life-bearing natural solar energy absorbed to trigger precipitation is probably equal if not more than all of the energy consumed by the entire United States in an entire month!!!",
            "title_similarity": "0.6745485",
            "sentiment_compound": 0.7821
        },
        {
            "id": "gw9t2d0",
            "score": 1,
            "text": "Here for when we replace “literally 1984” with “literally Waterworld.”",
            "title_similarity": "0.41419387",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwlryhr",
            "score": 1,
            "text": "Stop buying Nestle products! It's hard, they own so many brands, but check your labels! These are the same cretins that introduced baby formula to third world mothers who then stopped nursing and came to rely on the formula, which is expensive. Shame on them, so low!",
            "title_similarity": "0.6374059",
            "sentiment_compound": -0.9151
        },
        {
            "id": "gwqjibd",
            "score": 1,
            "text": "I honestly don't think they care. They do this here in Canada and just eat the fines and continue on. As long as the only penalty are mediocre fines, Nestlé will continue stealing water until the last drop is sold.",
            "title_similarity": "0.5110965",
            "sentiment_compound": -0.814
        },
        {
            "id": "gwsleo4",
            "score": 1,
            "text": "this should have been done years ago.",
            "title_similarity": "0.28487322",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwuupsn",
            "score": 1,
            "text": "Farmers in California measure their water consumption in MILLIONS OF ACRE FEET (that's a ridiculously large amount of water), which they use to grow rice in the area around our capital city, Sacramento (a very dry area where rice will not grow without huge amounts of irrigation). Those same farmers then export that rice, and (effectively) our water along with it, making tons of profit along the way. They do this with many other water hungry crops as well, up and down the state. Almonds are popular (one gallon of water per almond), pistachios, etc. California farmers are effectively selling all of our water outside the state.\n\nMeanwhile Nestle consumes a (relatively) trivial amount of water, and puts it to - literally - it's highest and best use - water to put directly into our bodies - and they are the ones getting flack?!?!",
            "title_similarity": "0.65341866",
            "sentiment_compound": 0.9513
        },
        {
            "id": "gwuzona",
            "score": 1,
            "text": "The sad part is they had to be told.. capitalism in a nutshell",
            "title_similarity": "0.44291502",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gxozlcq",
            "score": 2,
            "text": "I’ll stop drinking their water from now on. I hate corporations that bends the rule through lobbying",
            "title_similarity": "0.65801775",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gyxxfpy",
            "score": 1,
            "text": "Mexico is experiencing historically the worst drought, but will they do this? No",
            "title_similarity": "0.6179652",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gz111tz",
            "score": 1,
            "text": "Nestle's plant in Cabazon, Ca is on Morongo Indian land. No jurisdiction.",
            "title_similarity": "0.412099",
            "sentiment_compound": -0.296
        },
        {
            "id": "gz31f0r",
            "score": 2,
            "text": "Boycott Nestlé. That's one way to stop 'em. Read labels carefully. If a product is owned or produced by Nestlé, DON'T BUY IT!",
            "title_similarity": "0.49902976",
            "sentiment_compound": -0.5093
        },
        {
            "id": "gzfrhod",
            "score": 1,
            "text": "Is growing food or bottling water waisting it?",
            "title_similarity": "0.19570176",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzj26z4",
            "score": 1,
            "text": "Bit water is not a human right.....according to nestle",
            "title_similarity": "0.36619258",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2idjvr",
            "score": 1,
            "text": "People - \"The government hasn't put enough effort or money into our reservoir system.\"\n\nGovernment - \"Can we have money for our reservoirs.\"\n\nPeople - \"No. You'll waste it.\"\n\nGovernment - \"Can we run an aqueduct through this area.\"\n\nPeople - \"No. You'll spend too much. It will harm the environment. We shouldn't be supporting building up in these overdeveloped areas. People need to stop using so much water, not asking me to be inconvenienced by new construction around me.\"\n\nGovernment - \"Can everyone reduce water usage.\"\n\nPeople - \"Its not me, its them.\"\n\nGovernment - \"Let's reduce development to reduce growth in water use.\"\n\nPeople - \"We need more housing, we need more development to reduce home prices, don't restrict my right to get the most money for my land.\"\n\nGovernment - \"Maybe we shouldn't plant water dependent crops in a desert.\"\n\nPeople - \"You are killing the economy. You are taking jobs. Back off, big government tree huggers.\"\n\nGovernment - \"Ok, things are going to get shitty.\"\n\nPeople - \"Typical government mismanagement.\"",
            "title_similarity": "0.62141263",
            "sentiment_compound": -0.9066
        },
        {
            "id": "h2k5ga6",
            "score": 1,
            "text": "I hate Nestle so much oh my fucking god",
            "title_similarity": "0.50239384",
            "sentiment_compound": -0.3197
        }
    ]
}