{
    "Britney Spears tells LA court she wants her father charged with conservatorship abuse\n": [
        {
            "id": "h5811r4",
            "score": -13,
            "text": "Why is reddit so invested in this story lol?\n\nEdit: I could've predicted every one of these replies I swear I'm just talking to algorithms at this point.\n\nYeah it sucks for her, but this isn't news, there are *literally* millions of more important things happening in the world and they all deserve to be at the top of Reddit more than this TMZ shit, but I guess that's what this site has been for a while now.\n\nPeople acting like I'm saying fuck her lol, I hope she gets what's hers and it all works out for her, I just *don't care* and the only reason you do is because the actual important shit happening in the world isn't getting posted on r/news.",
            "title_similarity": "0.57437885",
            "sentiment_compound": -0.3617
        },
        {
            "id": "h57l7n4",
            "score": 14,
            "text": "The po8nt isn't that her father wants ehats best for yer, she is a capable, successful adult that can handle her own affairs.",
            "title_similarity": "0.3551012",
            "sentiment_compound": 0.891
        },
        {
            "id": "h58ifpk",
            "score": 5,
            "text": "Imagine she's just batshit crazy and he knows it better than anyone.",
            "title_similarity": "0.49707305",
            "sentiment_compound": 0.128
        },
        {
            "id": "h581jxh",
            "score": 5,
            "text": "Britney fighting back. You go girl!",
            "title_similarity": "0.44567552",
            "sentiment_compound": -0.4199
        },
        {
            "id": "h5864wy",
            "score": 5,
            "text": "Can someone come please explain why a grown woman has to go throw all this bullshit against her father. She’s an adult. Why does her father still have control over her",
            "title_similarity": "0.7308534",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h57wo3s",
            "score": -6,
            "text": "How much is her father ‘allegedly’ paying (bribing) the judge and other people in power over her to stay in power?\n\nJustice means nothing in the shadow of corruption.",
            "title_similarity": "0.65451986",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h5847rg",
            "score": -25,
            "text": "Why do we care so much about celebrities in America. Let them handle their own business. Celebrity worship here is a joke. Sad that this is at the top of “news.”",
            "title_similarity": "0.5946848",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h58k5te",
            "score": -7,
            "text": "Why are we so enamoured with celebrities? So many people are abused by their fathers and many are abused worse than her. I don't see them on the news.",
            "title_similarity": "0.6748918",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h583esd",
            "score": -35,
            "text": "All I can say is that based on her Instagram content, she seems….not well. She looks like a sweaty crackhead stripper just dancing and twirling around in front of the camera over and over and over. None of her posts are normal or talking about her kids life. It’s just “look at meeee! Weee! I’m dancing my heart out!” It’s very child-like. I definitely think this conservatorship needs to end with her dad holding the reigns, but someone needs to be looking out for her. She’s not right. She clearly has bipolar 1 or something else that requires medication for life and lots of therapy, etc. I’m pretty sure if she was calling the shots in her life and finances right now on her own, not medicated, she would crash and burn very fucking quickly.",
            "title_similarity": "0.6604048",
            "sentiment_compound": 0.8211
        },
        {
            "id": "h59bnnh",
            "score": 0,
            "text": "I know I may be the only one, but she appears to have serious mental issues to me.\n\nShe appears to have the mind of a child.",
            "title_similarity": "0.35941255",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h5800h0",
            "score": -9,
            "text": "Now she is free to hire Kim Kardashian.  That would be a reality show I would watch!",
            "title_similarity": "0.39961144",
            "sentiment_compound": 0.5562
        },
        {
            "id": "h580uc4",
            "score": 11,
            "text": "abuse? more like enslavement. Should also jail the woman that controls it and the company that made it happen, not just her father.",
            "title_similarity": "0.75747967",
            "sentiment_compound": -0.3415
        },
        {
            "id": "h585fhz",
            "score": -2,
            "text": "A father would do anything to protect his daughter.  \n\nBut to profit from her by taking away her rights is sickening.",
            "title_similarity": "0.5846013",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h58bfwt",
            "score": 6,
            "text": "I don't know how the law works in the US, but in Quebec, putting someone under tutelage is extremely difficult and it has to be reevaluated frequently. The odds of someone managing to put someone else under their tutelage or maintaining it when it isn't warranted are close to zero unless you find a crooked judge, and that still sounds absurdly unlikely. If US laws are anything similar to Quebec's in that regard, I can't imagine Britney Spears being put under tutelage unless she was completely unable to run her own life. As in, if she was allowed to control her own assets, she would probably burn it all in coke and booze or something like that within a few months and she'd go bankrupt before realizing she doesn't have any money left. This passage in the article in particular makes me dubious of her claims:\n\n>She listed a series of grievances, including that her hair vitamins and coffee had been taken from her.\n\nI've had mental patients make similar grievances. The hair (or whatever) vitamins were complete horseshit they bought on the internet for hundreds of dollars a bottle which at best were sugar pills, at worst were hormones which would make them extremely sick. And they say their \"coffee\" is taken from them because you won't let them drink coffee all night and then complain they can't sleep and beg for sedatives to sleep during the day.\n\nSo yeah, not saying her claims are bogus, but personal experience with people who need to be put under tutelage (or worse, curatorship) is that they're extremely immature people who would destroy themselves without an adult to supervise them and who complain loudly anytime they're denied anything.",
            "title_similarity": "0.53374624",
            "sentiment_compound": -0.9884
        },
        {
            "id": "h586ted",
            "score": 6,
            "text": "Her dad is a pimp and the judicial system is perpetuating the problem",
            "title_similarity": "0.7171453",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h585h4b",
            "score": -3,
            "text": "Few details of Britney’s conservatorship are in the public domain. But what happened before it made headlines around the world: Britney driving with a baby in her lap, Britney shaving her head on a whim, Britney attacking a car with an umbrella, Britney being wheeled out of her Beverly Hills mansion on a stretcher. She was committed to a psychiatric ward on two occasions in 2008 (known in California as a 5150 hold); it was after the second hold that James Spears petitioned L.A. County Superior Court, per The Guardian, for an emergency “temporary conservatorship.” It was made permanent by the end of the year.",
            "title_similarity": "0.69835687",
            "sentiment_compound": 0.0
        },
        {
            "id": "h591hn3",
            "score": 5,
            "text": "*unpopular opinion*\nHas anyone heard her father's side of the story? If Britney were an adult with severe disabilities, unable to handle herself, I don't think ppl would argue so hard to end the conservatorship. On the surface it seems she's a perfectly normal person stuck in a cage. But based on her IG behavior, it's conceivable that there's another side of the story, some sort of mental illness or something that might ruin her career and credibility if it were to come out. And if we give the father the benefit of the doubt that he really does have his daughters best interests at heart but cannot come forward with the truth then ppl are really crucifying him in public opinion for no reason. I don't know details, but I think it's often too easy to jump on a bandwagon without understanding the full picture.",
            "title_similarity": "0.62658066",
            "sentiment_compound": 0.8698
        },
        {
            "id": "h58300x",
            "score": 1,
            "text": "Sad thing is, once she removes her conservators, she’ll probably be taken advantage of like no other.",
            "title_similarity": "0.55643404",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h5bh5gn",
            "score": 0,
            "text": "Agreed. After what 13 years that’s excessive.. I guarantee he has paid himself a nice salary. Yet I do question Britney’s decision making still. Or at least people taking advantage of her. Perfect example is that Douche trainer she’s been shacked up with. He’s just another Kevin.. a money hungry douche! A key element being used against her by “Experts” is when you hear her speak and she talks about “having more babies” it’s very child like. And she seems to be making it sound as a priority. If she was free I’d bet she’d have the Vegas wedding and IUD? removed shortly after. \n\nYou to look at it from a legal standpoint. She has been under a tight leash with her money management. And had no issues in fact her net worth has remained stable. BUT, IMO she definitely has been a victim of fiduciary abuse by her father! The courts should come to some half way point between full conservatorship and none. Which can be done! The problem is she has mountains of videos, post “breakdown” through her claimed “stable” / to date that are being used against her. And quite well! People really don’t comprehend how damaging social media can be!! Unfair sure, but it does paint a picture, yes.  \n\nJust my $.02, she should be stepped down and allowed more decision making in her life. Then if successful after a couple years released from being conserved. And BTW he father isn’t the only person eligible, that’s where her new attorneys strategy should be focusing on. Change of conservator and “stepped down” / allowed more decision making.",
            "title_similarity": "0.681941",
            "sentiment_compound": 0.7137
        },
        {
            "id": "h5blc4o",
            "score": 0,
            "text": "Well she got the money to afford justice",
            "title_similarity": "0.22659932",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h583zx5",
            "score": -50,
            "text": "Why the ever living fuck are we still talking about this shit. Nobody cares. Get real lives and stop being so fucking obsessed with what these vapid \"celebrities\" are doing and saying every day.",
            "title_similarity": "0.5486593",
            "sentiment_compound": -0.8489
        },
        {
            "id": "h585w92",
            "score": 2,
            "text": "Finally, the abuse of Britney Spears was horrific to witness. I hope this continues to be a trend in media reprensentation mainly Hollywood. She had her rights stripped away as a person akin to imprisonment. Take back everything and never look back.",
            "title_similarity": "0.72705996",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h58n5ue",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.15744942"
        },
        {
            "id": "h58jrl5",
            "score": -8,
            "text": "Does anyone know what she had for breakfast?\n\nClearly this is pressing news lmao",
            "title_similarity": "0.53666204",
            "sentiment_compound": 0.765
        },
        {
            "id": "h584o1b",
            "score": 9,
            "text": "Personally, I dont believe that Brittany is a well-functioning adult. I think her mental/cognitive growth stopped back when she was still a teenager and the trauma kind of stunted her. She’s also clearly very uneducated. *That being said* lots of people are not very smart or are mentally ill or are bad with money. We don’t take away their autonomy for decades. We let Charlie Sheen dig his own grave and Shia Labouf too - we let Kanye *run for president* and no one tried to get them under a conservatorship.  I dont think Brittany is a danger to herself or others, which is more than can be said of some of the characters out there. She has every right to do as she pleases with her hard earned money. If she blows it, she blows it.",
            "title_similarity": "0.5601504",
            "sentiment_compound": -0.9197
        },
        {
            "id": "h57z2ca",
            "score": -50,
            "text": "He kept her batshit crazy ass from spiraling into bankrupt obscurity. What. an. asshole...",
            "title_similarity": "0.57672226",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h57zrm9",
            "score": -7,
            "text": "How do they force her to work and stuff?",
            "title_similarity": "0.4748428",
            "sentiment_compound": 0.0
        },
        {
            "id": "h595r7h",
            "score": -4,
            "text": "her dad is whack. but she is crazy too. check her insta. she’s cookoo.",
            "title_similarity": "0.6663296",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h57que4",
            "score": 20,
            "text": "Don't believe anything coming from a Rupert 1% Murdoch propaganda arm no matter how much you'd like to believe it. \n\n\\#FreeBritney. \\#JailRupert",
            "title_similarity": "0.46406627",
            "sentiment_compound": 0.1093
        },
        {
            "id": "h58h5xy",
            "score": -11,
            "text": "oh my gaaawwwwd! free britneay BITCH! she needs to live her life! yasss quannnnn slaaaay",
            "title_similarity": "0.35758817",
            "sentiment_compound": -0.4782
        },
        {
            "id": "h58aji2",
            "score": 4,
            "text": "Her Instagram posts lately are waaay more alarming than they usually are... just super weird vibes from them.",
            "title_similarity": "0.4294206",
            "sentiment_compound": 0.3415
        },
        {
            "id": "h5ae89o",
            "score": -6,
            "text": "I don't know why so many reddit users are britney fans but let's remember one thing:\n\n>The medical expert presented findings surrounding Spears' “ability to make intelligent decisions” and “manage her own affairs” on Sept. 18, 2019. The expert's findings were not public, and the star has remained in a conservatorship since.\n\nTha' bich cray",
            "title_similarity": "0.5116953",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h580xds",
            "score": 1,
            "text": "I haven't been able to follow this as much as I'd like so I have questions.\n\nWhat's stopping her from refusing to perform?\n\nHow can they force her to take any medication? \n\nHow can they prevent her from having a child?\n\nCould she possibly flee the country? I'm sure she could be just as big of a hit traveling the world and avoiding the US.\n\n\n---\n\nI don't understand how what they're doing to her is supposed to benefit anyone other than her dad and whoever else is involved. She's basically a slave. I had more freedom as a child. I love music just as much as everyone else and I would rather see the artists I've enjoyed for so long retire or quit instead of being forced to do this against their will.",
            "title_similarity": "0.5501957",
            "sentiment_compound": 0.9209
        },
        {
            "id": "h5b3ok8",
            "score": -1,
            "text": "Can’t she just have her fans assassinate the dude via dog whistling like the republicans & trump do? They get away with it all the time.",
            "title_similarity": "0.64168227",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h59elsn",
            "score": -5,
            "text": "Why does this keep coming back around? I don't care about Britney Spears family affairs!",
            "title_similarity": "0.4883998",
            "sentiment_compound": -0.4442
        },
        {
            "id": "h594ewn",
            "score": -12,
            "text": "She'll endup  turning tricks for 5 bucks below an overpass in Vegas if the conservaship is removed. The reality is that she's  too kooky to make it on her own and would be sucked dry by hangers on within a couple years.",
            "title_similarity": "0.55975634",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h57xi85",
            "score": -8,
            "text": "why has someone so wealthy been dealing with this conservatorship bullshit at all?  what the fuck is this?",
            "title_similarity": "0.46333665",
            "sentiment_compound": -0.6618
        },
        {
            "id": "h59boph",
            "score": -9,
            "text": "Why is everyone concerning theirselves with this? What about the people down the end of your road? or is this just like a real ‘made in guersey’ tv show and they just like the drama?",
            "title_similarity": "0.5409514",
            "sentiment_compound": 0.6747
        },
        {
            "id": "h587iuj",
            "score": 8,
            "text": "I would love to be able to hear the case because I feel like there's a lot that I don't know.  There has to be a reason why the court's are generally siding against her.  It would be a shame for her to get the money and waste it and then be on the streets homeless.  I just have this funny feeling that something is missing.",
            "title_similarity": "0.5087613",
            "sentiment_compound": 0.5385
        },
        {
            "id": "h58906o",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.13183689"
        },
        {
            "id": "h581m6t",
            "score": 5,
            "text": "I can't believe this is still going and she's the victim fighting for justice. This should bring a hard change to the conservatorship law.",
            "title_similarity": "0.65867996",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h58wkjn",
            "score": -5,
            "text": "The whole thing is fucked, but I really don't give two shits about Brittney",
            "title_similarity": "0.35161823",
            "sentiment_compound": 0.1608
        },
        {
            "id": "h58438p",
            "score": 1,
            "text": "Bro why the fuck is this happening in 2021? Like seriously!? I’m so confused this is a thing",
            "title_similarity": "0.35976988",
            "sentiment_compound": -0.7136
        },
        {
            "id": "h585hsm",
            "score": 2,
            "text": "Late to the discussion, but can someone give a quick summary of this situation? I tried reading articles and the ones I’ve seen seem to go on rants about her career and hits. What’s a conservatorship?",
            "title_similarity": "0.61905515",
            "sentiment_compound": -0.5122
        },
        {
            "id": "h58gfat",
            "score": 2,
            "text": "She wants to end her conservatorship without any sort of mental evaluation professionally or from the courts, am I understanding this correctly?",
            "title_similarity": "0.5379524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58yvv3",
            "score": -2,
            "text": "I got some \"news\" worth your attention: shawarma is delicious",
            "title_similarity": "0.28778577",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h57yxd4",
            "score": -32,
            "text": "I want her to  go away.",
            "title_similarity": "0.34082046",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h58gvfb",
            "score": -8,
            "text": "If I made the money Britney made, I would literally give as much to my dad as he wanted. I imagine that’s the case for many of us. I also imagine it’s much easier to just be a loving father than to fight legal battles for ten years to maintain income off your daughter’s name.",
            "title_similarity": "0.5371345",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h58q7wx",
            "score": -15,
            "text": "Oh my god who the hell cares",
            "title_similarity": "0.18670191",
            "sentiment_compound": -0.128
        },
        {
            "id": "h582tkt",
            "score": 3,
            "text": "Can anyone explain why this story is blowing up? I get she's a cultural pop icon, but it just seems like this suddenly became a huge cultural issue. I understand that ~~Brittany~~ Britney has been put through an unjustifiable amount of abuse because of this, but so many people struggle against unjustifiable abuse every day. \n\nIs conservatorship a bigger issue than I've realized?\n\nEdit: I misspelled her name. My comment has been corrected to avoid confusion.",
            "title_similarity": "0.67184085",
            "sentiment_compound": -0.9494
        },
        {
            "id": "h5858h1",
            "score": 4,
            "text": "This is great news. Apparently she can also hire her own lawyer now too. Her dad is a massove cunt",
            "title_similarity": "0.62591136",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h580yvr",
            "score": 5,
            "text": "Her dad is another level of evil.  His job is to protect his daughter not make her life hell...",
            "title_similarity": "0.50412935",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h5864f3",
            "score": 0,
            "text": "I don’t know all the details. But I think people in general should realize we are many …. and these horrible people and bad rules need to end",
            "title_similarity": "0.5025536",
            "sentiment_compound": -0.8885
        },
        {
            "id": "h58bzwa",
            "score": 0,
            "text": "This is future of Tiktokers/Youtubers who gave up school in their teen.",
            "title_similarity": "0.47418988",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58ha8x",
            "score": 5,
            "text": "The entire world wants her father charged with conservatorship abuse. Screw that guy.",
            "title_similarity": "0.825387",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h58jylg",
            "score": 0,
            "text": "It's been years now, her dad finally should get what he deserves",
            "title_similarity": "0.42974186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58l880",
            "score": 0,
            "text": "I hope Jamie gets everything that he did to Britney and more. Hes been treating her as a cash cow since he first saw her talent. Working her like a dog, threatening her into obedience and silence, taking her money; fuck him. I hope that this new lawyer does his magic and allows her more freedom.",
            "title_similarity": "0.6619874",
            "sentiment_compound": 0.8268
        },
        {
            "id": "h58lzqe",
            "score": 0,
            "text": "Is Brittany allowed to own a gun?\n\nShould she be?",
            "title_similarity": "0.3376062",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h58mncj",
            "score": 0,
            "text": "So i went through something less severe but similar as britney.   there really does come a point where you are just fucked and nobody beleives you or is willing to help.  it's a huge issue with just world falacy, i think anyway.  people just assume you are fucked if it is happening to you and it needs to happen.\n\ni would go onto reddit and try and get help and most of the people would just basically yell at me and say it was a good thing.  i'd try and get my friends to protect me, they didn't beleive me.  my family was the ones trying to get me put away in a psych ward.  and i was not mentally ill at all.  the police were called.  I can easily see how women used to be burned at the cross.  even by their own families.\n\nbasically i am saying it won't happen to anybody reading this.  but if it does, shit gets really fucky, and no matter how calm and rational you are, if enough people start thinking you are fucked, you get close to losing way more than you think.  you can't use logic and reason with people most of the time, this pandemic and political climate has shown that to be obv.  it's crazy trying to rational discuss your life, safety and freedom to people.  it's truly horrible and traumatic.  it's really fucked up.\n\nand people on reddit STILL harass me about it.  it's insane how crazy people can get.",
            "title_similarity": "0.610717",
            "sentiment_compound": -0.9613
        },
        {
            "id": "h59b87u",
            "score": -3,
            "text": "Raise your hands if this feels like a massive publicity stunt.",
            "title_similarity": "0.40933323",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5auezc",
            "score": 0,
            "text": "Hollywood news, paid actors/Entertainers idk probably a unpopular opinion",
            "title_similarity": "0.43865663",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h5bv0v8",
            "score": 0,
            "text": "Can someone please explain this Britney thing? I'm out of the loop.",
            "title_similarity": "0.42022234",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h58pq3t",
            "score": -9,
            "text": "Who the fuck cares lol why is this at the top of my feed",
            "title_similarity": "0.42523307",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h585x08",
            "score": 6,
            "text": "Godddd I can’t wait til this is over and she’s free and she makes new music like fucking Beyoncé lemonade 20000.0 and we all find out everything and she fucking thrives",
            "title_similarity": "0.4038672",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h59upmb",
            "score": 5,
            "text": "If you’ve watched her Instagram videos.. I kinda think the conservatorship is what allowed her to be a functioning superstar these last some odd years. She seems much more unwell than her fans believe. I definitely support ending the conservatorship (and hopefully she chooses to leave public life for her own good) but the end result of this isn’t going to be what fans want from her, which is more Britney.\n\nIt’s not so much the content of the videos and posts I find upsetting it’s the choice to post THESE things. It reminds me of some encounters I’ve had with seriously mentally ill people in really bad places.",
            "title_similarity": "0.54059166",
            "sentiment_compound": -0.8977
        },
        {
            "id": "h583y6m",
            "score": 14,
            "text": "This whole thing seems so first world problems. Britney made a lot of money. Maybe she had a few missteps, okay she got crazy for a minute, but was anybody asking Michael Jackson why he was building an amusement park for kids? No they just killed him.  She's totally entitled to waste her money like every other person is. Her dad hasn't added any value to society. We all have mental health issues, The only thing she's guilty of is making a lot of money and for some reason the dumb government decided that she's not allowed to spend her own money. Let's look at the judge who decided that was a good idea and put him or her under a microscope and let's analyze their life in their decision-making I want to take their money away because their undeserving of it. Let's talk to the judge's kids and see if the judge deserves to spend his or her money.",
            "title_similarity": "0.68719065",
            "sentiment_compound": -0.952
        },
        {
            "id": "h57wmgx",
            "score": 4,
            "text": "Finally they might leave Brittany alone.",
            "title_similarity": "0.20166671",
            "sentiment_compound": -0.296
        },
        {
            "id": "h580s5t",
            "score": -1,
            "text": "I remember before “this job” seeing him as a private chef for someone maybe on one of the housewives show.",
            "title_similarity": "0.414037",
            "sentiment_compound": 0.0
        },
        {
            "id": "h581bhp",
            "score": 1,
            "text": "Damn, she really is fighting back! Can you imagine the anger she's held back the past 13 years!??",
            "title_similarity": "0.5540354",
            "sentiment_compound": -0.8785
        },
        {
            "id": "h581tis",
            "score": -1,
            "text": "What is \"conservatonship\" anyway? What a bizarre situation she's in.",
            "title_similarity": "0.48177993",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h582273",
            "score": 1,
            "text": "As she should. I hope she wins this case. He choose greed over his own daughter.",
            "title_similarity": "0.5927994",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h584ukn",
            "score": -1,
            "text": "I fear she's gonna end up dead.",
            "title_similarity": "0.398268",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h584ywc",
            "score": 1,
            "text": "This leech should face jail time not only fines….",
            "title_similarity": "0.46916032",
            "sentiment_compound": 0.0
        },
        {
            "id": "h585dxl",
            "score": 1,
            "text": "How do you sue the judges involved in this horrible sequence of events?  I’m just being angry but feel at least some of the judges were colluding with her father.  I have no real basis for saying that but think sometimes judges who make bone headed harmful decisions should have consequences",
            "title_similarity": "0.6834758",
            "sentiment_compound": -0.8524
        },
        {
            "id": "h586k4s",
            "score": 1,
            "text": "ELI5 - how did the court side with her father again recently when it is clear that Britney doesn't feel he is looking after her best interests and even offered to have her fortune managed under a trust instead?",
            "title_similarity": "0.66759425",
            "sentiment_compound": 0.9022
        },
        {
            "id": "h586rml",
            "score": -1,
            "text": "her father deserved it",
            "title_similarity": "0.26119572",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5888gl",
            "score": -1,
            "text": "In the words of Wendy Williams regarding Britney’s family: “Death to ALL of them!”",
            "title_similarity": "0.6609925",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58btt1",
            "score": 1,
            "text": "Rightly so no one with bipolar rich or not should be controlled like this. It’s horrible.",
            "title_similarity": "0.44873497",
            "sentiment_compound": 0.0276
        },
        {
            "id": "h58iobe",
            "score": 1,
            "text": "He sells her blood to rich people. Why is this even a question!?",
            "title_similarity": "0.5806256",
            "sentiment_compound": 0.5983
        },
        {
            "id": "h58iw4u",
            "score": 1,
            "text": "I hope he ends up with a long jail sentence . He deserves atleast 10 years plus . If I abused a patient I would get a similar sentence. \n\nIf America does not want to do social services and instead let individuals safeguard then those individuals should get treated like professionals and end up in jail if they abuse.",
            "title_similarity": "0.5621357",
            "sentiment_compound": -0.0315
        },
        {
            "id": "h58ksj5",
            "score": -1,
            "text": "The person who should be sought out and punished the most is the judge who put her in this conservatorship in the first place.",
            "title_similarity": "0.6584837",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h58qqci",
            "score": 1,
            "text": "Goddamn.... How is this still ongoing clearly it's being abused to shits . She's at such a disadvanteous position even though it's 100% her assets",
            "title_similarity": "0.5235239",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h58r88a",
            "score": 1,
            "text": "Bout damn time. I’m tired of seeing someone so beautiful and talented exploited by greedy, POS relatives.",
            "title_similarity": "0.5750969",
            "sentiment_compound": -0.0887
        },
        {
            "id": "h58t2yf",
            "score": 1,
            "text": "I think we all knew that (he was abusing it I mean)",
            "title_similarity": "0.4533518",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h58wcqe",
            "score": 1,
            "text": "Can’t wait for her to drop a heavy avant garde noise album venting about all of this. On some “Brittney Spears feat. SunnO)))” vibe",
            "title_similarity": "0.6148607",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h58yilt",
            "score": 1,
            "text": "I'll say it, I definitely think it's wrong and a crime what her father is doing to her, controlling her conservatorship. But I think if Britney wins and regains control, there are other people around her poised to do very much the same as her father, except worse. And I don't think Britney is capable of handling them or her finances herself with all the sycophants around her. Hope she stays safe.",
            "title_similarity": "0.6949496",
            "sentiment_compound": 0.9194
        },
        {
            "id": "h58zf3n",
            "score": 1,
            "text": "What is a conservativership? Is that just a way for shity  parents that exploit their kids to rob those same kids? Is britney insane? I always thought she was just slutty and dumb and annoying.",
            "title_similarity": "0.6985435",
            "sentiment_compound": -0.948
        },
        {
            "id": "h595fe9",
            "score": 1,
            "text": "She is a beautiful angel. It kills me that nobody has truly had her back or speaks up for her.",
            "title_similarity": "0.25698763",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h59lo52",
            "score": -1,
            "text": "The perils of being a Disney product",
            "title_similarity": "0.3035526",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59m0k8",
            "score": -1,
            "text": "Not sure if this comment will get lost in the thread.\n\nBut what happens if she gets pregnant? Does her father/family take the child?",
            "title_similarity": "0.5216123",
            "sentiment_compound": -0.3593
        },
        {
            "id": "h5a9epk",
            "score": 1,
            "text": "Her conservatorship-appointed lawyer needs to be disbarred and jailed along with her father.",
            "title_similarity": "0.8311862",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h5b1laf",
            "score": 1,
            "text": "I feel like the only reason this is in the news is because it's her. This isn't a uncommon circumstance. She asked to stop takeing mental evaluation test for the next trail, thats a huge flag for me. If shes not worring about passing them then why not? If the stress of them could cause her to react then that's fine. I think she is mentally troubled, now should her dad be in charge idk. But alot of people need this in there life if they like it or not. People could easily take advantage of her. Just like with all people that have special needs they need help. Idk if she was fine as a child but alot of mental illness comes out as a adult. So I feel like you have 2 options, let her control everything and risk her destroying her self if not killing her self. Or give some basic guidance. If a judge has declared and multiple doctors that she's not reasonably able to take care of her self then maybe it's true.",
            "title_similarity": "0.55120534",
            "sentiment_compound": 0.9688
        },
        {
            "id": "h5dzo30",
            "score": 1,
            "text": "Her father should be in prison! It’s sickening to see how he bully’s his own daughter.  He says he wants Whats best for her, then he needs to prove by stepping away!  His greed will destroy him!!",
            "title_similarity": "0.72171175",
            "sentiment_compound": -0.871
        },
        {
            "id": "h5uivmj",
            "score": 1,
            "text": "Tired of this redneck family drama. There are more important issues in the world than the Fred Britney “movement.” \n\nI think some level of control over her makes sense because she comes across as someone who is mentally impaired. \n\nI grew up listening to her songs and appreciated her work, but the sun has set on her. This poor thing will literally walk into traffic if she’s let off the leash.",
            "title_similarity": "0.5164081",
            "sentiment_compound": -0.6359
        },
        {
            "id": "h588bj1",
            "score": -8,
            "text": "She wants a conservator for who knows what reason. Never asks to just end the conservatorship.",
            "title_similarity": "0.44088447",
            "sentiment_compound": 0.0
        },
        {
            "id": "h589y3s",
            "score": 7,
            "text": "I was indifferent to the Britney train when she was at peak celebrity. But god damn if this doesn't get to the heart of the question regarding human dignity and freedom, individual rights under the law, profound conflicts of interest, and the insane circular logic of the court being inclined to rule in favor of conservatorship because she is demonstrably unable to manage her own affairs because she is already under conservatorship.\n\nLet Britney be free to blow her fortune just like the rest of us and scrape off the goddamned bootlickers and parasites in her family and conservatorship!",
            "title_similarity": "0.72123694",
            "sentiment_compound": 0.9672
        },
        {
            "id": "h58nz2a",
            "score": -7,
            "text": "Maybe if she wasn’t a total screw up? Lolol",
            "title_similarity": "0.2943415",
            "sentiment_compound": -0.1761
        },
        {
            "id": "h58q5i7",
            "score": -8,
            "text": "Who cares? She's mentally unstable, so ..",
            "title_similarity": "0.38145277",
            "sentiment_compound": 0.128
        },
        {
            "id": "h58q6o1",
            "score": -7,
            "text": "i bet on everything her father raped her too. sorry TOO real for reddit? then give me proof he didnt. fucking scumbag..",
            "title_similarity": "0.78274715",
            "sentiment_compound": -0.3215
        },
        {
            "id": "h58z4yk",
            "score": -8,
            "text": "Oh my lord. 70k upvotes??? Who fucking cares about some shitcan celebrity.",
            "title_similarity": "0.44294953",
            "sentiment_compound": 0.5904
        },
        {
            "id": "h57resz",
            "score": -69,
            "text": "Hah give her her money screw it. Let's see how many kids she pops out so that she can feed them mountain dew. Or did you guys forget about her child abuse?\n\nhttps://nypost.com/2007/08/01/britney-junks-her-tots/\n\nRemember she lost custody to KEVIN FEDERLINE the mother of two children list custody of those kids to their father, KEVIN FEDERLINE.\n\nJesus people she needs help, but not this kind.\n\n---------------------Edit\n\nUSA today fact checked her\n\nhttps://www.usatoday.com/story/news/factcheck/2020/07/22/fact-check-britney-spears-conservatorship-isnt-manipulating-her/5430229002/",
            "title_similarity": "0.72026885",
            "sentiment_compound": -0.8116
        },
        {
            "id": "h58mp2z",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.13183689"
        },
        {
            "id": "h5934bs",
            "score": -8,
            "text": "As if Britney is suffering lol 'woke' reddit is a mockery",
            "title_similarity": "0.61042887",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h599jfp",
            "score": -7,
            "text": "She needs it. Have you seen her post a video before? She’s clinically not able to take care of herself or her children at all.",
            "title_similarity": "0.46640077",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h57z5ob",
            "score": 18,
            "text": "\"Conservatorship\" is sure a big word for \"legal slavery\" in this case. Such an abuse of the legal system and her rights as a human being.",
            "title_similarity": "0.6026912",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h57u8v2",
            "score": 91,
            "text": "Matt Gaetz Visited a Free Britney rally in LA today to garner sympathy and push his political agenda. The fact he’s even within 100 miles of Los Angeles shows how desperate he is. Co-opting the torture this woman has been enduring is nothing short of comically evil and selfish.",
            "title_similarity": "0.68798196",
            "sentiment_compound": -0.836
        },
        {
            "id": "h58hw05",
            "score": -7,
            "text": "Are people so bored with their lives that they need to know what some famous person is going through? I hate to say this, but that weird kid on YouTube was right.....leave Britney alone. Unless you're explicitly involved in the case (I'm looking at YOU, media), MYOB\n\nI'd also like to add that this is a private matter between Britney, her father, the lawyers, and the judge. So it really shouldn't concern the media. No wonder she's cracked under all this pressure. Damn vultures!",
            "title_similarity": "0.68008876",
            "sentiment_compound": -0.9452
        },
        {
            "id": "h59e5je",
            "score": -10,
            "text": "Who tf cares about britney spears and why this is in news? Lmao reddit is weird",
            "title_similarity": "0.5837943",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h580jro",
            "score": 2,
            "text": "How that man has escaped getting his comeuppance is beyond me. She is famous and I'm sure there would be someone that would oblige",
            "title_similarity": "0.43762556",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h581npl",
            "score": 2,
            "text": "What the fuck? Shes doing great. Let her live her own life the way she sees fit.",
            "title_similarity": "0.22430629",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h5832st",
            "score": 2,
            "text": "I'm with you Britney. Always wondered what happened to you.",
            "title_similarity": "0.5037735",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5847j7",
            "score": -2,
            "text": "Dud is making us good Father’s look bad. Shameful!",
            "title_similarity": "0.56937325",
            "sentiment_compound": -0.7263
        },
        {
            "id": "h584mhb",
            "score": 2,
            "text": "Fuck yeah, you go girl",
            "title_similarity": "0.15102479",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h584whp",
            "score": 2,
            "text": "She is asking the wrong people for charges of conservatorship abuse …\n\nIn the criminal justice system, the people are represented by two separate, yet equally important, groups: the police, who investigate crime; and the district attorneys, who prosecute the offenders.",
            "title_similarity": "0.63153726",
            "sentiment_compound": -0.946
        },
        {
            "id": "h587ets",
            "score": 2,
            "text": "When she got signed his first word were: “daddy’s getting him a bigger boat.” \nAnd in an interview last year, her brother said “ yeah the women in this family are very strong-minded and opinionated, they like to do what they want to do, and as much as I admire that, being one of 2 guys in this family, it kinda sucks.” \n\nThat should tell you all you need to know. Her entire family are leaches. Listen to her testimony. If it doesn’t make sense why she didn’t “just leave,” look into trauma bond, Stockholm syndrome and learned-helplessness. These are the same reasons spouses don’t leave their abusers.",
            "title_similarity": "0.6732448",
            "sentiment_compound": 0.128
        },
        {
            "id": "h58ji4g",
            "score": 2,
            "text": "Sometimes I feel like we don’t have the whole story. Brittney did some crazy stuff back in the day. So I wish we had more insider information. I’m sure her dad takes a lot of her money but I want to how much he has saved her from spending stupidly.",
            "title_similarity": "0.59439856",
            "sentiment_compound": 0.429
        },
        {
            "id": "h58kzc7",
            "score": -2,
            "text": "I don’t think that’s a thing, lil britty",
            "title_similarity": "0.091021605",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58l59k",
            "score": 2,
            "text": "Give her all her cash in a lump sum, and let her do what she wants.  If she fucks up, we are entertained and that’s her job.",
            "title_similarity": "0.47137958",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h58m7cj",
            "score": 2,
            "text": "I just learned her father's name is Jamie and her mom's name is Lynn. They seriously just hyphenated their names when they named their daughter (Britney's younger sister). I know some parents will just name a kid (Name) Jr., which I already find creepy, but the Jamie-Lynn takes is to another level. Her parents must be vain as hell",
            "title_similarity": "0.70750695",
            "sentiment_compound": -0.9091
        },
        {
            "id": "h58oqjc",
            "score": -2,
            "text": "In the criminal justice system, sexually based offenses are considered especially heinous.\nIn New York City, the dedicated detectives who investigate these vicious felonies are members of an elite squad known as the Special Victims Unit. These are their stories.",
            "title_similarity": "0.5493145",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h58ssix",
            "score": 2,
            "text": "It’s disappointing that she thought no one would listen to her. It took a whole movement to sway the court’s opinion. \n\nHer dad’s gravy train express is about to end.",
            "title_similarity": "0.63694096",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h5912gd",
            "score": -2,
            "text": "everyone forgets that she had a breakdown and that shady \"manager\" and if it weren't for her dad she'd either be in a padded room or broke.",
            "title_similarity": "0.61890167",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h591yd1",
            "score": -2,
            "text": "This sub shiuld be renamed r/muricanews.",
            "title_similarity": "0.30955744",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59qqo4",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.15744942"
        },
        {
            "id": "h59tbi6",
            "score": 2,
            "text": "Seriously just get her a neuropsych evaluation and I guarantee you they’ll deem her fit to not need a conservator.",
            "title_similarity": "0.37087798",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h59uk31",
            "score": 2,
            "text": "Conservatorship abuse is real.  My uncle used it to kill my grandmother.  She is dead because of him, she wasn’t even dying to begin with upon him having the conservatorship over her… but with everyone stomping around calling it “mom’s last days” they acted like she needed a feeding tube and other bullshit done to her\n\nShe JUST needed physical therapy and regular checkups.  She didn’t need a feeding tube.  She was not incompetent, my uncle had her declared incompetent.  Took her anti depressants away and she became suicidal, he refused to take her to the doctor.  She self starved and what happens when an old lady starves herself?  Heart attack \n\nAnd he may actually get away with this.  Before she died he left her in his house crossed state lines to empty her home.  Forged the deed on her house, and stole her house.  He found a buyer and everything.  He almost made $800k on that house, before the fake deed was discovered\n\nHe is still paying her car insurance in her name as if she is still alive, she died 2 years ago.  He is letting some random person drive her car.  Maybe I’m a bitch but I hope that person gets into some kind of accident, or fender bender, for the fraud to be discovered.  These idiots don’t have the money to pay for this shit out of pocket \n\nMy uncle has 7 siblings.  And most of them think that by being the “family hero” and stealing THEIR estate, that he is “making sacrifices for us.”  He killed their *mother*\n\nWould not surprise me one bit if they were trying to drive Britney to suicide, just like what my uncle did.  My grandmother just needed help, she needed physical therapy.",
            "title_similarity": "0.6831564",
            "sentiment_compound": -0.9977
        },
        {
            "id": "h59wwcy",
            "score": -2,
            "text": "Welcome to the current state or r/news",
            "title_similarity": "0.16947624",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h5k0h8z",
            "score": -2,
            "text": "why is it on 'top' ffs",
            "title_similarity": "0.1663465",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h57xybt",
            "score": -31,
            "text": "File. The. Right. Cases. \n\nThis ongoing nonsense makes me see why she was under conservatorship to begin with. She’s clearly -very- slow.",
            "title_similarity": "0.45119208",
            "sentiment_compound": 0.0
        },
        {
            "id": "h588obi",
            "score": 30,
            "text": "There are two options.\n\n1. She's mentally capable of making her own decisions, in which case continuing a conservatorship is grossly inappropriate and most likely a violation of her civil liberties.\n2. She's mentally unwell and is incapable of controlling her own life, from which her father profiting off of her career is tantamount to abuse of the mentally disabled and is grossly inappropriate and most likely a violation of her civil liberties.\n\nCan't have your cake and eat it too. Either way, her father is clearly the issue.",
            "title_similarity": "0.6002101",
            "sentiment_compound": -0.4638
        },
        {
            "id": "h588jx4",
            "score": -10,
            "text": "Pssssh. I read the title and thought, \"See. I knew that bish was batshit crazy.\"\nAll the #FrEeBrItNeY would shit their pants if they heard her talking in court. She's \"I'll defend myself in a double murder trial\" bonkers.\nPraise her father for keeping that nut alive all these years.\nEven better.. let them fight it out in private and everyone else can just STFU.",
            "title_similarity": "0.7196623",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h58nrhq",
            "score": -11,
            "text": "Fuck every one of you. You're all hypocrites. The entire web applauded this years ago because she was deemed crazy. You should be ashamed of yourselves. This story is the very pinnacle of why social media is a monster that damages people.",
            "title_similarity": "0.6625986",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h57keqr",
            "score": -68,
            "text": "[removed]",
            "title_similarity": "0.13183689"
        },
        {
            "id": "h581dq8",
            "score": 3,
            "text": "She should sue for the loss of 13 years of her life",
            "title_similarity": "0.58102614",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h584rw1",
            "score": 3,
            "text": "Christ, imagine having to fight for this",
            "title_similarity": "0.43172657",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h587vkq",
            "score": 4,
            "text": "I wouldn't trade her life for the world.",
            "title_similarity": "0.24746221",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5886hl",
            "score": 4,
            "text": "I also want her father charged.",
            "title_similarity": "0.625129",
            "sentiment_compound": -0.128
        },
        {
            "id": "h589j6w",
            "score": -2,
            "text": "Since everyone is asking \"what's the worst that could happen?\" I'd like to attempt to answer. \n\nIt's true that millions of unstable people with mental illnesses are not under conservatorship and probably should be. The majority of those people have *nothing to lose*.\n\nCan you imagine the absolute pieces of shit who are going to come out of the woodwork trying to marry her and get her pregnant? This isn't just about money, Brittany would be exploited and bled dry by people much, *much*, more cruel than her father. So instead of just having a shitty dad in charge of her money, she would have a shitty husband who controls her money and abuses her sexually and physically. Her husband could even have her committed and place her under conservatorship *all over again* if he got tired of dealing with her. How is that better than her current situation?\n\nGetting married and pregnant to some asshole she just met is not only possible, it's probable.\n\n*Edited for grammar",
            "title_similarity": "0.6457757",
            "sentiment_compound": -0.9755
        },
        {
            "id": "h58guha",
            "score": 4,
            "text": "And pay back all of HER money that he spent!",
            "title_similarity": "0.42764813",
            "sentiment_compound": -0.1759
        },
        {
            "id": "h58okn0",
            "score": 3,
            "text": "Can we donate to her court fees? I would love to help offset her costs any way that I can, even though I know she’s wealthy. I’m just pissed she has to even spend money to free herself though.",
            "title_similarity": "0.50527453",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h59i3oo",
            "score": -3,
            "text": "TBH this is such a first world problem it shouldn't register when there are so many more compelling issues but at the same time I bet she is correct and her father did not act in her best interest.",
            "title_similarity": "0.50907564",
            "sentiment_compound": 0.8928
        },
        {
            "id": "h5afrmh",
            "score": -3,
            "text": "Britney wants to go on an epic 7 day bender",
            "title_similarity": "0.4647144",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5dagm5",
            "score": -2,
            "text": "If you’re nearly 40 and can’t balance your own checkbook, the problem ain’t daddy anymore. Catch up the rest of the class Britney.",
            "title_similarity": "0.5011767",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h57oyp1",
            "score": -46,
            "text": "[removed]",
            "title_similarity": "0.13183689"
        },
        {
            "id": "h57wyc2",
            "score": 14,
            "text": "Good news.,\n\nI think her father has exploited her in the worst way.\n\nI hope she is freed and writes a book which leads to a movie - and the wanker gets not a cent of the profits.",
            "title_similarity": "0.65518934",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h589511",
            "score": -5,
            "text": "Holy shit this is the fuckin dumbest campest comment section I’ve ever been in",
            "title_similarity": "0.4077847",
            "sentiment_compound": -0.8016
        },
        {
            "id": "h58xq02",
            "score": 3,
            "text": "It's just so wrong that Britney's DAD is controlling her, and her marketing campaign is about being sexy and objectifying her and she doesn't get to make any choices in it... so in effect, not only is she a slave, but she's a sex slave, and her dad is her pimp.",
            "title_similarity": "0.71896946",
            "sentiment_compound": -0.0761
        },
        {
            "id": "h59fs5d",
            "score": 3,
            "text": "Thing is, because she's had someone make all her decisions for so long, if she ever gets her independence back she'll probably make some decisions which would seem to justify the conservatorship. But of course you're going to go a little crazy after your life has been stifled for so long",
            "title_similarity": "0.5951266",
            "sentiment_compound": -0.6966
        },
        {
            "id": "h59jl22",
            "score": -5,
            "text": "Back in the park me and the boys called her \"Britney Beers\"",
            "title_similarity": "0.43135962",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5876cs",
            "score": -3,
            "text": "Her hair Vitamins? That cold-hearted, abusive bastard!",
            "title_similarity": "0.59977865",
            "sentiment_compound": -0.8398
        },
        {
            "id": "h58f6w0",
            "score": 6,
            "text": "Why the fuck is Matt Gaetz at a free Britney rally?  What a colossal piece of shit.",
            "title_similarity": "0.6418263",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h58fzl0",
            "score": -7,
            "text": "If she doesn’t rant like a raging loon, she might win.",
            "title_similarity": "0.39607093",
            "sentiment_compound": 0.128
        },
        {
            "id": "h58gqdv",
            "score": 6,
            "text": "There is a fundamentally bigger problem than just her father here.  I am a guardian for an incapacitated parent.  As a guardian I *can* force actions against her will, such as signing off on a medical procedure that she may not want because she doesn’t understand it.  That’s the difference between guardian ship and a POA…. A Power of Attorney allows me to act on her behalf but I cannot overrule her wishes on any matter.  A guardian on the other hand can *direct* the actions of others against her will, such as having a doctor provide a therapy or medicine, or having the assisted living staff ensure she takes her medicines daily.  But beyond that I can’t *make* her do anything.  I can’t make her take a job, or perform in Vegas, or sign a contract.  I can take away her driver’s license, but I can’t make her drive if she still had one.  I can make things happen *to* her that may be against her will, but I can’t really make *her* do anything.  So this idea that he can force her to perform, for instance, doesn’t hold any water.  None.  Either he’s hoodwinking her into believing there’s some horribly negative outcome if she doesn’t, or, someone’s lying.  None of this…. Literally none of this holds ANY water, this is another example of “this isn’t how ANY of this actually works.”\n\nThere appears to be an utterly profound lack of court supervision here.  In virtually every state, a conservator or guardian is required to provide a very detailed financial and health assessment annually to the court in order to justify continued guardianship.  I have to file annual financial statements, account for my expenses in detail in order to be reimbursed by her estate (actual receipts and an expense report), and whatever fees I charge the estate must be disclosed by affidavit and are reviewed annually for appropriateness.  And they are actually reviewed.\n\nAgain, not one thing that has been said publicly, by the father, or her, or the courts, is anything even remotely close to how any of this actually works.  Something is just fundamentally wrong here.  There is some element of us being misled, but also likely many elements that are true.  If so, there are court employees that must be disciplined, lawyers that must be disciplined, including being disbarred, judges that need to be censured, and a father and others that do indeed need to be charged criminally, and sued civilly.  If what is being said to have happened is true, there is a web of negligence and misconduct that spans multiple people and organizations, including state agencies and multiple court employees and officers.",
            "title_similarity": "0.5690048",
            "sentiment_compound": -0.9231
        },
        {
            "id": "h59ixn2",
            "score": 6,
            "text": "Is she was a man this never would’ve happened.",
            "title_similarity": "0.1694887",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5dl3ch",
            "score": -5,
            "text": "Britney, yer over 40 years old, NO ONE CARES!",
            "title_similarity": "0.34941128",
            "sentiment_compound": -0.7534
        },
        {
            "id": "h57mw6e",
            "score": 115,
            "text": "Watching her posting dances on Instagram is both encouraging and saddening, you can tell she really uses it to escape but looks like she needs a break. I hope she’s able to take control of her own life soon.",
            "title_similarity": "0.43839088",
            "sentiment_compound": 0.8201
        },
        {
            "id": "h580avz",
            "score": -17,
            "text": "Can't she just write a shitty song about it ?.....I know she can if she tries really, REALLY hard.",
            "title_similarity": "0.5190899",
            "sentiment_compound": -0.7434
        },
        {
            "id": "h5818hw",
            "score": -6,
            "text": "Does she really have dementia?\nIf she does,things are about to get real creepy.",
            "title_similarity": "0.39205438",
            "sentiment_compound": 0.0
        },
        {
            "id": "h582hcr",
            "score": 6,
            "text": "I said this before on YouTube. In my line of work I see every single type of person. From the richest people on earth, to the poorest. From happy to sad, and everything in between. I’ve met hundreds, if not thousands of people living day to day who are so much worse off than Britney. I don’t follow this story day to day, and I also don’t mean this as to dog on those people who I’m saying are worse off. Some are the sweetest people on earth. My point is, it’s hard to believe this woman has been kept the way she is because the courts don’t think she could do it on her own.. Like, it’s such incredible bullshit.. Makes you lose even more hope for the government no matter what side your on",
            "title_similarity": "0.51395893",
            "sentiment_compound": -0.8202
        },
        {
            "id": "h58b3lg",
            "score": -5,
            "text": "   Hello? Does this thing still work? Mission report... I can't remember the date. We've been here for... months... weeks... hell, maybe decades.  We lost another man yesterday, old age took him.  I wonder if my wife even remembers my face.. I can't remember hers. Apparently my son got married, and I heard that he had had a little boy. I still haven't met him. My last hair fell out today, when I left I was 23... now I think I'm in my 90s. \n\nWhen I think of time I just remember the mission. Maybe tomorrow we'll finish it... I've told myself that for decades. It takes over my mind. We have to complete the mission, no matter what. We've covered so much ground, we've... I've... lost so many friends... hurt so many people. My kill count must me in the hundreds. So many innocents... men... women... children. The only thing that keeps me sane is the thought of the mission. But today, I doubt even that. Because all that sacrifice... all that hardship... and we still haven't found who THE FUCK ASKED.",
            "title_similarity": "0.5049319",
            "sentiment_compound": -0.9631
        },
        {
            "id": "h59wwxx",
            "score": 4,
            "text": "The won't let her take out her iud. That's beyond fucked up and should be illegal and that's just the cherry on top of what seems to an abusive conservatorship. I hope she gets justice and this changes thinks for ppl with mental illness stuck without rights to their own being.",
            "title_similarity": "0.64716077",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h58uz7x",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.15744942"
        },
        {
            "id": "h59xwz5",
            "score": 6,
            "text": "I genuinely don't even understand what the fuck is happening with this... With all the insane shit celebs have done, why was SHE hand picked to be called \"crazy\".. Literally what she did was pretty damn mild in comparison to what we hear in celeb news daily, and those fuckers still get to make their own decisions. \n\nWhat the fuck happened here?",
            "title_similarity": "0.579223",
            "sentiment_compound": -0.9423
        },
        {
            "id": "h58cdm6",
            "score": 10,
            "text": "You know what’s really scary? They could legit have a DNR for her that she doesn’t know about or didn’t sign herself.",
            "title_similarity": "0.5675207",
            "sentiment_compound": -0.5413
        },
        {
            "id": "h58d6on",
            "score": -10,
            "text": "She blew her brains out with drugs. She doesn’t even know those words... come on man!",
            "title_similarity": "0.5306319",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59g2t9",
            "score": -6,
            "text": "I mean at the end of the day she is still a crazy person? No?",
            "title_similarity": "0.4175478",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h57py0a",
            "score": 26,
            "text": "And so do the rest of us. \n\nHope this has a happy ending",
            "title_similarity": "0.066952124",
            "sentiment_compound": 0.765
        },
        {
            "id": "h58rl96",
            "score": 10,
            "text": "I don't usually care about celebrity crap, but what they did to her was abuse. She was literally just their cash cow. I honestly can't imagine someone forcing me to have an IUD implanted, and telling me that I'm not allowed to get pregnant. They literally robbed her of a huge portion of her life that she'll never get back, and as a woman, never be able to make up for a lost opportunity to have another child. I hate celebrity gossip, but when i randomly heard the court revelations, I stopped to listen was truly shocked and horrified. I hope she can have a happy life now.",
            "title_similarity": "0.65325505",
            "sentiment_compound": -0.6266
        },
        {
            "id": "h57o0is",
            "score": 254,
            "text": ">She listed a series of grievances, including that her hair vitamins and coffee had been taken from her. \n\nShe can’t have coffee? You’ve gotta be fucking kidding me.",
            "title_similarity": "0.6179386",
            "sentiment_compound": -0.204
        },
        {
            "id": "h58p3rt",
            "score": -11,
            "text": "Why does everyone care so much about this shit?",
            "title_similarity": "0.38497794",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h582mqv",
            "score": 84,
            "text": "[removed]",
            "title_similarity": "0.13183689"
        },
        {
            "id": "h57ud57",
            "score": 11,
            "text": "So happy for her! New representation! This is progress in the right direction!",
            "title_similarity": "0.119307294",
            "sentiment_compound": 0.8257
        },
        {
            "id": "h589ju1",
            "score": 10,
            "text": "So in the past few years she has had a [Las Vegas redidency](https://en.wikipedia.org/wiki/Britney:_Piece_of_Me) grossing $138 million, had [concert tours](https://en.wikipedia.org/wiki/Britney:_Live_in_Concert), released albums, and paid her father $10,000 per week, but somehow can't look after herself?",
            "title_similarity": "0.5610328",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h58jhro",
            "score": 10,
            "text": "Dude I'm a metal head. I'm probably pretentious about pop and use Britney Spears' name as like a stereotype for a pop star. I hate celebrity worship. That being said this story is absolutely tragic. It feels me with so much impotent rage I can't even think straight sometimes. Poor woman is a slave. Literally a fucking celebrity slave. This is America.",
            "title_similarity": "0.6859901",
            "sentiment_compound": -0.9393
        },
        {
            "id": "h57yo8y",
            "score": -13,
            "text": "Wow! This comment is going to repeat what everyone already knows but I'm going to say it in a way that makes it seem like I have known all along and didn't just learn on reddit! I'm so woke and educated there's nothing to do but to teach others.",
            "title_similarity": "0.44388372",
            "sentiment_compound": 0.7379
        },
        {
            "id": "h583fec",
            "score": 15,
            "text": "I have a question that may be unclear to answer. If Brit gets a positive ruling and her money back, would there be any legal recourse if he Dad just drained all of her accounts the day before he signs them back over? He has legal control of the accounts, so is there a mechanism to stop that type of thing?",
            "title_similarity": "0.623114",
            "sentiment_compound": -0.1179
        },
        {
            "id": "h59ic22",
            "score": -17,
            "text": "Am I the only one who thinks Britney did this to herself now should suffer consequences.also,shes 54 and makes terrible music. Who cares about her? Not I or anyone with a job and life.",
            "title_similarity": "0.5404547",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h57v9qv",
            "score": 53,
            "text": "Hope she wins, hope her father goes to jail or faces some kind of consequence, I hope this case caused the way conservatorships are issued and handled. There needs to be some kind of stipulations, an outside person or agency that doesn’t profit thus keeping everyone honest and the person safe.",
            "title_similarity": "0.55608827",
            "sentiment_compound": 0.9661
        },
        {
            "id": "h57kkfe",
            "score": -21,
            "text": "[deleted]",
            "title_similarity": "0.15744942"
        },
        {
            "id": "h57rilh",
            "score": 140,
            "text": "I hope they hit that bastard where it hurts him most, his money. Cause it's obvious he cares two shits about his daughter.",
            "title_similarity": "0.6828598",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h584gn1",
            "score": 20,
            "text": "They can compel her to perform, they can make her make appearances, they can have her do all these things, but they want to argue she has no control? Fuck off! That judge is bought and paid for.",
            "title_similarity": "0.6151363",
            "sentiment_compound": -0.2422
        },
        {
            "id": "h583pzd",
            "score": 152,
            "text": "We all made fun of Chris Crocker\n\"Leave Britney alone\" \n\n but in the end he was right",
            "title_similarity": "0.49271202",
            "sentiment_compound": 0.1406
        },
        {
            "id": "h57x0tf",
            "score": 199,
            "text": "Please, please, PLEASE charge Jamie Spears with conservatorship abuse. If there ever was a case to create reform in how conservatorships work, it would be this one! \n\nI know it doesn't undo all the bullshit Britany Spears had to put up with, but if this case creates a major reform in conservatorships than at least her suffering could have prevented others in conservatorships from having to endure the same thing.",
            "title_similarity": "0.6366005",
            "sentiment_compound": -0.4167
        },
        {
            "id": "h583eiz",
            "score": 114,
            "text": "Can we take a moment to appreciate her chutzpah to do this? Fueding with a parent is hard as fuck. Doing it in the public eye after repeated attempts to fight back were slapped down? Damn girl. You go.",
            "title_similarity": "0.7285678",
            "sentiment_compound": -0.782
        },
        {
            "id": "h57o8h2",
            "score": 984,
            "text": "This is a woman who has been charged with no crimes, yet is under house arrest. Her entire life controlled by others, just like prisoners in a jail.",
            "title_similarity": "0.43443456",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h5803t8",
            "score": 30,
            "text": "This whole story is insane. How can a grown ass women lose control of her own life, when she is clearly mentally sound... or at least as sound as the average person.",
            "title_similarity": "0.4825651",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h57xh8h",
            "score": 318,
            "text": "If my 89 year old mother with dementia doesn't need a conservator after blowing all of her money and making herself homeless per the Polk County judge, then why the fuck would Britney need anyone handling her shit?!",
            "title_similarity": "0.6153957",
            "sentiment_compound": -0.8122
        },
        {
            "id": "h57qcsk",
            "score": 399,
            "text": "We want everyone involved to be charged with conservatorship abuse, but especially Lou M Taylor & Jaime Spears",
            "title_similarity": "0.72857785",
            "sentiment_compound": -0.431
        },
        {
            "id": "h57okr2",
            "score": 401,
            "text": "Everyone involved in prolonging her conservatorship is sick. Especially the judge.",
            "title_similarity": "0.6408379",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h57nuc4",
            "score": 4332,
            "text": "I'm almost exactly the same age as Spears. When I was in my twenties,  I made a series of choices that resulted in me being addicted to drugs and my life became totally unmanageable. I lost the job,  the house,  the boyfriend.  I was handcuffed to an ambulance. You get the idea.  I was,  at that time,  not a sane or reasonable person.  \n\nI'm not a fabulously wealthy pop star,  so when I fucked up I was left to deal with the consequences. To hit rock bottom.  Because I was given that opportunity,  I was eventually able to turn my life around.  I'm 9 years clean and sober.  I have a wonderful husband,  a great job,  beautiful home.  People trust me. I pay my bills on time.  I'm a fucking girl scout. I am happy.  Healthy. \n\nI was redeemable. We are all redeemable. Including Britney. She is being robbed of the freedom to fail. Which we ALL need to grow.\n\nTo the people who try to justify this by claiming she'll fuck her life up if left to her own devices,  I say it's  HER life to fuck up.  That is her right.  Fucking her life up could end up being the best thing for her in the long run.  And she might *actually* succeed and thrive.  Either way,  it's her life.\n\nEdit: thank you for the award",
            "title_similarity": "0.6054754",
            "sentiment_compound": 0.9751
        },
        {
            "id": "h57zhtl",
            "score": 43,
            "text": "I am so glad for her. She deserves to be out of that disgusting deal.",
            "title_similarity": "0.31495088",
            "sentiment_compound": 0.1195
        },
        {
            "id": "h581145",
            "score": 42,
            "text": "She is in her own Black Mirror episode",
            "title_similarity": "0.3513375",
            "sentiment_compound": 0.0
        },
        {
            "id": "h588t1x",
            "score": 36,
            "text": "I am personally glad this is getting attention. Some people may brush it off as she is a celebrity and it is only getting attention due to that reason.\n\nHowever, I don't personally care about the fact she is a celebrity. This is a human rights issue. Imagine having a mental breakdown (which a lot of us do) and someone taking control of you and your actions for the rest of your life? It is absolute torture.\n\nI am studying law and generally advocate for the law, however, this is clearly judicial abuse.\n\nYou should definitely care as a person, put yourself in her shoes. Not having any autonomy as an adult is pretty much slavery (don't use that term lightly). She has been forced to work and her father gets all the benefits for sitting on his ass doing nothing.\n\nGood on you Britney! Thanks for bringing this issue into the spotlight.",
            "title_similarity": "0.54488564",
            "sentiment_compound": -0.7526
        },
        {
            "id": "h582dik",
            "score": 95,
            "text": "Conservatorships have a real purpose, if grandpa can't remember his name someone needs to help.\n\nBut the way they've used this shit against Britney for a decade while she is working, earning millions, raising her children, has a stable house? What else can someone do to prove they're a person?",
            "title_similarity": "0.6791702",
            "sentiment_compound": -0.5551
        },
        {
            "id": "h57v0e0",
            "score": 884,
            "text": "If my family forced me to work against my will and took all the money I made for 13 years, I’d honestly murder them.",
            "title_similarity": "0.6690457",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h57kykk",
            "score": 652,
            "text": "Sounds like a gong show and people are backing out of it. Her OWN manager! And lawyer (court-appointed, not father-appointed)\n\n>Much has happened in the three weeks since Spears' first testimony, with the star's long-term manager Larry Rudolph reportedly resigning and her court-appointed lawyer, Samuel Ingham III, also saying he intended to step down. The Bessemer Trust, a financial management company that was hired in 2020 to oversee Spears's estate alongside her father, also pulled out of the arrangement, saying there had been \"changed circumstances\".\n\n\n>She listed a series of grievances, including that her hair vitamins and coffee had been taken from her. \"Ma'am, that's not abuse, that's just f****** cruelty,\" she tearfully told Judge Brenda Penny. \"Excuse my language but it's the truth.\"\n\nThose seem petty but were singled out of a list\n\nEdit to add:\n\nAlso, from the article:\n\n>She (Spears) said she would be happy allowing co-conservator Jodi Montgomery to remain in the meantime. \"My dad needs to be removed today and I will be happy with Jodi helping me,\"\n\n>\"I'm here to press charges,\" Spears said\n\n\nShe is Not happy with how her father, Jaime Spears, has treated her and wants him punished",
            "title_similarity": "0.6998605",
            "sentiment_compound": 0.7122
        },
        {
            "id": "h57tzmb",
            "score": 1698,
            "text": "Charley Sheen didn’t have to go through this abuse",
            "title_similarity": "0.07906969",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h57vxmw",
            "score": 131,
            "text": "considering she was doing concerts and they labeled her unwell is crazy to me",
            "title_similarity": "0.56498045",
            "sentiment_compound": -0.34
        },
        {
            "id": "h57oip2",
            "score": 753,
            "text": "It's just astounding to me that this seemingly capable woman is still fighting this as if she was bedridden or in a permanent psych facility. I mean, what human being, let alone a judge, can allow this to go on any longer? It's beyond ridiculous, it's abuse by the system.",
            "title_similarity": "0.58593905",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h57xwdr",
            "score": 4994,
            "text": "Anyone who was a fan of Britney years ago, knows that two things were important to her…her autonomy and motherhood.\n\nAt 16 years old, she wanted creative control, she wanted business control. It became important to her to write her own music, she learned to play the piano so she could write more than lyrics. Her autonomy was always super important to her.\n\nAnd again, interview after interview she’d talk about wanting a big family..wanting to stop her career in the mid 30s and just be a mom. \n\nShe was stripped of both.",
            "title_similarity": "0.55468035",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h58axvf",
            "score": 186,
            "text": "When Britney was a child they made her an adult, when she’s an adult they make her a child",
            "title_similarity": "0.45353937",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57y479",
            "score": 80,
            "text": "I don't know her medical condition nor should I, but at this point the court should (at minimum) appoint an impatial party to oversee her affairs. \n\nOr just, ya know, leave her to her own choices.",
            "title_similarity": "0.50888896",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h57n7le",
            "score": 8721,
            "text": "Good. Conservatorships should not last this long, she is not incapacitated or unable to care for herself. I find everything that has happened morally repugnant, and it's really distressing to see how we treat people who suffer with mental illness in this country. She has not lived an independent life for over a decade, she's just been propped up and moved around the Vegas circuit so she can be a moneymaker in this insane business model. Everyone got a cut and she has withered away.\n\nEdit: Also, as anyone with toxic family can attest - it is goddamn *terrifying* to think that you could have a mental breakdown (hers was in a legitimate period of heavy stress) or even engage in drug use, and your family could use it against you to argue that they want full control over not only your finances - but your PERSON - for over a decade. I know a lot of people who have struggled with anxiety, depression, bipolar, drug use etc. and are fully functional, even if they have landed on bad times at various points in their life, or made bad decisions. Those are theirs to make. In NO WAY should their freedom and bodily autonomy be completely taken away because of it. I'm not a big fan of hers but this is a violation of her rights.",
            "title_similarity": "0.6601918",
            "sentiment_compound": -0.9836
        },
        {
            "id": "h57zprw",
            "score": 1124,
            "text": "[removed]",
            "title_similarity": "0.13183689"
        },
        {
            "id": "h57ztv4",
            "score": 658,
            "text": "Never in my life did I expect to give so much of a shit about Britney Spears.",
            "title_similarity": "0.42179868",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h57ydt0",
            "score": 7188,
            "text": "Such conservatorships should have a time limit on them, after which time the conservator should have to prove in a court why the arrangement should continue. Be it a year, 5 years, 10 years, whatever, but this bullshit where the \"protected\" person has to fight for release is bullshit.",
            "title_similarity": "0.56403404",
            "sentiment_compound": -0.9186
        },
        {
            "id": "h580014",
            "score": 863,
            "text": "Why is it that the conservators are allowed to determine if the conservatorship is still needed or pick the doctors that decide? That seems like a conflict of interest. Edit: The judge is the one who makes the decision, based on evidence presented by doctors and lawyers. Guess who got to pick the doctors and lawyers.",
            "title_similarity": "0.48593497",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h57lndh",
            "score": 22349,
            "text": "She gets to hire her own attorney now, and that will make a big difference.",
            "title_similarity": "0.39243197",
            "sentiment_compound": 0.0
        },
        {
            "id": "h57y1b3",
            "score": 40,
            "text": "Give him hell, Britney!",
            "title_similarity": "0.5421736",
            "sentiment_compound": -0.7088
        },
        {
            "id": "h57y7h4",
            "score": 5,
            "text": "I honestly can’t believe it’s been this long. Just give her, her freedom. She’s done nothing.",
            "title_similarity": "0.20878395",
            "sentiment_compound": 0.802
        },
        {
            "id": "h580tte",
            "score": 2,
            "text": "The battle for Brit Brit's freedom continues",
            "title_similarity": "0.24216828",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h5811g8",
            "score": 13,
            "text": "[deleted]",
            "title_similarity": "0.15744942"
        },
        {
            "id": "h581n3f",
            "score": 1,
            "text": "Where is her sister in all of this?",
            "title_similarity": "0.41689128",
            "sentiment_compound": 0.0
        },
        {
            "id": "h581v37",
            "score": 1,
            "text": "Right?. It’s Britney, ya?",
            "title_similarity": "0.33627594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h583hto",
            "score": 2,
            "text": "I want some Teddy Grahams! I mean..FREE BRITNEY SPEARS!",
            "title_similarity": "0.35827702",
            "sentiment_compound": 0.2225
        },
        {
            "id": "h583xm3",
            "score": 4,
            "text": "This whole situation is fucking devastating. Like something out of a horror movie. And of course, some assholes will likely profit off of making this into a movie in a few years.",
            "title_similarity": "0.6233622",
            "sentiment_compound": -0.8134
        },
        {
            "id": "h584066",
            "score": 24,
            "text": "Team Britney all the way.  She needs to break away from her greedy, control freak father. Enough is enough.",
            "title_similarity": "0.69215125",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h5856kn",
            "score": 13,
            "text": "What I don't understand is how the conservator gets to hire a lawyer. It's like a prosecutor hiring the lawyer for a defendant.",
            "title_similarity": "0.58513397",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5864k5",
            "score": 4,
            "text": "And the media was trying to spin her losing her attorney as catastrophic to the case. The media refuses to acknowledge what is going on.",
            "title_similarity": "0.6359428",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h586aq9",
            "score": 9,
            "text": "In my professional life, I’ve worked with conservators/guardians of adults and petitioned the court to have guardians appointed. In almost every case of a family member as guardian, it has been a shit show and often interferes with treatment. I don’t know whether a guardian is appropriate for Britney Spears or not, but I am absolutely certain that her father should not be making any decisions for her. It is clear he has over-stepped his authority and is likely preventing her from getting better. I can’t imagine there being any legal basis for keeping him appointed, since the court could appoint pretty much anyone else to the role.",
            "title_similarity": "0.7021563",
            "sentiment_compound": 0.937
        },
        {
            "id": "h586d34",
            "score": 5,
            "text": "I’m two days older than Britney, I couldn’t imagine having someone run my life in the ways she’s described. I know she’s had her troubles in the past but maybe a reorganization at the very least should be considered.",
            "title_similarity": "0.5044591",
            "sentiment_compound": -0.25
        },
        {
            "id": "h586hyu",
            "score": 1,
            "text": "It seems like simply asking for it to end should be enough. Insane it's still in court. I hope he loses everything for this.",
            "title_similarity": "0.5309235",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h586jdr",
            "score": 2,
            "text": "I hope she gets everything she wants",
            "title_similarity": "0.16882855",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h586nfw",
            "score": 1,
            "text": "Can anyone explain the background story of this to me please?",
            "title_similarity": "0.22063679",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h5878uj",
            "score": 1,
            "text": "Why wont they let Ms. Spears run her life? She seems quite capable. What has happened to her is an incomprehensible outrage.",
            "title_similarity": "0.53727204",
            "sentiment_compound": -0.1045
        },
        {
            "id": "h58791c",
            "score": 9,
            "text": "Good.\n\nI hope she wins and gets all the money he has stolen from her returned.\n\nRegardless of what anyone thinks of her as a performer or her music the situation she's been forced into is intolerable and something no-one should have to experience.",
            "title_similarity": "0.52318805",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h587ipr",
            "score": 1,
            "text": "So does everybody else. Unfortunately for some reason these judges keep protecting him.",
            "title_similarity": "0.2823903",
            "sentiment_compound": -0.34
        },
        {
            "id": "h587ma7",
            "score": 1,
            "text": "honest question.\n\nfan is short for \"fanatic\" and Britney has tons of them.\n\nI would've imagined that one of them would've kneecapped evil dad by now right?",
            "title_similarity": "0.71693957",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h587stl",
            "score": 1,
            "text": "Nice to see her breaking the clutches of MK ultra",
            "title_similarity": "0.4667812",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h587tla",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.15744942"
        },
        {
            "id": "h5880ou",
            "score": 5,
            "text": "i really wonder how the fuck this has gone on for so long when it seems pretty obvious a lot of fraud was taking place. \n\nhow does paying, against her will, over a million dollars for her father's PR campaign help her in any way? \n\ni hope this lets her hire an independent firm to come in and audit every single expense the that was charged against her will. It sure seems like a lot of theft and perhaps even judicial bribery were going on.",
            "title_similarity": "0.702734",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h5883x5",
            "score": 1,
            "text": "Seems like a long hard road to prove unless its blatantly bad",
            "title_similarity": "0.29293865",
            "sentiment_compound": -0.34
        },
        {
            "id": "h5887be",
            "score": 1,
            "text": "In a non for profit world we wouldn't have these problems.",
            "title_similarity": "0.019275954",
            "sentiment_compound": 0.6319
        },
        {
            "id": "h588drq",
            "score": 2,
            "text": "Hopefully with damages once successful?",
            "title_similarity": "0.22372678",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h588e3e",
            "score": 4,
            "text": "Idk how deep the whole conservatorship thing goes, but there should be some sort of social worker that does check ins to see if you potentially can regain your shit.",
            "title_similarity": "0.5337592",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h588f15",
            "score": 4,
            "text": "I hope she ends this conservatorship and sues the shit out of her family. Bankrupt them",
            "title_similarity": "0.718539",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h588idu",
            "score": 5,
            "text": "I’d be interested to see exactly how much of her money has been absorbed by family and   lawyers over the years. Leeches.",
            "title_similarity": "0.61211264",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h588vi6",
            "score": 1,
            "text": "Her dad heard her song “Slave 4 U” and took it the wrong way 😢",
            "title_similarity": "0.6487035",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h58935v",
            "score": 1,
            "text": "In reality she has a bunch of hangers-on waiting to score some type of payday. Her dad did the job fine. He didn't get training. Meanwhile the court holds a secret dossier with a bunch of concerning things in it. That's why this is at this stage. You can't lose control of the captaincy of your own life simply by being full of mischief. You have to mutiny",
            "title_similarity": "0.6348711",
            "sentiment_compound": 0.1426
        },
        {
            "id": "h5894ea",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.15744942"
        },
        {
            "id": "h58968y",
            "score": 1,
            "text": "its crazy that millions of people are on her side, yet we can't do anything",
            "title_similarity": "0.45378327",
            "sentiment_compound": -0.34
        },
        {
            "id": "h589g3z",
            "score": 1,
            "text": "Yay finally she gets her own voice go Brittany",
            "title_similarity": "0.23229103",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h589gfe",
            "score": 5,
            "text": "Whatever brit just fuck him up",
            "title_similarity": "0.4116189",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h589p62",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.15744942"
        },
        {
            "id": "h589vxr",
            "score": 1,
            "text": "This whole situation is wrong.  I wonder what is missing here.  She’s seems ok.  And I hope she is.",
            "title_similarity": "0.21421528",
            "sentiment_compound": -0.34
        },
        {
            "id": "h589y70",
            "score": 1,
            "text": "This feels like an ad campaign for I Care A Lot. But for real between that movie and this story I can't believe the state of mental health/elder care in this country.",
            "title_similarity": "0.606846",
            "sentiment_compound": 0.7992
        },
        {
            "id": "h58a4a0",
            "score": 2,
            "text": "Everyone who enabled this from her attorney (should be disbarred and made to pay back all monies) to her Dad (should be in jail) to the judge that did nothing to remedy this and allowed this slavery. Should all be sued and jailed to oblivion. \n\nAmerica “Land of the Free” unless you get caught up in the scum sucking “justice system.”",
            "title_similarity": "0.7365775",
            "sentiment_compound": -0.8847
        },
        {
            "id": "h58a4yd",
            "score": 1,
            "text": "How is everybody doing tonight?",
            "title_similarity": "0.1404569",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58abax",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.15744942"
        },
        {
            "id": "h58b0lh",
            "score": 25,
            "text": "I feel like what’s also important to note is that virtually all celebrities have hired third parties to manage their finances, schedules, etc so if she wants or needs that, that’s completely normal for someone with her amount of wealth and not a sign of incompetence",
            "title_similarity": "0.40114313",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h58bpf9",
            "score": 1,
            "text": "Seems like a no brainer at this point.",
            "title_similarity": "0.061812103",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h58c4n4",
            "score": 1,
            "text": "Her father and hangers on mooching off this woman! No more!",
            "title_similarity": "0.7114045",
            "sentiment_compound": -0.6688
        },
        {
            "id": "h58c7gh",
            "score": 6,
            "text": "State sponsored prostitution. We have come so far.",
            "title_similarity": "0.42071503",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58ccc3",
            "score": 9,
            "text": "I think his lawyers should be charged too, they made it all possible",
            "title_similarity": "0.5597944",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h58d11a",
            "score": 1,
            "text": "yes! finally some hope to this terrible situation",
            "title_similarity": "0.24596816",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h58d9b8",
            "score": 1,
            "text": "Britt of habeas corpus",
            "title_similarity": "0.27071744",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58dlvx",
            "score": 1,
            "text": "Wow, that must have been a difficult decision.  So sad to hear her father abused his role and her talent and fame.",
            "title_similarity": "0.6183763",
            "sentiment_compound": 0.079
        },
        {
            "id": "h58dmgn",
            "score": 3,
            "text": "This could be a great opportunity to bring awareness to anyone else who might be suffering from a similar situation. \n\nI realize this is very very uncommon, but are there any organizations that looks into these types of relationships?",
            "title_similarity": "0.23643851",
            "sentiment_compound": 0.34
        },
        {
            "id": "h58dmx1",
            "score": 2,
            "text": "Imagine being so crazy (even by entertainment industry standards) that you can’t even have control of your massive fortune?",
            "title_similarity": "0.5053967",
            "sentiment_compound": -0.0814
        },
        {
            "id": "h58eepr",
            "score": 1,
            "text": "I'm surprised she just put out a restraining order and not a hit on her father. If anything not trying to kill him is testimony to her mental faculty.",
            "title_similarity": "0.56561124",
            "sentiment_compound": 0.6846
        },
        {
            "id": "h58em43",
            "score": 4,
            "text": "The most heartbreaking thing about this is just all that missing time with freedom. I think this will be a slam dunk win for her but she can never get that time back. Just sucks. Hope she can get back to some semblance of normalcy after this heinous abuse.",
            "title_similarity": "0.48131207",
            "sentiment_compound": -0.6953
        },
        {
            "id": "h58ensz",
            "score": 1,
            "text": "Old Britney here us going to have a killer documentary series when it comes out. Calling it now. She'll cash in on this.",
            "title_similarity": "0.5917142",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h58eovn",
            "score": 3,
            "text": "Her father is soulless",
            "title_similarity": "0.3811184",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58epmp",
            "score": 8,
            "text": "I loved Brittney so much. I remember being at target once and there was only 1 cd left of her newest album and I HAD to HAVE it. Some little girl wanted it too but I guess her and her mother could see how bad I wanted it that they let me take it 😅 I was like 7 and a boy",
            "title_similarity": "0.5080855",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h58esb0",
            "score": 4,
            "text": "How in the fuk can an adult not fkn control their own shit in this day in age and have to battle it out in court. Her father is the biggest fkn mooch on the planet",
            "title_similarity": "0.66062146",
            "sentiment_compound": -0.836
        },
        {
            "id": "h58esud",
            "score": 2,
            "text": "I don't really understand what the laws are in this case. Here in NZ you don't really have anything medical forced on you unless you murder someone.",
            "title_similarity": "0.46726504",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h58evmt",
            "score": 3,
            "text": "Hell yeah. Get his ass.",
            "title_similarity": "0.24572763",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h58f2y9",
            "score": 3,
            "text": "Im so glad things are turning up for her. Love her!",
            "title_similarity": "0.11464945",
            "sentiment_compound": 0.831
        },
        {
            "id": "h58fjm6",
            "score": 4,
            "text": "People need to face real consequences and the conservatorship laws reimagined. Unacceptable to have someone’s human rights violated like that.",
            "title_similarity": "0.55618143",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h58fwwr",
            "score": 4,
            "text": "They whored her out as a child and now drain her money as an adult. WTF?  If she needed a court ordered conservatorship it should have been an independent one",
            "title_similarity": "0.6703319",
            "sentiment_compound": -0.8531
        },
        {
            "id": "h58fy5o",
            "score": 1,
            "text": "I’m not a lawyer, but I can tell you from my experience that the Courts and attorneys make SO MUCH MONEY from conservaterships they never end them. In court, the judge appoints an attorney to represent the public guardian or public administrator, but never for the Ward. Judges deny every request, but not until after their attorney responds and gets paid in kind.",
            "title_similarity": "0.46706462",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h58g3lp",
            "score": 1,
            "text": "Leave this woman alone. This fight is strictly about money.  The dad can't and didn't sing, B did. So fuck off you leeches!",
            "title_similarity": "0.55770993",
            "sentiment_compound": -0.8745
        },
        {
            "id": "h58gbb7",
            "score": 1,
            "text": "I mean, wouldn't the litigation privilege protect her dad?",
            "title_similarity": "0.5167004",
            "sentiment_compound": 0.2691
        },
        {
            "id": "h58gcfg",
            "score": 1,
            "text": "Hopefully she doesn’t end up with some lawyer thats preying on situation for some spotlight.   It’s a good first step",
            "title_similarity": "0.32768023",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h58gfo4",
            "score": 6,
            "text": "When someone can control every aspect of your life it is usually called domestic violence.",
            "title_similarity": "0.526241",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h58hrg8",
            "score": 1,
            "text": "Wow such a long article that tells you no relevant aspects of what is really at issue or needs to be determined by the court to remove the father, or the criteria to make the change in conservatorship.",
            "title_similarity": "0.53056556",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h58i0ns",
            "score": 7,
            "text": "watch the south park episode about her if you ever get a chance. it was a formative experience for me as a kid.",
            "title_similarity": "0.3125192",
            "sentiment_compound": 0.25
        },
        {
            "id": "h58iwsn",
            "score": 3,
            "text": "Judge who has been paid off: “no”",
            "title_similarity": "0.3365668",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58j8we",
            "score": 1,
            "text": "i feel so bad for her man. child stars should honestly not be a thing anymore. most celebrities hate the life that comes with the fame, and putting that on a child that doesn’t even have the choice of voting into a completely life changing career is kinda messed up. and of course parents won’t stop forcing their kids into this field, because for a child to be making $$$, means that money almost entirely goes to the parents.",
            "title_similarity": "0.65014464",
            "sentiment_compound": -0.7831
        },
        {
            "id": "h58jffy",
            "score": 7,
            "text": "This whole thing kind of reminds me of that 'I care a lot' Netflix movie about an evil woman who forces old people onto conservatorships to rob them of all their assets.\n\nedit: decent movie tho.  you'll hate the main character.",
            "title_similarity": "0.71491694",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h58jstr",
            "score": 3,
            "text": "Britney needs to retire to some place out of the way. Little house in someplace like Steamboat, Colorado or Butte, Montana. Have HER wealth invested, and she just lives comfortably off the interest. She can see some mental health and social workers to help her stay out of trouble.",
            "title_similarity": "0.42754477",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h58jvdo",
            "score": 6,
            "text": "How any of what this poor woman has gone through is even remotely legal is beyond me.",
            "title_similarity": "0.31831196",
            "sentiment_compound": -0.481
        },
        {
            "id": "h58kwxm",
            "score": 1,
            "text": "Glad she dropped her previous lawyer. That guy dropped the ball hard and was incompetent af… Dude could have easily upped his stock in the business. Instead he ”forgets” to disclose information to the client that would have helped her to end the guardianship… Her father better have compensated him well, because I doubt he will getting any big time cases anymore.",
            "title_similarity": "0.6283587",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h58l51k",
            "score": 3,
            "text": "I believe there's an episode of Dirty Money on Netflix about conservatorship abuse. It's so messed up.",
            "title_similarity": "0.619043",
            "sentiment_compound": -0.8687
        },
        {
            "id": "h58lfm6",
            "score": 1,
            "text": "Sounds like he should be charged with more than that. Human trafficking comes to mind, just because it was in the open and court approved doesn’t make what was done to her right.",
            "title_similarity": "0.50951195",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h58ltgs",
            "score": 2,
            "text": "Lou Taylor should be gone after too. I hope Jamie is enjoying his RV tonight. Times up mother Fucker.",
            "title_similarity": "0.44671196",
            "sentiment_compound": 0.25
        },
        {
            "id": "h58lz3e",
            "score": 1,
            "text": "Fuck Jamie Spears.\nHuman trash, time for the bin.",
            "title_similarity": "0.5777254",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h58m47x",
            "score": 1,
            "text": "Like her I was raised in a cult.",
            "title_similarity": "0.3930393",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h58mjh5",
            "score": 1,
            "text": "I sure hope the court listens to her this time",
            "title_similarity": "0.23228505",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h58mmex",
            "score": 1,
            "text": "Same conservatorship is paying her father $16k a month and if I m not mistaken  only $5k a month to her.",
            "title_similarity": "0.41068256",
            "sentiment_compound": 0.2755
        },
        {
            "id": "h58mvd6",
            "score": 9,
            "text": "I would feel like such a low life if I sucked my wealth off of my daughters talent and beauty...I’d off myself",
            "title_similarity": "0.56391084",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h58o7yu",
            "score": 3,
            "text": "This is so sad, as a child of the 90’s listening to Brittney.. We all thought she had a fabulous life…",
            "title_similarity": "0.41025144",
            "sentiment_compound": -0.1509
        },
        {
            "id": "h58oc0f",
            "score": 1,
            "text": "Finally, give her the freedom she deserves.",
            "title_similarity": "0.10305447",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h58on2l",
            "score": 1,
            "text": "We’re rooting for you Britney.",
            "title_similarity": "0.4410267",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58ot5a",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.15744942"
        },
        {
            "id": "h58ov7r",
            "score": 6,
            "text": "Damn, get 'em Britney.\n\nBe cool as hell to see her come back after this and get to be a real actual person and not a slave.",
            "title_similarity": "0.38657746",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h58p1ho",
            "score": 3,
            "text": "If she wins, can she sue them back and leave all the leechers with nothing?",
            "title_similarity": "0.5071736",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h58plsx",
            "score": 1,
            "text": "Why does he live in an RV now?",
            "title_similarity": "0.26998234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58pu6m",
            "score": 3,
            "text": "Duh. Hope she cleans him out.",
            "title_similarity": "0.32566908",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h58pz48",
            "score": 3,
            "text": "He should be locked up with Weinstein.",
            "title_similarity": "0.46354872",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58q2h7",
            "score": 17,
            "text": "Jamie Spears has a net worth of $5M, earned solely from the conservatorship.",
            "title_similarity": "0.35336906",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h58u2vd",
            "score": 1,
            "text": "I like Britney’s music Hopefully she can be free and do whatever makes her happy",
            "title_similarity": "0.13429758",
            "sentiment_compound": 0.9042
        },
        {
            "id": "h58u8j5",
            "score": 1,
            "text": "Isn’t LA court system rigged in some fashion?",
            "title_similarity": "0.3819428",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h58udf7",
            "score": 3,
            "text": "I want her to be free from her controlling father after all this time. That's ridiculous.\n\nThough I do still hope she chooses to continue singing after.",
            "title_similarity": "0.48883513",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h58vp1o",
            "score": 1,
            "text": "I doubt he would sign off on this for her.",
            "title_similarity": "0.23381749",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h58wgjt",
            "score": 8,
            "text": "Anyone actually reading this case knows this is much further reaching than just Britney Spears. \n\nThis is a disgusting case of violating *basic human rights* and we better hope she wins.",
            "title_similarity": "0.57862306",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h58wlxl",
            "score": 3,
            "text": "best of luck to this beautiful woman. God bless her for battling through adversity, chores as a child, and overcoming mental struggles that i couldn't even imagine reaching such publicity.  She deserves her fucking freedom.",
            "title_similarity": "0.37880322",
            "sentiment_compound": 0.926
        },
        {
            "id": "h58wnoy",
            "score": 1,
            "text": "And this should be the very least of it and the actual start of progress!",
            "title_similarity": "0.13183065",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h58y361",
            "score": 3,
            "text": "Britney's father should be in jail. He ruined her life.",
            "title_similarity": "0.74762434",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h58yanb",
            "score": 1,
            "text": "Poor girl, she's a SLAVE4U",
            "title_similarity": "0.43818355",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h58zlmj",
            "score": 1,
            "text": "Blatant and flagrantly so I’d think.",
            "title_similarity": "0.25849834",
            "sentiment_compound": 0.0
        },
        {
            "id": "h58zyyx",
            "score": 2,
            "text": "Better late than never",
            "title_similarity": "0.1485805",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5904yl",
            "score": 1,
            "text": "I hope Britney gets the support she needs. Completely unfair this.",
            "title_similarity": "0.48016745",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h590gir",
            "score": 1,
            "text": "I think the world should speak up for a free Britney. This whole situation is absurd.",
            "title_similarity": "0.5190077",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h590w0x",
            "score": 3,
            "text": "I like how the media finds a great photo of her when they portray her as the victim and not the villain. I remember seeing tabloids in the early-mid 2000’s  just brutally shame her. It was terrible. Most people saw her as a person, and the media didn’t. Weird times.",
            "title_similarity": "0.51611924",
            "sentiment_compound": -0.5386
        },
        {
            "id": "h591u9v",
            "score": 2,
            "text": "Isn't she like 20 years too late?",
            "title_similarity": "0.24575642",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h5923zy",
            "score": 1,
            "text": "Oops she did it for the first time.",
            "title_similarity": "0.13442096",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5928bg",
            "score": 2,
            "text": "Not only the father but the damn law. Seriously to allow this andddddd to take this long to settle and give her the rights back to her own life. It baffles me no blame is also put to the courts for something so brain dead obvious.\n\nMilking it to take the cash for the courts and lawyers it's a joke come on media shift the blame and spotlight to the courts and lawyers also",
            "title_similarity": "0.6697386",
            "sentiment_compound": -0.8542
        },
        {
            "id": "h592e8n",
            "score": 2,
            "text": "Why couldnt she take her money and skip town some plz explain to me",
            "title_similarity": "0.4875118",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h592hgu",
            "score": 2,
            "text": "Such conservatorships should have a time limit on them, after which time the conservator should have to prove in a court why the arrangement should continue. Be it a year, 5 years, 10 years, whatever, but this bullshit where the \"protected\" person has to fight for release is bullshit.",
            "title_similarity": "0.56403404",
            "sentiment_compound": -0.9186
        },
        {
            "id": "h592n8x",
            "score": 2,
            "text": "”Everybody wanting something from me\nThey rarely ever wanna just know me\nI became the stranger no one sees\nCut glass I've crawled upon my knees”\n\n8 Good Reasons - Sinead O’Connor",
            "title_similarity": "0.45090318",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h592nkf",
            "score": 2,
            "text": "How did those fans start the free Britney. They said she was signaling with clothes or something. This could be a movie. Geez. Poor girl",
            "title_similarity": "0.5666004",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h592o5h",
            "score": 3,
            "text": "Mind anyone explaining how this can even work? I haven’t heard about such a case outside America. How can a grown ass adult successfull woman be held hostage by her parent? She’s clearly not 24/7 psych ward material. What in the name of fuck?",
            "title_similarity": "0.5937263",
            "sentiment_compound": -0.7041
        },
        {
            "id": "h592wpv",
            "score": 3,
            "text": "No offense but her dad is a piece of shit",
            "title_similarity": "0.5416981",
            "sentiment_compound": -0.6736
        },
        {
            "id": "h5969pl",
            "score": 1,
            "text": "How the hell did she even get in a conservatorship and why is she still in one?",
            "title_similarity": "0.38614148",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h596hf1",
            "score": 1,
            "text": "I'd love to see her speak to it... Maybe an investigative journalism piece with her talking candidly about what has happened.",
            "title_similarity": "0.43443945",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h596rm9",
            "score": 2,
            "text": "I find all this so sad, she deserves control of her own life. The majority of the worlds population has this without question. The only ones that don't are in prison and prisoners deserve theirs rights to be taken away. What did she do that was so bad that now she still has no say over her own life🤔🤔🤔 it's fucked up, to say the least 🤨",
            "title_similarity": "0.5342665",
            "sentiment_compound": -0.9492
        },
        {
            "id": "h598532",
            "score": 2,
            "text": "Was never a fan of her music but It's almost unfathomable the pain and torment she has suffered at the hands of those who where to protect her. Poor lass.",
            "title_similarity": "0.42380562",
            "sentiment_compound": -0.8906
        },
        {
            "id": "h598o4v",
            "score": 1,
            "text": "By the looks of it she's not wrong... sad",
            "title_similarity": "0.024227118",
            "sentiment_compound": 0.6259
        },
        {
            "id": "h598q0z",
            "score": 1,
            "text": "I read the lengthy New Yorker article about her and it was so eye-opening.  Pretty much everyone she had around her was using her for their own benefit from the time she became famous. Hardly anyone was actually looking out for her. Anyone would have struggled with their mental health with that level of fame and being constantly hounded by the paps. They also elevated situations, bringing in the fire service to her house and getting her sectioned just because she didn’t want to say goodbye to her kids. This whole situation was manufactured by the sharks around her. Lou Taylor, Jamie Spears, Sam Ingram should all be charged.",
            "title_similarity": "0.6761843",
            "sentiment_compound": 0.6222
        },
        {
            "id": "h5992cc",
            "score": 5,
            "text": "Time for Mr Spears' birds to come home to roost. Comrade Britney will be avenged.",
            "title_similarity": "0.55964124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59a7zc",
            "score": 2,
            "text": "One of those cases where everybody could witness a murder, but nobody would accuse the murderer.\n\n\nFuck her farther, fuck her lawyer.",
            "title_similarity": "0.5271268",
            "sentiment_compound": -0.9718
        },
        {
            "id": "h59agmn",
            "score": 1,
            "text": "This really changes the \"Leave Brittney Alone\" video and waves of love/hate since it was released all those eons ago in the before times",
            "title_similarity": "0.6178772",
            "sentiment_compound": -0.3535
        },
        {
            "id": "h59av4z",
            "score": 4,
            "text": "I still have no idea what this means.",
            "title_similarity": "0.06840178",
            "sentiment_compound": -0.296
        },
        {
            "id": "h59azwr",
            "score": 3,
            "text": "Whole bunch of folks in her 'inner circle' need some jail time for what they've done to her and taken from her.",
            "title_similarity": "0.6487231",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59bblu",
            "score": 2,
            "text": "Fuck every single person who is doing this to her. Free Britney. This absolutely is abuse. \n\nThis is shining a light on a thing most people aren’t aware of. Unfortunately it isn’t just her this is happening to. Tons of people are in this situation but aren’t rich or famous.",
            "title_similarity": "0.55027926",
            "sentiment_compound": 0.3315
        },
        {
            "id": "h59bunk",
            "score": 3,
            "text": "I can’t fathom why anyone would be against this . Wtf is wrong with people ?",
            "title_similarity": "0.338599",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h59d0wn",
            "score": 4,
            "text": "Moral of the story, don't let anyone else be in control of YOUR life.",
            "title_similarity": "0.28648764",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59dele",
            "score": 2,
            "text": "I think it would be really telling how much the conservatorship (her dad) doesn’t actually care about her, if they were told by the court that Britney could no longer perform, etc. because the court is concerned for her mental state right now. Jamie Spears would probably request an end to the conservatorship himself the moment he recognized he wouldn’t have money rolling in from Vegas shows.",
            "title_similarity": "0.6874195",
            "sentiment_compound": 0.25
        },
        {
            "id": "h59dogq",
            "score": 4,
            "text": "This thread is painful to read. So much speculation and so few facts.",
            "title_similarity": "0.23650981",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h59eg8p",
            "score": 4,
            "text": "Get Gloria Allred on this case. She should be Britney's attorney. She will eat up and spit out all these freeloading grifters!",
            "title_similarity": "0.7493433",
            "sentiment_compound": -0.3802
        },
        {
            "id": "h59endo",
            "score": 4,
            "text": "Your country is fucked to allow this kind of garbage. Wtf is wrong with all of you? Is there something in the water?",
            "title_similarity": "0.5253179",
            "sentiment_compound": -0.8948
        },
        {
            "id": "h59eyhe",
            "score": 1,
            "text": "I found out about this today from this thread and even made a few comments on how fucked it is. Now that I delved deeper into it through a research hole, I can conclude it's the most fucked thing I've seen from America in recent history.\n\nLegal human slavery????",
            "title_similarity": "0.63875866",
            "sentiment_compound": -0.9464
        },
        {
            "id": "h59f02y",
            "score": 8,
            "text": "If Britney Spears sets legal precedent, 1.) I will be so fucking happy as a longtime fan. 2.) She will cement herself as an icon.",
            "title_similarity": "0.42650878",
            "sentiment_compound": 0.7947
        },
        {
            "id": "h59f3w5",
            "score": 4,
            "text": "A very talented women with misfortune of having poor support network has been exploited by literally every single person she has ever known. Hers is the saddest story.",
            "title_similarity": "0.53031397",
            "sentiment_compound": -0.5868
        },
        {
            "id": "h59fgul",
            "score": 9,
            "text": "Why do I get this feeling that after all the things I've been hearing about this, nobody will go to jail or even be punished at the end. Prove me wrong, american juridical system, please do",
            "title_similarity": "0.4988026",
            "sentiment_compound": -0.4897
        },
        {
            "id": "h59gvk0",
            "score": 3,
            "text": "The conservatorship literally robbed Britney of her prime years of life! She can't get that back. I hope she gets everything she asks for, I hope her \"father\" gets everything he asked for too.",
            "title_similarity": "0.7224828",
            "sentiment_compound": 0.7263
        },
        {
            "id": "h59hfq4",
            "score": 3,
            "text": "Does she not talk to her dad?",
            "title_similarity": "0.44638127",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59je81",
            "score": 5,
            "text": "Remember this is happening in “The land of the free” 😂\n\n‘Merica",
            "title_similarity": "0.11781431",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h59k6hg",
            "score": 3,
            "text": "Chris Crocker was right.",
            "title_similarity": "0.05181121",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59lkhd",
            "score": 3,
            "text": "It’s 2021 and Brittany Spears still making headlines",
            "title_similarity": "0.3334477",
            "sentiment_compound": 0.0
        },
        {
            "id": "h59m0qp",
            "score": 1,
            "text": "Her father will go psychotic if he looses CONTROL!! Hope people are protecting her",
            "title_similarity": "0.66847503",
            "sentiment_compound": 0.4374
        },
        {
            "id": "h59m96p",
            "score": 3,
            "text": "I hope she can get out of this bullshit asap.",
            "title_similarity": "0.31699812",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h59msdw",
            "score": 1,
            "text": "Holy crap this guy wants out of prison",
            "title_similarity": "0.45386365",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h59mwfo",
            "score": 4,
            "text": "Wasn’t there a Boston legal episode about conservatorship abuse where this asshole was draining all the elderly people’s finances and then selling heir homes without their permission?",
            "title_similarity": "0.73166573",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h59n3kb",
            "score": 3,
            "text": "Remember when Youtube had all those conspiracy videos about the illuminati and how these entertainers are slaves under their control? It's funny how even if the literal truth of a theory is false, the emotional essence of it can be true... Britney is enslaved through this conservatorship, Amanda Bynes is trying to get out of her conservatorship (and even if she might need it, I'd argue that her mental health was damaged due to years of emotional and sexual abuse and treating her like a hysterical person instead of helping her was pretty fucking convenient for them), lots of child stars have their money taken away by their parents, many performers have contracts that force them to work way too hard for years on end, and on and on it goes.",
            "title_similarity": "0.72111154",
            "sentiment_compound": 0.25
        },
        {
            "id": "h59nmqf",
            "score": 2,
            "text": "Where was Britney’s own Mother throughout this ordeal or her Sister Jamie Lynne …?  Why didn’t they speak up to help her?  I do not quite get it?  Where’s the familial bonds to protect Britney from her abusive father?",
            "title_similarity": "0.6811071",
            "sentiment_compound": 0.264
        },
        {
            "id": "h59ny1d",
            "score": 6,
            "text": "[https://www.newyorker.com/news/american-chronicles/britney-spears-conservatorship-nightmare](https://www.newyorker.com/news/american-chronicles/britney-spears-conservatorship-nightmare)\n\n&#x200B;\n\nThis is very worth the read, lays out how it came into being. IT was abusive from the very beginning. Her father should be in jail, maybe others, but definitely him.",
            "title_similarity": "0.7629893",
            "sentiment_compound": 0.3708
        },
        {
            "id": "h59oarp",
            "score": 6,
            "text": "I guess dad's gravy train has come to a stop. He'll have to get a job.",
            "title_similarity": "0.5379572",
            "sentiment_compound": -0.296
        },
        {
            "id": "h59op16",
            "score": 2,
            "text": "Someone is breaking out of their shell and growing up.  #freebritney",
            "title_similarity": "0.38427472",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h59ouiy",
            "score": 1,
            "text": "Pieces of Britney, Good podcast which explains as to how this all occurred. \n\n\nhttps://www.bbc.co.uk/programmes/p09mfr9s/episodes/downloads",
            "title_similarity": "0.45915407",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h59qdho",
            "score": 1,
            "text": "The \"Evidence\" should be interesting.",
            "title_similarity": "0.06689161",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h59qryr",
            "score": 4,
            "text": "Hope she hires the baddest ass legal eagle to not only to set her free, but disemboweled anyone who responsible for her prison like suffering.",
            "title_similarity": "0.6795716",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h59rss2",
            "score": 1,
            "text": "I feel so bad for Britney... I hope this works out for her. She deserves better",
            "title_similarity": "0.4202373",
            "sentiment_compound": 0.0795
        },
        {
            "id": "h59s70l",
            "score": 4,
            "text": "The fact that its legal to do this shit to a human being is beyond mind boggling.",
            "title_similarity": "0.268673",
            "sentiment_compound": -0.5789
        },
        {
            "id": "h59seph",
            "score": 3,
            "text": "I hope she finds peace and her father’s accounts are carefully checked.",
            "title_similarity": "0.37425703",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h59sred",
            "score": 2,
            "text": "I’m excited for  \n1) her to be free and happy  \n2) her celebratory “I’m free” album and tour (if she wants)  \n3) what I assume will be her advocacy for change for conservatorships as a whole  \n4) her father getting punished for essentially enslaving his daughter  \n5) her children to see her happy",
            "title_similarity": "0.5919725",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h59sua4",
            "score": 7,
            "text": "“Leave Britney Alone!!” Guy was wayyyy ahead of his time lol",
            "title_similarity": "0.35274062",
            "sentiment_compound": 0.5242
        },
        {
            "id": "h59ufmj",
            "score": 5,
            "text": "My brother is schizophrenic, violent, has committed multiple felonies, refuses medication, in and out of jail and mental hospitals....etc. My parents have BEGGED the legal system to do something, anything, to force him into treatment. Nope, sorry, nope, not gonna happen. \n\nCause he ain't got millions of dollars to pilfer from, that's why.",
            "title_similarity": "0.69403505",
            "sentiment_compound": -0.6786
        },
        {
            "id": "h59uw0x",
            "score": 7,
            "text": "This whole conservatorship bs sounds like a never ending claustrophobic nightmare.",
            "title_similarity": "0.49984366",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h59v7w3",
            "score": 6,
            "text": "This whole situation reminds me of being caseworker. Often, when a child was being abused or neglected it would be placed with grandparents.\n\nThey typically had stable housing, employment, etc.  The thing was, these were the people who raised shitty parents in the first place.  They were also someone children were familiar with, which tips the scales pretty heavily in their favor.\n\nI'm imagining a similar situation here.  Britney Spears may very well be incapable of caring for herself or her kids regardless of whether or not the conservatorship has been abused.  And even if it has, is there anyone outside her family that gives enough of a shit about her to actually look after her well being responsibly?",
            "title_similarity": "0.6012058",
            "sentiment_compound": -0.7408
        },
        {
            "id": "h59vi6z",
            "score": 3,
            "text": "Odd question, what have the kids and husband said about this? Wouldn't they be a good character reference?\n\nIt's also really crap that she's paying for the lawyers who work against her, her money is literally imprisoning her.",
            "title_similarity": "0.7528175",
            "sentiment_compound": -0.3925
        },
        {
            "id": "h59vku2",
            "score": 5,
            "text": "PLEASE CAN WE NOT LET THIS DIE\n\nShe can’t go back to that. Please",
            "title_similarity": "0.30206907",
            "sentiment_compound": -0.2978
        },
        {
            "id": "h59wi9r",
            "score": 2,
            "text": "https://en.m.wikipedia.org/wiki/I_Care_a_Lot\n\nWatched this movie a few months ago and the concept annoyed me as much as Britney’s story.  How can this shit happen? There should be much more oversight on this setup with a real focus on pushing people back on their feet when they really are in need.",
            "title_similarity": "0.69007343",
            "sentiment_compound": -0.7814
        },
        {
            "id": "h59wom7",
            "score": 5,
            "text": "It’s even more sickening that her father is the one doing this to her, but for a (fictional) film that showcases how conservators can be abusive and how lucrative it is, check out the Netflix film “I Care a Lot”.",
            "title_similarity": "0.7155727",
            "sentiment_compound": -0.5922
        },
        {
            "id": "h5a221c",
            "score": 4,
            "text": "Man Ratchet and Clank kind of hit the hammer on the head with \"Britney Gears\" seeing as she has been controlled like a robot her whole life.",
            "title_similarity": "0.58036965",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5a39g1",
            "score": 10,
            "text": "\"Family is everything\"\n\nNo, it isn't. Many times, not sometimes, MANY times family hurt you the most.",
            "title_similarity": "0.47181296",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5a3qo0",
            "score": 3,
            "text": "Passing through PH in Vegas one evening we saw people lined up to see Britney’s show, maybe 2-3 years ago and I remember thinking to myself, “man, I’m glad Britney got out of that conservatorship and is back in control of her life and making money, living the life now as a Vegas resident.” \n\nThen all of this wtf?",
            "title_similarity": "0.5310896",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h5a4mdv",
            "score": 1,
            "text": "You would think after all this backlash that he would back off and disappear",
            "title_similarity": "0.43483055",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h5a4x3z",
            "score": 1,
            "text": "Now this is Britney, bitch.",
            "title_similarity": "0.44813937",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h5a5rs2",
            "score": 2,
            "text": "I feel like Jamie Spears just started hearing sirens and has now turned his attention to a ironic needlepoint that says \"His judgment cometh and that right soon.:",
            "title_similarity": "0.6342471",
            "sentiment_compound": 0.25
        },
        {
            "id": "h5a67a4",
            "score": 3,
            "text": "If I was her, I'd refuse to perform, and tell everyone \"hey, stop paying for my music for now\", and make them all panic from losing their cash cow.\n\nBurn it to the ground.",
            "title_similarity": "0.60017",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h5a8h74",
            "score": 1,
            "text": "I heard that over the course of her career she's earned something approaching $360 million dollars. Every current source has her current net worth pegged as $60 million dollars.\n\nIf that number is even in the same ballpark as the real number, she is being robbed blind.",
            "title_similarity": "0.5773902",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h5a8ngk",
            "score": 2,
            "text": "444 S Flower St, Ste 4260, Los Angeles, CA 90071-2966 are his law offices. pretty place",
            "title_similarity": "0.38781068",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h5aahzw",
            "score": 1,
            "text": "I thought slavery was already abolished?",
            "title_similarity": "0.4196123",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h5abgcv",
            "score": 1,
            "text": "100% she will be free",
            "title_similarity": "0.05285324",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h5af1sc",
            "score": 2,
            "text": "I feel people who have hated on her all these years for her stiff dancing and lip syncing and being robotic how they must be feeling now? This women has immense respect from Me, I pray to God this kind of family should never be of any other.",
            "title_similarity": "0.523324",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5af8pj",
            "score": 6,
            "text": "Sue her father and investigate Lou Taylor. Follow the money",
            "title_similarity": "0.74866986",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ahp0k",
            "score": 3,
            "text": "Marathon of Britney on our radio, dads lining his pockets.",
            "title_similarity": "0.5427843",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5aj6kt",
            "score": 1,
            "text": "Slavery. Modern day version of when women were forced to insane asylums to shut them up & take their $.",
            "title_similarity": "0.6480905",
            "sentiment_compound": -0.8885
        },
        {
            "id": "h5arw2p",
            "score": 2,
            "text": "I hope he serves many years in jail. Along with his conspirators.",
            "title_similarity": "0.57742965",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5awfnp",
            "score": 1,
            "text": "Good. *I* want her father to be charged with conservatorship abuse. The only people unsure are those that would be responsible for it, attaching their name and face to the media circus that is sure to not end with a rare and righteous decision.  \n\n\nWhen we are thrown bread, it is not fresh bread. It is not the best or artisanal whatsoever. It is stale bread. And they sneer if we do not smile for it.",
            "title_similarity": "0.6700581",
            "sentiment_compound": -0.7677
        },
        {
            "id": "h5ayoxc",
            "score": 5,
            "text": "Why do her recent Instagrams still seem childlike and not by her? It's so weird to listen to her during the court audio and then watch a video of her on Instagram with some rambling beneath.",
            "title_similarity": "0.50866497",
            "sentiment_compound": -0.3052
        },
        {
            "id": "h5b3pyk",
            "score": 3,
            "text": "I wonder how much money her father has skimmed off her total wealth, because everyone knows if it wasn't a lot of money there would be nobody controlling her.",
            "title_similarity": "0.5461147",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h5b62cp",
            "score": 4,
            "text": "It truly disgusts me that *her team* made her get an IUD even though she wanted more children. How is something like this allowed to be done to a person?",
            "title_similarity": "0.5987686",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h5b75uy",
            "score": 1,
            "text": "Let her freeeeeee!!!! I’m not going home until I see a BS and JT reuinuon tour free of leashes!!!!! Let’s go",
            "title_similarity": "0.46066266",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h5b7ilg",
            "score": 1,
            "text": "What a fucking scumbag",
            "title_similarity": "0.35344213",
            "sentiment_compound": -0.6697
        },
        {
            "id": "h5bdwmg",
            "score": 1,
            "text": "I just hope she doesn’t go through some kind of ‘culture shock’ with all the new freedom. Call me a Debbie Downer, but she will probably have to adjust to her own life being hers again and I hope she has valid, healthy, trustworthy support. I want her to have her own life and total autonomy, it’s her right as a human being, to thrive or fail. I’m just worried. She deserves to thrive and be happy.",
            "title_similarity": "0.3813927",
            "sentiment_compound": 0.9604
        },
        {
            "id": "h5bjbv0",
            "score": 1,
            "text": "I just hope she's really alright and doesn't further get taken advantage of. This poor woman has never had a childhood, good role models or even a stable place to live in her life. What media did to her was kind of shocking.",
            "title_similarity": "0.39306635",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h5bl4x4",
            "score": 2,
            "text": "Gotta say when this is the most upvoted thing in /r/news it really speaks to what the average user here finds most important. Nothing's really changed in the past couple of decades with celebrity worship I guess",
            "title_similarity": "0.33915514",
            "sentiment_compound": 0.5095
        },
        {
            "id": "h5bodwx",
            "score": 2,
            "text": "This guy is no role model. Went to jail for drunk driving that killed a fellow athlete, struggled with alcohol abuse until 2004 and was violent to Britney's mom. He's a deadbeat profiting from the immense success of his daughter to which he contributed nothing.",
            "title_similarity": "0.63726914",
            "sentiment_compound": -0.9231
        },
        {
            "id": "h5bp94h",
            "score": 5,
            "text": "ill fully admit that i pay zero attention to celebrities 99% of the time but after seeing this in the news for so long and finally reading up on it, her father should be lined up against a wall and shot.  What a piece of shit human being.",
            "title_similarity": "0.6767803",
            "sentiment_compound": -0.7546
        },
        {
            "id": "h5bsrnz",
            "score": 3,
            "text": "This is the exact kind of journalism I expect to see with 108k upvotes on reddit. This is some absurdly important journalism that is incredibly important, and everything we say and do regarding it is super important and will effect the outcome...",
            "title_similarity": "0.46281475",
            "sentiment_compound": 0.8221
        },
        {
            "id": "h5bv6ml",
            "score": 2,
            "text": "I hope her dad dies slowly and alone.  And tomorrow.",
            "title_similarity": "0.36776263",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5bwouz",
            "score": 1,
            "text": "I can’t get the movie “I Care A Lot” out of my head everytime I think about Britnee. It’s like they created the movie to loosely cover what she’s going through. Or else this us actually very common (brother and dad who work in nursing homes say that doesn’t really happen though...)",
            "title_similarity": "0.6002816",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h5c2fvf",
            "score": 1,
            "text": "This entire thing is just so sad and he should be charged.",
            "title_similarity": "0.51844925",
            "sentiment_compound": -0.6995
        },
        {
            "id": "h5c58d8",
            "score": 1,
            "text": "Does anyone think he is super fucked now",
            "title_similarity": "0.4048717",
            "sentiment_compound": -0.128
        },
        {
            "id": "h5c7yk2",
            "score": 1,
            "text": "Man, fuck all those people. I hope this poor woman can live a happy life free of those parasites soon!",
            "title_similarity": "0.42132187",
            "sentiment_compound": 0.4708
        },
        {
            "id": "h5cda0u",
            "score": 1,
            "text": "I believe daddy is going to have a very hard time accounting for her money.",
            "title_similarity": "0.5950913",
            "sentiment_compound": -0.1761
        },
        {
            "id": "h5cyr0c",
            "score": 1,
            "text": "I don’t even buy she was mentally ill. Her response to her situation seemed appropriate.",
            "title_similarity": "0.24629691",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h5d2v9z",
            "score": 1,
            "text": "Good!\n\n&#x200B;\n\nHe deserves it, the parasite.",
            "title_similarity": "0.30347973",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h5deq77",
            "score": 1,
            "text": "Jamie Spears is going to end up in prison by the end of this. Oh well.",
            "title_similarity": "0.50043714",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5dvq81",
            "score": 2,
            "text": "I'm not a fan of her music at all but this woman is being abused by her father and the judicial system. FREE BRITNEY.",
            "title_similarity": "0.66278505",
            "sentiment_compound": 0.1577
        },
        {
            "id": "h5dzhl5",
            "score": 1,
            "text": "That motherfucker Jamie Spears has a seat in hell waiting just for him. You don't exploit your child since 17 years old, steal all her hard earned money, her life and even her ability to conceive and get away with it scot free.",
            "title_similarity": "0.6508254",
            "sentiment_compound": -0.8361
        },
        {
            "id": "h5icmdt",
            "score": 1,
            "text": "What her inner circle is doing to her is crazy! You can’t even find the movie Crossroads. Can’t even pay to watch it!",
            "title_similarity": "0.58503866",
            "sentiment_compound": -0.5242
        },
        {
            "id": "h5isk2v",
            "score": 2,
            "text": "He should do jail time.. Britney hasn’t been treated like a human being by those who were most expected in life to protect her. Your children owe you nothing. You owe them everything!",
            "title_similarity": "0.53968596",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h5jeasq",
            "score": 3,
            "text": "Good luck to her. Her father is a leech and needs to face consequences for how he's treated her.",
            "title_similarity": "0.69766533",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h5u0ysc",
            "score": 1,
            "text": "I’m not saying she shouldn’t be able to do what she wants with her life, bc it’s fucked up how little control she has over herself. But let’s not pretend like she’s a good person now. She assaulted a 12 year old girl on the set of Zoe 101.",
            "title_similarity": "0.59932196",
            "sentiment_compound": -0.6879
        },
        {
            "id": "h6fwvj0",
            "score": 2,
            "text": "Her father belongs in prison for life hard labor no parole in genpop and all his stolen assets returned to her. Also chemical castration since he forced her on birth control.",
            "title_similarity": "0.7336428",
            "sentiment_compound": -0.886
        },
        {
            "id": "h6otejk",
            "score": 1,
            "text": "I cant imagine how much money she's lost in this. I hope they make him pay it all back.",
            "title_similarity": "0.53883564",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h6rzyma",
            "score": 2,
            "text": "She definitely has daddy issues.",
            "title_similarity": "0.4816839",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h70hs8t",
            "score": 1,
            "text": "Why anybody cares about this nasty bitch and her stupid family idk.",
            "title_similarity": "0.5923073",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h7dsfrn",
            "score": 2,
            "text": "I hope she gets both her freedom and her justice.",
            "title_similarity": "0.22487873",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h7vzvak",
            "score": 1,
            "text": "I hope everyone who has worked against her ends up in jail.  Just thinking about doing something like this to my daughter, or anyone else for that matter, sickens me.",
            "title_similarity": "0.67843056",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8525yo",
            "score": 1,
            "text": "Atta Baby, Baby. ♡ \n\n(How were you supposed to know\nThat something wasn't right there?)",
            "title_similarity": "0.2974323",
            "sentiment_compound": 0.0
        },
        {
            "id": "h86oa9x",
            "score": 1,
            "text": "Me just thinking more and more about how her 14 year old threatened to whoop his Grandad's and we all thought he was being a disrespectful little shit, when really he knew what was going on with his mom.",
            "title_similarity": "0.73269963",
            "sentiment_compound": -0.7436
        },
        {
            "id": "h88f1cw",
            "score": 1,
            "text": "He should be charged with embezzlement from his own child too and be made to pay back all unapproved money he stole.",
            "title_similarity": "0.72637284",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8a64mc",
            "score": 1,
            "text": "Isn't she a low functioning disabled adult? I don't know enough about Britney to formulate an opinion",
            "title_similarity": "0.2712422",
            "sentiment_compound": 0.2057
        },
        {
            "id": "h8e6b5f",
            "score": 1,
            "text": "Ohh! Britney you are so cute",
            "title_similarity": "0.10386641",
            "sentiment_compound": 0.632
        },
        {
            "id": "h8kj34m",
            "score": 1,
            "text": "I hope everyone involved get what they deserve. #FreeBritney",
            "title_similarity": "0.22838861",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8mhb8j",
            "score": 1,
            "text": "If I was her I’d get every dime of it and make his ass live off of his retirement.You don’t think he’s been slipping money away all these years shit you know damn well he has. Good luck Britney you made it. it’s yours, you should be able to enjoy it. Get an accountant to go over the books a good one and pay them well.",
            "title_similarity": "0.5487236",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h8nms5j",
            "score": 1,
            "text": "Her father goes over an beyond his boundaries. She's a adult an all he wants is control of her money so he don't end up broke. She's been doing her own thing for years now.",
            "title_similarity": "0.51540923",
            "sentiment_compound": 0.3252
        }
    ]
}