{
    "Britney Spears' new attorney files to remove Jamie Spears as conservator\n": [
        {
            "id": "h6n642d",
            "score": 1,
            "text": "I don’t usually care much about celebrity issues but this one has been around for so long its caught many people’s attention. In my opinion Britney clearly has some mental health issues …then and now based actions, statements etc and they may require she exist on a conservatorship for the rest of her life.       Also good to remember that we will never know the whole storey. I do believe though that her family has taken horrible advantage of her celebrity and money and should ALL be cut off and restricted access. Hope she finds some piece whatever that turns out to be",
            "title_similarity": "0.6088725",
            "sentiment_compound": 0.6187
        },
        {
            "id": "h6n042b",
            "score": -4,
            "text": "What about that backstabbing snake of a sister??",
            "title_similarity": "0.5555512",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6mqlpc",
            "score": -52,
            "text": "[removed]",
            "title_similarity": "0.28078952"
        },
        {
            "id": "h6mrwbz",
            "score": -24,
            "text": "I am concerned that Britney and the free Britney movement are going to get exactly what they want and then another shoe is going to drop.\n\nHopefully that movement is correct and this was all an exploitative nightmare to be trashed and not a necessary means of helping a truly damaged person.\n\nBut whatever the case may be. It is none of my damn business.",
            "title_similarity": "0.5447941",
            "sentiment_compound": 0.7259
        },
        {
            "id": "h6nkc65",
            "score": -4,
            "text": "Read her monolog in this article. She's insane, she needs to be under a conservatorship. Sure, divest her family from it completely,  but she needs oversight. This ends poorly otherwise.",
            "title_similarity": "0.664306",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h6nbmyl",
            "score": 1,
            "text": "I’m gonna be honest, seeing this get so much attention the last few weeks has been weird for me. It’s good that she seems to be getting freedom but like…why do people care so much? This should not be headline news as much as it should just be TMZ material.",
            "title_similarity": "0.47277653",
            "sentiment_compound": 0.8641
        },
        {
            "id": "h6nmap9",
            "score": 3,
            "text": "Listen I'm probably going to take alot of heat for this, but my wife follows her on all her socials and shows me her vids, and I'm just saying, something is off with her. She seems fucking nuts to be completely honest. I'm not saying she needs this conservatorship, I don't know the details, but from the videos she posts, maybe there's more to the story. It really seems like she's lost in the early 2000s and genuinely believes she's some kind of fairy princess and wants to live in a fairy tale. People can believe whatever they want but it doesn't seem crazy to me that her family wants to be in charge of her estate because she would literally blow it all on shit like pink Bentleys.\n\nAgain, I'm sure this isn't a popular opinion, I thought for awhile her family is some kind of evil villains holding her hostage, but after seeing many many social media posts from her, that girl ain't right.",
            "title_similarity": "0.6193499",
            "sentiment_compound": -0.9025
        },
        {
            "id": "h6napfe",
            "score": -11,
            "text": "I don’t know about any of you, but this “news” is mind blowing.\n\nI mean, if I hadn’t read it here, I wouldn’t have believed this sort of pointless misdirection, masquerading as important shit, existed.",
            "title_similarity": "0.4080289",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h6ne9t5",
            "score": 1,
            "text": "It's a crazy situation and everything, but considering everything else going on in the world right now I don't really give a shit about Britney Spears.",
            "title_similarity": "0.5238203",
            "sentiment_compound": -0.7903
        },
        {
            "id": "h6mzstq",
            "score": -7,
            "text": "wasn't this the guy that used to feed britney and the other kids squirrel?",
            "title_similarity": "0.4024645",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ndg43",
            "score": 2,
            "text": "***NOTICE*** the title says “Jamie Spears”... her sister is “Jamie Lynn Spears” who is on her side. “Jamie Spears” is short for “James Spears”, her father. This is click bait at its finest. Further more, I am trying not to question myself why I have put so much effort into this comment. Fuck me.",
            "title_similarity": "0.64816856",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h6o04qz",
            "score": -4,
            "text": "Who the hell gives a fuck about Britney Spears",
            "title_similarity": "0.6115142",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h6nhl3r",
            "score": -6,
            "text": "I know this conservatorship is supposed to be super overbearing and controlling, but do we know that Britney can handle otherwise. It’s not like any of the outraged media know about her mental state or what exactly went down or why in the 2000s. Yes her dad was paying himself a fuck load of money, so clearly there’s a greed aspect, but I feel like that aspect being there doesn’t exactly invalidate other potential reasons for the conservatorship.\n\nI don’t know about the ethics behind taking away someone’s freedom to prevent them destroying themselves, but if it turns out that Britney does need that conservatorship to remain safe, and ends up destroying herself, will the redditors who know so little about the case be willing to take responsibility?",
            "title_similarity": "0.57333755",
            "sentiment_compound": -0.4075
        },
        {
            "id": "h6nq31y",
            "score": 2,
            "text": "Reddit hates celebrity worship, unless they're the ones doing it.",
            "title_similarity": "0.5963947",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h6om1pl",
            "score": 0,
            "text": "Americans are famous for putting holds on everyone else",
            "title_similarity": "0.31843954",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nagin",
            "score": -13,
            "text": "This is not newsworthy. This is a family’s messy life and stupid decisions paraded out as “news”",
            "title_similarity": "0.46661973",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h6ngg1u",
            "score": 0,
            "text": "Why does this keep popping up in the news?",
            "title_similarity": "0.25950485",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ns38s",
            "score": 0,
            "text": "thank god, I can get some sleep now.",
            "title_similarity": "0.09639081",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h6ok6xd",
            "score": 0,
            "text": "Same post, different day.",
            "title_similarity": "0.19296043",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6oybcs",
            "score": 0,
            "text": "Jamie Lynn spears wants to be an author.  I'm connected with someone involved in the project of her \"book\" and my response has always been \"......why.  What does she have to say? Who wants to read it.  Meh?\"  \n\n\nBut now I'm like \"uch.\"  Jamie has not grown up to be a decent human. Nothing insightful to say. Just power, posing, and standing on her sister's coattails and going \"MUSH!\" I'm annoyed that there are authors out there who sign contracts with moral clauses, whose lives and careers get ruined when they're accused -- no matter how loose, and absurd said accusation seems (e.g. Brian Banks).    Meanwhile, Jamie is neglectful to the point of supporting her sister's oppression, to the point that she's essentially doing brazen, horrible things to the person who made her famous and.....the people profiting might as well just go \"lol\"",
            "title_similarity": "0.6304589",
            "sentiment_compound": -0.8629
        },
        {
            "id": "h6r8l6v",
            "score": 0,
            "text": "Thank god we’re tackling the important shit",
            "title_similarity": "0.23443897",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h6n9xa4",
            "score": -3,
            "text": "i wonder if her instagram is being sabotaged.. if not, its not looking good.. =/",
            "title_similarity": "0.52040815",
            "sentiment_compound": -0.0951
        },
        {
            "id": "h6niwr8",
            "score": 6,
            "text": "Wish we had this energy for people locked up for minor marijuana offenses",
            "title_similarity": "0.41164494",
            "sentiment_compound": 0.3767
        },
        {
            "id": "h6nqs2b",
            "score": 1,
            "text": "Am I the only one confused and not paying attention to this at all",
            "title_similarity": "0.17827708",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h6nzfqb",
            "score": -2,
            "text": "Who cares about any of this shit",
            "title_similarity": "0.23406807",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h6nemo1",
            "score": 7,
            "text": "Not sure if this is an unpopular opinion, but I don’t think this should be playing out in the court of public opinion. \n\nWhile people behind FreeBritney have good intentions, they don’t have all the facts of the case.",
            "title_similarity": "0.33364564",
            "sentiment_compound": 0.6777
        },
        {
            "id": "h6o5tdi",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.303635"
        },
        {
            "id": "h6o6f3x",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.303635"
        },
        {
            "id": "h6na0sc",
            "score": -1,
            "text": "lawyers are now getting in on the fathers racket",
            "title_similarity": "0.4174481",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nhoxl",
            "score": 1,
            "text": "Mooching off your sister... so horrible",
            "title_similarity": "0.5148283",
            "sentiment_compound": -0.8015
        },
        {
            "id": "h6nmqoe",
            "score": -1,
            "text": "Tits out for liberation!",
            "title_similarity": "0.2928341",
            "sentiment_compound": -0.2942
        },
        {
            "id": "h6o3r6w",
            "score": -1,
            "text": "Hollywood petos ruined poor lady. And dad was tryin to cover it up.",
            "title_similarity": "0.56192553",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h6o8j6i",
            "score": 1,
            "text": "Let’s see if she consents to a psych evaluation. If she does that, I think she would pass and that would end the conservatorship.",
            "title_similarity": "0.63934124",
            "sentiment_compound": 0.25
        },
        {
            "id": "h6p9hn6",
            "score": -1,
            "text": "Was being a conservator always bad or is it onlt because it's Brittney spears? It could be possible she's severely mentally ill and can't control her own funds, I know alot of fully functional mentally ill people, psyc hospitals, group homes, etc.",
            "title_similarity": "0.54302436",
            "sentiment_compound": -0.9074
        },
        {
            "id": "h6po10j",
            "score": -1,
            "text": "Why is this such a big deal?",
            "title_similarity": "0.1820673",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nn9ki",
            "score": -4,
            "text": "Jesus fuck, get this inconsequential bullshit off the front page of news rn",
            "title_similarity": "0.61711454",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h6nd67u",
            "score": 10,
            "text": "give that girl some grey goose and a 8 ball #freebritney",
            "title_similarity": "0.42292184",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h6n8j12",
            "score": -2,
            "text": "Is anyone else concerned that someone is going to take advantage of Britney? Not that her father is doing a great job at all but just worried that she’s not getting manipulated further",
            "title_similarity": "0.4985438",
            "sentiment_compound": 0.4635
        },
        {
            "id": "h6nceye",
            "score": 2,
            "text": "Once she is free completely from this conservatorship I hope her attorneys will sue those that stole money for the past 13 years from her under the guise of “guardians” of her fortune.  Why has it taken this long ? It almost makes one think the Judge and team of lawyers that represent the father are in cahoots? I hope the CA bar does an investigation as well. Go Britney! Get your well deserved freedom back !",
            "title_similarity": "0.72956336",
            "sentiment_compound": 0.9548
        },
        {
            "id": "h6p2aiy",
            "score": 2,
            "text": "It's sad that more Americans understand the intricacies of this story over something truly important like climate change. I'll gladly accept the downvotes to post this.",
            "title_similarity": "0.45516255",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h6n9lhv",
            "score": 24,
            "text": "I can accept a judge deciding she still needs a conservator, but not the idea that it has to be her father. Unless she has a totally spurious reason for not wanting him I can't see why the judge would reject this.",
            "title_similarity": "0.49455985",
            "sentiment_compound": -0.4118
        },
        {
            "id": "h6nl61z",
            "score": 1,
            "text": "I love how people are all supportive of her after years of mocking her.\n\nEdit: To be clear I am not justifying her being in this conservatorship. I am simply pointing out that a lot of people are simply jumping on this bandwagon because it's popular vs because it's right. It's the white knighting of women on the internet.",
            "title_similarity": "0.5106509",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h6q7vdd",
            "score": -3,
            "text": "Who fucking cares why a waste of time",
            "title_similarity": "0.25391784",
            "sentiment_compound": 0.1263
        },
        {
            "id": "h6q7vr5",
            "score": -2,
            "text": "Who fucking cares what a waste of time",
            "title_similarity": "0.24663985",
            "sentiment_compound": 0.1263
        },
        {
            "id": "h6nij1t",
            "score": 0,
            "text": "I feel like Chris Crocker is going to become viral again",
            "title_similarity": "0.38978842",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6nn0qz",
            "score": 0,
            "text": "There are too many jamies.",
            "title_similarity": "0.2404331",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nv6rv",
            "score": 4,
            "text": "I hate that I'm actually starting to care about what happens to Britney fucking Spears.  But yeah, this is just ridiculous.",
            "title_similarity": "0.5896684",
            "sentiment_compound": -0.0784
        },
        {
            "id": "h6nve22",
            "score": 0,
            "text": "Can someone elaborate on why she needs this to begin with in 2008?\n\nI am really not trying to be rude when I say this, is she incapable of handling her finances? Or incapable of living her life without aid?\nI don’t understand what made this happen all the way at the beginning. Was she coerced into this “relationship” with her father to control everything? \n\nAnd now modern day she is not being set free of this burden but it’s being passed to another man. Who is this guy and what will make him different from her father? Genuine question as I haven’t a clue as to why this is a thing for someone of the magnitude of fame like Brittany Spears lol",
            "title_similarity": "0.56963",
            "sentiment_compound": 0.6817
        },
        {
            "id": "h6o6rt7",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.303635"
        },
        {
            "id": "h6onf89",
            "score": 0,
            "text": "Others gona touch her",
            "title_similarity": "0.29018718",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6mvwch",
            "score": -14,
            "text": "I wish this wasn’t news.",
            "title_similarity": "0.2952875",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6n8raw",
            "score": -5,
            "text": "No way ? only seen this headline 14 times in the last two days. Had no clue",
            "title_similarity": "0.36534685",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h6na78h",
            "score": 1,
            "text": "I read this as James Spader. I was all like whaaa",
            "title_similarity": "0.25321764",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6nbpkj",
            "score": -1,
            "text": "Then comes the news post about the court scheduling a hearing, then after, a decision to go through discovery, and finally after the news media has milked this subject.....it'll go to a jury trial if a judge can't make a decision.  \n\n\nContingent on a judge's ruling or a jury decision, we'll see the appeal will be made either way, and then the news outlets can cash in for years on this.",
            "title_similarity": "0.58809584",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nbvpa",
            "score": 1,
            "text": "For a second I thought it was Jamie Lynn Spears and I was super confused.",
            "title_similarity": "0.5203563",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h6nclho",
            "score": 1,
            "text": "I keep forgetting Jamie Spears is different than Jamie Lynn Spears",
            "title_similarity": "0.5268225",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ng2w8",
            "score": 1,
            "text": "Shouldn't there be some sort of psychological assessment that could judge, independently, if she is able to function successfully without a conservator. Unpopular opinion but she seems to have been successful in the past thirteen years without the constant media attention, maybe the conservator is working",
            "title_similarity": "0.48674846",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h6ngbqn",
            "score": -1,
            "text": "And the sky is still blue",
            "title_similarity": "-0.010615924",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nioog",
            "score": -1,
            "text": "Hit me Daddy, One More Time!",
            "title_similarity": "0.42622355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nmj4t",
            "score": 1,
            "text": "I’m very happy for these moves.  If I were Britney right now I would be terrified of being murdered in some way given the fact that everything - food, medication, etc - is out of her control and the evil people that have enslaved her are going to be exposed sooner or later.  I really hope nothing bad happens to her and I wonder if there is something her lawyer can do to protect her?",
            "title_similarity": "0.5490544",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h6nn8b0",
            "score": 1,
            "text": "This is great, but what about the little people.",
            "title_similarity": "0.061457783",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h6nq54j",
            "score": 1,
            "text": "The judges who have allowed her slavery must be getting a cut of the wealth.",
            "title_similarity": "0.49972796",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h6nzzm9",
            "score": -1,
            "text": "What the fuck is taking so long?",
            "title_similarity": "0.1777376",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h6ogql0",
            "score": -1,
            "text": "She finally stopped using r/legaladvice !\n\n(/s I don't want to insult anyone that gives good advice or the sub itself)",
            "title_similarity": "0.57775795",
            "sentiment_compound": 0.582
        },
        {
            "id": "h6ohrtx",
            "score": 1,
            "text": "Also maybe put him in jail?",
            "title_similarity": "0.32097003",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6oi768",
            "score": 1,
            "text": "Hopefully she can get her own control of her wealth. I would be the father probably spent tens of millions and once he looses control, he would get sued to wazoo",
            "title_similarity": "0.58055365",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h6okovh",
            "score": -1,
            "text": "Great news, on a side note, In one conversation she said she would like to have kids, doesn't she already has kids ?",
            "title_similarity": "0.42753956",
            "sentiment_compound": 0.765
        },
        {
            "id": "h6ordov",
            "score": 1,
            "text": "Britney is an illuminati plant",
            "title_similarity": "0.4639045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6owpw5",
            "score": -1,
            "text": "I'm going to lose my s*** if after all of this the whole thing is done away with and Brittany goes batshit crazy",
            "title_similarity": "0.60576046",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h6oxdsj",
            "score": 1,
            "text": "What a headline \"human does their job correctly\"",
            "title_similarity": "0.04249284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6p2w0l",
            "score": -1,
            "text": " Why don't they call him \"James Spears\"? As someone who didn't immediately read the article and rather googled \"Jamie Spears\" I wondered how her younger sister had become her conservator...",
            "title_similarity": "0.6598799",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6o90ie",
            "score": 8,
            "text": "i think its horrible how we treat Female vs Male celebrity’s.",
            "title_similarity": "0.48691463",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h6nc1fz",
            "score": -15,
            "text": "Check her social media. She crazy. Not that she deserves this, but she isn’t all there.",
            "title_similarity": "0.46122214",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h6ncgni",
            "score": -8,
            "text": "She is going to end up penniless witness me.",
            "title_similarity": "0.48603013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6n21b7",
            "score": 45,
            "text": "I’m with you Britney. Fuck Jamie Spears!",
            "title_similarity": "0.6628516",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h6n82sp",
            "score": -26,
            "text": "[removed]",
            "title_similarity": "0.2807895"
        },
        {
            "id": "h6nsmv4",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.303635"
        },
        {
            "id": "h6ntl86",
            "score": -9,
            "text": "She's clearly not well mentally. I don't see all the controversy around this.",
            "title_similarity": "0.32354477",
            "sentiment_compound": 0.223
        },
        {
            "id": "h6msl0l",
            "score": 121,
            "text": "Activate the free britney sleeper cells.",
            "title_similarity": "0.46780986",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h6nis19",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.303635"
        },
        {
            "id": "h6nlyjx",
            "score": -2,
            "text": "Wait why the fuck is her little sister a conservator to begin with???",
            "title_similarity": "0.5876414",
            "sentiment_compound": -0.6174
        },
        {
            "id": "h6ouawl",
            "score": 2,
            "text": "Stop worshipping celebrities.",
            "title_similarity": "0.52665365",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h6peo16",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.303635"
        },
        {
            "id": "h6n9nnn",
            "score": 75,
            "text": "To think that this could have gone on for the remainder of her life if she hadn't exposed him publicly... scary.\n\nFREE BRITNEY! This woman deserves the world.",
            "title_similarity": "0.5424531",
            "sentiment_compound": 0.3285
        },
        {
            "id": "h6ng8rb",
            "score": 65,
            "text": "It's really fucking stupid that it took a popstar having this done to her for people to give a shit about conservatorship legislation. There are thousands of Americans dealing with this. \n\nI'm not trying to belittle her struggle, because obviously, the way she's being treated is abhorrent. I just wish it didn't take celebrity for people to care about mentally ill people fighting for basic human rights.",
            "title_similarity": "0.5508577",
            "sentiment_compound": -0.8993
        },
        {
            "id": "h6nbzb1",
            "score": -4,
            "text": "These attorneys are making a killing on this case. LOL!!!!",
            "title_similarity": "0.46105",
            "sentiment_compound": -0.4651
        },
        {
            "id": "h6nc6hi",
            "score": 3,
            "text": "He should if all possible try to remove the female judge that seems to in control of all the hearings",
            "title_similarity": "0.6369561",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nnm6n",
            "score": 3,
            "text": "It's hilarious how everyone thinks they're experts on this and really know what's happening...and of course nobody questions the narrative.",
            "title_similarity": "0.24309406",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6nspcn",
            "score": -2,
            "text": "Her new topless pics are just a bonus",
            "title_similarity": "0.39028427",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h6nuii6",
            "score": 3,
            "text": "39 years old. Can’t be on her own. Sad",
            "title_similarity": "0.37631118",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6nvhoc",
            "score": 2,
            "text": "I wish I could find it - but there was a documentary with her back when TRL was still big - I remember watching it and feeling SO sad for her - you could tell she was depressed, trying to manage the extreme amount of attention that celebrity brings - you could tell she felt extremely alone and isolated even with make up artists, stylists, assistants, etc buzzing around her. I think she even said at one point that she felt alone… all I wanted to do was just walk up to her give her a hug and ask her what she needed. This poor poor woman… I’m happy things are shifting in her favor but it’s taken far too long.\n\nUpdate: The doc was [‘For the Record’](https://vimeo.com/441937549) thanks u/sillywhabbit",
            "title_similarity": "0.47973043",
            "sentiment_compound": -0.8585
        },
        {
            "id": "h6nwodj",
            "score": 4,
            "text": "Dude’s name is Jamie. Like, fuck off.",
            "title_similarity": "0.42770857",
            "sentiment_compound": -0.25
        },
        {
            "id": "h6oyyho",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.303635"
        },
        {
            "id": "h6ozwlb",
            "score": 3,
            "text": "The system is so bad. Imagine how many live trapped in it like Britney, but we don't know about it and they will never know they can leave.",
            "title_similarity": "0.543554",
            "sentiment_compound": -0.5417
        },
        {
            "id": "h6pvuqe",
            "score": 3,
            "text": "Her family used the Conservatori system to rape and pillage her. And the legal/court system benefitted too.",
            "title_similarity": "0.47797415",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h6n8pfx",
            "score": -13,
            "text": "Imagine this all ends with Britney Spears mental issues taking over resulting in some sort of horrible end, and we all learn that the family was just trying to protect her after the mistake of getting her into fame too early caused her mental issues to begin with.",
            "title_similarity": "0.6885892",
            "sentiment_compound": -0.1761
        },
        {
            "id": "h6nddwd",
            "score": 14,
            "text": "Get all the  freeloaders out",
            "title_similarity": "0.39304084",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h6nmcoc",
            "score": -5,
            "text": "Not a girl.\n\nProbably not even a woman.\n\nHell, probably not even a man.",
            "title_similarity": "0.25184",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h6nx2z0",
            "score": 3,
            "text": "Jamie Spears choose money over his daughter.  She isn't ever going to forgive him and he is going to die alone and hated by his descendants.",
            "title_similarity": "0.6037941",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h6oyust",
            "score": -5,
            "text": "Its beyond pathetic that America is so obsessed with some celebs finances and mental health. News flash, judges base rulings on ALL the evidence not just the fraction of evidence that your choice of media shared with you to get your dumb ass to click",
            "title_similarity": "0.5248169",
            "sentiment_compound": -0.8845
        },
        {
            "id": "h6p3wuz",
            "score": 4,
            "text": "Wow the sister was part of it to….this runs deeper and crazier than I could have imagined. \n\nHope she can get the fuck away from her family",
            "title_similarity": "0.60183126",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h6pmqrr",
            "score": -4,
            "text": "Why do you idiots even give a shit. Live your own life. Stop being so caught up in other peoples lives. So pathetic.",
            "title_similarity": "0.37826395",
            "sentiment_compound": -0.8895
        },
        {
            "id": "h6molai",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.30363506"
        },
        {
            "id": "h6nuh4y",
            "score": -5,
            "text": "Why the fuck do people care about shit like this???",
            "title_similarity": "0.2872008",
            "sentiment_compound": -0.4479
        },
        {
            "id": "h6nui6m",
            "score": -5,
            "text": "The fact that this bullshit still makes major headlines is completely depressing and absurd.",
            "title_similarity": "0.34010106",
            "sentiment_compound": -0.8122
        },
        {
            "id": "h6py5vn",
            "score": -5,
            "text": "How is this considered news of any importance can this wird Britney Spears stop it is weird as fuck",
            "title_similarity": "0.6198304",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h6necww",
            "score": -8,
            "text": "The concern over Spears is amusing.\n\nEdit: Your concern over my comment is equally amusing.",
            "title_similarity": "0.19082816",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h6nerg7",
            "score": 6,
            "text": "Really eye opening how broken conservatorship bureaucracy is in ‘Murica.",
            "title_similarity": "0.47457796",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6og7l1",
            "score": -6,
            "text": "I think she taking advantage of her social status. Sentimental emotions should be discouraged, let the law prevail.",
            "title_similarity": "0.424289",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h6olcru",
            "score": -5,
            "text": "We don't know everything that's going on behind the scenes or in the court documents and that.\n\nSo stop demanding her to be free when we don't know everything that's going on.",
            "title_similarity": "0.48385474",
            "sentiment_compound": -0.1888
        },
        {
            "id": "h6onjxl",
            "score": 6,
            "text": "How is Britney Spears simultaneously so unwell she can’t take care of her own finances and her own life but is also somehow capable of performing at the highest of levels for 70 hours a week and earning millions a year? How does that make sense to anyone?",
            "title_similarity": "0.503768",
            "sentiment_compound": 0.7059
        },
        {
            "id": "h6oo6wy",
            "score": -7,
            "text": "She is very naive (maybe a low IQ too) and was trying to give large sums of money to something unsavoury. I have this weird feeling that the conservatory was a deal made to avoid her going to prison.  \nCos she was deemed unable to make proper judgement calls. There's been several people trying to trick her into handing over money, she's very easy to trick in that regard.  \nSo ironically all this \"free Britney\" stuff, could be the thing that gets her locked up in prison. I can't say I care either way. Let her make her mistakes that can ruin her life. Then hopefully, I won't have to hear about this anymore. lol",
            "title_similarity": "0.55631185",
            "sentiment_compound": -0.8655
        },
        {
            "id": "h6nq9re",
            "score": 23,
            "text": "For those commenting on her mental health, go look at clips of her in Los Vegas and then look at how she has been since leaving there and having a stay in a mental health facility. It is literally like looking at two different humans. She went from alert and able to work, well spoken, was able to be on to, etc. to, she didn’t want to do something her team wanted her to do and they institutionalized her and I swear to goodness I think they gave the poor woman a lobotomy. The difference in her appearance and behavior took a dramatic, dramatic turn after that. There were pics of her leaving it looking like she didn’t know where she was. My theory is this: at the beginning of the conservatorship she was struggling. Possibly postpartum depression. Then they kept her busy working and things were going well but she wanted to do things differently and they didn’t want to lose control so they either got her on some drug or they did something surgically to her to incapacitate her. The shift in everything about the woman after that is bananas to me. I don’t know enough to know if she does or doesn’t need a conservatorship, but I do know without a doubt the entire team needs to be replaced and she deserves as much freedom as anyone else in all regards as long as she isn’t hurting herself or someone else. I hope all the people who’ve done this to her so far get caught. But the smoking gun is her refusing that Vegas thing. Next thing you know she was in a mental hospital supposedly upset over her fathers health. (And they don’t even get along.) and now she’s messy hair, dark circles under her eyes, manic dancing, not making coherent sentences half the time. They did something to her. I just know it.",
            "title_similarity": "0.5497624",
            "sentiment_compound": -0.7102
        },
        {
            "id": "h6oq6a7",
            "score": -8,
            "text": "Why is this even newsworthy?\n\nShe wanted fame, fortune and fuckall.",
            "title_similarity": "0.47104174",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6o849f",
            "score": 8,
            "text": "Basically shes exactly what they did back in the day and put woman in asylum for having a moment, but instead of being physically locked up they locked her into working like a cash cow and slaving away. The poor woman can even remove her contraception and she's stated she would love more kids but now she's pushing 40 times creeping up. I hope that she gets her freedom back but I would love to see some jail time for her dad and family. They did her real dirty.",
            "title_similarity": "0.6026399",
            "sentiment_compound": 0.9612
        },
        {
            "id": "h6okk3g",
            "score": -9,
            "text": "what if, ten years after the conservatorship is removed, she spends away all her wealth?\n\nwho would you blame, then, reddit angry mob?\n\nalso where the hell is kevin federline in all this?",
            "title_similarity": "0.66119486",
            "sentiment_compound": -0.8243
        },
        {
            "id": "h6mwwfe",
            "score": 3585,
            "text": "Apparently she wasn’t even allowed to have coffee. That’s when I knew dude was truly a monster.",
            "title_similarity": "0.5442773",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6p32tu",
            "score": -8,
            "text": "Can’t wait for her next meltdown. She’ll be marrying a scum bag, having a few kids, shaving her head and flashing her body to the paparazzi in no time.",
            "title_similarity": "0.5858637",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6nnpig",
            "score": 12,
            "text": "No one, not even her lawyer, is going to mention she had postpartum depression (PPD) in 2007? Opportunistic, sexist twats. She should not be under a conservatorship.\n\nWhen viewing the umbrella incident [in context](https://www.youtube.com/watch?v=eJy4eyjDUqU), it was actually perfectly understandable.",
            "title_similarity": "0.6197496",
            "sentiment_compound": -0.2869
        },
        {
            "id": "h6np5vo",
            "score": -9,
            "text": "As long as I can still look her up on pornhub, i could care less what happens to her",
            "title_similarity": "0.53063214",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h6o7x5c",
            "score": 11,
            "text": "I interrupted a 20+ year career of not paying any attention to Britney Spears recently, and having heard the details of the case, I am HOT MAD. This true crime podcast did a 2.5 hour deep dive into the case, and man, if you aren't mad as hell when you're done, I don't even know what to say to you.\n\n[https://open.spotify.com/episode/0BVfmpX74XGdRQrRSRYQwA?si=yQIvURhyQc-bvxkt6c18Ig&dl\\_branch=1](https://open.spotify.com/episode/0BVfmpX74XGdRQrRSRYQwA?si=yQIvURhyQc-bvxkt6c18Ig&dl_branch=1)\n\nYou can skip roughly the first 20 minutes if you want to get right to the case, but they're very likeable.",
            "title_similarity": "0.64989823",
            "sentiment_compound": 0.7099
        },
        {
            "id": "h6nhnad",
            "score": 54,
            "text": "Of all the crazy conspiracies of the past couple of years, this is the one that was actually true.",
            "title_similarity": "0.34325022",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h6n77wn",
            "score": 83,
            "text": "[removed]",
            "title_similarity": "0.28078952"
        },
        {
            "id": "h6nghgj",
            "score": 123,
            "text": "She is likely way worse off than we know, but why is Kanye allowed to be insane and not her? Let her have her life.",
            "title_similarity": "0.54864615",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h6n9dzz",
            "score": 415,
            "text": "ffs let britney be in charge of her life again. fucking nuts that the mypillow guy is free on his own making up batshit insane conspiracies on tv and she can't even have coffee.",
            "title_similarity": "0.604661",
            "sentiment_compound": -0.6997
        },
        {
            "id": "h6nby2j",
            "score": 138,
            "text": "“Attorney files to remove functionally independent adult from abusive money hungry slave owner“ 👏🏻 \n\n**FTFY**",
            "title_similarity": "0.6544497",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h6moftt",
            "score": 1015,
            "text": "For those if us in the dark, why exactly is she in a conservatorship to begin with. (I was a child when all this happened, also tend to live under a rock) -Thanks!",
            "title_similarity": "0.45543057",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h6nny9h",
            "score": 138,
            "text": "This whole thing with Britney has caused me to view her in such a different way. I was never a huge fan, but I grew up listening to her singles come out, I was of the age that I saw her rise to fame and become a teen idol and sex icon. I remember her marriage with K-Fed and when she shaved her hair.\n\nI never thought twice about it.\n\nBut with all this history coming out and how she’s been so trapped in a sense; used as nothing more than a money making machine by people with dollar signs in their eyes (which unfortunately her own father is the main perpetrator) instead of a human being.\n\nComparisons to Michael Jackson can be drawn.",
            "title_similarity": "0.6091858",
            "sentiment_compound": -0.9111
        },
        {
            "id": "h6n3pjo",
            "score": 704,
            "text": "This is actually a really smart strategy if the ultimate goal is to end the arrangement altogether. Jamie has a significant financial incentive for the arrangement to continue - he's drawing monthly payments that appear to be his entire source of income. The more Britney can replace him and the other individual conservators with professionals, the easier it may ultimately be for her to get the whole arrangement ended. \n\nThese professional firms do also have a financial incentive to stay in place, but it's dwarfed by their larger reputational concerns - if they get nailed for fighting to keep a bad conservatorship in place, it costs them other business. No matter how much they're collecting from Britney, it's not going to replace 10 or 100 other accounts they might lose if they're found to be acting in bad faith. A bad enough ruling might prevent them from being assigned to any other conservatorships altogether.\n\nI very much hope that after she's able to get herself out from under this thing, she hires a forensic accountant to go over everything beginning in 2008 - there's no way this is all clean.",
            "title_similarity": "0.51136225",
            "sentiment_compound": -0.8175
        },
        {
            "id": "h6n2k9b",
            "score": 4043,
            "text": "Wtf, isnt Britney like 40 years old, and a mother? \n\nWhat judge has allowed this farse to continue",
            "title_similarity": "0.63715935",
            "sentiment_compound": -0.7105
        },
        {
            "id": "h6n9v9u",
            "score": 277,
            "text": "I'm just waiting for her younger sister to be the big bad reveal",
            "title_similarity": "0.61825645",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h6nedre",
            "score": 208,
            "text": "\"She's so lucky, she's a star\n\nBut she cry, cry, cries in her lonely heart, thinking\n\nIf there's nothing, missing in my life\n\nThen why do these tears come at night?\"\n\n\n\n\n\nDamn, these lyrics hit real different to me now",
            "title_similarity": "0.38966435",
            "sentiment_compound": -0.8962
        },
        {
            "id": "h6nhsly",
            "score": 66,
            "text": "Shes no more mentally ill than me and im on disability but still FULLY in charge of my finances. This whole this is evidence of how poorly we think of people with mental health disabilities and why we HAVE to treat disabled folk better.",
            "title_similarity": "0.37629607",
            "sentiment_compound": 0.6966
        },
        {
            "id": "h6nmhnq",
            "score": 61,
            "text": "First we free Britney. \n\nThen we arm Britney. \n\nThen Britney frees us.",
            "title_similarity": "0.5370902",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h6nqto6",
            "score": 78,
            "text": "I'm still just astounded that Brittney Spears can basically be put into total slavery in broad daylight and there's so little anyone can do about it.",
            "title_similarity": "0.46923214",
            "sentiment_compound": -0.5095
        },
        {
            "id": "h6nieem",
            "score": 768,
            "text": "During a deep dive into Britney's situation, I stumbled across this documentary. It's very, very long..almost 3 hours. It's made up of clips of her interactions with the media/paparazzi from the very beginning. The only interviews are with Britney herself. It really gave me a sense of what her life was like back then and how batshit it really was, through really no fault of her own. It shows how fucked up the paparazzi was to her when she was going through it. And how relentless they were. It's all of it, in one video. \n\nhttps://vimeo.com/179358036",
            "title_similarity": "0.5636924",
            "sentiment_compound": 0.0334
        },
        {
            "id": "h6mtr68",
            "score": 9438,
            "text": "Amazing adequate legal counsel can change people's lives.",
            "title_similarity": "0.28336188",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h6nfyw3",
            "score": 6805,
            "text": "And her father has yet to explain why someone whose mental state is so severe, she can't handle making even the most basic decisions for herself, can somehow handle being forced into a grueling live performing schedule for years. \n\nShe's either unfit to take care of herself and should thus be allowed to retire to a less stressful life, or she's perfectly fit to handle the long hours and stress of performing live in front of huge audiences, in which case she doesn't need someone controlling every aspect of her life. There's just no universe where both of those things are true.",
            "title_similarity": "0.4933468",
            "sentiment_compound": 0.1597
        },
        {
            "id": "h6nj9me",
            "score": 3185,
            "text": "[deleted]",
            "title_similarity": "0.30363506"
        },
        {
            "id": "h6ncv6m",
            "score": 96,
            "text": "So in the best case that she wins her freedom, does any repercussions come to her father other than losing out on future income? Does he get to walk away with the millions of dollars he has paid himself out of her earnings?",
            "title_similarity": "0.5371685",
            "sentiment_compound": 0.9027
        },
        {
            "id": "h6nd4ny",
            "score": 1,
            "text": "Why was Jamie Spears allowed? Not like she made good decisions.",
            "title_similarity": "0.5058478",
            "sentiment_compound": 0.1999
        },
        {
            "id": "h6ndy53",
            "score": 287,
            "text": "So, something I've been wondering about is does her conservator have the ability to sign contracts for her to do performances that she is then legally obligated to do?",
            "title_similarity": "0.47668627",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6ney0a",
            "score": 1,
            "text": "Depending on how upset Jamie is at this will tell just how much she cares about her sister. What a sad situation.",
            "title_similarity": "0.48048443",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h6nez0p",
            "score": 1,
            "text": "How has Jamie Spears not made his money yet. It’s been like 10+ years. Take your pros and leave",
            "title_similarity": "0.50079346",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h6nffd2",
            "score": 1,
            "text": "How is any of this legal in the first place?",
            "title_similarity": "0.21555223",
            "sentiment_compound": 0.1593
        },
        {
            "id": "h6nfjpo",
            "score": 2,
            "text": "This is a good thing. That dude was definitely milking the golden calf.",
            "title_similarity": "0.19277151",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h6nfywf",
            "score": 2,
            "text": "I hope this case causes change for others under abusive conservatorships.",
            "title_similarity": "0.43795073",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h6ngvv2",
            "score": 1,
            "text": "Why the fuck was she a conservator anyway?",
            "title_similarity": "0.4429865",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h6nh2se",
            "score": 1,
            "text": "https://threadreaderapp.com/thread/1419653002818990085.html",
            "title_similarity": "0.2962592",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nhaus",
            "score": 19,
            "text": "Finally. Someone capable and is actually doing their job for their client. An investigation must be enacted upon her previous counsel. Something's very fishy about that whole situation.",
            "title_similarity": "0.45336336",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h6nhhw5",
            "score": 2,
            "text": "Why doesn’t she petition to have the conservatorship removed rather than having a change in conservator?",
            "title_similarity": "0.64710426",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6niiy4",
            "score": 6,
            "text": "Dad will continue to fight until every last penny is gone.",
            "title_similarity": "0.37724036",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h6nis70",
            "score": 1,
            "text": "Has a shrink signed off on her yet?\n\nAll the outrage online but I've not yet heard she is actually stable again.\n\nIf she is.. more power to her... but...  is she?",
            "title_similarity": "0.58635205",
            "sentiment_compound": 0.2523
        },
        {
            "id": "h6niwx8",
            "score": 2,
            "text": "What are these folks carrying the signs for? It’s not as if they can actually affect the outcome of the court case bu doing that.",
            "title_similarity": "0.26663744",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nj365",
            "score": 1,
            "text": "While reading through the replies I just kept wondering, how on earth are those conservatorships enforced in the USA? Does she have to wear a hat that says \"please call Jamie Spears if I appear to make a decision\"? How do they actually prevent her from going to the doctor and having her IUD taken out, or getting a coffee?",
            "title_similarity": "0.67128444",
            "sentiment_compound": 0.4479
        },
        {
            "id": "h6nj4on",
            "score": 3,
            "text": "Why is Britney’s father not allowing her to do anything without his permission, when all she did was lock herself in a room with her son and shave her head?",
            "title_similarity": "0.61043584",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6njnrs",
            "score": 15,
            "text": "Previous lawyer was making bank. He was probably in on keeping her in the conservatorship.",
            "title_similarity": "0.43320706",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6njy2w",
            "score": 5,
            "text": "This headline is confusing because I thought they were talking about her sister.",
            "title_similarity": "0.5034318",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h6nkaqb",
            "score": 20,
            "text": "Puts a whole new meaning to her song \"work bitch\"",
            "title_similarity": "0.50119555",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h6nkfib",
            "score": 3,
            "text": "Bless whoever her new attorney is!",
            "title_similarity": "0.42997056",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h6nl5tw",
            "score": 3,
            "text": "I think legal systems would be much more valid and interesting if people who wilfully and intentionally pretend they are allowed to violate a human's rights just get... legally bludgeoned, no questions asked, no discrimination, no hesitation.\n\nA man apparently keeps bald face hornet's as pets and shares videos on social media. Living ADT security system. Like that- you intentionally and wilfully violate a human's rights... *run.*",
            "title_similarity": "0.49889424",
            "sentiment_compound": 0.3539
        },
        {
            "id": "h6nlehk",
            "score": 3,
            "text": "Her personal problem has become a big national PR campaign. Lol",
            "title_similarity": "0.49656445",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h6nlmxs",
            "score": 3,
            "text": "Lmao she hired a former federal prosecutor. This dude  is done.",
            "title_similarity": "0.5173062",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h6nlr65",
            "score": 3,
            "text": "When Britney gets out of this conservatorship and decides to do a FREEDOM tour… well, let’s just say that her fans are going to support her more than ever through her music and products, knowing she will financially reap the benefits that are rightly hers.  Shit is going to be insane!  She is such a kind hearted person and I am rooting for her",
            "title_similarity": "0.4815665",
            "sentiment_compound": 0.8666
        },
        {
            "id": "h6nmhq2",
            "score": 1,
            "text": "I feel like I've read this same title almost every day for the last year",
            "title_similarity": "0.19616547",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6nnnco",
            "score": 1,
            "text": "What is the best case scenario here? Can the conservatorship be terminated, then Britney has her own attorney and her own new security detail, and she can do whatever she wants?",
            "title_similarity": "0.7102843",
            "sentiment_compound": 0.7882
        },
        {
            "id": "h6not7o",
            "score": 2,
            "text": "This seems like it's taking forever.",
            "title_similarity": "0.21195251",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6npsy3",
            "score": 3,
            "text": "Here's the leaked audio of her testimony from the conservatorship hearing: https://www.youtube.com/watch?v=iVrhKBhMrEI",
            "title_similarity": "0.54274875",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h6nquiz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2807895"
        },
        {
            "id": "h6nscw9",
            "score": 4,
            "text": "It is fucking nuts how this has been allowed to happen to her, yet Ozzy Osbourne can be as crazy as he has been with repercussions not nearly as severe as Britney's.",
            "title_similarity": "0.4602728",
            "sentiment_compound": -0.4232
        },
        {
            "id": "h6nsish",
            "score": 1,
            "text": "I thought they were talking about her sister at first lol",
            "title_similarity": "0.4776988",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h6nu699",
            "score": 2,
            "text": "He probably wouldn’t be her new attorney if he didn’t do exactly this.",
            "title_similarity": "0.39519835",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nuhrj",
            "score": 3,
            "text": "He wasn’t kidding when he said he was going to move aggressively",
            "title_similarity": "0.15745768",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h6nv0ct",
            "score": 3,
            "text": "American society is broken. And it's pathetic that the 99% of rable don't revolt. At the very least, medical Care is covered by the government in most countries. In the United States these people should all be shot and skinned as the scum of the country and enemies of the state",
            "title_similarity": "0.6021413",
            "sentiment_compound": -0.577
        },
        {
            "id": "h6nv6c4",
            "score": 1,
            "text": "Like the previous attorney hasn’t thought of this?",
            "title_similarity": "0.3375754",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6nw1n9",
            "score": 1,
            "text": "Anyone else getting serious Yolanda vibes from this Jamie guy?\n\n**Bonus Question**: Anyone thinking we have a Coogan situation on our hands?",
            "title_similarity": "0.5096322",
            "sentiment_compound": 0.5514
        },
        {
            "id": "h6nwa9v",
            "score": 3,
            "text": "That fact that he hasn’t just stepped down makes me believe he’s that much more of an asshole.",
            "title_similarity": "0.29767764",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6nxkl6",
            "score": 6,
            "text": "I don't understand how this is possible in America.  Isn't fucking Freedom our shit?",
            "title_similarity": "0.4021381",
            "sentiment_compound": -0.8151
        },
        {
            "id": "h6nzuyj",
            "score": 3,
            "text": "Does anybody know how much her dad is worth? Considering all his money comes from Britney, I would be interested to know where his standing is but I'm not good with numbers.",
            "title_similarity": "0.59097975",
            "sentiment_compound": -0.2045
        },
        {
            "id": "h6nzxqz",
            "score": 2,
            "text": "Good! Shes needed a lawyer that's actually on her side for years",
            "title_similarity": "0.36938655",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h6o070s",
            "score": 3,
            "text": "I find this whole thing fascinating, there's definitely going to be some mini series/ TV movie about it.   It's so weird to read the former Disney star being confined by her own blood relatives who doubt her mental health and well being.   The very meaning of a \"dysfunctional\" family.",
            "title_similarity": "0.6034415",
            "sentiment_compound": 0.5512
        },
        {
            "id": "h6o09o4",
            "score": 12,
            "text": "I feel bad for the LEAVE BRITNET ALONE dude. He was right",
            "title_similarity": "0.27374098",
            "sentiment_compound": -0.8001
        },
        {
            "id": "h6o0ce5",
            "score": 4,
            "text": "can she request a new judge to preside over the case?",
            "title_similarity": "0.559228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6o0z1c",
            "score": 8,
            "text": "This thing is so disturbing. Unless we aren't being told something about her real mental health. In some instances people need a guardian like if they are a vegetable or suffering a psychotic break but she's an adult. If she wants to make good or bad decisions with her money let her fucking do it.",
            "title_similarity": "0.501985",
            "sentiment_compound": -0.5887
        },
        {
            "id": "h6o12cq",
            "score": 3,
            "text": "I hope Britney comes out ok 5 years from now. I have suspicion that this may be the classic example of celebrity infatuation, and no one real will be there for her on 2 years when all this is done and she’s on her own. I just pray she has real people in her life that she can trust.",
            "title_similarity": "0.6427839",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h6o23fd",
            "score": 9,
            "text": "Good on you Britney, the meme from years ago is looking less comical and more predictive by the second.\n\nWhy should she be subject to a conservatorship *her little sister* has more say in that she does? This is fucked up.\n\nThey’re all so used to sucking on the teat that Britney’s wealth provides, they can’t stand to see that end.\n\nGet a real job and stock being parasites you…parasites.",
            "title_similarity": "0.6319468",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h6o25hq",
            "score": 6,
            "text": "It still makes me so sad to think that she suffered through this for so many years alone because she thought people wouldn’t like or believe her. \n\nI’m sure she was gaslit from the moment she entered the realm of the uber famous",
            "title_similarity": "0.5154174",
            "sentiment_compound": -0.6863
        },
        {
            "id": "h6o2iyk",
            "score": 3,
            "text": "In reality, a change in conservator shouldn’t make significant difference. Right?",
            "title_similarity": "0.3385651",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h6o3a8n",
            "score": 2,
            "text": "You GO BRITTANY! With you100%👍",
            "title_similarity": "0.34979677",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6o4i3a",
            "score": 5,
            "text": "Hope this makes ppl see how bad the system is.\nShe suffers yet they ignore her statements.\n\nIt's basically legalized slavery in a way....yes you are free but you aren't in control of your life.",
            "title_similarity": "0.4952532",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h6o5kev",
            "score": 3,
            "text": "I am so glad she got the new attorney, he is years better than anything she had before.",
            "title_similarity": "0.28115618",
            "sentiment_compound": 0.7761
        },
        {
            "id": "h6o6mab",
            "score": 5,
            "text": "Jamie Lynn and that father need a long stroll off a short pier\n\nAlso,  I googled what her net worth is and I get 50 or 60 million....shouldn't it be a LOT more than that????",
            "title_similarity": "0.39980996",
            "sentiment_compound": 0.4329
        },
        {
            "id": "h6o767o",
            "score": 4,
            "text": "None of her family members should have their dirty paws on her money. Her dad and sister are the worst.",
            "title_similarity": "0.5071005",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h6ofav3",
            "score": 3,
            "text": "Yeah he is exploiting his daughter big time.",
            "title_similarity": "0.38677916",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h6ofew4",
            "score": 3,
            "text": "As soon as she has a right to, she should sue her entire family.",
            "title_similarity": "0.5896197",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ofitp",
            "score": 2,
            "text": "How traumatic for Brittany",
            "title_similarity": "0.37469295",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h6og9fa",
            "score": 4,
            "text": "How is her net worth only $60 million???  She was the biggest pop star in the world for a decade.  Comparably, Taylor Swift and Justin Bieber are worth 300-400 million each.  Britney was at the same level of fame, chart success, and touring revenue.",
            "title_similarity": "0.42801932",
            "sentiment_compound": 0.8943
        },
        {
            "id": "h6oingn",
            "score": 5,
            "text": "Let's assume the dad is right and Britney is still disturbed and still needs a curator.\n\nEven then, it should be blatantly obvious to anyone involved that the curator can't be the dad anymore.\n\nIt needs to be someone professional, uninvolved and neutral.",
            "title_similarity": "0.53857553",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h6okn5l",
            "score": 3,
            "text": "JFC this whole debacle is like a badly written horror story - so crazy to be unbelievable. \n\nWhen they make the movie it’s going to be a real shocker.",
            "title_similarity": "0.54158133",
            "sentiment_compound": -0.8029
        },
        {
            "id": "h6olcjs",
            "score": 1,
            "text": "I hope she wins. Everyone deserves freedom",
            "title_similarity": "0.23095202",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h6ompsm",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.28078952"
        },
        {
            "id": "h6ooxw5",
            "score": 1,
            "text": "Why do they all look the same",
            "title_similarity": "0.0031211954",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ovch8",
            "score": 2,
            "text": "The Spears family is like one of the beggar clans that force their kids to beg in the streets with an accordion and puppy and then steal all their earnings.",
            "title_similarity": "0.4485427",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h6oyk35",
            "score": 3,
            "text": "With all the work Britney has done all the performances all the music releases, all the merchandising etc. how is it that her estate only has $60 million? Who has been skimming or actually stealing from her?",
            "title_similarity": "0.57164514",
            "sentiment_compound": -0.6199
        },
        {
            "id": "h6p2293",
            "score": 2,
            "text": "Given the apparent family dynamic it makes perfect sense to replace the father with an independent conservator.",
            "title_similarity": "0.38009584",
            "sentiment_compound": 0.743
        },
        {
            "id": "h6p3bd7",
            "score": 1,
            "text": "IMNAL but that seems like a good step 1",
            "title_similarity": "0.117838204",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h6p3fe6",
            "score": 3,
            "text": "Special \"fuck you\" to Perez Hilton",
            "title_similarity": "0.49565658",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h6p4ehn",
            "score": 2,
            "text": "is there any reason she needs a different conservator? couldn't she just end the whole thing? (Forgive me if this is a stupid question since I'm out of the loop)",
            "title_similarity": "0.5941211",
            "sentiment_compound": -0.3939
        },
        {
            "id": "h6p6gmy",
            "score": 6,
            "text": "The judge should be held accountable along with her father and both should be imprisoned for conspiracy, fraud and torture.",
            "title_similarity": "0.5296901",
            "sentiment_compound": -0.9337
        },
        {
            "id": "h6p88fs",
            "score": 5,
            "text": "After that work on sending the father to jail forever, he deserves it.",
            "title_similarity": "0.3344847",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6pbfqr",
            "score": 5,
            "text": "I've never cared much for Brittney's music or her scene, but what they are putting her through is appalling. Modern day slavery is real and court sanctioned. Free Brittney.",
            "title_similarity": "0.50266504",
            "sentiment_compound": -0.8001
        },
        {
            "id": "h6pdglj",
            "score": 3,
            "text": "Fucking dragggggg him. Sometimes it hurts seeing recent pics of Britney cuz you can see on her face how much of a toll this has taken 😕 at least she looks more hopeful now that she got to choose her own legal team. Dumb af that she wasn't able to do that in the first place considering she's in a court battle to defend only herself but ok USA stay winning",
            "title_similarity": "0.6050848",
            "sentiment_compound": 0.6482
        },
        {
            "id": "h6pe4wy",
            "score": 1,
            "text": "Even tho I don’t think this is possible, it’s gonna take a lot of work on the courts part to follow thru.",
            "title_similarity": "0.35753405",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6peagt",
            "score": 2,
            "text": "I just can’t believe how awful her family is. We all know from what we have been hearing that Jaime is god awful, but her mom? Did she just give up? Jaime Lynn sounds like an uneducated brat on payroll and what about her brother? They just suck.",
            "title_similarity": "0.56088907",
            "sentiment_compound": -0.5559
        },
        {
            "id": "h6peehv",
            "score": 3,
            "text": "How this is remotely legal, moral or ethical is beyond me.\n\nPlenty of people are allowed to run their own lives while doing incredibly stupid things.  Brittany may not be the smartest cookie (I don’t know, her entire personage has been hidden from the public so it’s impossible to truly have an opinion on it), but it’s her career, her money, her life, her body and her choice what to do with it.\n\nHer father belongs in prison, for life.  So does the attorney he hired on her dime, and that attorney should be made to pay her back every penny he charged since he wasn’t representing Brittany in any honest way.",
            "title_similarity": "0.52637076",
            "sentiment_compound": -0.4416
        },
        {
            "id": "h6pgb2f",
            "score": 3,
            "text": "Meanwhile Kanye is wearing pantyhose on his head and decided he's gonna live in a stadium in Georgia",
            "title_similarity": "0.3891679",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6pmdpd",
            "score": 3,
            "text": "Fuckin' A.  I'm no Britney fan but the level of bullshit here is insane.  She had an issue a decade ago.  She's cool now.  Enough already.  FREE BRITNEY!",
            "title_similarity": "0.59411794",
            "sentiment_compound": -0.4128
        },
        {
            "id": "h6pmxzw",
            "score": 4,
            "text": "Her previous lawyer needs to be disbarred. He used her as a piggy bank and never once acted in her best interest.",
            "title_similarity": "0.55315745",
            "sentiment_compound": 0.802
        },
        {
            "id": "h6pnnuu",
            "score": 2,
            "text": "Money is the root of all evil. Ofc he is greedy and wants her money.",
            "title_similarity": "0.3789215",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h6ponhv",
            "score": 2,
            "text": "The damage is already done, Britney lost most of his teenage years and adult life getting sucked by her father, and I cannot imagine how much money he has taken out of her.\n\nHopefully after all this mess the end result will be worth the years of suffering.",
            "title_similarity": "0.58369374",
            "sentiment_compound": -0.8713
        },
        {
            "id": "h6poupx",
            "score": 3,
            "text": "My God, this poor woman, my heart goes out to her. She has been used by so many for so long and somehow she has managed to hang in there. \nShe has incredible strength to have put up with this for so long, *especially* while dealing with mental health issues!!  \n\nHer father is a POS, as a parent this enrages me that another parent can be so abusive (mentally, emotionally, and financially) and the court is just fine with it… for *13 years*!  Honestly I think this judge needs to be changed out too.",
            "title_similarity": "0.48621866",
            "sentiment_compound": 0.3022
        },
        {
            "id": "h6prsyw",
            "score": 4,
            "text": "This whole case sounds like a movie. I just can't believe such a big star has been a slave for such a long time. This makes me wonder who else has been a slave of their family, manager, loved ones, friends, etc. This all sounds similar to that Miley Cyrus episode of Black Mirror, but still, I didn't think it would be this real. I feel so bad for Britney, and I think she's a shit artist. But at this point, I hope she gets out of this mess, and starts making some more music. I really hope so.",
            "title_similarity": "0.60252655",
            "sentiment_compound": -0.5514
        },
        {
            "id": "h6pwa08",
            "score": 1,
            "text": "I read “files” as “fails” and I thought “for fucks sake”",
            "title_similarity": "0.42084217",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6pyvqz",
            "score": 1,
            "text": "I was placed on a hold over a suicide joke repeatedly, and they have used raunchier jokes before. Someone does not like her.",
            "title_similarity": "0.4942925",
            "sentiment_compound": -0.5283
        },
        {
            "id": "h6pz8t9",
            "score": 1,
            "text": "Leave Britney alone. I'm serious!",
            "title_similarity": "0.45040852",
            "sentiment_compound": -0.4199
        },
        {
            "id": "h6pzncd",
            "score": 1,
            "text": "How long is this going to take to have completed?",
            "title_similarity": "0.17298332",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6q0a6a",
            "score": 2,
            "text": "The part I do not understand about this is... Did every one not already just become insanely wealthy. Like at what point in your acquiring of extreme wealth (in this case it would appear at the highly unfortunate expense of your own daughter) do you not just say OK - that's it. Like how do you decide to hold it and just keep going on with it? Is it to prove some legal point? I'm so confused. Power of one over the other? Can the courts reclaim all of the money back to Brittney?\n\nThis is a level of greed and power I cannot even begin to fathom... Probably why I'm not very successful with money ? Not sure.",
            "title_similarity": "0.55689657",
            "sentiment_compound": -0.7296
        },
        {
            "id": "h6q104f",
            "score": 1,
            "text": "Leave Britney alone meme",
            "title_similarity": "0.58947414",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6q6wax",
            "score": 1,
            "text": "Jamie Spears busy working on his resume. His free ride through life is coming to an end.",
            "title_similarity": "0.3887831",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h6qh7ek",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.28078952"
        },
        {
            "id": "h70jy58",
            "score": 1,
            "text": "I mean the legal people not Britney's supporters. I think it's disgusting she was subjected to this illegal bullshit for over a decade. I didn't word myself properly but I'm talking about her Dad and Sister. Fucking scum",
            "title_similarity": "0.6009316",
            "sentiment_compound": -0.7703
        },
        {
            "id": "h71dhx4",
            "score": 1,
            "text": "Her new attorney has been on for 2 weeks and has done way more than her old ridiculous court appointed attorney, who was pain up to $40k per week for 13 years only to be her father’s hypeboy.  \nThis Conservatorship is a crime imo!\nI can’t believe this has been going on for 13 years now and that she was allowed to handpick her own attorney only in July 2021. \nI hope freedom comes soon for her, she deserves it!",
            "title_similarity": "0.56855595",
            "sentiment_compound": -0.4184
        },
        {
            "id": "h7eras1",
            "score": 1,
            "text": "The fact he is fighting so hard to not give up conservatorship is confirmation that he is profiting from / exploiting it. \n  \nIf he was really just a loving parent he would have no issue passing the role onto a qualified professional.",
            "title_similarity": "0.3186382",
            "sentiment_compound": -0.1785
        }
    ]
}