{
    "Two travellers from U.S. fined $20,000 each for fake vaccination documents.\n": [
        {
            "id": "h753rts",
            "score": 2,
            "text": "I really do hope they make vaccine passports a requirement.\n\nDon't bother replying to my comment, I won't read it.",
            "title_similarity": "0.30034494",
            "sentiment_compound": 0.6386
        },
        {
            "id": "h74xc1x",
            "score": -7,
            "text": "They should absolutely be in prison these people are the reason the entire global economy is still still at a stand still.",
            "title_similarity": "0.305821",
            "sentiment_compound": -0.552
        },
        {
            "id": "h75c99t",
            "score": -2,
            "text": "Let me guess. Voted for trump?",
            "title_similarity": "0.19142805",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7485yd",
            "score": 34,
            "text": "Considering how much damage they could have done to your country, how many people they could have killed and especially considering the lengths they went to conceal their non-vaccinated status I would throw these ass clowns in a deep hole and throw away the key. 20yrs in prison should teach them a lesson and prevent other ass clowns from trying the same. How many have to die before we take this seriously?",
            "title_similarity": "0.6390879",
            "sentiment_compound": -0.9741
        },
        {
            "id": "h74xx3i",
            "score": 6,
            "text": "Let me guess...Conservatives?",
            "title_similarity": "0.09663399",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74z9zz",
            "score": 4,
            "text": "Ewww. Get the fuck out of our country.",
            "title_similarity": "0.20656675",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h749coc",
            "score": 28,
            "text": "\"The agency says violating quarantine or isolation instructions when entering Canada could lead to a $5,000 fine for each day of non-compliance or each offence, or more serious penalties including six months in prison or $750,000 in fines.\"\n\nBro, slap them with the $750,000 and make a big example of them.",
            "title_similarity": "0.7753658",
            "sentiment_compound": -0.8718
        },
        {
            "id": "h75cqwb",
            "score": -3,
            "text": "FINED?!? Fucking christ.\n\nEDIT: just to be clear they should be imprisoned.",
            "title_similarity": "0.42654154",
            "sentiment_compound": -0.2621
        },
        {
            "id": "h74713u",
            "score": 43,
            "text": "Fuckin morons, bet they regret not getting a FREE and Safe vaccination now.",
            "title_similarity": "0.4685949",
            "sentiment_compound": -0.6944
        },
        {
            "id": "h74vbmw",
            "score": -6,
            "text": "A fine?  I’d really much rather see them in prison for a couple years at least. Consider this, if they’re spoiled-brat rich kids, this fine means absolutely nothing to them. But if the husband is an auto mechanic and the wife a housewife, this likely means their teenage children now can’t go to college. If they go to prison for a while, the teenagers now have to live with a relative which is probably a good thing.",
            "title_similarity": "0.5653641",
            "sentiment_compound": 0.09
        },
        {
            "id": "h755wys",
            "score": 0,
            "text": "Let me guess they were European Americans ?",
            "title_similarity": "0.13618697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74ooi8",
            "score": -42,
            "text": "While I'm personally a big fan of the idea of anti-vaxxers getting what they deserve, I can't help but think this sets a bad precedent.\n\nThe vaccination card I received when I got vaccinated was NOT a secure legal document by any reasonable means. It was literally just a postcard with some stuff printed on it. There's no watermark or seal or anything to prove it is valid.\n\nWhen they handed me my card with the vaccine id pre-printed on it. It didn't even have my name or a signature on it! They told me, \"Just write your own name on there if you want\".\n\nAnd NOW they want to treat these as actual legal documents?\n\nSide note: Another thing they told me was, \"make sure you take a picture of that in case you lose it\", which is utterly nonsensical. When has that ever been a way to provide proof of a legal document? Imagine if I could just show the police a picture of my driver's license and that was treated as acceptable.",
            "title_similarity": "0.52221674",
            "sentiment_compound": -0.457
        },
        {
            "id": "h74v196",
            "score": -34,
            "text": "Papers, Please is just getting *MORE* depressing.\n\nEDIT: ITT: non-gamers.",
            "title_similarity": "0.33550617",
            "sentiment_compound": -0.3239
        },
        {
            "id": "h74wo9x",
            "score": 4,
            "text": "Issuing fake vax cards is against the law and providing fake Federally issues documents (proof of vax) is also a federal offense……..OOOOooor, you just get a vaccine and move about your business.",
            "title_similarity": "0.5560775",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h74ea57",
            "score": 43,
            "text": "Good. Fuck them. The US has all the tools to end the pandemic but nothing to do about selfish idiots.",
            "title_similarity": "0.3904453",
            "sentiment_compound": -0.6652
        },
        {
            "id": "h755a5l",
            "score": 3,
            "text": "If the penalty for a crime is a fine, then that law only exists for the lower class.",
            "title_similarity": "0.46147493",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h75ayo6",
            "score": 0,
            "text": "Good on them for doing what I wish we could should do hers at all levels. Then everyone's freedoms are restored. If only we were not so divided on purely evidence less political mumbo jumbo. Pass a low and enforce it. period.",
            "title_similarity": "0.22982307",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h75ccwr",
            "score": -19,
            "text": "Ahhh yes. The celebration of Canadas government for Americans getting fined for illegally entering another country without valid vaccination cards. And yet, the same Reddit will crucify the American government for simply requiring people enter the country on the southern border legally. I’ll grab my popcorn.",
            "title_similarity": "0.6196947",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h74unyh",
            "score": 1,
            "text": "Build that wall, build that wall",
            "title_similarity": "0.010975548",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75py8z",
            "score": 1,
            "text": "As an American I can say how much I fucking hate Americans.",
            "title_similarity": "0.43642008",
            "sentiment_compound": -0.6115
        },
        {
            "id": "h76pfmp",
            "score": 0,
            "text": "Keep these god damn Americans out please",
            "title_similarity": "0.20450296",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h758puu",
            "score": 19,
            "text": "Two **illegal immigrants** from the U.S. fined $20,000 each for fake vaccination documents.\n\nFIFY",
            "title_similarity": "0.97381306",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h751mx1",
            "score": -4,
            "text": "So if you're rich theres basically no penalty for this\n\nNiiiiiiiiiiice",
            "title_similarity": "0.17311166",
            "sentiment_compound": 0.7464
        },
        {
            "id": "h74vazc",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.0727368"
        },
        {
            "id": "h74zg0r",
            "score": -5,
            "text": "I would wager they were from Arkansas if I thought people from Arkansas ever left Arkansas.",
            "title_similarity": "0.30940348",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74w4lb",
            "score": 2,
            "text": "So faking vax papers is a $20,000 fine. That means it's a law that only really applies to people who are not wealthy.",
            "title_similarity": "0.8699622",
            "sentiment_compound": -0.5272
        },
        {
            "id": "h74ybag",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.07273681"
        },
        {
            "id": "h75arf1",
            "score": 5,
            "text": "I'm vaccinated, so don't get me wrong here, but if I got a $20,000 fine in Canada what I really got is a reason to never go to Canada again. I'm pretty sure they won't extradite you for a fine.",
            "title_similarity": "0.6539737",
            "sentiment_compound": 0.9086
        },
        {
            "id": "h75e40a",
            "score": -18,
            "text": "Ohhh noooo, not fake vaccination documents!!!!! Awwwwwwwww how dare they!!!",
            "title_similarity": "0.23611285",
            "sentiment_compound": 0.575
        },
        {
            "id": "h76dlbb",
            "score": 0,
            "text": "“This is unconstitutional”",
            "title_similarity": "0.13911845",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74onlc",
            "score": 58,
            "text": "Seriously fuck off with this shit America.",
            "title_similarity": "0.2737406",
            "sentiment_compound": -0.8573
        },
        {
            "id": "h74b8zn",
            "score": 21,
            "text": "I can't even imagine paying $20K to avoid doing the right (and free!!!) thing.  Like usually people avoid doing the right thing because it's difficult, feel like getting forged vaccine documents and $20K in fines and kicked out of Canada is way more difficult than taking the two lunch breaks at work to get a shot.  \n\nI dunno, maybe I'm wrong here.",
            "title_similarity": "0.7047086",
            "sentiment_compound": -0.6563
        },
        {
            "id": "h74ty13",
            "score": 4,
            "text": "Is this not propf Americans don’t really deserve to come to Canada?\n\nEspecially since they won’t let us in?",
            "title_similarity": "0.30103284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75yhk8",
            "score": 1,
            "text": "Everyone in the comments doesn’t realize these are Canadians not Americans , idiot.",
            "title_similarity": "0.3065543",
            "sentiment_compound": 0.4023
        },
        {
            "id": "h767p75",
            "score": -1,
            "text": "20,000$ is nearly cheaper than a manditory two-week stay at one of Trudeaus friend's hotel.",
            "title_similarity": "0.63281476",
            "sentiment_compound": 0.0
        },
        {
            "id": "h769udf",
            "score": -1,
            "text": "Don’t even have a vax card. Just a sheet of paper that looks like a joke",
            "title_similarity": "0.28934255",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h76xa4o",
            "score": 1,
            "text": "When ~~Mexico~~ The US sends its people, they're not sending their best. They're not sending you. They're not sending you. They're sending people that have lots of problems, and they're bringing those problems with us. They're bringing drugs. They're bringing crime. They're rapists. And some, I assume, are good people.",
            "title_similarity": "0.54766273",
            "sentiment_compound": -0.9283
        },
        {
            "id": "h76zbhi",
            "score": 1,
            "text": "Why not imprison them, and forcibly vaccinate them while in custody just so they don't spread it on the inside?",
            "title_similarity": "0.42097348",
            "sentiment_compound": 0.0
        },
        {
            "id": "h77ayn8",
            "score": 1,
            "text": "I’m glad these people are getting fined.  People don’t need to bring their entitled attitudes to Canada or any other Foreign country. Canada should probably build a wall and make the U.S. pay for it!",
            "title_similarity": "0.39535856",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h77b7x1",
            "score": 1,
            "text": "Imagine paying $20k to not get a shot and lie about it instead of getting the shot for free",
            "title_similarity": "0.719035",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h77wyp6",
            "score": -1,
            "text": "Ah yes, another thread where Canadians get to act like their country isnt an irrelevant tundra with the economy of a big city in Alabama. Canada, just be glad South Park made an episode about how utterly insignificant you are and stop acting like anyone cares about you. Just because TWO whole rednecks tried to sneak into your country, doesnt mean anything. More canadians try to sneak in than that on an hourly basis",
            "title_similarity": "0.43436617",
            "sentiment_compound": 0.8319
        },
        {
            "id": "h74ex1g",
            "score": 6,
            "text": "Does anybody know how they know they are fake documents? My vaccine card is real but it looks like it would be very easy to forge.",
            "title_similarity": "0.35417864",
            "sentiment_compound": 0.7572
        },
        {
            "id": "h75ejmv",
            "score": -6,
            "text": "Well that’s one way to prove there is a database of every person whose been vaccinated that is openly shared amongst countries.",
            "title_similarity": "0.29923612",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h7522ot",
            "score": 22,
            "text": "Americans are the dumbest fucking people on earth.\n\nGet vaccination free.....Fake vaccination $20, 000.",
            "title_similarity": "0.78587687",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h74r28g",
            "score": -40,
            "text": "[removed]",
            "title_similarity": "0.019520625"
        },
        {
            "id": "h74ptj9",
            "score": 16,
            "text": "Good! Zero tolerance for these dipshits. I am thoroughly sick and tired of the whiny anti mask, personal choice folks. They are guilty of prolonging this pandemic and killing thousands of people that did not have to die.",
            "title_similarity": "0.61417073",
            "sentiment_compound": -0.852
        },
        {
            "id": "h74dqyt",
            "score": 13,
            "text": "How stupid are these people, like forging a passport driver's license birth certificate.\n\nJail time.  These are Karen's on the road again",
            "title_similarity": "0.6187166",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h74qp6d",
            "score": 17,
            "text": "[deleted]",
            "title_similarity": "0.07273681"
        },
        {
            "id": "h758j14",
            "score": 6,
            "text": "I’ve been separated from my boyfriend since the start of covid (he’s in Canada, I’m in NC.) i finally have plans to see him in early September. I have social anxiety and am definitely nervous as hell about going across the border. I am fully vaccinated and will do whatever it takes. Can’t imagine the dumb ass mindset of people brazen enough to try and pass off fake vaxx cards.",
            "title_similarity": "0.5556956",
            "sentiment_compound": -0.9393
        },
        {
            "id": "h75rfna",
            "score": 4,
            "text": "They should also force vaccinate people that dothis and make them stay in detention while they wait for the second shot if they don't have the Johnson and Johnson shot available.",
            "title_similarity": "0.44718534",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h74bfxm",
            "score": 35,
            "text": "When the vaccine is free, you would risk being fine $20,000 just not to get it?  Sad. Dumb.",
            "title_similarity": "0.75891364",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h746wlu",
            "score": 139,
            "text": "Wow that's a life-ruining fine. Outstanding.\n\nITT: people who don't understand that most Americans live paycheck to paycheck and 20k is equal to or greater than a huge number of American's yearly income",
            "title_similarity": "0.7059833",
            "sentiment_compound": 0.9287
        },
        {
            "id": "h74cefm",
            "score": 82,
            "text": "Queue the Fox News interview: \"Freedom loving Americans oppressed and persecuted by New World Order big pharma Bill Gates vaccine agenda.  Oh, and Hillary's emails.\"\n\nThen they'll do a GoFundMe and raise $500k from trailer parks all over Red America.",
            "title_similarity": "0.6916162",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h75ji0s",
            "score": -11,
            "text": "Slippery slope we are all on… next comes the vaccine tattoo",
            "title_similarity": "0.35867304",
            "sentiment_compound": 0.0
        },
        {
            "id": "h753dbm",
            "score": 8,
            "text": "It costs $0.00 to get vaccinated. It's safe, effective, and free.\n\nAlso, did I mention it costs $0.00?",
            "title_similarity": "0.4285897",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h75pzex",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.01952069"
        },
        {
            "id": "h76biw2",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.0727368"
        },
        {
            "id": "h75d336",
            "score": 2,
            "text": "Who the hell takes takes that kind of risk to travel to Canada of all places?",
            "title_similarity": "0.3424499",
            "sentiment_compound": -0.7902
        },
        {
            "id": "h75f48o",
            "score": -1,
            "text": "Wow how did this repost of a shit article get so many awards and upvotes? This is amazing.",
            "title_similarity": "0.41063368",
            "sentiment_compound": 0.8062
        },
        {
            "id": "h75q08u",
            "score": 1,
            "text": "Good. Fine the fuck out of anyone caught doing this. Fine them into the ground. This behavior is sick, there needs to be no wiggle room for people to think that it's worth the risk.",
            "title_similarity": "0.36655366",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h75zfsu",
            "score": -2,
            "text": "Moar please, we are dying to hear more ignorant mouth spit.",
            "title_similarity": "0.23679078",
            "sentiment_compound": -0.024
        },
        {
            "id": "h769fsq",
            "score": 2,
            "text": "Only $20k? For putting millions of lives at risk? Ban them from returning and send them to jail!",
            "title_similarity": "0.812003",
            "sentiment_compound": -0.747
        },
        {
            "id": "h76vkhh",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.01952069"
        },
        {
            "id": "h7776rg",
            "score": 1,
            "text": "Good, let this be a lesson.",
            "title_similarity": "-0.15224637",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h77hcea",
            "score": -3,
            "text": "Meanwhile in the US we just release illegals right into the community.",
            "title_similarity": "0.39963225",
            "sentiment_compound": 0.0
        },
        {
            "id": "h746oh6",
            "score": 22,
            "text": "Welp, time to close the border.",
            "title_similarity": "0.15394181",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75c9sf",
            "score": -9,
            "text": "Welcome to the new world order!",
            "title_similarity": "-0.026339069",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h74lh7y",
            "score": 530,
            "text": "Called it. Americans: hate people with illegal paperwork. Love having illegal paperwork",
            "title_similarity": "0.4156771",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h74hlqf",
            "score": -63,
            "text": "[removed]",
            "title_similarity": "0.019520625"
        },
        {
            "id": "h74p4rl",
            "score": 5,
            "text": "If the penalty for a crime is a fine, then the law only exists if you are poor.",
            "title_similarity": "0.45636255",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h74f9va",
            "score": 11,
            "text": "Can you stick them in jail for a while? Please? We don't need them back anytime soon.",
            "title_similarity": "0.1946691",
            "sentiment_compound": 0.3939
        },
        {
            "id": "h74izqy",
            "score": 3,
            "text": "That should be prison time as well",
            "title_similarity": "0.17075868",
            "sentiment_compound": -0.296
        },
        {
            "id": "h74wmay",
            "score": 2,
            "text": "We need to see more of this. Hold these assholes accountable.",
            "title_similarity": "0.16743784",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h74xyxd",
            "score": 5,
            "text": "Canada should keep them for a while and make them do community service. Have them gown up clean/sanitize COVID ICU rooms after the patients die. Or have them work at an EMS station and clean/sanitize ambulances. :)",
            "title_similarity": "0.28532058",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h75gg3f",
            "score": 3,
            "text": "Good! If you don’t want the FREE vaccine, that’s your problem. But you also have to deal with the consequences, ie, no vaccine card and no travel to places that require it.",
            "title_similarity": "0.36217275",
            "sentiment_compound": -0.4811
        },
        {
            "id": "h75n8jx",
            "score": 2,
            "text": "Imagine complaining about voter id and celebrating vaccination documentation",
            "title_similarity": "0.41018248",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h75q8y8",
            "score": 4,
            "text": "This made me pretty giddy because we all know exactly the profile of these clowns. \nY’know them, they always sport flip flops or sandals, either a golf shirt or maga/USA tee depending on the venue and always rocking their finest khaki cargo shorts and a cap unless it’s church time \nRude to retail and food service employees and throughout the pandemic made scene or two about having to wear a mask",
            "title_similarity": "0.36628985",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h75task",
            "score": 3,
            "text": "Lol fucking Americans sneaking into our borders, idk why we even opened them up.",
            "title_similarity": "0.44577217",
            "sentiment_compound": 0.34
        },
        {
            "id": "h76djl0",
            "score": 3,
            "text": "IMO 20k for fake documents isn’t harsh enough. The fine should be one dollar per US COVID based death. Roughly over 600k for falsified documents and putting people at risk.",
            "title_similarity": "0.6977856",
            "sentiment_compound": -0.9153
        },
        {
            "id": "h75tntt",
            "score": -11,
            "text": "[deleted]",
            "title_similarity": "0.0727368"
        },
        {
            "id": "h748ilc",
            "score": -25,
            "text": "What I don't understand is why are they even handing out vaccination cards when your name is entered into your state's database when you get the vaccine.  Are these cards designed more for small businesses who don't have access to the database?  Even if that was the case you can get a digital health pass via iOS/Android.",
            "title_similarity": "0.49587494",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74d8lo",
            "score": 61,
            "text": "I think breaking quarantine or something like that is probably more a \"big fine\" type thing - if you're not sick.  If you're sick then it should be a HUGE fine plus civil liability to everyone you infect thing.  \n\nBut when you decide to forge documents i think Jail is the way to go.  And not for a couple of weeks or months.",
            "title_similarity": "0.6554023",
            "sentiment_compound": 0.4587
        },
        {
            "id": "h748fdx",
            "score": -53,
            "text": "[removed]",
            "title_similarity": "0.01952069"
        },
        {
            "id": "h74yzgt",
            "score": 6,
            "text": "Paying 20k instead of a free shot. Okay.... your choice I guess idiots",
            "title_similarity": "0.6295923",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h74zsyg",
            "score": 3,
            "text": "Fuck em. Could’ve just got the free shot but nooooo.",
            "title_similarity": "0.23351365",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h752k8i",
            "score": 0,
            "text": "No papers? Those them in the pit",
            "title_similarity": "0.18557258",
            "sentiment_compound": -0.296
        },
        {
            "id": "h756z82",
            "score": 2,
            "text": "Losers. Something they can get for free by doing their part instead they fake. Glad they got caught hope it happens to more of them",
            "title_similarity": "0.25420845",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h75h80r",
            "score": -4,
            "text": "The Toronto Star Left-Center is biased based on editorial positions that favor the left and High for factual reporting due to proper sourcing.",
            "title_similarity": "0.40886897",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h75m41z",
            "score": 3,
            "text": "trumptardz most likely",
            "title_similarity": "0.08437896",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75n7bf",
            "score": 0,
            "text": "Good. Making the rest of us look like fucking assholes.",
            "title_similarity": "0.2861646",
            "sentiment_compound": 0.079
        },
        {
            "id": "h75qsqx",
            "score": 4,
            "text": "Fined? They should be in jail for reckless endangerment.",
            "title_similarity": "0.48939678",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h75uz0i",
            "score": 0,
            "text": "Kekw... What could go wrong...",
            "title_similarity": "0.13108206",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h76emgy",
            "score": 0,
            "text": "How?\n\nWhat exactly are vaccination documents?  Is there a official template or are they all different?",
            "title_similarity": "0.29802638",
            "sentiment_compound": 0.0
        },
        {
            "id": "h779mwf",
            "score": 0,
            "text": "Good. It's not like we're in a pandemic or anything.",
            "title_similarity": "0.12553999",
            "sentiment_compound": 0.1999
        },
        {
            "id": "h77xwom",
            "score": 0,
            "text": "A woman called in to the CBC saying that a member of her family was already planning to travel to Canada on fake vaccine documents, and loosely implied she’d report them. I hope it was them.",
            "title_similarity": "0.430335",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h7fegav",
            "score": 0,
            "text": "For the one time fee of $100, I will tell you how to get a card free.",
            "title_similarity": "0.41889513",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h754l66",
            "score": 13,
            "text": "Canadian here.  Stay the fuck out, you dumb fucking petri dish unvaccinated assholes.",
            "title_similarity": "0.33456108",
            "sentiment_compound": -0.891
        },
        {
            "id": "h74osd8",
            "score": 16,
            "text": "Two idiots who got a well-deserved fine. I love it 😁👍🏾",
            "title_similarity": "0.21096203",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h74p6j5",
            "score": 14,
            "text": "Americans entering another country with fake papers.  I bet they have harsh thoughts about people who do that to get into the US",
            "title_similarity": "0.52485764",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h76mkla",
            "score": -10,
            "text": "I get that it’s fraud, and that they should be fined, but $20,000 is insanely egregious.",
            "title_similarity": "0.76451194",
            "sentiment_compound": -0.34
        },
        {
            "id": "h75b3s8",
            "score": -18,
            "text": "Good job Reddit. Let’s push an article that has zero credibility to scare those who aren’t vaccinated. Glad the propaganda machine is working.",
            "title_similarity": "0.42288622",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h74otyu",
            "score": 7,
            "text": "Lock them up too, these people are real scum. Imagine going through the trouble to get fake vaccination documents.",
            "title_similarity": "0.5720674",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h74wm5u",
            "score": 4,
            "text": "Good. Fuck them for trying to infect other countries. Eat shit",
            "title_similarity": "0.45067424",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h75058u",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.0727368"
        },
        {
            "id": "h75lnb2",
            "score": 5,
            "text": "Seriously, as a flight attendant,  I don't know what it is but certain people from a certain cultural, religious, ethnic group, feel that rules don't pertain to them. Noses out all the time, always right on the edge. Every. Single. Time. I already know who is going to be flagged for mask violations the second they board because the nose is out, mask loose, looking to press the boundaries. I am not a prejudice person, but every time? Like every. time. I am tired of this shit.",
            "title_similarity": "0.40501317",
            "sentiment_compound": -0.7613
        },
        {
            "id": "h75qmh5",
            "score": 6,
            "text": "Put them all over the news and ridicule them relentlessly. We should be making examples of every able bodied idiot in the world that does this kind of shit.",
            "title_similarity": "0.47343948",
            "sentiment_compound": -0.8805
        },
        {
            "id": "h76ixog",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.01952069"
        },
        {
            "id": "h75bdmm",
            "score": -9,
            "text": "Can they just not pay it and never go back to Canada? $40,000 is like a year of savings for families doing well for themselves. Basically a year of your life. Perhaps 10, 15, or infinite for some. \n\nPenalty seems harsh. I hope the Canadian gov reduces it privately. It got media coverage already so the message is there already, no need to crucify a few dumb Americans.",
            "title_similarity": "0.6139275",
            "sentiment_compound": -0.558
        },
        {
            "id": "h75mz89",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.01952069"
        },
        {
            "id": "h75qxub",
            "score": 7,
            "text": "Shucks, imagine that: Americans trying to get away with their games in a different country & paying a nice price for their arrogance & willful ignorance!  Warms my heart.",
            "title_similarity": "0.45209235",
            "sentiment_compound": 0.5411
        },
        {
            "id": "h75tvvj",
            "score": -6,
            "text": "Uea you're only allowed to pass unvaccinated without being shamed if you are going from Mexico to the USA",
            "title_similarity": "0.23735702",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h748a22",
            "score": 260,
            "text": "Good - to heck with these turkeys. \n\nApologies for the coarse language.",
            "title_similarity": "0.35144886",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h74gfi9",
            "score": -67,
            "text": "[removed]",
            "title_similarity": "0.01952069"
        },
        {
            "id": "h755lgs",
            "score": -13,
            "text": "crazy how this has been happening all across the world but when it's 2 americans it's 27k upvotes, \"usa bad, dumb, and fat all other countries good, smart, and very in shape\"",
            "title_similarity": "0.5856848",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h74mgpr",
            "score": 1,
            "text": "Best news I’ve read all day.",
            "title_similarity": "0.23790751",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h74rbdg",
            "score": 1,
            "text": "Throw in a lifetime entry ban just to show you mean business. We don’t need any more idiots spreading this crap when we already have more than enough of our own",
            "title_similarity": "0.40751475",
            "sentiment_compound": -0.765
        },
        {
            "id": "h74sxf3",
            "score": 1,
            "text": "Am American.\n\nLock em up.",
            "title_similarity": "0.19447455",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74tlot",
            "score": 1,
            "text": "Make an example of them.",
            "title_similarity": "-0.19697402",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74uc67",
            "score": 1,
            "text": "The whole thread talks about the border controls of canada which should be fine as readers learn something. I want to see a discussion about the stupidity of those anti-vaxxers trying to enforce their god-given right to freedom of choice outside the protection of their country.",
            "title_similarity": "0.33427238",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h74xzj8",
            "score": 1,
            "text": "Was waiting for this. This is going to be a future problem world wide.",
            "title_similarity": "0.09325587",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h74y2x2",
            "score": 1,
            "text": "They really should publish mugshots...",
            "title_similarity": "0.30724287",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74yfpq",
            "score": 1,
            "text": "Lmao those anti-vax scum should be thrown in jail",
            "title_similarity": "0.47545385",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h74zjy1",
            "score": 1,
            "text": "How hard were they to fake 🤣😂🤣",
            "title_similarity": "0.2437002",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h74zm0u",
            "score": 1,
            "text": "Hahahahahha that is a hoot.  This isn’t Walmart",
            "title_similarity": "0.10447021",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75007g",
            "score": 1,
            "text": "20k is a small price to pay to own the libs",
            "title_similarity": "0.4384926",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h750r12",
            "score": 1,
            "text": "They should offer to waive the fine if they get vaccinated",
            "title_similarity": "0.4045267",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h758k0t",
            "score": 1,
            "text": "Considering it is probably Canadian dollars that isn't nearly enough of a fine.",
            "title_similarity": "0.37467664",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h758qqd",
            "score": 1,
            "text": "Off to Siberia for the counterfeiters",
            "title_similarity": "0.38734406",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75ggut",
            "score": 1,
            "text": "That would just mean I’m banned from that country because I’d never pay a huge fine to a country I don’t live in.",
            "title_similarity": "0.40326908",
            "sentiment_compound": -0.434
        },
        {
            "id": "h75io28",
            "score": -1,
            "text": "Is that canadian pesos or real american dollars?",
            "title_similarity": "0.35248962",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75jeyz",
            "score": 1,
            "text": "The kicker to the story, they're donating all money received from fines to the Hillary Clinton 2028 presidential election fund.",
            "title_similarity": "0.5648516",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75jowv",
            "score": 1,
            "text": "And to think, the vaccine was free",
            "title_similarity": "0.11909692",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h75klft",
            "score": 1,
            "text": "coulda just got the shot and saved $40k",
            "title_similarity": "0.55580044",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h75me1b",
            "score": 1,
            "text": "They didn't have to put \"from U.S.\" in the title, it's already implied",
            "title_similarity": "0.03312148",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75nbnp",
            "score": -1,
            "text": "Go back to us, never pay the fine, what's the problem?",
            "title_similarity": "0.31710723",
            "sentiment_compound": -0.4581
        },
        {
            "id": "h75nhgz",
            "score": 1,
            "text": "Good. Keep the plaguers out.",
            "title_similarity": "0.08125437",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h75orfj",
            "score": 1,
            "text": "That's more effort than getting vaccinated by a lot",
            "title_similarity": "0.3751382",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75pllc",
            "score": 1,
            "text": "so how did they catch them? when i got my second dose i forgot  my card and all they told me eas to copy the new info onto the  new card .",
            "title_similarity": "0.5006953",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75pzyy",
            "score": 1,
            "text": "Sadly enough, Canadian prison is probably nicer than these wal-mart shoppers home.",
            "title_similarity": "0.36233795",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h76brk7",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.07273681"
        },
        {
            "id": "h76hchi",
            "score": 1,
            "text": "A ha ha ha ha ha ! Dummies. If the US would do this for all the fakies- we would have a country back,",
            "title_similarity": "0.2965067",
            "sentiment_compound": 0.8832
        },
        {
            "id": "h76pdx8",
            "score": 1,
            "text": "US: “you get what you fucking deserve!” \nBut really, vaccines are free and people make fake documents that can cause people to die I’m glad they fine.",
            "title_similarity": "0.4189334",
            "sentiment_compound": 0.2114
        },
        {
            "id": "h76sdb4",
            "score": -1,
            "text": "Why the big fine instead of only declining? Is it to deter the people that would attempt this and would not have been caught ?\n\nEdit: I mean deporting instead of declining.",
            "title_similarity": "0.3505757",
            "sentiment_compound": 0.2869
        },
        {
            "id": "h76vgmy",
            "score": 1,
            "text": "Hope they are permanently banned from Canada.",
            "title_similarity": "0.25424466",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h770zx6",
            "score": 1,
            "text": "could they be force-vaccinated by order of a court?\n\nceterum censeo \"unit libertatem\" esse delendam.",
            "title_similarity": "0.32194102",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7b5mr9",
            "score": -1,
            "text": "👉CDC study shows 74% of people infected in Massachusetts Covid outbreak were fully vaccinated👈\n\nAbout three-fourths of people infected in a Massachusetts Covid-19 outbreak were fully vaccinated, according to new data published Friday by the CDC.\n\nhttps://www.cnbc.com/2021/07/30/cdc-study-shows-74percent-of-people-infected-in-massachusetts-covid-outbreak-were-fully-vaccinated.html",
            "title_similarity": "0.54688144",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h7473fn",
            "score": 106,
            "text": "I’m so glad the fine is something significant and not just a $100 fine that people will just ignore.",
            "title_similarity": "0.3900473",
            "sentiment_compound": 0.6659
        },
        {
            "id": "h74r93r",
            "score": 5,
            "text": "Oh those poor Patriots.\n\n&#x200B;\n\nI thought this was America. Isn't this America?\n\n&#x200B;\n\n&#x200B;\n\n/s",
            "title_similarity": "0.33050066",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h758tmi",
            "score": 6,
            "text": "As an American I say good. Fuck 'em.",
            "title_similarity": "0.14083627",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h758w7t",
            "score": -7,
            "text": "So that about $50 USD?",
            "title_similarity": "0.46293676",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7596sx",
            "score": 7,
            "text": "Fuck these pieces of shit. They belong in prison for years.",
            "title_similarity": "0.47729835",
            "sentiment_compound": -0.886
        },
        {
            "id": "h75afhk",
            "score": 9,
            "text": "Good. Fuck them. I'd even push for jail time, except I don't want their unvaccinated asses in my country.",
            "title_similarity": "0.3499327",
            "sentiment_compound": -0.2076
        },
        {
            "id": "h75iu1t",
            "score": -8,
            "text": "\"Vaccination documents.\" \nWhat the fuck? Where are we headed?",
            "title_similarity": "0.31288898",
            "sentiment_compound": -0.594
        },
        {
            "id": "h747t7z",
            "score": 116,
            "text": "So you’re saying two people who refused to get vaccinated didn’t foresee any consequences to their actions? Stunned. I’m stunned I tell ya.",
            "title_similarity": "0.39180964",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h759ju3",
            "score": -6,
            "text": "Quite different from the border into the US where they let anybody in, whether or not vaccinated, and fly them to places like Tennessee. What a world.",
            "title_similarity": "0.39851606",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7662qy",
            "score": -8,
            "text": "Great, can't  wait till we see this headline: \"1 million Travellers from Southern Border fined $20,000 each for lacking vaccination documents\". \n\nOf course, we all know this won't happen. Bias and hypocrisy is rife in the nation and the current political sphere.",
            "title_similarity": "0.8341423",
            "sentiment_compound": 0.6593
        },
        {
            "id": "h76estf",
            "score": -7,
            "text": "The world is so corrupt geez. The do that to the travellers to make us afraid. Biggest scam",
            "title_similarity": "0.5025883",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h74y3d0",
            "score": -17,
            "text": "It’s terrifying how having a vaccine or not has created a new war amongst people.\n\nStop and think about that. Take a step back and look at what is going on.",
            "title_similarity": "0.49523133",
            "sentiment_compound": -0.8895
        },
        {
            "id": "h74j8du",
            "score": 9,
            "text": "To fake documents rather than getting a couple shots that prevent a deadly illness seems like an extra kind of stupid",
            "title_similarity": "0.40390623",
            "sentiment_compound": -0.7841
        },
        {
            "id": "h74yq3p",
            "score": -7,
            "text": "All the unvaccinated should go to prison. Easy way to quarantine!\n\nIf you don’t trust the government and big pharma - off to prison you go. They have your best interests in mind you dummy’s. Why would they lie to us?",
            "title_similarity": "0.5116476",
            "sentiment_compound": 0.7263
        },
        {
            "id": "h765rpz",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.01952069"
        },
        {
            "id": "h74t7qh",
            "score": 2,
            "text": "Lock them up too. Scumbags deserve that.",
            "title_similarity": "0.27182806",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74u018",
            "score": 2,
            "text": "And people complain about businesses and jobs requiring proof of vaccination… well y’all are liars!",
            "title_similarity": "0.54896814",
            "sentiment_compound": -0.6239
        },
        {
            "id": "h74uuh2",
            "score": 2,
            "text": "It's just a quick jab in the arm, don't cha know.",
            "title_similarity": "0.2665075",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74vaxs",
            "score": 2,
            "text": "Bad enough you don’t vax. \n\nEven worse that you fake vax card. \n\nHopefully along with the fine they’re made to swallow some pfizer",
            "title_similarity": "0.5102678",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h74wi0l",
            "score": 2,
            "text": "Clearly, we are not sending our best.",
            "title_similarity": "0.08156203",
            "sentiment_compound": -0.17
        },
        {
            "id": "h74x2h1",
            "score": 2,
            "text": "Literally could’ve gotten that proof for free and easy to get.",
            "title_similarity": "0.12863798",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h74yawh",
            "score": 2,
            "text": "I had an interesting run-in with Canadian Border Security about 10 years ago at the Niagara Falls border crossing.  I had not been to Canada in years, and the last time I used my driver’s license to get across.  This time they asked for a passport (as I learned was required since I’d last crossed) but I didn’t have it with me since I only was crossing on foot to hit the casino and have dinner with friends.  The Border Agent, an older woman, about 5 foot tall with that thick Canadian accent I love hearing sat me in a holding area for about an hour, then finally said she couldn’t let me cross without a passport.  Then she asked what I had intended to do in Canada.  I said I was going to meet friends for dinner and spend a thousand bucks in the casino.  She looked at me and asked where was my car.  I told her I was on foot and was to take a bus back to Buffalo at 11 pm.  She looked at me for a while and then said “Alright. Go on.  Good luck getting back in the States!” And laughed.  Funny thing was the US agents and military guys I encountered crossing back later that night just looked at my license and work ID - I worked for the federal government at the time - Asked if I had anything to declare and let me go though no problem.  Took about 30 seconds. I’ll always remember that Canadian Border Agent.  Had a lot of fun that night.  Now I always bring my passport whenever I go anywhere near Canada just in case I want to take a day trip.",
            "title_similarity": "0.58551514",
            "sentiment_compound": 0.992
        },
        {
            "id": "h74ywcp",
            "score": 2,
            "text": "this is funny because it literally requires less work to just get the vaccine and go on with your life, instead of trying to forge documents and lie about it.",
            "title_similarity": "0.37661523",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h750pbl",
            "score": 2,
            "text": "So, MAGA is pretending that Latinos without documentation are a security threat—meanwhile, they are forging documentation and actively threading others’ security.",
            "title_similarity": "0.29841125",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h751f54",
            "score": 2,
            "text": "All they had to do to avoid this was stand in line for 5 minutes, get a free jab in their arm, and be on their way. Maybe a couple hours of discomfort at the worst. Hilarious.",
            "title_similarity": "0.56005746",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h755dwo",
            "score": 2,
            "text": "You’d think with Reddit being so informative, someone would have posted the real and fake vaccination cards already side by side to distinguish the differences",
            "title_similarity": "0.44775742",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h755stl",
            "score": 2,
            "text": "Give them 5 years hard labor",
            "title_similarity": "0.3821868",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h757j6w",
            "score": 2,
            "text": "Too bad the fines weren't much higher! \n\nI just can't wrap my head around how stupid people are. The COVID shot is literally free. It costs more to create a fake vax card than to just get the damn shot.",
            "title_similarity": "0.5058418",
            "sentiment_compound": -0.8081
        },
        {
            "id": "h7581xm",
            "score": 2,
            "text": "Fuck, a jab is free. Wtf ppl",
            "title_similarity": "0.1601513",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h759dkn",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.019520625"
        },
        {
            "id": "h75cp8t",
            "score": 2,
            "text": "Omg this is made my day.",
            "title_similarity": "-0.05850822",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75djcv",
            "score": 2,
            "text": "Should have been executed",
            "title_similarity": "0.12710646",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75ejvn",
            "score": 2,
            "text": "$20,000 seems too low. Should have been more like $2,000,000 each.",
            "title_similarity": "0.68947476",
            "sentiment_compound": 0.1761
        },
        {
            "id": "h75gca6",
            "score": 2,
            "text": "Awesome! Keep it up Canada!",
            "title_similarity": "-0.028762838",
            "sentiment_compound": 0.6892
        },
        {
            "id": "h75ivl6",
            "score": -2,
            "text": "I'd just go back to the states and ignore it lol",
            "title_similarity": "0.20119044",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h75lc8t",
            "score": 2,
            "text": "Best news I've read all day. LOCK. THEM. UP.",
            "title_similarity": "0.338542",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h75mg3v",
            "score": 2,
            "text": "Probably amounts to two years worth of salaries for those two morons",
            "title_similarity": "0.6272697",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h75mll6",
            "score": -2,
            "text": "But the world hates any US immigration rules.",
            "title_similarity": "0.38478756",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h75nf9v",
            "score": 2,
            "text": "Make it 40k each. Fuck these assholes.",
            "title_similarity": "0.52502954",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h75o8ue",
            "score": 2,
            "text": "There’s a great way to stick it to the man while probably getting a lien on your mortgage. Smart move.",
            "title_similarity": "0.27791873",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h75okbz",
            "score": 2,
            "text": "Damn 20k and likely banned from coming back just to avoid protecting yourself from a potential life threatening virus. Can't get much dummer than that.",
            "title_similarity": "0.560132",
            "sentiment_compound": -0.8834
        },
        {
            "id": "h75orme",
            "score": 2,
            "text": "Impound the vehicles, quarantine them and wait for payment.",
            "title_similarity": "0.3458619",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75oyki",
            "score": 2,
            "text": "This just shows how selfish people really are.",
            "title_similarity": "0.3196603",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h75rvkl",
            "score": -2,
            "text": "Fake? How you get one and how they know",
            "title_similarity": "0.14743641",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h75uybk",
            "score": 2,
            "text": "Damn, I can’t believe it’s already snowing at the border.",
            "title_similarity": "0.3057599",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h76gql5",
            "score": 2,
            "text": "If only there was some way that $20,000 fine could’ve been avoided… hmmmmmm 🤔\n\nGetting an actual vaccine is free, you know 🙄",
            "title_similarity": "0.578771",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h76juxo",
            "score": 2,
            "text": "I hope they get stamped by a moose as well.",
            "title_similarity": "0.12211894",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h76o9tz",
            "score": -2,
            "text": "Good luck getting a US citizen to pay of foreign issued fine...one of the perks of the military industrial complex right there.",
            "title_similarity": "0.40162534",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h772e2h",
            "score": 2,
            "text": "$20,000 when they could have been vaccinated for free.... Hope it was worth it?",
            "title_similarity": "0.66687846",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h77734x",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.0727368"
        },
        {
            "id": "h77casd",
            "score": 2,
            "text": "Why can’t they go to jail?",
            "title_similarity": "0.27187645",
            "sentiment_compound": 0.0
        },
        {
            "id": "h78jl8f",
            "score": 2,
            "text": "Yea!!!!  These people need to have real consequences for their abhorrent behavior.",
            "title_similarity": "0.23382577",
            "sentiment_compound": -0.7405
        },
        {
            "id": "h7483ac",
            "score": 28,
            "text": "Hopefully the consequences of not paying the fine includes deportation and being permanently  banned from entry.",
            "title_similarity": "0.41553646",
            "sentiment_compound": -0.2244
        },
        {
            "id": "h74vdrs",
            "score": 26,
            "text": "Vaccination: Free\n\nFine for lying about having it: $20,000\n\nOwInG tHe LiBs: Priceless",
            "title_similarity": "0.7861463",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h74uvkx",
            "score": -11,
            "text": "Meanwhile at the U.S. southern border, we'll take all the Covid you got and give you $. Enjoy your hypocritical conundrum.",
            "title_similarity": "0.4737174",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h74zgs9",
            "score": -11,
            "text": "Who fined them? Love to see that lawsuit",
            "title_similarity": "0.35169932",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h756m7x",
            "score": 12,
            "text": "Lmaoooo. As someone who just got vaccinated and who's arm is still sore, proper documents in hand, I'm so fucking glad they have a system for validating these things.\n\nSorry anti-vaxxers, nana's inkjet ain't gonna save you.",
            "title_similarity": "0.46090254",
            "sentiment_compound": 0.578
        },
        {
            "id": "h74p7yw",
            "score": 196,
            "text": "The European Union has an electronic proof of vaccination that's a QR code someone can keep on their phone..... even some of the poorer EU countries  have already surpassed many US states",
            "title_similarity": "0.44085196",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h746yur",
            "score": 1264,
            "text": "> The agency says in a news release Friday that the travellers arrived last week and have been handed four fines totalling $19,720 each.\n\nGood. People who forge vaccination documents belong in jail. I promise that it’s just easier to get the vaccine then take the time to forge a fake document. \n\nWhat idiots.",
            "title_similarity": "0.74888575",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h74kaig",
            "score": 4,
            "text": "Dammit, this is why we can't have nice trips.",
            "title_similarity": "0.33460817",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h74skdb",
            "score": 3,
            "text": "its crazy that people went to those lengths rather than get a FREE vaccine available to everyone",
            "title_similarity": "0.43867567",
            "sentiment_compound": 0.3885
        },
        {
            "id": "h74tis4",
            "score": 1,
            "text": "Im glad someone is taking this seriously.",
            "title_similarity": "-0.11140036",
            "sentiment_compound": 0.2789
        },
        {
            "id": "h74vsp9",
            "score": 3,
            "text": "This is just me, idk, but it seems cheaper just to get the vaccine and not be a total dipshit.",
            "title_similarity": "0.36715767",
            "sentiment_compound": -0.6994
        },
        {
            "id": "h74w70j",
            "score": 2,
            "text": "These people should be on a no fly list for life.",
            "title_similarity": "0.21195924",
            "sentiment_compound": -0.296
        },
        {
            "id": "h74we1b",
            "score": 3,
            "text": "The… vaccine… is… free…",
            "title_similarity": "0.10530612",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74wf2b",
            "score": 3,
            "text": "I bet they’re the same type  of people that rail against illegal immigrants and fake documents.",
            "title_similarity": "0.45979643",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h74wnxj",
            "score": -2,
            "text": "I put this vax in your face.  \nNow what you gon' do with it?  \nBetter have my money when I come to collect.  \nPay up, pay up, pay up.",
            "title_similarity": "0.45660645",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h74yi0c",
            "score": 2,
            "text": "Don’t understand how people would take the time and effort to falsify a vaccination card, rather than get the shot\n\nHope both of them are forced to actually pay the fine",
            "title_similarity": "0.576782",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h74z007",
            "score": 4,
            "text": "The fucking entitlement. A country plainly states they don’t want you here unless X and they HAD to go so badly that they faked documents.",
            "title_similarity": "0.4849286",
            "sentiment_compound": -0.5706
        },
        {
            "id": "h74zmqi",
            "score": 1,
            "text": "I got a bonus for getting my shot months ago 🤔. Wonder what it cost to get those fake documents.",
            "title_similarity": "0.599726",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h753axl",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.019520625"
        },
        {
            "id": "h75734n",
            "score": 3,
            "text": "Good. Why put others at risk because you can't be bothered to care?",
            "title_similarity": "0.19071361",
            "sentiment_compound": 0.7151
        },
        {
            "id": "h7574yp",
            "score": 3,
            "text": "Deserved. At least don't pretend you're vaccinated when you're not. You're not gonna be able to go back to how things were before covid without getting your shots, that's just how it is. The world isn't gonna go back to how it was, just for you.",
            "title_similarity": "0.35149604",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h759n9r",
            "score": 4,
            "text": "Lol and they could have gotten the vaccine for free.",
            "title_similarity": "0.301519",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h75bl66",
            "score": 2,
            "text": "Please dispose of them at your earliest convenience in a manner you see fit. We do not want them back. Thanks.",
            "title_similarity": "0.032179207",
            "sentiment_compound": 0.7564
        },
        {
            "id": "h75diwv",
            "score": 3,
            "text": "Apparently they were Canadian citizens, but who came from the US - presumably living or working there. Which means they are definitely fucked lol, no chance they can escape that fine (good).",
            "title_similarity": "0.38311687",
            "sentiment_compound": 0.7303
        },
        {
            "id": "h75e8co",
            "score": 3,
            "text": "Good. The fine should have been higher.",
            "title_similarity": "0.087859094",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h75gvld",
            "score": 4,
            "text": "You play stupid games and you win stupid prizes. If other countries require you to get the vaccine then get the vaccine. It’s not really a matter of believing it, it’s a matter of following the rules, especially if other countries. It’s the exact same concept as walking into someone’s house and that person asking you to take off your shoes. Do you take off your shoes or whine and cry like a little bitch? Regardless of your political beliefs and opinions on Covid and vaccines, these people broke the law and they’re paying the price for it.",
            "title_similarity": "0.5671016",
            "sentiment_compound": -0.8013
        },
        {
            "id": "h75h683",
            "score": 4,
            "text": "Sweet.  Fuck them.  Should’ve been more.",
            "title_similarity": "0.10606692",
            "sentiment_compound": -0.128
        },
        {
            "id": "h75kgn3",
            "score": 3,
            "text": "Give them jail time…\nWhere I’m from *ahem the United States\nIf you forge something that’s fraud… sounds like a felony to me…",
            "title_similarity": "0.54285127",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h75khpb",
            "score": 3,
            "text": "Should go to jail for faking those.",
            "title_similarity": "0.4238112",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h75mbkd",
            "score": 2,
            "text": "How much did they pay for the forged documents",
            "title_similarity": "0.53355813",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h75nwcv",
            "score": 4,
            "text": "Fake documents on a border are a Bad Idea, especially for health records.",
            "title_similarity": "0.46799824",
            "sentiment_compound": -0.765
        },
        {
            "id": "h75ph1m",
            "score": 4,
            "text": "Well they really 'owned the libs' there, didn't they?",
            "title_similarity": "0.16194957",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h75pm3r",
            "score": 3,
            "text": "I would assume that they are likely to face charges in the US for falsification of official documents too. In which case, good, throw the book at them.",
            "title_similarity": "0.50531447",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h75qj94",
            "score": -2,
            "text": "I went to Canada in my teenage years. Pre-2001. There was no border so going into Canada. I think there was an unmanned booth to come back into the USA.",
            "title_similarity": "0.31842238",
            "sentiment_compound": -0.296
        },
        {
            "id": "h75y24g",
            "score": -3,
            "text": "What a disgrace to Japan and to the Olympics.",
            "title_similarity": "0.39278784",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h76acmi",
            "score": 2,
            "text": "An antivaccer couple whom I know are traveling through Coasta Rica have been traveling on forged vaccination documents. Now if they get caught...",
            "title_similarity": "0.53111136",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76e0lt",
            "score": 2,
            "text": "Only 20k? Bump it to 100,000k",
            "title_similarity": "0.5092936",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76un3f",
            "score": 3,
            "text": "They should be banned for 10 years at least.",
            "title_similarity": "0.4506641",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h76v84e",
            "score": 3,
            "text": "Good, lets keep doing this.",
            "title_similarity": "-0.22763523",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h74vh4u",
            "score": 12,
            "text": "It's absolutely amazing to know World Governments are fed up with American stupidity and entitlement.",
            "title_similarity": "0.49819726",
            "sentiment_compound": 0.2944
        },
        {
            "id": "h74n94u",
            "score": -39,
            "text": "How tf can this many people blindly support this fascism? There’s no way this sub is a accurate res presentation of our population",
            "title_similarity": "0.49257892",
            "sentiment_compound": 0.128
        },
        {
            "id": "h7606y9",
            "score": -15,
            "text": "Lol. That’s a gross violation of their freedom. They are American citizens.",
            "title_similarity": "0.36645633",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h74xyif",
            "score": 5,
            "text": "Funny how the voter ID card people are against vaccination cards......",
            "title_similarity": "0.492689",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h74z1uk",
            "score": 3,
            "text": "Geez. Seems like it would’ve been cheaper to get the free vaccine.",
            "title_similarity": "0.37641692",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h74zqi4",
            "score": 3,
            "text": "why do people get fake vaccination documents, vaccinations are totally free wtf",
            "title_similarity": "0.3479652",
            "sentiment_compound": -0.5552
        },
        {
            "id": "h751de3",
            "score": 3,
            "text": "They fucked around and found out.",
            "title_similarity": "0.20267478",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h752jmq",
            "score": 5,
            "text": "Seriously! Fuck these people. We are all tired of this shit man, I thought this kind of crap gets treated as acts of terrorism?",
            "title_similarity": "0.45434073",
            "sentiment_compound": -0.9611
        },
        {
            "id": "h756kua",
            "score": -5,
            "text": "A $20,000 fine seems really excessive, if anything they should face prison instead, it's not fair that they'll either be financially crippled for years, or just slightly inconvenienced depending on their financial situation.",
            "title_similarity": "0.77992344",
            "sentiment_compound": -0.5365
        },
        {
            "id": "h756wza",
            "score": 4,
            "text": "Rather pay 40k then get a free vaccine. You know what they say about playing stupid games. \n\n\n\nEdit cleared up the phrasing",
            "title_similarity": "0.58829266",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h757d2d",
            "score": -4,
            "text": "Is this not getting ridiculous to you guys though. I’m honestly over the restrictions and just want the world to move past this as fast as possible. These people are pretty kinda stupid for doing this though.",
            "title_similarity": "0.29595727",
            "sentiment_compound": 0.6708
        },
        {
            "id": "h757y9v",
            "score": 3,
            "text": "Fine them more! They could have potentially exposed people to a dangerous disease.",
            "title_similarity": "0.30761763",
            "sentiment_compound": -0.4389
        },
        {
            "id": "h758hf4",
            "score": 4,
            "text": "Build a wall and make USA pay for it",
            "title_similarity": "0.3387647",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h7590do",
            "score": 4,
            "text": "Couldn't happen to two finer fucks.",
            "title_similarity": "0.21079147",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h75etj8",
            "score": -4,
            "text": "And people can walk across our border without getting into trouble. Silly",
            "title_similarity": "0.093593925",
            "sentiment_compound": 0.3309
        },
        {
            "id": "h75lj58",
            "score": 3,
            "text": "Pffft, its a small amount of money. US citizens always have minimum $200k lieing around to cover health expenses or college funds, so the joke is on canada. Hahaha\n\nEdit: /s",
            "title_similarity": "0.6384933",
            "sentiment_compound": 0.7251
        },
        {
            "id": "h75qfqp",
            "score": 5,
            "text": "They showed us libs didn’t they?",
            "title_similarity": "0.21232244",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76ju6n",
            "score": 4,
            "text": "Oooohhh rednecks with forged papers. Wonder what they think of people with forged papers.",
            "title_similarity": "0.41909522",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76ku0h",
            "score": 5,
            "text": "Good. These dumb motherfuckers can at least stay in their own country if they don't want to be vaccinated.",
            "title_similarity": "0.42460772",
            "sentiment_compound": -0.1586
        },
        {
            "id": "h76lpt5",
            "score": -3,
            "text": "The Canadians at the border they have centers very sensitive sensors to pick up things like marijuana bombs gunpowder stuff like that.  I don't know how many times they threatened to tear my car apart on both sides of the border because I used to smoke marijuana in my car and I didn't realize how messy it was it gets everywhere. So when I crossed back into the United States after a while I had my car detailed in Canada and then I didn't smoke in it when I was in the United States most of the time because it's legal in Canada and yeah they can threaten to tear my car apart so what I got to watch the dog work he sniffed my balls and he went through my car and through my car and the guy liked me I lied to him of course but I know how to do that I'm good at it. I won't ever be allowed in Canada again no problem though they do that they finde people that's what they do they don't put you in jail they find you and they take away your passport.\n I had a buddy that happened to in Canada. There was a guy going a 120 km over the speed limit or the speed limit somewhere and they find him $12000. I don't put you in jail they make you pay for your crimes I like that about them. What time I smuggled a necklace into Canada on my wife's neck and they went through my shaving gear looking for drugs or drugs they held me up at the airport I had to talk to a nice guy which I did I'm a great conversationalist talking to the cops I used to really like doing that I'm old now and I don't do that anymore but or but I have mental problems I'm not gonna kid you but I've been working on them and I'm better now but still I respect the Canadians and $20000 it's $2 that's better than 3 years in a Mexican jail",
            "title_similarity": "0.56093526",
            "sentiment_compound": 0.9867
        },
        {
            "id": "h77g6o9",
            "score": -4,
            "text": "And you know everything. Try not to break your arm patting yourself on the back. No one gets to control who lives and who doesn't. I'm not here to prove myself right or you or anyone else wrong. I don't watch fox or follow any specific channel. I know a lot about disease and that lockdowns are not a solution. What I'd like you to consider is how detrimental fear is to the immune system and how powerless we as a society can become if we give away out freedoms. It is easy to give away and hard to get back. That said, ask yourself how you'd like to live your life and let everyone else decide how to live theirs.",
            "title_similarity": "0.40929174",
            "sentiment_compound": -0.4141
        },
        {
            "id": "h74n8sn",
            "score": 54,
            "text": "Hahahahahahaha hahahahahaha.\nHahahahahahaha hahahahahahahaha hahahahahahahaha hahahahah\nHahahahahahahaha.",
            "title_similarity": "-0.033165403",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74rpao",
            "score": 31,
            "text": "take a vaccine for free\n\nor $20k fine for fake docs. darwin is happily dancing",
            "title_similarity": "0.6084205",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h74lytb",
            "score": 242,
            "text": "Whatever, at least they owned the libs.\n\n/s",
            "title_similarity": "0.069617994",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74mb08",
            "score": 5,
            "text": "Ban them from any kind public travel.",
            "title_similarity": "0.1488114",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h74tftg",
            "score": 3,
            "text": "A free shot or a $20,000 fine.  I know which one I'd pick.",
            "title_similarity": "0.48202965",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h74ud8r",
            "score": 4,
            "text": "I have a vaccine card - it’s pretty basic. What kind of POS forgery must they have made to actually be caught?! 😂",
            "title_similarity": "0.429744",
            "sentiment_compound": 0.75
        },
        {
            "id": "h74us5m",
            "score": 4,
            "text": "This belongs in r/mademesmile",
            "title_similarity": "0.04147778",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74x25d",
            "score": 6,
            "text": "Good! Also, I'm really sorry so many of my countrymen are so fucking stupid.",
            "title_similarity": "0.5270705",
            "sentiment_compound": -0.4509
        },
        {
            "id": "h755eq3",
            "score": -4,
            "text": "They don't have to pay, its a different country - they cant do anything",
            "title_similarity": "0.113252945",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h757a64",
            "score": 4,
            "text": "Imagine getting a 20k for forging a document for something that is free...",
            "title_similarity": "0.5619824",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h75xubu",
            "score": -4,
            "text": "I see, so getting fined $750k is warranted?",
            "title_similarity": "0.64425874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76d3hc",
            "score": 6,
            "text": "Having a fake vaccine passport is a higher crime than storming the Capitol",
            "title_similarity": "0.63081056",
            "sentiment_compound": -0.765
        },
        {
            "id": "h75wrq3",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.019520625"
        },
        {
            "id": "h74p3vc",
            "score": 5,
            "text": "Just get your fucking vaccines, people",
            "title_similarity": "0.25296682",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74rtvt",
            "score": 5,
            "text": "Are people really this stupid.. I am not surprised",
            "title_similarity": "0.18221687",
            "sentiment_compound": -0.7196
        },
        {
            "id": "h74s4vn",
            "score": 6,
            "text": "Dear Canada,\n\nFeel free to keep them... we don't want em back\n\nKthx",
            "title_similarity": "0.160373",
            "sentiment_compound": 0.6886
        },
        {
            "id": "h74v2nz",
            "score": -6,
            "text": "So many people believing these people will actually pay the fine. I have friend who managed to obtained $500 of traffic fines in Switzerland, guess which country he is never going to visit again.",
            "title_similarity": "0.71165866",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h7517qg",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.07273681"
        },
        {
            "id": "h752wer",
            "score": 6,
            "text": "Going into crippling debt to own the libs 😎",
            "title_similarity": "0.48996264",
            "sentiment_compound": 0.128
        },
        {
            "id": "h7549hu",
            "score": 5,
            "text": "To all the international readers out there - I swear to you, not every American is this big of an asshole.",
            "title_similarity": "0.48843664",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h75612n",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.07273681"
        },
        {
            "id": "h758i4x",
            "score": 5,
            "text": "Good these fuckers need to pay for exacerbating the virus for so long.",
            "title_similarity": "0.49730176",
            "sentiment_compound": -0.34
        },
        {
            "id": "h75matr",
            "score": 6,
            "text": "Fucking GOOD. Lies that cost lives should result in JAIL TIME.",
            "title_similarity": "0.4212185",
            "sentiment_compound": 0.2138
        },
        {
            "id": "h75phj5",
            "score": 7,
            "text": "Good. They should also be forced to do community service by working in the ICU with Covid patients.",
            "title_similarity": "0.18779805",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h74qttx",
            "score": 25,
            "text": "Unfortunately, we the U.S. are getting those unvaccinated clowns back at some point.",
            "title_similarity": "0.36930442",
            "sentiment_compound": -0.34
        },
        {
            "id": "h754vrv",
            "score": 7,
            "text": "That’s what you get for trying to cheat!",
            "title_similarity": "0.19055416",
            "sentiment_compound": -0.5093
        },
        {
            "id": "h755t52",
            "score": 7,
            "text": "Is there a hotline for turning in people with fake vaccination cards??",
            "title_similarity": "0.46365118",
            "sentiment_compound": -0.5362
        },
        {
            "id": "h759mm5",
            "score": 6,
            "text": "Why!? The vaccine is free! Just get it!",
            "title_similarity": "0.13622867",
            "sentiment_compound": 0.6341
        },
        {
            "id": "h75gca3",
            "score": 7,
            "text": "I’m honestly surprised these people even travel what with how little they seem to understand any culture aside from their own, how much they hate foreigners, and how much they jerk off to America.",
            "title_similarity": "0.45650947",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7633e4",
            "score": 7,
            "text": "Thats a $40,000 moron tax",
            "title_similarity": "0.6330215",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h76lih0",
            "score": -7,
            "text": "It’s stupid you have to have a vaccine passport now",
            "title_similarity": "0.41358417",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h74sjm0",
            "score": 45,
            "text": "The US Government will have a beef with them too. Fakes are a federal offense.",
            "title_similarity": "0.5170209",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h74a3zt",
            "score": 939,
            "text": "Sorry, Canada, we're not sending our best.",
            "title_similarity": "0.20686783",
            "sentiment_compound": -0.5673
        },
        {
            "id": "h74rlq5",
            "score": 9,
            "text": "Keep ‘em…we don’t want them!",
            "title_similarity": "0.010341695",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h74znt0",
            "score": 7,
            "text": "Anti-vaxxers get what they deserve.  They knew the rules and chose to try to get around them.   Get caught, pay the piper.\n\nAnd they were probably using those fake vaccine cards from available on magahatter sites.",
            "title_similarity": "0.42007273",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h755b4j",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.01952069"
        },
        {
            "id": "h75b82m",
            "score": 7,
            "text": "It's such a shame to be an American considering how arrogant a large base of our population is. COVID has really brought out the idiots.",
            "title_similarity": "0.5465901",
            "sentiment_compound": -0.743
        },
        {
            "id": "h75h28z",
            "score": 8,
            "text": "What kills me is these people PAY for these fake cards when they could get the real ones for free",
            "title_similarity": "0.521847",
            "sentiment_compound": -0.6633
        },
        {
            "id": "h75lh5t",
            "score": 8,
            "text": "Turns out your homegrown stupidity gets you in trouble in countries where your Republican senator can't cover for your ass in order to get your vote.",
            "title_similarity": "0.57754385",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h75uvtj",
            "score": 8,
            "text": "Canada, it's time to close that southern border. As an American, let me assure you that we're too damned ignorant to be trusted.",
            "title_similarity": "0.3937564",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h76jniu",
            "score": 7,
            "text": "$20,000 in fines because you faked paperwork about whether you took a vaccine that costs $0 out of pocket.\n\nWhat a couple of fucking brain surgeons.",
            "title_similarity": "0.89140165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74s7kw",
            "score": 26,
            "text": "Good. Can you guys keep them though? We don't need their diseases.",
            "title_similarity": "0.07076295",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h74y07g",
            "score": 28,
            "text": "So using illegals documents to enter another country ?  Do they see the irony ?",
            "title_similarity": "0.36149383",
            "sentiment_compound": -0.1431
        },
        {
            "id": "h7591m5",
            "score": 28,
            "text": "I’m about to leave Spain and there was an American dude at one of my hostels a few days ago bragging about how he got a blank vacc card from a friend and filled it out himself. Like fuck off, people already think Americans are entitled pricks when you go abroad, way to play the part.",
            "title_similarity": "0.63680327",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h75uwbg",
            "score": 28,
            "text": "Vaccinations = free. \nRefusing to vaccinate = $19,000\n\nThese anti-vaxxers are extremely stupid, and now they gotta pay dearly for their stance one way or another.",
            "title_similarity": "0.67442775",
            "sentiment_compound": -0.1761
        },
        {
            "id": "h752fcw",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.01952069"
        },
        {
            "id": "h754tyl",
            "score": 9,
            "text": "Should also throw them in jail for 14 days let them out and then throw them back in for another 14 days and then dump their asses back across the border.",
            "title_similarity": "0.5529464",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h758bz6",
            "score": 9,
            "text": "How stupid they are. Anti vax:\" i want things to get back to normal.\" CDC :\" get the vaccine\" Antivax:\"NO!\" then get fined for fake documents.",
            "title_similarity": "0.5993847",
            "sentiment_compound": -0.8313
        },
        {
            "id": "h75aw89",
            "score": 9,
            "text": "Imagine being such a fucking ignorant tool you rather forge serious documents than get vaccinated for a horrible virus causing widespread economic and medical disaster. \n\nFuck people like them and I wish the fine was double.",
            "title_similarity": "0.6372172",
            "sentiment_compound": -0.8313
        },
        {
            "id": "h75qv4r",
            "score": 8,
            "text": "When faced with the option of getting a free vaccine that will largely inoculate you from a rampant virus and forging documents that carry financial penalties, these clowns decided the latter was a better decision. Well done, dickheads.",
            "title_similarity": "0.51378226",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h74wc0b",
            "score": 535,
            "text": "Why *anyone* would go to a different country and act entitled and/or break the law?\n\nYou don’t want to go to foreign prison. Ever. Not even in Canada.",
            "title_similarity": "0.33548027",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h74v97c",
            "score": 10,
            "text": "Vaccines that 3.8 billion people have received and haven’t turned into magnetic lizard people with great cell reception: $0. \n\nBasing life choices on information you got from uneducated smooth brains on Facebook:  $20,000.",
            "title_similarity": "0.7000638",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h74vfkl",
            "score": 10,
            "text": "They got to tell the government that it couldn't tell them to be healthy, for free, and all it cost them was $20,000 each. What a bargain!",
            "title_similarity": "0.7279216",
            "sentiment_compound": 0.7959
        },
        {
            "id": "h75flm6",
            "score": -11,
            "text": "[deleted]",
            "title_similarity": "0.0727368"
        },
        {
            "id": "h75dwwy",
            "score": 12,
            "text": "It has got to be cheaper to get vaccinated than to make a fake card",
            "title_similarity": "0.410299",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h75vwgq",
            "score": -10,
            "text": "So, Canada has a vaccination database of US citizens.",
            "title_similarity": "0.35847828",
            "sentiment_compound": 0.0
        },
        {
            "id": "h764ti9",
            "score": 10,
            "text": "Guys, as an American, I’m so sorry for how we act. It’s goddamn embarrassing.",
            "title_similarity": "0.43178225",
            "sentiment_compound": -0.7537
        },
        {
            "id": "h7502vr",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.01952069"
        },
        {
            "id": "h753d20",
            "score": 35,
            "text": "The same people buying fake vaccination cards probably have very specific opinions about other people trying to use improper paperwork to enter the country or get a job.",
            "title_similarity": "0.5197947",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h75w4x7",
            "score": 13,
            "text": "Great! Everyone else who does this deserves a fine too. Get the damn vaccine.",
            "title_similarity": "0.3102401",
            "sentiment_compound": 0.5411
        },
        {
            "id": "h75wvm0",
            "score": 14,
            "text": "As an American, has Canada considered terrorism charges? Shits a 'bioweapon' and they knowingly infiltrated a sovereign nation's borders with the intent to deceive, or something. Get 'em Canada...",
            "title_similarity": "0.49702945",
            "sentiment_compound": -0.91
        },
        {
            "id": "h74py8t",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.01952069"
        },
        {
            "id": "h754glk",
            "score": 15,
            "text": "Imagine paying a fine for not getting a free vaccination.",
            "title_similarity": "0.6185658",
            "sentiment_compound": -0.2268
        },
        {
            "id": "h74sk79",
            "score": 71,
            "text": "The vaccine is free.\n\nMaking it expensive to be a fucking prick is the only way at this point.",
            "title_similarity": "0.35380796",
            "sentiment_compound": 0.1548
        },
        {
            "id": "h7486oo",
            "score": 8151,
            "text": "$20,000 to avoid getting a vaccine with no out of pocket costs to them... how smooth brained can you get.",
            "title_similarity": "0.7051448",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h75seoh",
            "score": 14,
            "text": "Fucking idiots. If you bought a fake vaccine pass you are a degenerate",
            "title_similarity": "0.5462228",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h75far4",
            "score": 112,
            "text": "LOL imagine paying for a fake vaccine passport for a FREE VACCINE! And then having to pay $20,000 on top of that! Karma’s a bitch, bitch!",
            "title_similarity": "0.8274826",
            "sentiment_compound": -0.5588
        },
        {
            "id": "h75aofu",
            "score": -14,
            "text": "I love this article from a website that I've never heard of before that also provides 0 resources to back up their claims. Im proud to be a sheep. Glad that you all are too.",
            "title_similarity": "0.2300567",
            "sentiment_compound": 0.8834
        },
        {
            "id": "h75dc3p",
            "score": 14,
            "text": "It probably took more work to fake that stuff than to just get the damn shot. \n\n\nSo stubborn .",
            "title_similarity": "0.3084439",
            "sentiment_compound": -0.8425
        },
        {
            "id": "h75wh6j",
            "score": -16,
            "text": "Yet another reason not to go to Canada",
            "title_similarity": "0.104719825",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74lqfe",
            "score": 353,
            "text": "Can we assume that they’ll also face a lifetime ban from entering Canada via land borders or airports? That seems like it should be automatic.  \nEDIT: removed a typo (‘the’)",
            "title_similarity": "0.37908337",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h74adxg",
            "score": 2614,
            "text": "What stops them from not paying?  Something tells me these are same type of people who would avoid paying at all costs.",
            "title_similarity": "0.2780831",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h74wcyh",
            "score": 18,
            "text": "Fake docs and a 20k fine for something they could have gotten for free.  Nothing but stupid as far as the eye can see.",
            "title_similarity": "0.6475228",
            "sentiment_compound": 0.6327
        },
        {
            "id": "h752475",
            "score": -20,
            "text": "Their personal medical records aren't any of anyone else's business. Fabricating a crime without the legislation is all this is.",
            "title_similarity": "0.3356845",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h752vdr",
            "score": 350,
            "text": "Imagine paying $20k for not getting a free covid vaccine 🤡",
            "title_similarity": "0.82754695",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h753co7",
            "score": 449,
            "text": "American citizens faking documents to get into another country? The hypocrisy has to be hilarious for the border agents.",
            "title_similarity": "0.523303",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h74s3fn",
            "score": -21,
            "text": "How is this enforced though? It's Canada fining US citizens. What if they don't pay it? Just not allowed back in Canada? Big woop, I wouldn't pay $20,000 to visit Canada",
            "title_similarity": "0.5067364",
            "sentiment_compound": 0.2805
        },
        {
            "id": "h74jiqm",
            "score": 1770,
            "text": "They got off lucky, \"The agency says violating quarantine or isolation instructions when entering Canada could lead to a $5,000 fine for each day of non-compliance or each offence, or more serious penalties including six months in prison or $750,000 in fines.\"",
            "title_similarity": "0.72794366",
            "sentiment_compound": -0.8268
        },
        {
            "id": "h74pch8",
            "score": 28,
            "text": "Good 100% hit them hard before people try to do the same.",
            "title_similarity": "0.3466093",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h74pj27",
            "score": -28,
            "text": "I know they did wrong, but 20k is insane.",
            "title_similarity": "0.4329452",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h7553ht",
            "score": 29,
            "text": "Good!  If you're going to refuse the Vaccine at least admit it and deal with the issues you run into due to your choice.",
            "title_similarity": "0.33352187",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h74u4qg",
            "score": 377,
            "text": "They probably spent more effort getting fake documents than the effort it takes to get a vaccine.",
            "title_similarity": "0.5337065",
            "sentiment_compound": -0.5209
        },
        {
            "id": "h755w6z",
            "score": 140,
            "text": "They probably paid for the fake ones too. So they paid twice. Meanwhile the real shit is free. What a world.",
            "title_similarity": "0.42561036",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h74o22u",
            "score": -40,
            "text": "[removed]",
            "title_similarity": "0.01952069"
        },
        {
            "id": "h7658k5",
            "score": 43,
            "text": "The irony is that in the US the ppl that harp against illegal immigrants and how illegals use fake documents to take advantage of the system and American generosity are 90% right wingers. The same kind of right wingers who make, buy, and sell fake vaccine papers.",
            "title_similarity": "0.7206658",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h75k5v1",
            "score": 40,
            "text": "I’m pretty sure no one’s going to be reading this as I’m pretty late to the game. But I was recently in Paros, Greece and I heard some Americans talking in front of me as I was walking back to my hotel. They were talking about how they changed the vaccination letter  to the name of someone else. I don’t know if the person didn’t have the documents on them or they just weren’t vaccinated, but it really pissed me off. Just go get your vaccine dumbass.",
            "title_similarity": "0.57762194",
            "sentiment_compound": -0.8717
        },
        {
            "id": "h75hrda",
            "score": 47,
            "text": "They got a harsher punishment than people who tried to overthrow the government.",
            "title_similarity": "0.4910356",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h75cmvs",
            "score": 66,
            "text": "They had 3 options and chose the worst one.\n\n1)Try and sneak into a country with phony documents. Risk paying a huge fine/prison\n\n2) get a free vaccine and then travel\n\n3) Stay their dumbass home if they were not willing to get vaccinated",
            "title_similarity": "0.6180239",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h74oqm4",
            "score": 8412,
            "text": "How bad were the documents that they got caught?  My library card looks more official that the Vaxx card.",
            "title_similarity": "0.52169263",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h74s1by",
            "score": 4225,
            "text": "[removed]",
            "title_similarity": "0.019520625"
        },
        {
            "id": "h754ucf",
            "score": 396,
            "text": "[deleted]",
            "title_similarity": "0.07273681"
        },
        {
            "id": "h74d23b",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.07273681"
        },
        {
            "id": "h74n3e9",
            "score": 2,
            "text": "They’re not sending their best.",
            "title_similarity": "0.08739634",
            "sentiment_compound": -0.5216
        },
        {
            "id": "h74pb0a",
            "score": 2,
            "text": "Also being banned entry in one country makes it real hard to travel anywhere else.",
            "title_similarity": "0.36871395",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h74qjr3",
            "score": 2,
            "text": "Ok, get this on Fox in the States.\n\nMake it a big story so more morons don't try it.",
            "title_similarity": "0.37779534",
            "sentiment_compound": -0.4351
        },
        {
            "id": "h74qsyh",
            "score": 1,
            "text": "I've had to modify incorrect information (test date, birth date) twice on covid test documents before travelling, because the people inputting it keep screwing it up.",
            "title_similarity": "0.51497066",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h74t1hr",
            "score": 1,
            "text": "I better not see a GoFundMe for this",
            "title_similarity": "0.12421419",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h74t2m3",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.0727368"
        },
        {
            "id": "h74t43q",
            "score": 1,
            "text": "Due to the amount of the fine are they allowed to go back home before paying? I’m almost positive they will not pay if allowed to leave before hand.",
            "title_similarity": "0.4218316",
            "sentiment_compound": 0.8128
        },
        {
            "id": "h74twe4",
            "score": 1,
            "text": "Did they kick them the fuck out?",
            "title_similarity": "0.32647136",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h74u0wt",
            "score": 1,
            "text": "We used to party on the Peace Bridge (Buffalo/Canada) when traffic was at a standstill . I’m talking get out of the car w a beer and visit our friends in the car behind us. WTF, right? 1980s.",
            "title_similarity": "0.45437306",
            "sentiment_compound": 0.5813
        },
        {
            "id": "h74u6q2",
            "score": 2,
            "text": "Goes to show that if you want to quickly find out if some government documents you have are fake just hand them to a border guard.",
            "title_similarity": "0.46231687",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h74urna",
            "score": 1,
            "text": "Good, they can get fucked.  I hope it fucking breaks them.  Get vaccinated you stupid muppets.",
            "title_similarity": "0.4835238",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h74utmn",
            "score": 3,
            "text": "The $20k fine should be far more common for people purposefully acting a cunt.",
            "title_similarity": "0.6161634",
            "sentiment_compound": -0.34
        },
        {
            "id": "h74uu22",
            "score": 2,
            "text": "Idiots doing idiot things because they're idiots",
            "title_similarity": "0.3235978",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h74v8wp",
            "score": 1,
            "text": "Guess these two idiots dont realize, that the US and most likely Canada at this point, keep track of all COVID vaccination records between countries.",
            "title_similarity": "0.51625496",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74v9dp",
            "score": 1,
            "text": "When I went up to Canada I got the impression they do not fuck around. Mexico and US were both so much more lax. \n\nAnyway, fuck these guys.",
            "title_similarity": "0.34061345",
            "sentiment_compound": -0.0035
        },
        {
            "id": "h74vsof",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.0727368"
        },
        {
            "id": "h74w8xx",
            "score": 3,
            "text": "I have an alternative to the fine. In lieu of the fine, they get a quarantine jail stay and get both vaccines, then shipped home at their own costs. I'm sure that's much cheaper than $20k.",
            "title_similarity": "0.6160306",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h74x0sj",
            "score": 4,
            "text": "It's OK they are used to it. That's a mild trip to the hospital",
            "title_similarity": "0.1281017",
            "sentiment_compound": 0.4466
        },
        {
            "id": "h74x67e",
            "score": 2,
            "text": "And let that be a lesson to you all.",
            "title_similarity": "-0.06820805",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74xg9e",
            "score": 2,
            "text": "That's one way to avoid getting a vaccine yet still pay healthcare prices",
            "title_similarity": "0.43276274",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h74xhkc",
            "score": 3,
            "text": "I thought rural Americans didnt have access to a photocopier? /s",
            "title_similarity": "0.3106044",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74xoju",
            "score": 2,
            "text": "Probably because they failed to set off the magnetometer.",
            "title_similarity": "0.24942574",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h74xr3d",
            "score": 2,
            "text": "Can’t say you didn’t deserve it.",
            "title_similarity": "0.038208567",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74y4am",
            "score": 1,
            "text": "I wonder if Canadians face the same scrutiny. I know a Canadian who lives in the Caribbean who just returned for the funeral of a family member with a fake vaccination card.  As far as I know (from FB posts), they've been able to move about without difficulty. I'm curious to see what happens when they leave Canada for their Caribbean home this weekend.",
            "title_similarity": "0.44296157",
            "sentiment_compound": -0.6933
        },
        {
            "id": "h74yoas",
            "score": 1,
            "text": "Border fine violations are steep",
            "title_similarity": "0.43377736",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h74zdot",
            "score": 3,
            "text": "You can’t fuck the federal government. Federal government fucks you.",
            "title_similarity": "0.34406024",
            "sentiment_compound": -0.765
        },
        {
            "id": "h74zk24",
            "score": 4,
            "text": "https://tenor.com/view/dave-chapelle-chapelle-show-popcopy-fuck-em-thats-why-gif-11866262",
            "title_similarity": "0.17434634",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74zltl",
            "score": 2,
            "text": "So we're finding regular citizens more than we are for Congressional positions? When they lie?",
            "title_similarity": "0.45618555",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74zpjj",
            "score": 2,
            "text": "With I could fined $20,000. I'd buy a boat",
            "title_similarity": "0.74497116",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7500a6",
            "score": 3,
            "text": "Good. Hope they go bankrupt.",
            "title_similarity": "0.2789137",
            "sentiment_compound": 0.296
        },
        {
            "id": "h7501os",
            "score": 1,
            "text": "And to think the vaccine is free…",
            "title_similarity": "0.12647265",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75054i",
            "score": 1,
            "text": "I hope Canada keeps them, we don't want them back",
            "title_similarity": "0.10399838",
            "sentiment_compound": 0.3975
        },
        {
            "id": "h7506us",
            "score": 1,
            "text": "Just keep them in a foreign prison for life",
            "title_similarity": "0.17456827",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h7507d2",
            "score": 1,
            "text": "Imagine paying 20k fine for lying about a vaccine that is free.",
            "title_similarity": "0.77304053",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h7507e2",
            "score": 1,
            "text": "Won’t they just go back to the USA and not pay? Could they be forced to pay?",
            "title_similarity": "0.4058925",
            "sentiment_compound": -0.5368
        },
        {
            "id": "h750ah7",
            "score": 2,
            "text": "The vaccine would have been free...",
            "title_similarity": "0.17619981",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h750c5v",
            "score": 1,
            "text": "Good. I hope every oppressed tear glistens in the light of their bankruptcy lawyer's office.",
            "title_similarity": "0.46021888",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h750eb1",
            "score": 3,
            "text": "I misread this as \"Time travellers\" instead of \"Two travellers\" and thought this was an Onion article for a second",
            "title_similarity": "0.39027664",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h750h6c",
            "score": 1,
            "text": "I’m going to bet they never pay the fine nor go to Canada ever again.",
            "title_similarity": "0.3293567",
            "sentiment_compound": -0.0762
        },
        {
            "id": "h750pso",
            "score": 2,
            "text": "Oh man imagine how many eggs they could've bought",
            "title_similarity": "0.42295393",
            "sentiment_compound": 0.0
        },
        {
            "id": "h750vyo",
            "score": 1,
            "text": "In the past, I have traveled through the US on trains, planes, buses, and by car (by cable car in SF) with weed but I would never attempt to possess trying to cross a national border. I saw Midnight Express. I know my rights in the US do not transfer to other countries and neither does Merica ideas.",
            "title_similarity": "0.37627065",
            "sentiment_compound": 0.0
        },
        {
            "id": "h750z3z",
            "score": 5,
            "text": "I'll bet these people are the types that would demand far worse punishments for immigrants forging docs.",
            "title_similarity": "0.5429692",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h7511r2",
            "score": 2,
            "text": "Canada is not ducking around.",
            "title_similarity": "-0.0944544",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7513z0",
            "score": 1,
            "text": "Good!\n\nHopefully they are stuck with this and Canada goes after them via collections etc",
            "title_similarity": "0.12052458",
            "sentiment_compound": 0.5983
        },
        {
            "id": "h7514vn",
            "score": 2,
            "text": "According to the article they were issued fines totaling 20k, not for fake documents",
            "title_similarity": "0.660636",
            "sentiment_compound": 0.3724
        },
        {
            "id": "h7518u4",
            "score": 1,
            "text": "And it begins! I hope this isn’t in the news all the time, but I also hope the diligence of the Canadian Border Service is detailed enough to catch those that try it\n\nWe have spent so much time making sure we’re protected, vaccines, masks, politeness, etc… that we don’t need idiots messing it up!",
            "title_similarity": "0.30100113",
            "sentiment_compound": 0.9214
        },
        {
            "id": "h7519zd",
            "score": 3,
            "text": "It’s literally free to get the vaccine in the US. These people are such dumbasses.",
            "title_similarity": "0.4955364",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h751hsn",
            "score": 1,
            "text": "Not nearly high enough.  They should be sent to prison for a year with inadequate Covid safety protocols.",
            "title_similarity": "0.6179501",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h751ij1",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.019520625"
        },
        {
            "id": "h751il3",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.07273681"
        },
        {
            "id": "h751k3h",
            "score": 1,
            "text": "Canada: Take off, eh?\n\nWe'll be more than happy to re-open the border once we got this shit under control, on both sides of said border.",
            "title_similarity": "0.21524552",
            "sentiment_compound": -0.07
        },
        {
            "id": "h751ot4",
            "score": 1,
            "text": "Lol, that's more than twice what I paid for my car. Just the cost of being an asshole I guess.",
            "title_similarity": "0.66029555",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h751r13",
            "score": 4,
            "text": "What a couple of entitled fucks, thinking that they have some sort of right to visit Canada even if it means circumventing the conditions required for entry, which aren't even onerous and are for protecting Canadian citizens. It's not on them to judge the validity or the reasonableness of those conditions for entry into a foreign country.",
            "title_similarity": "0.21834734",
            "sentiment_compound": -0.25
        },
        {
            "id": "h751yk3",
            "score": 1,
            "text": "Well it doesn’t specifically say that they had fake vaccination cards, its not clear, just that they had to answer questions honestly, prolly that they didn’t follow protocol (tests arriving and quarantine) which fines for $5k.\n\nSeriously, how is Canada gonna prove, in case they upload fake cards to the app, that they are fake if not even the US have a registered database? Do you really think that the person in charge in Canada is gonna look for the phone of the place where the card says it took vaccination and then to call them to ask? haha yeah sure, pleaaase",
            "title_similarity": "0.5610791",
            "sentiment_compound": -0.2368
        },
        {
            "id": "h752a8g",
            "score": 5,
            "text": "Honestly, every country should have kept their boarders closed even when the vaccines were done and should have waited until herd immunity was up. This would have stopped the spread of variants and would have kept stupid people from traveling and spreading it.",
            "title_similarity": "0.40859127",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h752af8",
            "score": 4,
            "text": "Just get the vac then it’s easy why fake it",
            "title_similarity": "0.21387154",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h752qc5",
            "score": 2,
            "text": "I know it's a lot to do, but can you keep them?  That's two less anti vax idiots here and we need all the help we can get",
            "title_similarity": "0.3382519",
            "sentiment_compound": 0.2592
        },
        {
            "id": "h752xau",
            "score": 6,
            "text": "Lovely—more of this please. I don't want to spend the rest of my life dealing with the pandemic of 2020 because people like this did not take this plague seriously.",
            "title_similarity": "0.3980985",
            "sentiment_compound": 0.4944
        },
        {
            "id": "h7532qk",
            "score": 1,
            "text": "That's gonna look bad on their credit report",
            "title_similarity": "0.3221336",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h7532zw",
            "score": 1,
            "text": "I lost mine, how do i get a replacement??",
            "title_similarity": "0.2155768",
            "sentiment_compound": -0.3939
        },
        {
            "id": "h7537ds",
            "score": 2,
            "text": "sounds like ill be relaxing in my own home until everyone else taps out.",
            "title_similarity": "0.17360888",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7539ey",
            "score": 2,
            "text": "Oh this does bring a smile to my face.",
            "title_similarity": "-0.08575012",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h753ey5",
            "score": 2,
            "text": "I'm surprised it took this long.",
            "title_similarity": "0.104984164",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h753jy2",
            "score": 2,
            "text": "I could just hear those two idiots saying, “I am an American and want immunity!!!”",
            "title_similarity": "0.37475505",
            "sentiment_compound": 0.2905
        },
        {
            "id": "h753rka",
            "score": 3,
            "text": "Penalties should not be money,  they should be time.",
            "title_similarity": "0.1121517",
            "sentiment_compound": 0.0
        },
        {
            "id": "h753ycv",
            "score": 4,
            "text": "This was incredibly disappointing because I read the headline as ‘Time Travellers…’",
            "title_similarity": "0.48081875",
            "sentiment_compound": -0.5413
        },
        {
            "id": "h753zde",
            "score": 1,
            "text": "How did they know they are fake?  Got mine at CVS and it is a generic card and handwritten.",
            "title_similarity": "0.41132724",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h7541vd",
            "score": 3,
            "text": "Couldn’t just wait a few weeks and have gotten the shot could they?",
            "title_similarity": "0.37510002",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75467d",
            "score": 7,
            "text": "As an American, I say throw the fucking book at them.",
            "title_similarity": "0.43280032",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7549a4",
            "score": 2,
            "text": "It should be in the biometric of your passport",
            "title_similarity": "0.22008845",
            "sentiment_compound": 0.0
        },
        {
            "id": "h754auh",
            "score": 2,
            "text": "Thank you for paying for out health care system, now get the fuck out.",
            "title_similarity": "0.39470202",
            "sentiment_compound": 0.296
        },
        {
            "id": "h754hav",
            "score": 7,
            "text": "I'd say please don't give them back, but I wouldn't want them either if I were Canadian.",
            "title_similarity": "0.21353151",
            "sentiment_compound": 0.0816
        },
        {
            "id": "h754rxt",
            "score": 7,
            "text": "I love so much that they actually got caught 🙌🏻",
            "title_similarity": "0.16445544",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h754swh",
            "score": 1,
            "text": "Somehow I kept reading fined as find, and I could not understand how you get $20000 for being vaccinated.",
            "title_similarity": "0.70899874",
            "sentiment_compound": 0.0
        },
        {
            "id": "h754wbo",
            "score": 8,
            "text": "Good! Crack the fuck down on that shit. Such a stupid selfish thing to pull.",
            "title_similarity": "0.30401838",
            "sentiment_compound": -0.8999
        },
        {
            "id": "h755573",
            "score": 6,
            "text": "I jumped through all those quarantine hoops even though I was vaccinated because it was before they lifted the quarantine requirement for vaccinated individuals. I have no sympathy for these turds.",
            "title_similarity": "0.5334538",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h7556lk",
            "score": 1,
            "text": "How enforceable are these fines?",
            "title_similarity": "0.24950218",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7558k9",
            "score": 3,
            "text": "Fined? Whatever happened to rotting in prison?",
            "title_similarity": "0.40145874",
            "sentiment_compound": -0.5661
        },
        {
            "id": "h755a3y",
            "score": 2,
            "text": "I just noticed Pfizer is spelt wrong on my card (which is real).",
            "title_similarity": "0.40485746",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h755anp",
            "score": 3,
            "text": "Oh man, can't you lock them up?",
            "title_similarity": "0.15423192",
            "sentiment_compound": 0.0
        },
        {
            "id": "h755ii0",
            "score": 2,
            "text": "Can they just keep them there?",
            "title_similarity": "-0.12833305",
            "sentiment_compound": 0.0
        },
        {
            "id": "h755mti",
            "score": 3,
            "text": "There's a point in one's life were you have to ask yourself... \"is it worth it.\"",
            "title_similarity": "0.073603995",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h755tbu",
            "score": 3,
            "text": "They should be blacklisted by Canada.",
            "title_similarity": "0.29736733",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7569eg",
            "score": 6,
            "text": "That’s pretty fucking funny",
            "title_similarity": "-0.04275635",
            "sentiment_compound": 0.7501
        },
        {
            "id": "h756eh2",
            "score": 2,
            "text": "NONONO! Pleas keep them!",
            "title_similarity": "-0.15072143",
            "sentiment_compound": 0.0
        },
        {
            "id": "h756gui",
            "score": 3,
            "text": "More than the price of the vaccine. 🤦‍♂️",
            "title_similarity": "0.5152738",
            "sentiment_compound": 0.0
        },
        {
            "id": "h756qzi",
            "score": 9,
            "text": "So fucking entitled. \n\nThe US has an excess of vaccines but people don’t want take them and then fake documents to enter other countries. \n\nHere I am fully vaccinated in a country with a scarcity of vaccines but because I’m not a US citizen I can’t even enter the US because of the covid travel ban.",
            "title_similarity": "0.56633574",
            "sentiment_compound": -0.83
        },
        {
            "id": "h756t2b",
            "score": 6,
            "text": "That's a lot to pay for a free vaccine.",
            "title_similarity": "0.41378856",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h756tgm",
            "score": 3,
            "text": "Vaccines are still free down in Canada's pants, right?  Just get the 2 shots and save the money.",
            "title_similarity": "0.37854174",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h756wc5",
            "score": 3,
            "text": "I expected a worse penalty for falsifying documents like that, a bit of jail or at least community time + the money.",
            "title_similarity": "0.50346464",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h75705l",
            "score": 2,
            "text": "Rode my motorcycle into Canada with my new passport. They said welcome and warned me , don’t even try to go back in the states until I signed my passport,  I had forgotten to sign it!!",
            "title_similarity": "0.3935089",
            "sentiment_compound": -0.1491
        },
        {
            "id": "h757fw7",
            "score": 2,
            "text": "You can always go on WebIZ and get your vaccination records…",
            "title_similarity": "0.13233638",
            "sentiment_compound": 0.0
        },
        {
            "id": "h757q73",
            "score": 3,
            "text": "Hahahaha fuck those two idiots. Bet they wish they just got their fucking shots now!",
            "title_similarity": "0.40458915",
            "sentiment_compound": -0.2714
        },
        {
            "id": "h757tao",
            "score": 4,
            "text": "Before anyone says \"justice\" they'll probably start a gofundme and make more money than $20,000 from dumbasses",
            "title_similarity": "0.75513315",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h757tbi",
            "score": 2,
            "text": "Would have been better off jumping the border instead.",
            "title_similarity": "0.2314513",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h757vwe",
            "score": 7,
            "text": "Is there a subreddit for this type of stuff because I just LOVE to see it. I know r/ByeByeJob is a classic, but maybe specifically for anti-vaxx people getting shit on?",
            "title_similarity": "0.2881198",
            "sentiment_compound": -0.4467
        },
        {
            "id": "h7582th",
            "score": 3,
            "text": "Lol. Canucks don’t fuck around with their fines, either.",
            "title_similarity": "0.18551812",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h7588m0",
            "score": 5,
            "text": "Why did I read the headline as “Time travelers.”",
            "title_similarity": "0.2930784",
            "sentiment_compound": 0.0
        },
        {
            "id": "h758d3g",
            "score": 5,
            "text": "Clearly , the prime minister should considerate US as a national security threat for Canada",
            "title_similarity": "0.2292251",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h758gwn",
            "score": 1,
            "text": "What a loser! Good! Goood!",
            "title_similarity": "0.09665942",
            "sentiment_compound": -0.3348
        },
        {
            "id": "h758peh",
            "score": 6,
            "text": "AHAHAHHAHA that is all. Good riddance",
            "title_similarity": "-0.057357937",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h75bw8b",
            "score": 3,
            "text": "If the fines are in Canadian dollars the plague rats get a 20% discount.  What a deal!",
            "title_similarity": "0.76165736",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75c7t6",
            "score": 1,
            "text": "I hand out the offical EU documents with actual handwritten information on it. It's good for all of EU and anybody with a printer and a scanner could make one in 10 minutes and just fill it out themselves really\n\nEdit\\* I manage a test facility, I don't actually just go around handing them out",
            "title_similarity": "0.45092982",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h75cx16",
            "score": 3,
            "text": "Maybe in lieu of a fine, they could be remanded to the nearest hospital to work in some capacity for the COVID ward for a couple weeks.",
            "title_similarity": "0.46126577",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h75d6m9",
            "score": 2,
            "text": "I hope they threw them in jail until they saw the judge and paid :D\n\nLovely nation the USA is these days /s",
            "title_similarity": "0.50651896",
            "sentiment_compound": 0.8941
        },
        {
            "id": "h75db9y",
            "score": 1,
            "text": "How does Canada enforce fines on Americans? Can they?",
            "title_similarity": "0.42710316",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75dkcl",
            "score": 3,
            "text": "I met a girl who got arrested in Costa Rica this year for doing this. She was not the brightest but they let her go 🙄",
            "title_similarity": "0.5516918",
            "sentiment_compound": -0.4871
        },
        {
            "id": "h75dnqn",
            "score": 5,
            "text": "$20,000 each over a free vaccine, tragic.",
            "title_similarity": "0.7625567",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h75duba",
            "score": 2,
            "text": "Hopefully they were also permanently banned from entry.",
            "title_similarity": "0.18099645",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h75e75j",
            "score": 5,
            "text": "Reminds me of the guy on tiktok who sells the file to make a 3D printed multi-pass (think 5th element) vaccination holder. JUST the holder. The amount of people who demand refunds because it doesn't include a fake vaccination card all filled out. YEAH it happens a lot. A whole lot.",
            "title_similarity": "0.5652319",
            "sentiment_compound": 0.6107
        },
        {
            "id": "h75ee16",
            "score": 3,
            "text": "To fuck around is human, to find out is Devine",
            "title_similarity": "0.040386632",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h75ehdx",
            "score": 2,
            "text": "How are they going to make them pay the fine?\nStick them in jail.",
            "title_similarity": "0.41870207",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h75eyo3",
            "score": 1,
            "text": "I've been playing a lot of Papers, Please lately and I'm very tired so when I read this my sleep deprived mind just thought to itself \"*Glory to Arstotzka*\"",
            "title_similarity": "0.43512365",
            "sentiment_compound": 0.079
        },
        {
            "id": "h75ez7t",
            "score": 6,
            "text": "They should banned from all air travel permanently and have their passwords revoked.",
            "title_similarity": "0.41104698",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h75f3h1",
            "score": 3,
            "text": "Too bad Canada can’t keep them.",
            "title_similarity": "0.26087907",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h75fakb",
            "score": 5,
            "text": "Forging documents for a free vaccine. Jfc",
            "title_similarity": "0.34364998",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h75fet4",
            "score": 6,
            "text": "Not content with endangering others and helping to prolong the pandemic at home, these dangerous, selfish morons decided to help spread it worldwide. To our Canadian cousins: isn't there some isolated gulag you could stick these jagoffs in for the next decade or so? We *really* don't wan them back.",
            "title_similarity": "0.5205399",
            "sentiment_compound": -0.3895
        },
        {
            "id": "h75fp8e",
            "score": 5,
            "text": "Well, I guess they should be happy it’s Canadian dollars…\n\nNice to see some governments taking this seriously.",
            "title_similarity": "0.17841394",
            "sentiment_compound": 0.7734
        },
        {
            "id": "h75ft4v",
            "score": 5,
            "text": "Good. Fuck assholes like this.",
            "title_similarity": "0.16223644",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h75ft52",
            "score": 4,
            "text": "Yet I’m sure they will still spin it as owning the libs.",
            "title_similarity": "0.04127524",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h75fz14",
            "score": 5,
            "text": "Good. Should throw the fking book at them. We still remember the time when your president blocked a huge purchase of masks we paid for at the beginning of the pandemic when the Americans were still calling it a hoax. Haven't bought an American or Chinese product since then. Plus I started an online group with so far 300 followers to make sure we aren't buying anything American or Chinese as much as we can help it. European and Jaoanese products are way better but way pricier. Worth the sacrifice IMHO.",
            "title_similarity": "0.6944655",
            "sentiment_compound": 0.743
        },
        {
            "id": "h75gaoe",
            "score": 6,
            "text": "We're not sending our best.",
            "title_similarity": "0.073043965",
            "sentiment_compound": -0.5216
        },
        {
            "id": "h75gkbg",
            "score": 2,
            "text": "Could have bought a truck",
            "title_similarity": "0.2021352",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75gnmy",
            "score": 2,
            "text": "An American customs officer once asked me “Where’s your girlfriend?” I hadn’t spoken English for two months and this question was out of nowhere. I could not understand him and just had to keep being like “umm what” until I was like oh wtf haha. I thought he thought I couldn’t understand English haha",
            "title_similarity": "0.55054903",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h75hre8",
            "score": 3,
            "text": "Awesome. Keep it coming! Fight anti-vaxer deplorables head on. We seriously need to go for the jugular on this issue.",
            "title_similarity": "0.2735545",
            "sentiment_compound": 0.2714
        },
        {
            "id": "h75ikak",
            "score": 4,
            "text": "It's ridiculous that people can even fake this card. Instead of some easily-breakable cardboard paper material that might not fit in your pocket, isn't waterproof and can't fit in a wallet, it should've been a laminated card like your license with a QR code on it for easy scanning and a number just for you. Sadly, such a thing doesn't exist in good ol' 1955.",
            "title_similarity": "0.46427572",
            "sentiment_compound": -0.8088
        },
        {
            "id": "h75inke",
            "score": 2,
            "text": "Did anyone else read this as Time Travelers",
            "title_similarity": "0.16758287",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75j0qk",
            "score": 1,
            "text": "It’s like breaking into the library to steal a library card",
            "title_similarity": "0.37349093",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h75j93x",
            "score": 2,
            "text": "I thought the title said \"time travellers\"",
            "title_similarity": "0.11216892",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75jetb",
            "score": 2,
            "text": "As an American, I'm not surprised they were Americans lmao",
            "title_similarity": "0.15369827",
            "sentiment_compound": 0.4997
        },
        {
            "id": "h75jfzq",
            "score": 2,
            "text": "Imagine getting fined $40,000 total for something you could've done for free. Absolute fucking morons.",
            "title_similarity": "0.74715155",
            "sentiment_compound": 0.1796
        },
        {
            "id": "h75jme9",
            "score": 3,
            "text": "Google shows me individual us salary was  about $36k in 2019.  Imagine if corporations got fines of this scale. What if the SEC did its job?\n\nGlad were being tough on vacc liars but I just wish to see this energy applied to all unlawful behavior. Especially the rich kind.",
            "title_similarity": "0.6414599",
            "sentiment_compound": 0.955
        },
        {
            "id": "h75jphn",
            "score": 2,
            "text": "And those fines will be paid…never.",
            "title_similarity": "0.2011438",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75jqi4",
            "score": 7,
            "text": "Good on Canada! I’m an American and think those 2 asshats deserve to be fined more and jailed for thinking they’re so smart. This damn pandemic has really opened my eyes and I’m sure a lot of others too as to how unbelievably selfish a lot of us are in this country. It’s downright disgusting.",
            "title_similarity": "0.54525685",
            "sentiment_compound": -0.7451
        },
        {
            "id": "h75jrsm",
            "score": 1,
            "text": "Yea this’ll do the trick!",
            "title_similarity": "-0.09467434",
            "sentiment_compound": -0.126
        },
        {
            "id": "h75k6kc",
            "score": 4,
            "text": "Make it 200k and garnish their fucking wages for life the cockknockers.",
            "title_similarity": "0.6789201",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75k7v6",
            "score": 8,
            "text": "Americans trying to cross the border illegally. Why don’t they just follow the law, and follow the rules?",
            "title_similarity": "0.3701334",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75kotl",
            "score": 2,
            "text": "I’d like to know how it was proved they were fake… when I got both of my shots I was given a blank covid card that is signed by a doctor… I could give this card to anyone.  I was never asked for my ID either time.  They’re giving this vaccine out on the street corner.\n\nThere are more checks and balances when I get my oiled changed on my car.",
            "title_similarity": "0.4922299",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h75kuvs",
            "score": 1,
            "text": "They should have just come to Alberta.   Despite rising numbers, the UCP government has decided that they aren't testing and that you don't have to isolate even with a confirmed case.",
            "title_similarity": "0.2889906",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h75l1wl",
            "score": 5,
            "text": "I went to Canada last week and in addition to all the Covid-19 requirements I also needed to name 3 Canadians that were famous during the 80s. I said Michael j Fox, Bryan adams and Corey hart and got in.",
            "title_similarity": "0.46946007",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75l7zv",
            "score": 2,
            "text": "If it’s any consolation to these fools I do feel owned",
            "title_similarity": "0.11450838",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h75m5i0",
            "score": 3,
            "text": "Probably got the idea on Facebook",
            "title_similarity": "0.15303388",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75ngyz",
            "score": 8,
            "text": "A lot of people are trying to fake vaccine cards too.  I've heard people claim its not illegal (it is).  I've heard people say they won't get caught (maybe they won't).  I don't get it.  You don't particularly need them locally, and if you try flying or crossing international borders with one, you better realize there will be a lot of scrutiny on your fake card.",
            "title_similarity": "0.46408987",
            "sentiment_compound": -0.0966
        },
        {
            "id": "h75nr04",
            "score": 5,
            "text": "Good. They are putting others in danger.",
            "title_similarity": "0.060574718",
            "sentiment_compound": -0.128
        },
        {
            "id": "h75nxa4",
            "score": 3,
            "text": "So we’re they deported, never to be welcome in our country again???\n\nIf any of us did that in the USA, you can bet your ass, that’s what they would do!!",
            "title_similarity": "0.473777",
            "sentiment_compound": -0.7966
        },
        {
            "id": "h75nxxv",
            "score": 3,
            "text": "Maybe this bribe will change your mind *shoves over a neat pile of photocopied coins*",
            "title_similarity": "0.48108542",
            "sentiment_compound": 0.296
        },
        {
            "id": "h75o0k8",
            "score": 1,
            "text": "Travelers- badges? We don’t need no f**king badges!",
            "title_similarity": "0.0827713",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h75o5p1",
            "score": 4,
            "text": "So instead of you know like just getting vaccinated they went through the trouble of getting fake docs and now they owe $40K and probably will be barred from entering Canada again ever. Why can't we get a virus that only kills stupid people?",
            "title_similarity": "0.72387934",
            "sentiment_compound": -0.8807
        },
        {
            "id": "h75p5yi",
            "score": 7,
            "text": "So they are illegal immigrants? Oh the irony.",
            "title_similarity": "0.38673666",
            "sentiment_compound": -0.6204
        },
        {
            "id": "h75p7qb",
            "score": 1,
            "text": "I bet /r/NoNewNormal is having a field day over this.",
            "title_similarity": "0.1626522",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75q2se",
            "score": 3,
            "text": "So…is there a way to actually make them pay? Because I know somebody who got a parking ticket on a rental car in another country, but didn’t pay it because they were never going back there…",
            "title_similarity": "0.4253432",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h75qig7",
            "score": 3,
            "text": "In read that as “Time Travelers” and was really curious as to what they were fined for a second.",
            "title_similarity": "0.514607",
            "sentiment_compound": 0.3804
        },
        {
            "id": "h75rx3y",
            "score": 8,
            "text": "Throw the book at them",
            "title_similarity": "0.30130112",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75taha",
            "score": 5,
            "text": "The vaccines are free",
            "title_similarity": "0.09977785",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h75tcgm",
            "score": 3,
            "text": "Their medical bills will be higher. It’s a damn shame since the vaccine is free.50",
            "title_similarity": "0.53215617",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h75th1c",
            "score": 2,
            "text": "I quick read that as “ Time travelers”. \nClick.",
            "title_similarity": "0.14269638",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75tmjg",
            "score": 7,
            "text": "They're American, so this $20,000 is a huge deal. Odds are overwhelming that they only have $1000 or so in savings.",
            "title_similarity": "0.6785085",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h75u4sj",
            "score": 6,
            "text": "That should straight up be jail time.",
            "title_similarity": "0.17841536",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h75u5hd",
            "score": 5,
            "text": "Good! Ya know they can get a real vax card for free, no charge.",
            "title_similarity": "0.22418636",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h75u9ms",
            "score": 2,
            "text": "They live in a nightmare of their own creation redpilled to the gills",
            "title_similarity": "0.3560704",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h75uggt",
            "score": 1,
            "text": "Dam we are in deep shit",
            "title_similarity": "0.17540754",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h75uit6",
            "score": 2,
            "text": "Probably the same ones complaining out borders are shut.. we don’t want your kind here!",
            "title_similarity": "0.23547749",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h75v5mx",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.0727368"
        },
        {
            "id": "h75vgow",
            "score": 8,
            "text": "This is why we need vaccination passports. It's not about \"social control\", it's necessary technology.",
            "title_similarity": "0.24452928",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75vsov",
            "score": 2,
            "text": "Did anyone else see the discussion thread about someone’s mom planning on doing this exact thing?",
            "title_similarity": "0.20092005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75vsps",
            "score": 7,
            "text": "The sense of entitlement of those people, the laws of other countries don't apply if they don't like them.",
            "title_similarity": "0.32795992",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h75w5zk",
            "score": 1,
            "text": "How did the Canadians know?",
            "title_similarity": "0.12834051",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75wq4u",
            "score": 1,
            "text": "Genuinely curious, is it US that enforces the fine or the intended Country of entry?",
            "title_similarity": "0.20804185",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h75xpwd",
            "score": 11,
            "text": "Getting the vaccine would have been much cheaper",
            "title_similarity": "0.31389308",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75xsch",
            "score": 4,
            "text": "They should be banned from Canada forever.",
            "title_similarity": "0.2814053",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h75yk76",
            "score": 8,
            "text": "I’m happy that laws are being enforced and fair judgements for the crimes committed being doled out",
            "title_similarity": "0.1584976",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h75yr11",
            "score": 2,
            "text": "I was concerned when I got my card because I don't know how you'd prove it's valid.  There's no signatures or anything on the card.  I didn't enter the info online anywhere.",
            "title_similarity": "0.26160583",
            "sentiment_compound": -0.296
        },
        {
            "id": "h75yyxa",
            "score": 5,
            "text": "I would have happier to hear them get a year in jail over a fine. What a bunch of douches....",
            "title_similarity": "0.58124495",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h75yzqu",
            "score": 15,
            "text": "The sheer arrogance. Its one thing to try that shit i  your own country, but to try it in another? Fucking insane. \n\nAnd id bet dollars to donuts that these people are for the Wall.  (Assuming im right), the hypocrisy is astounding",
            "title_similarity": "0.5414972",
            "sentiment_compound": -0.5844
        },
        {
            "id": "h75zk2z",
            "score": 18,
            "text": "Canada: Fuck around and find out.",
            "title_similarity": "0.18107572",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h75zt0e",
            "score": 15,
            "text": "Omg just get vaccinated.",
            "title_similarity": "0.22980459",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75zxbg",
            "score": 13,
            "text": "They should lose their passport for a while as well",
            "title_similarity": "0.3407679",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h7603jr",
            "score": 1,
            "text": "How do they verify its validity. I has mine in a different state than I live and by state randomly reaches out for me to get mine",
            "title_similarity": "0.2922629",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h760j8u",
            "score": 3,
            "text": "Should get a steeper fine, jail time and at least a 2 year banning of entry.",
            "title_similarity": "0.56102085",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h760m9f",
            "score": 3,
            "text": "I feel like “assholes” is not a strong enough word, but I just don’t know how else to respond. When Judgment Day comes I want to be able to tell God “I am not with them.”",
            "title_similarity": "0.23930827",
            "sentiment_compound": 0.4587
        },
        {
            "id": "h760zio",
            "score": 9,
            "text": "Several of my coworkers signed documents about their vaccinations and they have fake cards. I can’t wait to see what happens to them.",
            "title_similarity": "0.53597575",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h7624b7",
            "score": 3,
            "text": "I’z got me my fredumb card! Yeehaw… why go thru all that when they could have just vaccinated.",
            "title_similarity": "0.38448268",
            "sentiment_compound": 0.0
        },
        {
            "id": "h762cfo",
            "score": 11,
            "text": "Fuck yea.\n\nFuck these assholes.",
            "title_similarity": "0.21633331",
            "sentiment_compound": -0.8957
        },
        {
            "id": "h76391b",
            "score": 30,
            "text": "Bet these jackasses also spam their social media to the brim about illegal immigrants not respecting their nation's laws constantly while they brazenly flaunt the public health regulations of other countries.",
            "title_similarity": "0.58726835",
            "sentiment_compound": -0.9105
        },
        {
            "id": "h763pr2",
            "score": 6,
            "text": "Nobody’s gonna know…\nNobody’s gonna kno-THEY’RE GONNA KNOW!",
            "title_similarity": "0.046815265",
            "sentiment_compound": 0.0
        },
        {
            "id": "h764h6e",
            "score": 1,
            "text": "They just don't trust like that.",
            "title_similarity": "0.106351085",
            "sentiment_compound": -0.5875
        },
        {
            "id": "h764y0s",
            "score": 13,
            "text": "Imagine taking the time and money to forge vaccine documentation and not...just get vaccinated",
            "title_similarity": "0.47368488",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76606t",
            "score": 6,
            "text": "That this isn’t an Onion article is the most depressing thing I can think of. Hope that 20k is worth your “freedom.” Idiots.",
            "title_similarity": "0.5632783",
            "sentiment_compound": 0.228
        },
        {
            "id": "h7669qy",
            "score": 4,
            "text": "I just went back to Toronto recently, and customs was no joke.",
            "title_similarity": "0.19200075",
            "sentiment_compound": -0.2235
        },
        {
            "id": "h767j1a",
            "score": 2,
            "text": "And the vaccine is free!",
            "title_similarity": "0.096457966",
            "sentiment_compound": 0.5562
        },
        {
            "id": "h767ky5",
            "score": 5,
            "text": "Good- maybe jail them next time too",
            "title_similarity": "0.17177474",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h767vpe",
            "score": 4,
            "text": "Cheaper to just get the free vaccine",
            "title_similarity": "0.3049306",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h7685bk",
            "score": 3,
            "text": "Our documents are literally with a QR code so it wouldn't be/really easy possible to forge them. Don't know how it is outside of EU.",
            "title_similarity": "0.35974354",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h768zg0",
            "score": 1,
            "text": "This is posted twice by two different people in r/news. Which one gets the upvote and which gets the downvote? Find out next time",
            "title_similarity": "0.42732698",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76baef",
            "score": 3,
            "text": "I read “Time Travelers” and thought they were lunatics that used fake vaccinations from the future",
            "title_similarity": "0.5329852",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h76c4qj",
            "score": 1,
            "text": "Sooo… they’re fucking banned from coming back… right?",
            "title_similarity": "0.16397524",
            "sentiment_compound": -0.5095
        },
        {
            "id": "h76cgxr",
            "score": 5,
            "text": "Well, since our own country can't even delve out consequences to these imbeciles, I'm glad that Canada is at least helping us out, sorta...",
            "title_similarity": "0.22647792",
            "sentiment_compound": 0.743
        },
        {
            "id": "h76cjuq",
            "score": 5,
            "text": "Bet florida was involved",
            "title_similarity": "0.017157238",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76ck1r",
            "score": 1,
            "text": "Lifetime of vaccination can be bought in that amount!!",
            "title_similarity": "0.34477177",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76deyw",
            "score": 1,
            "text": "Has anyone been able to identify which “panacea of freedom”, I.e failed state these exemplary individuals hail from?",
            "title_similarity": "0.17379251",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h76diyv",
            "score": 8,
            "text": "bankrupting myself to own the libs",
            "title_similarity": "0.41856858",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76e7f4",
            "score": 5,
            "text": "Isn't the vaccine free, even in America? Why would you go to such lengths...",
            "title_similarity": "0.44473696",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h76fotz",
            "score": 9,
            "text": "See what happens when you try to fuck around in a country that actually takes public wellbeing seriously?",
            "title_similarity": "0.25561094",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h76gfqm",
            "score": 2,
            "text": "I read that as \"two travellers from U.S. find $20,000 each\" and thought, well that's nice. I'm tired. Time to call it a night.",
            "title_similarity": "0.741278",
            "sentiment_compound": 0.25
        },
        {
            "id": "h76hqs0",
            "score": 3,
            "text": "If you ask me throw them in jail while you're at it.\n\nForging documents, lying to the government, endangering lives.",
            "title_similarity": "0.5239624",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h76hsi9",
            "score": 2,
            "text": "I’m curious how they knew the documents were fake. It’s like the easiest thing to fake with just a printer, cardstock and a label maker. By law, there isn’t a National record of it for them to reference, so how would the Canadian government know?",
            "title_similarity": "0.4094584",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h76i7jn",
            "score": 1,
            "text": "Same thing happened in Belgium. In comparison to this, they basically got away with it.",
            "title_similarity": "0.25840688",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76ia6x",
            "score": 1,
            "text": "Alright then, I guess it's time to deport these undocumented aliens back to their sh*those countries am I right? Get f*cked rednecks",
            "title_similarity": "0.46065414",
            "sentiment_compound": 0.25
        },
        {
            "id": "h76ibss",
            "score": 2,
            "text": "Good, I wish those stupid mother fuckers paid even more",
            "title_similarity": "0.4382134",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h76ig8e",
            "score": 3,
            "text": "\"What? No, we don't need to obey your laws or respect your citizens - we're american!\"",
            "title_similarity": "0.23769079",
            "sentiment_compound": 0.5255
        },
        {
            "id": "h76jik9",
            "score": 3,
            "text": "These antivaxxers deserve this.",
            "title_similarity": "0.054308355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76l35k",
            "score": 1,
            "text": "Bur dit they cross the border?",
            "title_similarity": "0.13376205",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76n08t",
            "score": 3,
            "text": "And vaccines are free.",
            "title_similarity": "0.03729115",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h76nrft",
            "score": 3,
            "text": "Super funny they could have avoided that with a free vaccine.",
            "title_similarity": "0.34065348",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h76p7fl",
            "score": 1,
            "text": "I'm traveling to Germany soon, I was under the impression I would be good with my Vax card?",
            "title_similarity": "0.25288877",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h76q4nx",
            "score": 4,
            "text": "Ludicrous ,they could hvave taken free vaccination ,but they choosed to counterfeit fake documents instead.The cost is extra 20,000 dollars,which is perhaps over their traveling budget in the first place.",
            "title_similarity": "0.75806123",
            "sentiment_compound": -0.5789
        },
        {
            "id": "h76s59h",
            "score": 5,
            "text": "Thank you Americans for your patronage, those unused vaccines are being donated to poorer countries like mine so more lives can be saved.",
            "title_similarity": "0.49575394",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h76ssvk",
            "score": 1,
            "text": "who didn't see this coming?",
            "title_similarity": "-0.01994957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76vxgo",
            "score": 1,
            "text": "I read that as time travellers, what the fuck is wrong with me.",
            "title_similarity": "0.25822026",
            "sentiment_compound": -0.765
        },
        {
            "id": "h76w1bw",
            "score": 2,
            "text": "lolol very used to it if you’re gonna mandate that shit",
            "title_similarity": "0.091497585",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h76w271",
            "score": 1,
            "text": "I read that as time travelers…",
            "title_similarity": "0.06553494",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76wjb9",
            "score": 2,
            "text": "But it’s only 20k in Canadian money.",
            "title_similarity": "0.5046891",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76wwl0",
            "score": 3,
            "text": "You have physical vaccination cards?",
            "title_similarity": "0.21590522",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76xowc",
            "score": 3,
            "text": "A crime punishable by a fee is a crime that only exists for the poor.",
            "title_similarity": "0.4079733",
            "sentiment_compound": -0.9186
        },
        {
            "id": "h772u0y",
            "score": 1,
            "text": "I read that as time travellers and thought that was a very low fine.",
            "title_similarity": "0.32641196",
            "sentiment_compound": -0.081
        },
        {
            "id": "h77bwnj",
            "score": 1,
            "text": "I went to Canada on a fishing trip in the early 90’s, before needing a passport to enter.  One of the older guys that had been fishing up there for 30 years thought it would be funny to tell the border guard he wanted a cheeseburger and a coke like he was at a drive thru.. The border agents didn’t think it eases funny. They had all our vehicles pull over and pull out everything in there coolers and unwrap every fish!  We were there over and hour getting everything checked.  They about put a gag in the guys mouth when they crossed the border the next year! Lol.",
            "title_similarity": "0.6000657",
            "sentiment_compound": 0.8906
        },
        {
            "id": "h77hfpj",
            "score": 1,
            "text": "Is that really worth it?",
            "title_similarity": "-0.045769528",
            "sentiment_compound": 0.2944
        },
        {
            "id": "h77l1r2",
            "score": 3,
            "text": "We aren't sending our best.",
            "title_similarity": "0.05564547",
            "sentiment_compound": -0.5216
        },
        {
            "id": "h77qkri",
            "score": 1,
            "text": "Hope they are permanently barred from entry as Personas non gratas.",
            "title_similarity": "0.224044",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h77rksg",
            "score": 1,
            "text": "Travelling is really stupid in America now, they will charm you an arm & leg to get a new vaccination from their doctors if they see that your vaccination test is a day off of the ones they allow that no one warns you about.",
            "title_similarity": "0.6049019",
            "sentiment_compound": -0.2493
        },
        {
            "id": "h77rky8",
            "score": 2,
            "text": "Haha, eat it fucking assholes",
            "title_similarity": "0.2570145",
            "sentiment_compound": -0.2716
        },
        {
            "id": "h780bmv",
            "score": 2,
            "text": "What about people who got the JJ vaccine? That might as well have been fake lol",
            "title_similarity": "0.39855102",
            "sentiment_compound": 0.5473
        },
        {
            "id": "h782tj1",
            "score": 1,
            "text": "Lol. The picture of snow piles at the border.",
            "title_similarity": "0.20770682",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7998aw",
            "score": 2,
            "text": "No. Not $100,000. Test them for covid in every way. If anything is found, charge them with bioterrorism.",
            "title_similarity": "0.53551674",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7b9hky",
            "score": 1,
            "text": "We're not sending our best.",
            "title_similarity": "0.073043965",
            "sentiment_compound": -0.5216
        },
        {
            "id": "h7c142t",
            "score": 1,
            "text": "Lots of snow for July in Canada.",
            "title_similarity": "0.29456306",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7cq01d",
            "score": 1,
            "text": "This is the original press statement from the Public Health Agency of Canada:\n\n [https://www.canada.ca/en/public-health/news/2021/07/two-individuals-fined-for-providing-false-information-related-to-covid-19-proof-of-vaccination-credentials-and-pre-departure-tests.html](https://www.canada.ca/en/public-health/news/2021/07/two-individuals-fined-for-providing-false-information-related-to-covid-19-proof-of-vaccination-credentials-and-pre-departure-tests.html)\n\nNowhere in there does it mention the nationality of the travelers, so stop speculating about it.",
            "title_similarity": "0.5163292",
            "sentiment_compound": -0.1447
        },
        {
            "id": "h7dwkz3",
            "score": 2,
            "text": "I was visiting a respiratory clinic last week, and the nurse told me that two of his not very close neighbors asked him to get them vaccination cards, even though they have not taken the vaccine.\n\nThere's probably a lot of forgeries out there.",
            "title_similarity": "0.59384686",
            "sentiment_compound": 0.0
        },
        {
            "id": "h84fnl6",
            "score": 1,
            "text": "seems like the conspirac theorists from a year ago were onto something when they said soon youll need a proof of vaccine to travel",
            "title_similarity": "0.47507823",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9xgcf9",
            "score": 1,
            "text": "I would say 6 months in jail is proper justice for possibly spready a known infectious virus across borders.",
            "title_similarity": "0.52882725",
            "sentiment_compound": 0.5267
        }
    ]
}