{
    "United Airlines will require its 67,000 U.S. employees to get vaccinated, a first for U.S. carriers\n": [
        {
            "id": "h7xinz1",
            "score": 91,
            "text": "Yep, if people aren't going to do it on their own, they need to be motivated to do it.  How's unemployment sound?   These people need to understand there are consequences to their selfishness.",
            "title_similarity": "0.22237384",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h7xjq0g",
            "score": 75,
            "text": "And screw you American Airlines whose CEO has announced that they won’t mandate vaccines. The official airline of the plague.  Thank you United.",
            "title_similarity": "0.5418136",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h7xqaj7",
            "score": 55,
            "text": "This is great news. No.\n\nThis is AMAZING news. \n\nBest news I heard all week.\n\nWe need more companies to make it mandatory.\n\nLet's STOP the virus!",
            "title_similarity": "0.5342595",
            "sentiment_compound": 0.9098
        },
        {
            "id": "h7xw353",
            "score": -81,
            "text": "[removed]",
            "title_similarity": "-0.056563057"
        },
        {
            "id": "h7xl08y",
            "score": 49,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7xvi2f",
            "score": 4,
            "text": "Any anti vaxx scumbag should be fired and not hired. We don’t need idiot red hats ruining it for the rest of us.",
            "title_similarity": "0.23440458",
            "sentiment_compound": -0.9371
        },
        {
            "id": "h7xin9d",
            "score": 32,
            "text": "Awesome. Now do the passengers.",
            "title_similarity": "0.06831415",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h7xhexd",
            "score": 57,
            "text": "Why not make it a requirement for passengers too?",
            "title_similarity": "0.16531819",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xdrol",
            "score": 48,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7yc1ir",
            "score": 6,
            "text": "A vaccine so safe that government and businesses need to force people to take it.",
            "title_similarity": "0.49527484",
            "sentiment_compound": 0.5777
        },
        {
            "id": "h7xj8ve",
            "score": 47,
            "text": "This is a good. Next up? Require it of all passengers.",
            "title_similarity": "0.28783977",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7xibya",
            "score": 91,
            "text": "My buddies dad works for United and is a YUGE 45 supporter. \n\nI want to text him and see how he is but I’m sure he’s having a fucking melt down. 😅",
            "title_similarity": "0.46724105",
            "sentiment_compound": 0.848
        },
        {
            "id": "h7xjbhr",
            "score": -36,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xjti6",
            "score": 8,
            "text": "I like these snowball reports coming out from corps this week. If antivax people can’t work anywhere, maybe they’ll stay home, which is a decent runner up to getting vaccinated.",
            "title_similarity": "0.57733804",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7xjy0c",
            "score": 7,
            "text": "Now do the passengers.",
            "title_similarity": "0.04997868",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xjd9z",
            "score": 65,
            "text": "Basically the same thing as me required to have a forklift license. It's for my safety *and* yours.\n\nEdit: You're failing to see the point that if you don't want to get a vaccine and work at an airport, you should start your own airline and make your own rules. Fuck yeah! The American dream!\n\nDownvote me anti-vaxxers. My favorite part of your group is how you all beg for the vaccine when you're in the hospital dying. But fuck yeah, muh freedoms!",
            "title_similarity": "0.5718235",
            "sentiment_compound": 0.2993
        },
        {
            "id": "h7y0671",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xjuca",
            "score": 7,
            "text": "Good now do it for passengers.",
            "title_similarity": "0.08304355",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7xjkqg",
            "score": 2,
            "text": "Why did this take so long?",
            "title_similarity": "0.16977635",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xzsz9",
            "score": -10,
            "text": "its pretty sad that people think its okay to force a vaccine on people against their wishes (people will do it to keep their job)\n\nif you are vaccinated , why are you worried about the next person? you supposed to be safe right? if you are not safe with the vaccine, you should never have gotten it then. just think about that",
            "title_similarity": "0.43404883",
            "sentiment_compound": 0.308
        },
        {
            "id": "h7xoh8v",
            "score": -83,
            "text": "These comments = tell me how you would have been a Nazi in the 30s without telling me",
            "title_similarity": "0.48609173",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7y4axn",
            "score": -1,
            "text": "Good. Now make it so all customers have to be vaccinated or they can't fly.",
            "title_similarity": "0.5852344",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7xus3g",
            "score": 9,
            "text": "I'm sure conservative snow flakes won't absolutely lose their shit over this.",
            "title_similarity": "0.3044871",
            "sentiment_compound": -0.0229
        },
        {
            "id": "h7xk8il",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xh4w3",
            "score": 6,
            "text": "Hopefully it'll have a domino effect with the rest of the carriers",
            "title_similarity": "0.18553995",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h7xik6n",
            "score": -13,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7xh8pm",
            "score": 78,
            "text": "I imagine this will not sit well with their conservative and black employees. \n\nWeird that those two groups have bonded over vaccination hesitancy but here we are.",
            "title_similarity": "0.46455115",
            "sentiment_compound": -0.2975
        },
        {
            "id": "h7xns76",
            "score": -7,
            "text": "Do you people even hear yourself?",
            "title_similarity": "0.009752821",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xh6hj",
            "score": -11,
            "text": "The state that I am stuck in has outlawed mask mandates.  I wonder how that will work?  Covid Kim has doubled down on free 'Murica.",
            "title_similarity": "0.47799507",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7xk56x",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7y79xt",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7xspfe",
            "score": -31,
            "text": "What about:\n\n1) those who already had the virus\n\n2) those ineligible for the vaccine\n\n3) informed consent\n\nInteresting to see this authoritarian policy happen in the airline industry before the healthcare industry. Good luck America.",
            "title_similarity": "0.5930964",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h7xjj8u",
            "score": -39,
            "text": "[removed]",
            "title_similarity": "-0.056563057"
        },
        {
            "id": "h7xtrnr",
            "score": 0,
            "text": "Wow, so they are finally doing the adult thing and want an attaboy for it?",
            "title_similarity": "0.3256132",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h7xunxa",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7xu9qp",
            "score": -1,
            "text": "**Everyone pay attention**\n\nThere will be A LOT of conservatives who try to get religious or medical exceptions. \n\n- Put Pressure on physician oversight boards and politicians to ensure these are not thrown out whimsically.\n\n- I'm already hearing conservative acquaintances go, \"Oh I know Dr. X will write me a medical excuse so I don't have to get it!\"\n\nEnforcing employees to get vaccinated will help; but a lot of these conspiracy conservative loonies will still try to skirt the system.",
            "title_similarity": "0.50534433",
            "sentiment_compound": -0.5983
        },
        {
            "id": "h7xiw3o",
            "score": 41,
            "text": "I guess next time I fly, I’m flying United.",
            "title_similarity": "0.32959574",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7xrlwv",
            "score": 9,
            "text": "Last time I flew I overheard both flight attendants talking about How the vaccine is bs and covid is a hoax. I’m like great, not the people I want handling my food and drink in a tin can 39k get above the ground.",
            "title_similarity": "0.5663957",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h7xlav9",
            "score": -31,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xgd0a",
            "score": 121,
            "text": "My prediction. Roughly 60,000 of these employees are going to be excited about this policy. Most probably are already vaccinated. \n\nBut we’re going to hear a lot more from the overly vocal 7,000.\n\nThe obnoxious minority.",
            "title_similarity": "0.6983019",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h7xkybf",
            "score": 13,
            "text": "> Employees must be vaccinated five weeks after the FDA fully approves a Covid vaccine or five weeks after Sept. 20, whichever is first.\n\nI don't agree with this. Why not just 5 weeks after it is FDA approved? What if it never gets approved?",
            "title_similarity": "0.6609101",
            "sentiment_compound": 0.4041
        },
        {
            "id": "h7ysbw5",
            "score": 1,
            "text": "It's sad how yall supporting politicians and companies breaking human rights by mandating the vaccine.\n\nJust shows how you're brainwashed by both the media and your authorities.\n\nIf r/Nonewnirmal ever gets banned, this will only further šroove you're are idiots.",
            "title_similarity": "0.43839568",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h7xpikb",
            "score": 17,
            "text": "It would be so much easier if individual companies didn't need to make their own decisions. Vaccines should be completely mandatory to even leave your damn house. You don't trust the science? Good, you don't have to, because global experts already did that work for you.",
            "title_similarity": "0.49519578",
            "sentiment_compound": 0.2428
        },
        {
            "id": "h7xqwb2",
            "score": -16,
            "text": "This opens up a huge liability for companies jumping on board with this.  The pharmacutical  company isn't liable.  Your health insurance WILL NOT cover side effects. So, who will it fall on when you experience side effects? You!  BUT, your employer required it.  The employer is now liable.",
            "title_similarity": "0.48012394",
            "sentiment_compound": 0.1386
        },
        {
            "id": "h7xvt3x",
            "score": -18,
            "text": "When everyone is vaccinated, and people are still getting covid, who are all you authoritarians going to focus your blame on then?",
            "title_similarity": "0.5273318",
            "sentiment_compound": -0.34
        },
        {
            "id": "h7xdfn4",
            "score": 142,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xz4n7",
            "score": -3,
            "text": "The bell tolls for thee, anti science people.  You’re next :)",
            "title_similarity": "0.28785625",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h7xgzye",
            "score": 37,
            "text": "Kinda like how schools require vaccinations. Makes perfect sense.",
            "title_similarity": "0.3768196",
            "sentiment_compound": 0.7102
        },
        {
            "id": "h7ymp90",
            "score": 6,
            "text": "USA is weird. I used to think you were free, now when an American says freedom I kind of chuckle a bit. Okay, you can have a pistol... But it's easier to thrown in prison, your leader is trying to get the military to enforce citizens vaccinations, your 'freedom of speech' isn't real, all of the woke vocabulary came from the states. Jeez guys, your government is treading on you",
            "title_similarity": "0.5211003",
            "sentiment_compound": 0.8911
        },
        {
            "id": "h7xgr8l",
            "score": 65,
            "text": ">a first for U.S. carriers\n\nIt's still hurting my brain that there is any controversy here at all.",
            "title_similarity": "0.34454304",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h7xpiat",
            "score": -24,
            "text": "[mRNA vaccines do not even slow the spread of COVID](https://www.cdc.gov/mmwr/volumes/70/wr/mm7031e2.htm?s_cid=mm7031e2_w)\n\nThere’s really no justification for forcing people who don’t want the vaccine to get it, we are just normalizing taking away more freedom of choice. How can you support abortion rights but not people’s’ right to choose vaccination when doing so doesn’t matter at all to the people around you?",
            "title_similarity": "0.46926767",
            "sentiment_compound": 0.603
        },
        {
            "id": "h7xyza3",
            "score": -15,
            "text": "Forcing people to do something to their body isn't right. Especially with all of the recent news coming out with how much of a joke these vaccines are. The delta may as well just make someone a active carrier, people that were/are naturally resistant are being cornered in and essentially forced to take it. People are already having issues with their hearts and other things for short sided effects. But you know it's just your heart. We still don't know the long term side effects from these experiments... Meanwhile the largest group of people who are actually in danger to covid. They will never have to really deal with the long term side effects and are the ones making all these mandates with immunity towards the companies and products. Screw that. That generation already has ruined enough.",
            "title_similarity": "0.4754602",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h7xvhl8",
            "score": -1,
            "text": "Good move! Biden should use the FAA to require airlines to check proof of vaccination before allowing people to fly. That would curb the pandemic real quick.",
            "title_similarity": "0.54969454",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h7xstyg",
            "score": 1,
            "text": "How the hell is this not already a thing.  These people literally fly all over the country and are regulated by the FAA.  Wouldnt have even been any red tape or bickering, just require it.  Even the employees who just work there are with people who have been all over and crammed into tiny cabins.",
            "title_similarity": "0.50125283",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h7xzoaa",
            "score": 3,
            "text": "Hell yeah. if the government isn't going to mandate it, the private sector mandating it is the next best thing that can happen.",
            "title_similarity": "0.30181175",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h7y7fko",
            "score": 8,
            "text": "So, a company is requiring it’s workers to get a vaccine that, on their website, says it’s not fda approved, AND insurance companies will not pay for medical needs later if they (the insurance company) decide the experimental drug caused any part of the problem. I cannot wait for the fucking lawsuits.",
            "title_similarity": "0.55615747",
            "sentiment_compound": -0.6837
        },
        {
            "id": "h7ypu9q",
            "score": 4,
            "text": "I absolutely think everyone should get vaccinated, but requiring it feels like a dangerous precedent",
            "title_similarity": "0.38141727",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h7xkzre",
            "score": 2,
            "text": "bunch of employees dying of covid or put in intensive care or even visiting ER going to raise their insurance rates.\n\n\ncorporations care about profit.\n\n\nin this case,  it happens to also benefit everyone else on the planet,  but their motivation is greed.",
            "title_similarity": "0.509655",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h7y2lft",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7y7b9w",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xi3em",
            "score": 15,
            "text": "You know things are messed up when United is the voice of reason.",
            "title_similarity": "0.08760363",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h7xpa43",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xls41",
            "score": 7,
            "text": "Fine. I will now fly United.",
            "title_similarity": "0.17176582",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h7xnrog",
            "score": 9,
            "text": "Are we just going to assume, or admit, that a large percentage of Americans are complete ovine idiots blindly following the conservative idiocracy they worship?  Do these hesitant or obstinate slugs have to be forced by the need to earn a living in order to do the sensible and right thing?  Holy shit - just get the fucking shots already.",
            "title_similarity": "0.44781277",
            "sentiment_compound": -0.7998
        },
        {
            "id": "h7yjwmb",
            "score": 1,
            "text": "What happens if you have an adverse reaction to the vaccine after being forced to get it",
            "title_similarity": "0.3714943",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h7xl9v0",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7y72gr",
            "score": 1,
            "text": "This is the only intelligent choice.\n\nEvery business should be mandating at this point. The financial risk is simply too high not to, not to mention the irreparable harm to your brand if a major outbreak tied to your lax vaccine policy is exposed in the media.",
            "title_similarity": "0.43857384",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h7ynwon",
            "score": 0,
            "text": "but in the possibility of dangerous side effects, you’re not allowed to sue us or the vaccine company because you chose willingly to receive the vaccine. We didn’t jab you with it, we just may or may not insinuated that your job could be on the line.",
            "title_similarity": "0.3630545",
            "sentiment_compound": -0.631
        },
        {
            "id": "h7xgukz",
            "score": -3,
            "text": "Would be nice to give employers a website to actually confirm this happened. Currently just yes or no.",
            "title_similarity": "0.2771861",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h7xjqmv",
            "score": -4,
            "text": "Notice that corporations are leading the charge - if government is doing it resistance will come.",
            "title_similarity": "0.3993144",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xz9pk",
            "score": -12,
            "text": "You geniuses are giving these corporations power to tell you what you do with your health.  This won't be the end of things.",
            "title_similarity": "0.41849566",
            "sentiment_compound": 0.34
        },
        {
            "id": "h7xsat9",
            "score": 2,
            "text": "Getting the vaccine is the AMERICAN thing to do. Don’t endanger your kids or your friend’s kids just because YOU are scared of possibly having mild side effects for a day.",
            "title_similarity": "0.44348893",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h7y04po",
            "score": 3,
            "text": "Good. More companies need to do this. I'm tired of hearing the misinformed comparing forcing the shot on the public to Nazi Germany FFS. People dont want to be around other people that aren't vaccinated. This will cause companies to lose money one way or the other. So make employees   get the shot to help keep their businesses afloat...and protect their employees and the public. I see it as a win/win.",
            "title_similarity": "0.45801306",
            "sentiment_compound": -0.6961
        },
        {
            "id": "h7y5n8l",
            "score": 3,
            "text": "This is going to become a nationwide epidemic of forced terminations. The next month is going to be brutal...#2years to flatten the curve",
            "title_similarity": "0.51958376",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h7xpi4b",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "-0.023195429"
        },
        {
            "id": "h7xleoq",
            "score": 33,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xpix2",
            "score": -13,
            "text": "Soon you will be required to take a DNA test prior to employment to rule out candidates that may cost more due to illness or disease risk.",
            "title_similarity": "0.47333956",
            "sentiment_compound": -0.6204
        },
        {
            "id": "h7xtp3q",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xperj",
            "score": 8,
            "text": "My moms a flight attendant for another major US airline and my dad was just saying how he’s surprised they haven’t asked my mom to get the covid vaccine. My mom is very against it, she’s very conservative. My dad and I just signed up to get it. My mom was not happy with us and was talking about her friend who knows a doctor who said they wouldn’t get the vaccine, and my dad actually called my mom out on her shit for once and said that her friend is a radical conservative who attended the Jan 6 Attack in DC. I lose my shit because this is the first time I’d ever heard her friend did this, and my mom was defending her for it! Like “oh she wasn’t actually in the building” and I’m flipping my shit but we’re in public so I can’t really flip my shit. Mind you we live in AZ so this woman literally flew to the Jan 6 attack. There’s absolutely no redeeming that. But this type of thing is so typical for my mom, it’s just absolutely insane how brainwashed she is in every way and it makes me sad. So anyways it’ll be interesting if her airline makes her get a vaccine to keep her job.",
            "title_similarity": "0.58420146",
            "sentiment_compound": -0.9719
        },
        {
            "id": "h7xwb9i",
            "score": 7,
            "text": "To all anti vaxxers, shut the fuck up and get the vaccine",
            "title_similarity": "0.37591738",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h7xmbwg",
            "score": 3,
            "text": "Good. I’m waiting for my employer to do the same. They moronically brought all of us back in last Monday. Within a week, 4/10 of us with vaccines got covid from the 2 dudes who are anti vaxx who came to work sick. No symptoms by those of us that are vaccinated but we now have to stay out of the office for two weeks.  Its so annoying that society is slowing down because these anti science trump cowards are dragging us down.",
            "title_similarity": "0.6521199",
            "sentiment_compound": -0.8965
        },
        {
            "id": "h7xs8jd",
            "score": 4,
            "text": "Ironic how instead of governments mandating vaccination, we have companies do it for us.",
            "title_similarity": "0.51448894",
            "sentiment_compound": -0.128
        },
        {
            "id": "h7xwugc",
            "score": 4,
            "text": "Nice, I hope all major airlines do this",
            "title_similarity": "0.41078174",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h7y7mx9",
            "score": -4,
            "text": "get vaccinated or you're the literal scum of the earth. my god. be less fucking stupid.",
            "title_similarity": "0.37356323",
            "sentiment_compound": -0.3214
        },
        {
            "id": "h7ykp3g",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7xuivd",
            "score": -22,
            "text": "Such Bullshit. People need to wake up. This is second hand citizenship occurring right in front of us.  Has history taught us nothing? None of this seems terrifyingly familiar? This is just the first step.i feel as if we have already lost.",
            "title_similarity": "0.46095806",
            "sentiment_compound": -0.504
        },
        {
            "id": "h7xyaef",
            "score": 0,
            "text": "Really hoping JetBlue adopts this too.",
            "title_similarity": "0.23866299",
            "sentiment_compound": 0.6195
        },
        {
            "id": "h7yjbd7",
            "score": 0,
            "text": "In other news United wants to reduce diversity and this is just the ticket!",
            "title_similarity": "0.24302983",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h7zfm1r",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h807hgd",
            "score": 0,
            "text": "And for anyone healthy that dies or suffers major side effects from the vaccine because you were forced to take it, sorry, the positives outweight the negatives",
            "title_similarity": "0.5074023",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h7xiur6",
            "score": 3,
            "text": "Come on Delta, don't let me down here...  \n  \nEdit: the airline!",
            "title_similarity": "0.37309432",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xoz2w",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7xnkki",
            "score": -6,
            "text": "Would they be liable if somone has a bad reaction to the vaccine? I've heard that a small percentage of people have had allergic reactions.",
            "title_similarity": "0.4677354",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h7xm5mx",
            "score": 0,
            "text": "Am I the only one who thought this had happened already? I mean, a ton of their employees are stuck in a tin can with members of the public 30000 feet up in the air for hours. Others are in airports behind desks handling tickets and baggage from people all day long. This seems like a necessity anyway. \n\nIs it a big deal because they are requiring it of the back office staff now too?",
            "title_similarity": "0.634205",
            "sentiment_compound": 0.2168
        },
        {
            "id": "h7y317z",
            "score": 1,
            "text": "Nice. Here's a little song I'd like to sing. 🎶Take this job and shove it! I ain't workin' here no more!🎶",
            "title_similarity": "0.23436724",
            "sentiment_compound": 0.7585
        },
        {
            "id": "h7y5m1l",
            "score": 2,
            "text": "Canceling flights because they don't have the staff but ya, this will help.",
            "title_similarity": "0.38162592",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h7ydbj7",
            "score": 3,
            "text": "As a person who would have much preferred NOT to get this damn vaccine, I must say that I give up,  I will have to get it done anyway because if I don't they will take away my ability to work, travel and live. I am no longer a free man. Here's my arm , assholes, jab away at me.",
            "title_similarity": "0.37923348",
            "sentiment_compound": -0.5461
        },
        {
            "id": "h7ye5vy",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7z9fgy",
            "score": -1,
            "text": "In the breakroom, just now, all the trumpsucks were talking about how we should have a class action lawsut over being required to get the vaccine. As I was going out to work my flight, the main instigator poked me in the arm and said \"There you go, buddy. There's your shot!\" To which I replied, \"Oh, no. I already got mine. I'm smart. I don't wanna die.\"",
            "title_similarity": "0.48763186",
            "sentiment_compound": 0.7301
        },
        {
            "id": "h7xkrb1",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xq5qs",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7y2ech",
            "score": -9,
            "text": "A 'vaccine' that doesn't prevent catching or spreading the virus, as the data shows, and that has killed at least 50k globally so far \n\nAll to protect from a virus with a survival rate of 99.7%\n\nCritical thinking is dead. The zombie army grows 👌",
            "title_similarity": "0.60002154",
            "sentiment_compound": -0.5332
        },
        {
            "id": "h7xwdaz",
            "score": 7,
            "text": "Get vaxxed or fuck off. I’m fucking done with you.",
            "title_similarity": "0.111383274",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h7xz2bu",
            "score": -3,
            "text": "\"Give me your money or else I'll shoot you... Thank you for willingly giving me your wallet as a gift, I appreciate it.\"",
            "title_similarity": "0.21080315",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h7y3l95",
            "score": 4,
            "text": "I don’t understand anyone who hasn’t gotten a vaccine yet. I have 0 sympathy for people getting hospitalized with Covid right now. We did our part, sheltered in place, got vaccine, etc. I shouldn’t have to wear my mask AGAIN or shutdown to protect the lazy and uninformed. Please don’t tell me it’s to protect those under 12 because they will be just fine",
            "title_similarity": "0.5208523",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h7yf3oc",
            "score": -5,
            "text": "Would never fly with them again! You can’t force people to give up their body autonomy to work. How disgusting .",
            "title_similarity": "0.32555068",
            "sentiment_compound": -0.5707
        },
        {
            "id": "h7xcim9",
            "score": 82,
            "text": "Good idea. Spending a long time in a small confided space which may or may not have much air circulation (see comments below) is a great way to spread the virus.",
            "title_similarity": "0.30210823",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h7xojqe",
            "score": 13,
            "text": "It's insane that this has not been standard for all airlines since the vaccines became available. Just like hospitals, airlines are high risk venues for the spread of this disease.",
            "title_similarity": "0.58572763",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h7zba1t",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7yerxp",
            "score": -6,
            "text": "Vaccine mandates are wrong. This isn’t even FDA approved.",
            "title_similarity": "0.31376597",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h7xrcvq",
            "score": 2,
            "text": "I love this.\n\nI will enjoy eating popcorn while reading the antivax morons outrage posts.",
            "title_similarity": "0.16633171",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7xvcn8",
            "score": 3,
            "text": "This is a good move by United, but I'm still not forgiving them for knocking a paying customer unconscious and then dragging him off the flight.\n\nhttps://youtu.be/VrDWY6C1178",
            "title_similarity": "0.4450224",
            "sentiment_compound": -0.0667
        },
        {
            "id": "h7y5lfa",
            "score": -3,
            "text": "So should they unionize and tell the big corporation no?  Or will this make the libs who have no principles say no to unionization?  let's watch it unfold while I'm downvoted.",
            "title_similarity": "0.41707894",
            "sentiment_compound": -0.5803
        },
        {
            "id": "h7y7gf0",
            "score": 2,
            "text": "This is good news. Those trying to avoid the vaccine should be easily identifiable and banned from appearing in public, profiting off any sort of government funded works or interacting at all with those of us who are.",
            "title_similarity": "0.31938323",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h7ywimt",
            "score": 2,
            "text": "Anti-vaxxers must be banned everywhere. They are partners of covid in spreading, and  they are helping covid creates more variants.\n\n\\#FACT",
            "title_similarity": "0.34198695",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h7xsv7v",
            "score": 25,
            "text": "Cool, can they do it for the passengers too? Similar to eating in restaurants, air travel isn’t a God-given right. There are laws around common carriers, but if the feds are requiring it for their employees, I’m sure the lawyers for the airlines can find a way without violating applicable law.",
            "title_similarity": "0.48665717",
            "sentiment_compound": 0.8113
        },
        {
            "id": "h7xyov8",
            "score": 8,
            "text": "Good. Keep the trend going. It sucks it has to come to hurting wallets to make people quit being stupid but here we are. People need to get the vaccine and stop whining. Nobody is happy about covid and not getting vaccinated isn't \"sticking it to the libs\". It just makes you look like a dumb asshole.",
            "title_similarity": "0.39896804",
            "sentiment_compound": -0.2382
        },
        {
            "id": "h7y0gwj",
            "score": -11,
            "text": "I can’t see how this is constitutional.",
            "title_similarity": "0.123110965",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xj0v8",
            "score": -32,
            "text": "Reality is - sadly - vaccine or not… masks on airplanes will be a thing indefinitely. Now that authority figures have had a taste of power, they’re not going to simply give it up.",
            "title_similarity": "0.4626515",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h7xqt8k",
            "score": 4,
            "text": "I'm a United airlines supervisor and can say this is certain, the unions are going to fight this tooth and nail. There will be no end date for this as it will get drug out in court.\n\nI, myself am vaccinated. And push for everyone to get vaccinated too. However the whining and crying that comes from my employees about mask use, is astounding. I too hate wearing masks, but am tired of covid and want to do everything I can to help. \n\nI can't wait to get back to work, to maybe see actual tears flow over this announcement.",
            "title_similarity": "0.487174",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h7xvpzr",
            "score": -4,
            "text": "From the Nuremberg code regarding medical experimentation (i.e. the Covid \"vaccines\"): \"The voluntary consent of the human subject is absolutely essential. This means that the person involved should have legal capacity to give consent; should be so situated as to be able to exercise free power of choice, without the intervention of any element of force, fraud, deceit, duress, overreaching, or other ulterior form of constraint or coercion; and should have sufficient knowledge and comprehension of the elements of the subject matter involved as to enable him to make an understanding and enlightened decision.\"",
            "title_similarity": "0.3481133",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h7y46og",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xji8n",
            "score": 2,
            "text": "It’s the responsible thing to do.",
            "title_similarity": "-0.0013575475",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7xmns6",
            "score": -2,
            "text": "Guess a lot of mechanics are quitting because a lot are hard headed about getting vaccinated.",
            "title_similarity": "0.48538804",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h7xot79",
            "score": -1,
            "text": "Remember when United Airlines overbooked a flight and forcefully removed a passenger? I remember.",
            "title_similarity": "0.6016264",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7xr083",
            "score": 0,
            "text": "and before anyone loses their mind, i had to provide a drivers license or passport and proof of citizenship before taking any job\n\nnone of this is new",
            "title_similarity": "0.4695588",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h7xt1cz",
            "score": 1,
            "text": "Good. Hopefully lots more companies and institutions following suit.",
            "title_similarity": "0.26093936",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h7xvswp",
            "score": -1,
            "text": "Lol workers forced to be vaccinated but the general population has no care to be vaccinated. You are paying people to get vaccinated. *PAYING*. That suspicious as fuck.",
            "title_similarity": "0.53006995",
            "sentiment_compound": -0.9108
        },
        {
            "id": "h7xyjvz",
            "score": 0,
            "text": "That’s actually a good move on their part. I can see that be a determining factor for me.",
            "title_similarity": "0.07537668",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7z4rzp",
            "score": -2,
            "text": "Don't know why anyone's cheering. Just sets a precedent that employers can now mandate health decisions for their employees, becoming even more intrusive than they already are. \n\nAnd I'm someone who got the Moderna shots and who is on the Left part of the spectrum. \n\nRemember when liberals were generally supportive of employers ending their restrictions of people with tattoos or \"natural\" hairstyles? But now they're clamoring for big business to impose restrictions; what happened to the American liberal disdain for corpocrats and big business? We trust them now?",
            "title_similarity": "0.499869",
            "sentiment_compound": 0.3695
        },
        {
            "id": "h7z4zkj",
            "score": -2,
            "text": "Other airlines, like mine, are waiting to follow.\n\nBonus is we’d get rid of a lot of racists and pro trumpers.  And a jump in seniority.",
            "title_similarity": "0.49840564",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7zb51q",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xsq6d",
            "score": -14,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7xxrgx",
            "score": -14,
            "text": "This really sucks because I genuinely believe I have a higher chance of dying from the shot then I do from catching COVID. Freedom was taken away a little bit today",
            "title_similarity": "0.32579517",
            "sentiment_compound": 0.5279
        },
        {
            "id": "h7xladi",
            "score": 9,
            "text": "Serious question: What about the small minority of people who are unable to get the vaccine for medical reasons? (i.e. autoimmune issues)\n\nIm Very Pro vaccine btw",
            "title_similarity": "0.4726475",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h7xkb84",
            "score": 0,
            "text": "This is lovely to hear, hopefully this will reduce the spread even more.",
            "title_similarity": "0.10400152",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h7y2gnb",
            "score": 0,
            "text": "My next flight will be with them",
            "title_similarity": "0.22166035",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ye4o6",
            "score": 0,
            "text": "Great but could they maybe GET A PLANE OFF THE GROUND ON TIME?",
            "title_similarity": "0.33971834",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h7ykb3a",
            "score": 0,
            "text": "andddddd there goes my uncles job. seriously.",
            "title_similarity": "0.30155742",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h7zbq1j",
            "score": 0,
            "text": "They should give insensitive instead of force employees to get vaccinated.",
            "title_similarity": "0.35474718",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h7zhx23",
            "score": 0,
            "text": "If they're gonna lose money of course they're gonna enforce masks, republiscum or democrats",
            "title_similarity": "0.34145892",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h7xidx1",
            "score": 3,
            "text": "Which makes sense, considering that many of their employees are jammed into small metal tubes with the public (not all or even the majority, of course, but quite a few of them).  Could be a liability nightmare for them if they aren't seen as doing everything they can to prevent spread.",
            "title_similarity": "0.3536663",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h7y40sr",
            "score": 4,
            "text": "Yay.  It’s about time.  Everyone else follow suit now.",
            "title_similarity": "0.15178344",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h7y5bnr",
            "score": 2,
            "text": "Good. More of this, please!",
            "title_similarity": "-0.03365431",
            "sentiment_compound": 0.7308
        },
        {
            "id": "h7z6yk2",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.023195405"
        },
        {
            "id": "h7xl25y",
            "score": -25,
            "text": "Huge abuse of power, sad times......",
            "title_similarity": "0.12734158",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h7y4zxe",
            "score": 5,
            "text": "It’s unquestionably better for the economy for everyone to get vaccinated.\n\nThe American foreign policy people are licking their lips now, Europe and America are having a lot of success in getting people vaccinated while South America and Asia struggle— this is going to help cement western economic dominance for probably another decade.\n\nThis is like winning a war against these economic competitors and we didn’t have to use the military (although almost a million people died— mostly elderly).",
            "title_similarity": "0.6786556",
            "sentiment_compound": 0.9022
        },
        {
            "id": "h7yc1sv",
            "score": -5,
            "text": "It’s begun, the gestapo forcing something onto everyone.",
            "title_similarity": "0.28880653",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yhvkl",
            "score": -6,
            "text": "Fuck Requirements. People should be free to choose what to do with their body.",
            "title_similarity": "0.10289504",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h7y6kx2",
            "score": -10,
            "text": "Remember when forced vaccination was just a conspiracy theory.",
            "title_similarity": "0.3425189",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h7xibbq",
            "score": 14,
            "text": "I wonder if this will help or hurt with their alleged “staff shortages” that are causing flight cancellations and delays.",
            "title_similarity": "0.404965",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h7xn4ut",
            "score": 11,
            "text": "It's simply an easy way to get the stupidest of their employees to quit",
            "title_similarity": "0.15175296",
            "sentiment_compound": -0.128
        },
        {
            "id": "h7xqvmz",
            "score": -12,
            "text": "What an echo chamber Reddit has become. Mandates like this should be concerning to all. All for a virus with a 99.9% survival rate?",
            "title_similarity": "0.57020414",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7y9b8j",
            "score": 2,
            "text": "I’ll try to convince my mom to fly United Airlines from now on.",
            "title_similarity": "0.5027143",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h7ybgyo",
            "score": -1,
            "text": "I’m confused? If CDC just said the vaccine does not prevent transmission, what’s the point?",
            "title_similarity": "0.38224196",
            "sentiment_compound": -0.4086
        },
        {
            "id": "h7yefx2",
            "score": 2,
            "text": "F your stupid ideas of freedom where you can encroach on my freedom to live with your anti-vax stupidity. \n\nUSA is for the brave! Get vaccinated!",
            "title_similarity": "0.40070462",
            "sentiment_compound": 0.7955
        },
        {
            "id": "h7yf4h1",
            "score": 2,
            "text": "Whats the twitter response this will cause? Is it “this is literally nazi germany”….. so sick of the arguments, just get the fucking shot!",
            "title_similarity": "0.29270583",
            "sentiment_compound": -0.8038
        },
        {
            "id": "h7yntkv",
            "score": -2,
            "text": "Keep chasing the carrot like the good donkeys you are.",
            "title_similarity": "0.07387726",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h7ywta4",
            "score": -2,
            "text": "These little back and forth discussions with the vaccinated are getting less and less interesting and amusing as their [dementia](https://alzres.biomedcentral.com/articles/10.1186/s13195-021-00850-3) starts to kick in. It's sad",
            "title_similarity": "0.36418095",
            "sentiment_compound": 0.0975
        },
        {
            "id": "h7y6hpg",
            "score": 5,
            "text": "Good. Our area hospitals just mandated it as well. I was surprised it took so long. Unfortunately our public schools have not. Really a teacher that is so unscientific as took not understand vaccination protections and benefits has no business in a classroom anyway. To me this is no different than booting teachers that are caught on white supremist websites. It is too much of a tell on their values",
            "title_similarity": "0.5419675",
            "sentiment_compound": 0.6275
        },
        {
            "id": "h7y8tbx",
            "score": 3,
            "text": "Great, now mandate vaccines for air travel. That will have a much greater impact.",
            "title_similarity": "0.39359355",
            "sentiment_compound": 0.765
        },
        {
            "id": "h7ygzec",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7zf4m9",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7zy935",
            "score": -4,
            "text": "I'd refuse abs then sue for wrongful termination for medical discrimination",
            "title_similarity": "0.3224649",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7y0aqi",
            "score": -9,
            "text": "What's with the hate against the unvaccinated? If they choose to not get the vaccine and risk death so be it. Their choice.",
            "title_similarity": "0.30975544",
            "sentiment_compound": -0.8658
        },
        {
            "id": "h7xvndq",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "-0.023195405"
        },
        {
            "id": "h7yivyj",
            "score": -7,
            "text": "Not anti vax but forcing vax on anyone is bullshit",
            "title_similarity": "0.20237857",
            "sentiment_compound": -0.6926
        },
        {
            "id": "h7y2rn0",
            "score": -10,
            "text": "They just shit all over the Bill of Rights.",
            "title_similarity": "0.23270863",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h7xdlx5",
            "score": 447,
            "text": "The carrot didn't work, time for the stick.",
            "title_similarity": "0.11314911",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yu63c",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xu65u",
            "score": 3,
            "text": "GREAT!  Great, great, great.  All other airlines need to follow suit.",
            "title_similarity": "0.33724126",
            "sentiment_compound": 0.9608
        },
        {
            "id": "h7y0wh1",
            "score": 2,
            "text": "Great, more big companies getting it done.",
            "title_similarity": "0.3223999",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h7y38vx",
            "score": 3,
            "text": "Now do the passengers, too.",
            "title_similarity": "0.08531022",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7y8r6e",
            "score": 4,
            "text": "Good. Now make passengers do it too. \n\nAirlines setting that guideline is the only way we’re ever going to turn the corner on this.",
            "title_similarity": "0.43867093",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7y932l",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h805v3n",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xl2km",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7xo6fl",
            "score": 1,
            "text": "Honest question. What about the people that legit can’t get a vaccine due to health issues? Does anyone see massive unemployment coming this fall and winter as more companies require a vaccine?  \n\nStay safe everyone.",
            "title_similarity": "0.6479341",
            "sentiment_compound": 0.5661
        },
        {
            "id": "h7xpkhv",
            "score": -1,
            "text": "This reminds me of the movie Contagion, everyone will require proof of vaccination (bracelet, vaccination passport)",
            "title_similarity": "0.53447574",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h7xqlzy",
            "score": 1,
            "text": "I'm just here to tag the facists.",
            "title_similarity": "0.09423504",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xta56",
            "score": 1,
            "text": "Now they will be even more short staffed...",
            "title_similarity": "0.08967712",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xu79r",
            "score": 1,
            "text": "What percentage won't be able to due to valid medical reasons?",
            "title_similarity": "0.29993278",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xwhyt",
            "score": -1,
            "text": "and thats why there's a shortage of employees.",
            "title_similarity": "0.20369619",
            "sentiment_compound": -0.25
        },
        {
            "id": "h7xytpo",
            "score": 1,
            "text": "That's not united at all.",
            "title_similarity": "-0.049813055",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h7y65be",
            "score": 1,
            "text": "Oh yes United, the not worst airline in the US",
            "title_similarity": "0.40817934",
            "sentiment_compound": 0.8314
        },
        {
            "id": "h7yi7h9",
            "score": 1,
            "text": "That’s good because I am at the airport right now and both the security agent that took my ID and the person who printed my boarding pass were coughing.",
            "title_similarity": "0.4931829",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h7ymfe8",
            "score": -1,
            "text": "Can someone explain something to me? You don’t need to get a flu vaccine to travel or work so why is this vaccine any different from all other vaccines? Why are people forced to get this one?",
            "title_similarity": "0.5325072",
            "sentiment_compound": -0.7303
        },
        {
            "id": "h7yo3k6",
            "score": 1,
            "text": "I wonder if this sort of thing will be challenged on equal protection grounds - vaccine mandates will have a disproportionate impact on blacks, who have among the lowest vaccination rates of any demographic.",
            "title_similarity": "0.53835166",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h7ys1w9",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7yw80j",
            "score": 1,
            "text": "This is great! I've been a big fan of United ever since they kicked that one guy's ass when he refused to get off the plane.",
            "title_similarity": "0.45355153",
            "sentiment_compound": 0.5848
        },
        {
            "id": "h7z968o",
            "score": 1,
            "text": "Excellent,  finally got the ball rolling",
            "title_similarity": "0.040812716",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h7zcev2",
            "score": 1,
            "text": "That’s not gonna cause any issues.\n\nPilots are predominantly white, male, and primarily conservative. Let’s see how this plays out.",
            "title_similarity": "0.3137127",
            "sentiment_compound": 0.3071
        },
        {
            "id": "h7zdkss",
            "score": -1,
            "text": "This is going to be an interesting social experiment, Hear me out. Unvaccinated people will be treated like low lifes while vaccinated people will be treated favorably.  Sort of like a social credit score. Isnt china doing?  The same thing where if you do what the CCP deems as favorable your social score rises, while if you don't agree with the CCP you will have a lower score and its hard to live in society. Im interested to see how this will progress as all this stuff develops in the US.",
            "title_similarity": "0.41938645",
            "sentiment_compound": 0.9286
        },
        {
            "id": "h804qg9",
            "score": -1,
            "text": "And if the workers refuse, they will be treated with the same respect United gives their customers: severe beatings.",
            "title_similarity": "0.23811702",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h80w9pc",
            "score": 1,
            "text": "Pilots aren't necessarily anti vaxx. We are subjected to extensive medical oversight. One wrong medication, one medical episode and we are stripped of our medical and lose our jobs. Thee FAA and the FDA are miles apart on the vaccine. These airlines that are mandating the vaccine won't blink an eye if we suffer a side effect that stripe us of our job. They won't pay us either...",
            "title_similarity": "0.5745628",
            "sentiment_compound": -0.793
        },
        {
            "id": "h7xxhgq",
            "score": 19,
            "text": "now make everyone flying get vaccinated.",
            "title_similarity": "0.47043762",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xbf6z",
            "score": -85,
            "text": "[removed]",
            "title_similarity": "-0.056563057"
        },
        {
            "id": "h7xm80d",
            "score": 3,
            "text": ">  Uber said U.S. office staff will need to be vaccinated to return to in-person work but stopped short of requiring them for drivers.\n\nof for fuck's sake.  Drivers would be the ideal people to vaccinate.",
            "title_similarity": "0.60826266",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h7xnu6e",
            "score": 4,
            "text": "Good. More of this! ಠᴗಠ",
            "title_similarity": "-0.014789339",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h7xqfju",
            "score": -4,
            "text": "United airlines is fucking garbage. I an willing to pay 10% more for any flight so long as customer service is comparable to other amazing companies. Unfortunately non exist.",
            "title_similarity": "0.57421887",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h7xsul9",
            "score": -3,
            "text": "United is, and always will be, a garbage airline.",
            "title_similarity": "0.31647992",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h801gql",
            "score": -4,
            "text": "The number of people who think the government and/or your employer should be able to force you to do anything is alarming.  Especially if you’re an American blessed enough to have a Bill of Rights and Constitution protecting you.",
            "title_similarity": "0.4989472",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h7xjy03",
            "score": 7,
            "text": "I know an ultra-right wing United employee who's livid about this rule. He works in their IT dept. and sees no reason why he needs to vax and is all over Facebook about it.\n\nHe NEVER tags United Airlines in any of his posts, tho. Funny, that.",
            "title_similarity": "0.44288376",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h7xuel3",
            "score": 8,
            "text": "Require proof of vaccination from passengers when booking flights and kill two birds with one stone.   You will keep the violent anti-mask lunatics off of the flights.",
            "title_similarity": "0.42521137",
            "sentiment_compound": -0.9042
        },
        {
            "id": "h7xwux2",
            "score": 7,
            "text": "This needs to happen more often. Oh, you don't want to get vaccinated? That's fine but you go be unvaccinated someplace else because we don't have time for your stupidity, we have a business to run.",
            "title_similarity": "0.38157728",
            "sentiment_compound": -0.5516
        },
        {
            "id": "h7xlr8b",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "-0.056563057"
        },
        {
            "id": "h7y3ikp",
            "score": 7,
            "text": "I know a group of people that are just your cookie cutter, Trump supporter, Fox News, anti-vaccine types. The other day one of them was asking me if I thought he was going to eventually be forced to get the vaccine. I could see the genuine fear in his eyes. Afterwards I thought, how is this man not afraid of a virus that’s killed 600k Americans but he’s terrified of the vaccine that prevents it? I chalked it up to the overwhelming power of right wing propaganda and echo chambers. He’s likely spent the last 6 months only consuming anti-vaccine propaganda. It’s scary that a relatively normal person of average intelligence can be so manipulated by an ideology and it’s leaders.",
            "title_similarity": "0.6341686",
            "sentiment_compound": -0.9587
        },
        {
            "id": "h7y4flp",
            "score": -9,
            "text": "Good luck getting employees",
            "title_similarity": "0.062052168",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h7ya0r8",
            "score": 12,
            "text": "The fact that this 100% reasonable decision is being considered controversial, blows my mind.",
            "title_similarity": "0.26511937",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h7xla8k",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7xq8zd",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7y8ifr",
            "score": 5,
            "text": "Cool, now require passengers to present a vaccination card or a negative covid test within 24 hours.",
            "title_similarity": "0.6700227",
            "sentiment_compound": -0.34
        },
        {
            "id": "h7y8l26",
            "score": 5,
            "text": "Get ready for a shit ton of cancelled flights around the deadline date.",
            "title_similarity": "0.5310471",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h7xll57",
            "score": 1,
            "text": "Still won't make me fly United.  Don't forget, they will illegally sell your seat out from under you and beat the shit out of you if you don't want to give it up.\n\nhttps://en.wikipedia.org/wiki/United_Express_Flight_3411_incident",
            "title_similarity": "0.39034194",
            "sentiment_compound": 0.8044
        },
        {
            "id": "h7xql8o",
            "score": -1,
            "text": "Useless unless they require passengers to be vaccinated as well.",
            "title_similarity": "0.39365503",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h7xrkdz",
            "score": -2,
            "text": "It’s sad that it’s going to take large scale employers to push the issue for people to get vaccinated in the US",
            "title_similarity": "0.58900565",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h7y05ux",
            "score": -1,
            "text": "I’d like to take a moment and shame those that this is pertaining too….who have yet to be vaccinated.",
            "title_similarity": "0.34564537",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h7y0lsp",
            "score": -2,
            "text": "I hope American Airlines follows suit I have a friend that is a AA flight attendant and thinks the virus is a “hoax” made but by the media. She refused the vaccine it would be nice to see her get it or quit and do some other job. I don’t agree with I just don’t like her. Am I fucked up for this?",
            "title_similarity": "0.44029105",
            "sentiment_compound": 0.5187
        },
        {
            "id": "h7y1gc8",
            "score": 1,
            "text": "If people quit their jobs because they didn’t want the shot then they should not be able to get any type of jobless benefit.",
            "title_similarity": "0.27005994",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h7yh8ku",
            "score": 2,
            "text": "Now everyone else, do this.",
            "title_similarity": "0.04437399",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yi8qt",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7yjcug",
            "score": 1,
            "text": "This is welcomed news!\n\nI hope other companies will follow suit. We have to beat this damn virus and this may be the only way to get the unvaxxed vaxxed!!",
            "title_similarity": "0.38967207",
            "sentiment_compound": 0.468
        },
        {
            "id": "h7yu8ky",
            "score": 2,
            "text": "Conspiracy theories like the need for vaccination papers from last year are coming true. Which one will from this year will also be? Unvaccinated Concentration camps, the Vaccines are really \"timebombs\" which mutated into the Delta variant, and Unvaccinated sperm being worth gold are some of my favorites to look out for next year.",
            "title_similarity": "0.59245765",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h7z4ehc",
            "score": -1,
            "text": "What is the legality in forcing people to get a non-fda approved experimental vaccine? I assume there are going to be a shit ton of lawsuits because of this? \n\nAnd before I get lit up, I am vaccinated, and am not an anti vaxxer. Just curious what the legality is.",
            "title_similarity": "0.59491",
            "sentiment_compound": 0.3009
        },
        {
            "id": "h7z7afh",
            "score": 2,
            "text": " Cool, now do passengers",
            "title_similarity": "0.007873524",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7z7rgw",
            "score": 2,
            "text": "We need to require vaccination to fly.",
            "title_similarity": "0.42783418",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7z8s9p",
            "score": -1,
            "text": "This is fucking bullshit. Why the fuck do their what? 100 pilots get $2000 but the thousands (ten thousands?) of regular employees who do all the hard grunt work don’t get shit? The Fuck is wrong with America? CEOs make hundreds of times more per hour than the lowly grunt who works and sweats all day but that grunt doesn’t get to eat a slice of that million dollar pie, not even a taste, not even a free McChicken they were going to throw away that he made",
            "title_similarity": "0.62780744",
            "sentiment_compound": -0.9803
        },
        {
            "id": "h7zakcm",
            "score": 2,
            "text": "Crazy town that this is news worthy. Putin won. People are literally committing suicide thanks to propaganda",
            "title_similarity": "0.3326928",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h7ztd1x",
            "score": 3,
            "text": "Wait a god damn second airplanes are the easiest way for a virus to move large distances very quickly, call me naive but I thought for sure they'd already be required to be vaccinated..\n\nThe amount of virus that one flight attendant could spread is so much greater than ... well.. EVERYONE ELSE like who else can spread a virus to more people over more distance faster and easier??",
            "title_similarity": "0.54783106",
            "sentiment_compound": 0.9488
        },
        {
            "id": "h80o5s2",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xn7wq",
            "score": 8,
            "text": "Honestly this is also a great way to get rid of all all the idiots in your company.",
            "title_similarity": "0.25341517",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h7xtflz",
            "score": -10,
            "text": "Sad. They will get a huge lawsuit soon. The dangers of this are extremely high.",
            "title_similarity": "0.27935183",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h7y121w",
            "score": 8,
            "text": "Airlines already require TDAP, MMR, vericella, and flu vaccines. How is this a first?",
            "title_similarity": "0.65456665",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h7y54tj",
            "score": -9,
            "text": "If you are forced by an employer to get a vaccination and die, can the family sue?",
            "title_similarity": "0.49441606",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h7xwwek",
            "score": -15,
            "text": "Is it even constitutional to require your staff to take a certain kind of medication? Surely that can't be legal",
            "title_similarity": "0.36569718",
            "sentiment_compound": 0.5618
        },
        {
            "id": "h7xlgl1",
            "score": -6,
            "text": "Make vaccines mandatory for unemployment, no free rides for people being fired.",
            "title_similarity": "0.51406527",
            "sentiment_compound": -0.8361
        },
        {
            "id": "h7xt708",
            "score": -6,
            "text": "The vaccine only confers personal protection from life-threatening symptoms.\n\nThe vaccine does NOT stop someone from getting the virus, replicating the virus, or spreading the virus.\n\nThis news is only ~5 days old, but do not lean on the vaccine too heavily for stopping the spread, that's not what it does.  Masks are what actually protect people in public settings.",
            "title_similarity": "0.47976804",
            "sentiment_compound": 0.4486
        },
        {
            "id": "h7xw7mc",
            "score": -6,
            "text": "We should see 67,000 people walk out on the job.",
            "title_similarity": "0.70892626",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7zbn5i",
            "score": -6,
            "text": "Sounds like a HIPPA violation",
            "title_similarity": "0.06811519",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h7xtm7i",
            "score": 15,
            "text": "When United requires all passengers to be vaccinated, I'll fly again.",
            "title_similarity": "0.6100638",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7y376p",
            "score": 14,
            "text": "Honestly I it weird that it’s worded like “there forced fo get the covid vaccine” like aren’t they forced to get every other vaccine too?",
            "title_similarity": "0.5252789",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h7xntr7",
            "score": -10,
            "text": "If only there was an FDA approved vaccine… 🤨\nBut sure, let’s force everyone to take something that only has emergency authorization, and that limits the manufacture’s liability…",
            "title_similarity": "0.43017215",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h7xyqaa",
            "score": -10,
            "text": "Diving into communism pretty hard!",
            "title_similarity": "0.27029786",
            "sentiment_compound": 0.5255
        },
        {
            "id": "h7xu1p6",
            "score": 4,
            "text": "Why just the employees?",
            "title_similarity": "0.17167032",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yb680",
            "score": 3,
            "text": "Great news that more companies are taking steps to protect their employees and everyone else around them.",
            "title_similarity": "0.3765208",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h7ybtk3",
            "score": 3,
            "text": "About time somebody had the balls to do the right thing and stop pandering to these whiny crybabies.",
            "title_similarity": "0.18195409",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7ycg1v",
            "score": 3,
            "text": "I'm a lot more sympathetic to this from transport and public vacing companies than I would be for a random office complex doing the same thing.  These companies have liability to manage.  If their employees get someone sick and that person dies, the company will probably get sued.  So of course they're going to mandate vaccinations.  It's textbook liability management.\n\nI do wish they'd wait for final FDA approval though.  It's not that far away.",
            "title_similarity": "0.54175395",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h7yhjb1",
            "score": 2,
            "text": "Awesome.  Makes perfect sense.",
            "title_similarity": "-0.049336925",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h7yl42h",
            "score": 4,
            "text": "I'm surprised more companies don't do this for the sole reason of weeding out the idiots that are likely holding the company back or will cause problems later anyways.",
            "title_similarity": "0.32952622",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h7ymk17",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7ynqr2",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "-0.023195429"
        },
        {
            "id": "h7yqh4d",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7yzg0f",
            "score": -3,
            "text": "Hey take this vaccine\nDo I still have to wear a mask.. yes\nCan I still get covid and pass it on to others... yes\nDo I still have to quarantine.. yes\nSo I'm pretty much just like an unvaccinated person then.. yes, well until you have 4-5 of these shots then hopefully you're protected...",
            "title_similarity": "0.49434367",
            "sentiment_compound": 0.9701
        },
        {
            "id": "h7z6omb",
            "score": 3,
            "text": "That’s an airline I’ll be using.",
            "title_similarity": "0.32262087",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7z6wsq",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h80bxfl",
            "score": -2,
            "text": "how is this not illegal discrimination?",
            "title_similarity": "0.021845978",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h7xs5q4",
            "score": -7,
            "text": "🐑🐑🐑🐑🐑🐑🐑🐑",
            "title_similarity": "-0.07777868",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xy9v7",
            "score": -7,
            "text": "So now we’re giving the people holding the lives of others 30,000 feet in the air an experimental vaccine. Sounds smart to me!",
            "title_similarity": "0.5741582",
            "sentiment_compound": 0.6864
        },
        {
            "id": "h7y6bx3",
            "score": 7,
            "text": "If you morons believe lil orange twitler’s, Fox’s  And GQP’s bs, if you’re diagnosed with COVID refused the vax, “cause, uhhhh hoax “You waive the right to medical treatment. Die at home. No hospital and ventilator for you, no Dr.s, just clutching Jesus and your constitutional rights. YOU STAY AT home, lose your fucking legs, gasp like a fish on a river bank. Smart humans WANT you out of the gene pool and for god’s sake: don’t breed.",
            "title_similarity": "0.40212196",
            "sentiment_compound": -0.8443
        },
        {
            "id": "h7y6n01",
            "score": -7,
            "text": "Look out below...... Read about antibody dependent enhancement before getting the \"safe\" jab.  Luc Montagnier nobel prize winning viralogist is a good source.",
            "title_similarity": "0.40206552",
            "sentiment_compound": 0.91
        },
        {
            "id": "h7y8d56",
            "score": -5,
            "text": "Get vaccinated yourselves, and don’t worry about what others do.\n\nI mean, the vaccine should keep you safe from a lab made cold, right?\n\nReddit is a shit hive of communist losers.",
            "title_similarity": "0.48844945",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h7yffre",
            "score": 7,
            "text": "We're so fucked.  I drove by a vaccine protest in front of the local hospital near my home.  My faith in humanity had been severely eroded the last year and a half.  I couldn't even look at the dumb fucks I was so mad.",
            "title_similarity": "0.55112827",
            "sentiment_compound": -0.9546
        },
        {
            "id": "h7yg1dx",
            "score": -7,
            "text": "First private companies are forcing it and soon irk be the government forcing you. Do you really want people taking away your choice?",
            "title_similarity": "0.40469924",
            "sentiment_compound": 0.1513
        },
        {
            "id": "h7ygky9",
            "score": -8,
            "text": "I still don’t trust the vax",
            "title_similarity": "0.1675742",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h7ylb0p",
            "score": -6,
            "text": "Isn't this a violation of HIPAA?",
            "title_similarity": "0.026894854",
            "sentiment_compound": 0.3875
        },
        {
            "id": "h7zk9lr",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7zm5ng",
            "score": -7,
            "text": "What a nonsense, this is by force, not by will.\nUnited always was crap anyhow.",
            "title_similarity": "0.18370065",
            "sentiment_compound": -0.7672
        },
        {
            "id": "h7xnx21",
            "score": 11,
            "text": "All the anti-vaxers, can “fly” American… that is , wait in line to rebook because they can’t keep their planes staffed due to Covid.",
            "title_similarity": "0.57529217",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xoidz",
            "score": -12,
            "text": "I see no reason to take the vaccine if you’ve already had covid",
            "title_similarity": "0.39686888",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7y9ah5",
            "score": -11,
            "text": "A non-fda approved vaccine that was rushed out and you gotta wait 15 minutes after to make sure you don’t die. No thanks. I worked the vaccine clinics for months and saw numerous reactions that had to be rushed down to the ER. Nice authoritarianism though. Get jabbed or we take food off your table.\n\n people in line would ask me if I got the vaccine, my response was always  “nope, already had covid”",
            "title_similarity": "0.66733223",
            "sentiment_compound": 0.1516
        },
        {
            "id": "h7xmgoz",
            "score": -3,
            "text": "So that theory about the vaccine causing clots at high altitudes was bullshit, huh?",
            "title_similarity": "0.356992",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h7xmjx9",
            "score": 0,
            "text": "So, I'm guessing insurance companies are nudging them.",
            "title_similarity": "0.31351045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xn7ad",
            "score": -4,
            "text": "They will still beat your ass and throw you off a plane when they need a seat, but at least you won't get the rona",
            "title_similarity": "0.2943048",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h7xny4g",
            "score": -4,
            "text": "So, boosters are next? There are 3 or 4 \"still in testing\" they can mandate. Also, it can often take multiple vaccinations of the same vaccine before imunity takes. Just so you know, this is not a one-shot-cure-all. This is a new ritual.",
            "title_similarity": "0.5106475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xq1r5",
            "score": -4,
            "text": "Are you guys having fun talking about Covid?",
            "title_similarity": "0.17123899",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h7xsomk",
            "score": -4,
            "text": "Lol remember when united was hated? You people have rhe memory of a goldfish",
            "title_similarity": "0.3111716",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h7xsvtk",
            "score": -5,
            "text": "Yeah, but do they accept responsibility for anyone that does have adverse reaction?\n\nI'm all for everyone being vaccinated, but I think it's wrong to force people to do it without accepting full responsibility in case (very rare but still) vaccination causes adverse reaction.\n\nEdit. I know this will be downvoted to hell, but I don't think it's fair to corner people into a medical decision without support.",
            "title_similarity": "0.4172469",
            "sentiment_compound": -0.9689
        },
        {
            "id": "h7xvypn",
            "score": 0,
            "text": "The pilots are going to be a problem because their union is so strong and they’re pretty conservative",
            "title_similarity": "0.39089945",
            "sentiment_compound": 0.6948
        },
        {
            "id": "h7xx44u",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xzsro",
            "score": 6,
            "text": "Y'all wanted a free market. Here yah go",
            "title_similarity": "0.13197008",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h7y8vk2",
            "score": -3,
            "text": "As long as they’re willing to far the labor shortage and side effect lawsuits that will end up bankrupting them.",
            "title_similarity": "0.27975217",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h7y981t",
            "score": 0,
            "text": "What will happens to those medically restricted from having the vaccine? Must cost a fortune to pension them off on medical retirement, especially for cash strapped air lines.",
            "title_similarity": "0.6192191",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h7yaiml",
            "score": 0,
            "text": "Will United include vaccination as an understanding to the occupational hazard of this industry?",
            "title_similarity": "0.42563897",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7ybglo",
            "score": 0,
            "text": "I guess that's cool but fuck united airlines.",
            "title_similarity": "0.3749376",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h7ycfzy",
            "score": 5,
            "text": "I work for a company that doesn't require vaccines but does require regular testing and masks for the unvaccinated.  Some folks have already start losing their goddamn minds.  A few have already quit or been fired due to their backlash at the policy.  It's sad how the \"pro-life\" conservatives and religious types have politicized this into so much unneeded death and economic harm.",
            "title_similarity": "0.49440557",
            "sentiment_compound": -0.9836
        },
        {
            "id": "h7yehm9",
            "score": 0,
            "text": "One great big festering neon distraction",
            "title_similarity": "0.09297728",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7ygkk4",
            "score": 0,
            "text": "Good time to apply for a horrible job",
            "title_similarity": "0.10410393",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h7yi809",
            "score": -4,
            "text": "Is this legal? Unless I missed something, the vaccine is still under EUA, plus there are almost certainly going to be employees for whom it may be unsafe to get the vaccine due to a medical condition.",
            "title_similarity": "0.47433835",
            "sentiment_compound": 0.1045
        },
        {
            "id": "h7yjmpr",
            "score": 0,
            "text": "Missed out on a great headline.\n\nSomething about first carrier to avoid being carriers",
            "title_similarity": "0.29396474",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h7ym3cm",
            "score": 5,
            "text": "Well, that's me only flying United in the foreseeable future.",
            "title_similarity": "0.26273865",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h7yo2jg",
            "score": 4,
            "text": "I love it. I just booked a United flight yesterday and this pleases me. Looks like they’re doing better than spirit.",
            "title_similarity": "0.5016591",
            "sentiment_compound": 0.9453
        },
        {
            "id": "h7yy66i",
            "score": 0,
            "text": "Uh is that pilot in the photo at the start of his 12 hour flight or the end of it? I’m not sure I want my pilot getting injected BEFORE It.",
            "title_similarity": "0.5496141",
            "sentiment_compound": -0.2924
        },
        {
            "id": "h7z07jb",
            "score": 0,
            "text": "United breaks guitars but get vaccines👍🏻",
            "title_similarity": "0.34678861",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h7z0zsi",
            "score": 0,
            "text": "I'm not trying to be an anti-vax dumbass by bringing this up but with stuff like this coming out in the news, what's the point of getting it? It seems like it's not really working.\n\nhttps://www.verywellhealth.com/cdc-report-vaccinated-breakthrough-infections-5195483",
            "title_similarity": "0.42026746",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h7z1a5j",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7z49qf",
            "score": 0,
            "text": "How they catching the virus in the safety of the cockpit?",
            "title_similarity": "0.39225414",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7zdoow",
            "score": 5,
            "text": "I'm hoping a bunch of pilots at my airline will refuse/get fired/quit so I can go up in seniority.",
            "title_similarity": "0.48304647",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7zuph0",
            "score": 3,
            "text": "Lol, imagine being a grown ass adult with a job and a family and having to have a group that couldn't give one little fuck about you, you're employer, treat you like a fucking child over shit they shouldn't have to be involved in because you're stomping your feet on the ground saying no even though it could kill you.\n\nWhatever the hell the conservatives are thinking, I dunno what it is. But they should really be made to understand how second hand embarrassing it is watching them fuck their lives up so bad in real time and on purpose.\n\nLike if I didn't know any better I would have guessed they all have some special brain disease that makes them lack the capability to feel shame. Fuck, I still think about the time Rebecca said ew when I asked her to the movies when I was a teenager. I couldn't imagine how I'd feel if I had been screaming and crying or no, LITERALLY SHAKING, over the people I pay to keep me healthy from shit like pandemics telling me how to not be a statistic in a pandemic.",
            "title_similarity": "0.4097138",
            "sentiment_compound": -0.99
        },
        {
            "id": "h7zxwfh",
            "score": 4,
            "text": "Good. Every business should require the vaccine",
            "title_similarity": "0.48987776",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7zypxv",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.056563057"
        },
        {
            "id": "h80iam0",
            "score": 0,
            "text": "The biggest issue I see with all of this is people at the top, not always the bottom.\n\nEspecially healthcare CEO's and the industry influencing how companies think about vaccines.\n\nYou don't make a profit curing people. You can do both. For example. sell drugs and the vaccine to fight against Malaria. The ones that sold drugs made more profit than dealing with the 75% efficacy rate of vaccines for malaria. It's a combination of both if you look at the statistics. When they cured chicken pox with 95% to 98% efficacy rate with the Varicella vaccine, You know who made money? exactly, nobody, the pharmaceutical company is a business at the end of the day.",
            "title_similarity": "0.6399188",
            "sentiment_compound": -0.0034
        },
        {
            "id": "h81elkf",
            "score": 0,
            "text": "I thought there was a crew shortage???",
            "title_similarity": "0.18124226",
            "sentiment_compound": -0.3695
        },
        {
            "id": "h81eqhx",
            "score": 0,
            "text": "There will be a flood of job openings in all industries causing even more labor issues",
            "title_similarity": "0.4321171",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xms50",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xsvdb",
            "score": -10,
            "text": "Don’t give in. There’s a labor shortage. Take a couple days off in protest. Watch them squirm. Or, cross your fingers and hope you’re not one of the thousands with lasting injuries.",
            "title_similarity": "0.46889007",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h7z519g",
            "score": -8,
            "text": "I love Reddit and all, but seeing what kind of pro-vaccination echo chamber it has become, really makes me sad.",
            "title_similarity": "0.34329897",
            "sentiment_compound": -0.4489
        },
        {
            "id": "h7y7rkq",
            "score": -10,
            "text": "Kind of illegal though",
            "title_similarity": "-0.042629756",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h7xpi5e",
            "score": 6,
            "text": "To those of you who’s heads are exploding, welcome to the free market chucklefuck!",
            "title_similarity": "0.1837903",
            "sentiment_compound": 0.7644
        },
        {
            "id": "h7xqkby",
            "score": 5,
            "text": "Cool, can we require a vaccine for people coming into the country? Seems like a reasonable requirement.",
            "title_similarity": "0.4742443",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h7y8yet",
            "score": 4,
            "text": "Good. Standardize this shit. Make it a requirement for all jobs.",
            "title_similarity": "0.34111932",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h7yb1aa",
            "score": 6,
            "text": "Good. \n\nStop refusing science you morons. Vaccines work. Deal with it.",
            "title_similarity": "0.33104295",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h7ygcik",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7ykf65",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.056563057"
        },
        {
            "id": "h7z9em2",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.056563057"
        },
        {
            "id": "h7xb9rh",
            "score": 894,
            "text": "Glad to hear it. Curious if and how this will be negotiated with the union groups.\n\nI find it surprising 90% of their pilots have been vaccinated, considering how conservative a group airline pilots are as a whole. \nSource: liberal airline pilot.",
            "title_similarity": "0.70901406",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h7yfsl1",
            "score": 17,
            "text": "Anti-vaxxers should definitely stop flying in protest.  In fact, they should really put their money where their mouths are and just stay home... that will stick it to the man!",
            "title_similarity": "0.2429541",
            "sentiment_compound": -0.2003
        },
        {
            "id": "h7y3jjf",
            "score": 10,
            "text": "*Unvaccinated employees will be forcibly removed from the premises.*",
            "title_similarity": "0.37821358",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7y6oyy",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "-0.056563057"
        },
        {
            "id": "h7yiqbr",
            "score": -11,
            "text": "You guys gave up your freedom so easily. This was the stupidest generation in history.",
            "title_similarity": "0.27737838",
            "sentiment_compound": 0.6015
        },
        {
            "id": "h7xjr38",
            "score": 178,
            "text": "Ending the pandemic using capitalist principles. \n\n“You want to work for me? Then get vaccinated, otherwise get lost”",
            "title_similarity": "0.41698104",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h7xgac9",
            "score": 303,
            "text": "Maybe a snarky thought - but I wonder how much of this is driven by medical costs and its impact on profits? Large businesses tend to self-fund healthcare plans, I would think it would be much cheaper having a covid vaccinated workforce than one where a sizable percentage is going to the hospital.\n\nVaccination is the way to go - but I wonder if this just being driven like all corporate decisions - by the bottom line.",
            "title_similarity": "0.57547575",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h7xo7o2",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "-0.056563057"
        },
        {
            "id": "h7y4p9g",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "-0.056563057"
        },
        {
            "id": "h7xlv99",
            "score": 6,
            "text": "This makes so much sense. The easiest way for diseases and viruses to spread around the world is by travel, specifically air travel. If we want a chance at ever seeing this pandemic come to an end not only should all airline employees be vaccinated, but so should every passenger. If you want to go somewhere, you should be required to get vaccinated. If you don't like it, too bad. Stay home.",
            "title_similarity": "0.54341877",
            "sentiment_compound": -0.6614
        },
        {
            "id": "h7ydhla",
            "score": 6,
            "text": "Thank god. I’m all for forcing the idiots",
            "title_similarity": "0.117366165",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h7yopgo",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7z8uij",
            "score": -6,
            "text": "The vaccine doesn't prevent the catching or spreading of covid so why is this still a thing?",
            "title_similarity": "0.33770722",
            "sentiment_compound": -0.0191
        },
        {
            "id": "h7zaukq",
            "score": -7,
            "text": "Bold prediction: UA will experience a lot of cancelled flights in the near future.",
            "title_similarity": "0.42707568",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h7ze1zw",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7zf824",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7zhckh",
            "score": -6,
            "text": "Somehow more important to vaccinate against Covid than HIV, Herpes, TB, that are all more communicable.",
            "title_similarity": "0.37302893",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h7z5n76",
            "score": 13,
            "text": "Remember all those idiot republicans that said “healthcare isn’t a right”? Neither is a job.\n\nGet vaccinated, assholes.",
            "title_similarity": "0.5017568",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h7xlvd1",
            "score": -1,
            "text": "I'm curious if they're requiring actual proof of vaccination or if they're asking employees to self-attest like a whole lot of places are doing.",
            "title_similarity": "0.51174515",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h7xmf4u",
            "score": -1,
            "text": "I'm sure this is more about staffing flight crews and less about actually trying to stem the pandemic, but I'll take it.",
            "title_similarity": "0.37841368",
            "sentiment_compound": 0.1655
        },
        {
            "id": "h7xnja5",
            "score": -1,
            "text": "*heavy Dutch breathing* the flight crew for the Dutch Olympic team might have infected our national athletes on the flight to Tokyo. It’s been a massive issue.",
            "title_similarity": "0.51628804",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h7xps1a",
            "score": -1,
            "text": "Ironic it's United of all airlines lmao.",
            "title_similarity": "0.40025234",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h7xqpq9",
            "score": 1,
            "text": "Happy to hear some positive news from United. Hasn’t happened in a looooooong time.",
            "title_similarity": "0.2372454",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h7xs4lt",
            "score": 1,
            "text": "Good now require the customers as well if you wanna impress me",
            "title_similarity": "0.15437481",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h7xs59j",
            "score": 1,
            "text": "....and then will still be required to wear a mask.",
            "title_similarity": "0.09940179",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xsdcz",
            "score": 1,
            "text": "Wtf, only now. In most places they would be the first",
            "title_similarity": "0.29163775",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h7xtlpc",
            "score": 1,
            "text": "Select NFL players and their cult following in shambles",
            "title_similarity": "0.3724539",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xu7kc",
            "score": -1,
            "text": "Good thing the vaccines are effective and have no side effects",
            "title_similarity": "0.1440528",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h7xwaki",
            "score": -1,
            "text": "Wonder how the flight attendant on my flight who interjected a weird libertarian rant into the safety briefing will take this.\n\nDude was a crackpot.",
            "title_similarity": "0.4299651",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h7xx286",
            "score": 1,
            "text": "Yes I’m sure this will certainly not exacerbate the pilot shortage.",
            "title_similarity": "0.22251695",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h7xxo55",
            "score": 1,
            "text": "It's going to be such a mess when companies start requiring 3rd dosage or booster shots. Half of the company will have to work on that alone.",
            "title_similarity": "0.5177494",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h7xxugc",
            "score": -1,
            "text": "Check it out \n\nhttps://www.redvoicemedia.com/video/2021/08/freedom-fighter-court-victory-ends-masking-shots-quarantine-in-alberta/",
            "title_similarity": "0.39605904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xy8vy",
            "score": -1,
            "text": "How can they require it? U don’t get it you’re fired?",
            "title_similarity": "0.19818598",
            "sentiment_compound": -0.6072
        },
        {
            "id": "h7xyyma",
            "score": 1,
            "text": "I wonder how many resignations will be seen",
            "title_similarity": "0.36404353",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7y00zq",
            "score": 1,
            "text": "After 17 hours at Newark airport, delayed for a “mechanical issue” and only receiving a $5 gift certificate for food that could not be used with any other form of payment, I swore I would never ever fly with United again. \n\nMaybe I’ll give them a try again.",
            "title_similarity": "0.6372874",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h7y12dp",
            "score": 1,
            "text": "Every employer is going to require vaccination outside of literal vax deniers and idiots trying to make a pointless point. Let’s see how the conspiracy theories hold up when there’s money on the line. Mmmmm.",
            "title_similarity": "0.5514778",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h7y1kqv",
            "score": 1,
            "text": "What do these companies do for medically exempt employees? Like if you had a bad reaction to the first shot snd were advised not to get the second?",
            "title_similarity": "0.49589083",
            "sentiment_compound": -0.2406
        },
        {
            "id": "h7y2a5d",
            "score": 1,
            "text": "And if you don't, they'll beat the shit out of you and throw you off the plane.",
            "title_similarity": "0.28894857",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h7y2ab7",
            "score": 1,
            "text": "And people thought the mask was infringing on their rights as a human being",
            "title_similarity": "0.15238412",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7y52b3",
            "score": 1,
            "text": "As is with any occupation, there’s good ones and bad ones.",
            "title_similarity": "0.07849155",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h7y6f7d",
            "score": 1,
            "text": "Great,  now can I have a free carry on?",
            "title_similarity": "0.043582454",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h7y8asm",
            "score": 1,
            "text": "I would imagine there is a liability risk and increased medical insurance costs for United.  Liability from 1. Passengers get sick from an employee 2. An employee gets long COVID or dies from work exposure.",
            "title_similarity": "0.51148856",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h7ycbpp",
            "score": 1,
            "text": "what if the religion in which one is beholden doesnt \"allow\" it?",
            "title_similarity": "0.18191801",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h7ydix0",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7ye4td",
            "score": 1,
            "text": "Job openings people, job openings. Get out there and get a job! UA... and you might have to pass a UA 😋",
            "title_similarity": "0.29544076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yjk4f",
            "score": 1,
            "text": "I'm appalled that it was not done already...smh",
            "title_similarity": "0.117276154",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h7ynlr4",
            "score": -1,
            "text": "That's cool, but I still refuse to fly United.",
            "title_similarity": "0.11274522",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h7yp1nf",
            "score": 1,
            "text": "They started to think seriously about it. They work with a lot of people and they should stay safe anyway. Someone doesn't understand that.",
            "title_similarity": "0.21211347",
            "sentiment_compound": 0.296
        },
        {
            "id": "h7ypd20",
            "score": 1,
            "text": "But if their employees are all vaxxed how are they gonna charge extra for 5G on flights?\n\n\n/s",
            "title_similarity": "0.6090585",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ypk1f",
            "score": 1,
            "text": "Of course it's United airlines...",
            "title_similarity": "0.368999",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7ysp7h",
            "score": 1,
            "text": "Now do it for all your passengers too.",
            "title_similarity": "0.19461378",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ytsx6",
            "score": -1,
            "text": "Just think of the people sitting at home thinking \"I have a stream of income only if I get a shot that could possibly save my life,  life's not fair\".",
            "title_similarity": "0.4157062",
            "sentiment_compound": 0.3045
        },
        {
            "id": "h7ytxoi",
            "score": 1,
            "text": "Too little, too late. There's no stopping it at this point, so all of your parents and grandparents are going to have to go through multiple rounds, many will die as a direct result of assholes who deliberately chose not to follow the CDC recommendations. They chose to ignore science, and this shit is just some PR shit to justify United Airlines to continue flying back and forth, transmitting this disease around the world. I fucking hate this planet and the inhabitants.",
            "title_similarity": "0.47402182",
            "sentiment_compound": -0.9628
        },
        {
            "id": "h7yus1s",
            "score": 1,
            "text": "Gotta make sure they can still receive government subsidizes by complying with guidelines",
            "title_similarity": "0.27273744",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7yv1vq",
            "score": 1,
            "text": "What's up with companies enforcing social rules. I thought that was the governments job .. corporations have too much power",
            "title_similarity": "0.5293959",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yv5qp",
            "score": 1,
            "text": "So they're not taking into account the diets, health restrictions, religious exemptions, medications, diseases, etc. Of 67,000 people???!\n\nYou can't sue the government, employer, or vaccine makers for anything to go wrong, but you'll get fired if you don't take it. Makes sense.",
            "title_similarity": "0.58956647",
            "sentiment_compound": -0.8308
        },
        {
            "id": "h7yw500",
            "score": 1,
            "text": "So what did they inject you with?",
            "title_similarity": "0.13260096",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yx2b1",
            "score": 1,
            "text": "I would never fly any airline that doesn't.  American, for instance.",
            "title_similarity": "0.32083663",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yxbx0",
            "score": 1,
            "text": "Isn't it too late/redundant if they are already a carrier? 😷🤣🤣🤣",
            "title_similarity": "0.18341559",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h7yxmjv",
            "score": -1,
            "text": "Is that even legal .. ?asking for a friend",
            "title_similarity": "0.09580499",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h7yz2ks",
            "score": 1,
            "text": "You love to see it. I hope many other private businesses follow suit",
            "title_similarity": "0.21740657",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h7yzipb",
            "score": 1,
            "text": "Shouldn't even be allowed in an airport unless you're 2 doses deep. Do airlines have some obligation to facilitate the spread of a potentially fatal, infectious disease?\n\nIs there any standing for a class action?",
            "title_similarity": "0.5097604",
            "sentiment_compound": -0.594
        },
        {
            "id": "h7z0i0v",
            "score": -1,
            "text": "Good luck enforcing that.\n\nThis will end in at least unemployment for those who are terminated because they refuse to disclose to their employer whether or not they’ve taken the vaccine, and possibly lawsuits.",
            "title_similarity": "0.4899469",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h7z0o8b",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7z1k3s",
            "score": -1,
            "text": "Yeah nothing like forcing everyone to get the vaccine, instead of you know, letting them get it for their own personal benefit. \n\nNothing like all these forcing companies and govts to encourage people to get the vaccine bc it's good for them!",
            "title_similarity": "0.45346826",
            "sentiment_compound": 0.8162
        },
        {
            "id": "h7z78le",
            "score": 1,
            "text": "It must be a law to get vaccinated or the economy will bust and people will continue to suffer and die.",
            "title_similarity": "0.46326154",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h7zgsmq",
            "score": 1,
            "text": "Do we have a list of companies requiring the vaccine?",
            "title_similarity": "0.5454487",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7zi9k9",
            "score": 1,
            "text": "Ahh I love the free market the republicans help stay in place!",
            "title_similarity": "0.21268901",
            "sentiment_compound": 0.8883
        },
        {
            "id": "h7zns06",
            "score": 1,
            "text": "Only a matter of time when this is the norm.",
            "title_similarity": "0.122698426",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h7xzlej",
            "score": 7,
            "text": "this isn't controversial, it's incredibly simple.  if you can get vaccinated, you get vaccinated.\n\nif not, you can go live in fear somewhere else.  the amount of fat idiots that smoke cigarettes but think the vaccine is going to kill them makes my head hurt",
            "title_similarity": "0.40468174",
            "sentiment_compound": -0.9319
        },
        {
            "id": "h7y964h",
            "score": -7,
            "text": "Kinda like how Biden and Kamala call for transparency when it comes to the vaccine here during their campaign tour. Also how they say they would not take a vaccine while Trump was President.\n\n\nhttps://www.reddit.com/r/tucker_carlson/comments/omb0aw/twofaced_hypocrites/\n\nSee how Doctors are labeled because they don't spout the same narrative. Like your Doctor who was told to \"shut up\"\n\nhttps://www.cnbc.com/2021/08/06/doximity-social-network-for-doctors-full-of-antivax-disinformation.html",
            "title_similarity": "0.57233346",
            "sentiment_compound": 0.5729
        },
        {
            "id": "h7yxn50",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7zb985",
            "score": -6,
            "text": "This is crazy, these businesses have to get punched in the mouth. Didn't they get bailed out by tax payers not too long ago?",
            "title_similarity": "0.5232277",
            "sentiment_compound": -0.34
        },
        {
            "id": "h7xmx8m",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xsibk",
            "score": -7,
            "text": "If I already have got covid, why do I need a vaccination. I am already immunized to it. The vaccine doesn't stop transmission, it just lessens the effects if you do get it. It is unadvised for people already sick with covid to get the vaccine \n\nThere is no scientific data that shows passports curve the spread.this is just punishment for the unvaccinated, or as they say incentive to get vaccinated. Just as jail is an incentive to not do crime.",
            "title_similarity": "0.4839893",
            "sentiment_compound": 0.0098
        },
        {
            "id": "h7xtneo",
            "score": -8,
            "text": "Just another reason to never get on a United plane.",
            "title_similarity": "0.28268203",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7y8zga",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "-0.056563057"
        },
        {
            "id": "h7yl7rr",
            "score": 7,
            "text": "Honestly since that string of bad PR a couple of years ago my United experiences have been absolutely top notch. Their flights are consistently cheapest not called frontier or spirit if I want basic economy, and still pretty cheap for normal economy. Their flights have been on time for me, and just overall smooth experience. \n\nTheir miles program kinda sucks, but otherwise I more often fly United than anything else. (Helps My nearest airport is a United hub of course but still).",
            "title_similarity": "0.44614652",
            "sentiment_compound": 0.937
        },
        {
            "id": "h7ymcag",
            "score": -7,
            "text": "This is bull shit, I’ll never fly United Airlines again.",
            "title_similarity": "0.33953863",
            "sentiment_compound": -0.7124
        },
        {
            "id": "h7z6wvv",
            "score": 9,
            "text": "Companies are starting to figure out the majority of consumers and workers don’t wanna be around plague rats",
            "title_similarity": "0.51559764",
            "sentiment_compound": 0.0
        },
        {
            "id": "h801jds",
            "score": -9,
            "text": "My mother has been a FA for United (Continental) since ‘98. She was devastated that her employer is mandating someone inject themselves with something they aren’t sold on. Shouldn’t anyone? Regardless of your position on the vaccine.",
            "title_similarity": "0.5987898",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7xc6jl",
            "score": 5150,
            "text": "United CEO basically said what Biden did :\n\n>“We know some of you will disagree with this decision to require the vaccine for all United employees,” United CEO Scott Kirby and President Brett Hart said Friday in an employee note. ** “But, we have no greater responsibility to you and your colleagues than to ensure your safety when you’re at work, and the facts are crystal clear: everyone is safer when everyone is vaccinated.” **\n\nE: The number of redditors coming up with non - sequitur responses is beyond alarming.  Turning off inbox replies\n\nDO YOUR CIVIC DUTY AND GET VACCINATED.  VACCINES WILL SAVE YOUR LIFE AND THE LIVES OF OTHERS",
            "title_similarity": "0.59341264",
            "sentiment_compound": 0.9533
        },
        {
            "id": "h7xt3nl",
            "score": -8,
            "text": "Mandating something that isn't FDA approved while it is already getting rushed to get sloppily approved.\n\nWhat could go wrong?",
            "title_similarity": "0.2954123",
            "sentiment_compound": -0.3883
        },
        {
            "id": "h7y92ee",
            "score": -10,
            "text": "Fuck America. “Anyone who trades liberty for safety deserves neither and loses both.”\nSo fuck one of our founding fathers, eh? I’ll agree with Ben Franklins dead ass when it comes to this shit over any modern day moral narcissistic redditor who only parrots the narrative he is fed in bad faith and perpetuates in bad faith. Fuck it. Let’s just have a civil war already. Seems like we want people we don’t agree with to die anyway so let’s just get at it. I’m done being apart of the left. (I know I’m free to go and won’t be missed) Progressivism with our conservatism keeping it in line is anarchy.",
            "title_similarity": "0.34095278",
            "sentiment_compound": -0.9583
        },
        {
            "id": "h7yaazp",
            "score": -9,
            "text": "Let these morons go ahead and do it.  These businesses will all be bankrupt within 6 months.  Just look at what’s happening with Spirit Airlines.  Once they see that they’re losing tons of money, they’ll reverse course.",
            "title_similarity": "0.5626507",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h7yaplm",
            "score": -9,
            "text": "Embarrassing that this is happening in this country. I suppose millennials are coming of age in a new world. Freedom was only appealing when put on a poster during Cold War times, now it’s Back to oligarchy to the winning oligarchs",
            "title_similarity": "0.54539114",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7ye8p0",
            "score": -9,
            "text": "So much for personal freedom. Your fear shouldn't block my freedom.",
            "title_similarity": "0.09388127",
            "sentiment_compound": 0.0098
        },
        {
            "id": "h7z5nzp",
            "score": 9,
            "text": "I can't wait until the FDA fully approves the vaccines. Every single company in America should require the vaccine. What are people going to do? Just not work? Nope. They'll get vaccinated. And once it's approved, no court is going to say the company must allow unvaccinated apart from medical or religious beliefs.",
            "title_similarity": "0.6430836",
            "sentiment_compound": 0.7053
        },
        {
            "id": "h7za8vl",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7xl0tl",
            "score": -2,
            "text": "US employees, don’t forget your regional flight attendant didn’t get one and came to work sick because they work for one of the shitty regional airlines in America.",
            "title_similarity": "0.50063103",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h7xn3nw",
            "score": 2,
            "text": "Huge, and wonderful.  There will be a small percentage who can't get it, I assume that's part of this plan.",
            "title_similarity": "0.29630312",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h7xpa1w",
            "score": 2,
            "text": "As all employers should, during a global pandemic.",
            "title_similarity": "0.41424608",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xq1he",
            "score": -2,
            "text": "Good, this is what companies need to do to make consumers feel safe.",
            "title_similarity": "0.25938845",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h7xq89p",
            "score": -2,
            "text": "I'm surprised to hear there are employees who haven't been vaccinated yet at the airport",
            "title_similarity": "0.58025223",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h7xr7zg",
            "score": 2,
            "text": "The company pays for healthcare, at least partially right?  Even from that perspective they have an interest in keeping their rates low with lower claims.  Vaxxes are proven to save lives and reduce hospitalization.\n\nThis is the system that we have.  A \"free market\" employer sponsored healthcare system.",
            "title_similarity": "0.332519",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h7xrjit",
            "score": 2,
            "text": "The uproar from the right is going to be precious as more and more employers require vaccinations.",
            "title_similarity": "0.5096259",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h7xu1ih",
            "score": 2,
            "text": "But first can we be realistic with the $140 check bag fee.",
            "title_similarity": "0.49490324",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xvllu",
            "score": 2,
            "text": "Dammit. I was just fine with detesting United. Then they had to go and do something socially responsible. \n\nCurse them.",
            "title_similarity": "0.16390209",
            "sentiment_compound": 0.34
        },
        {
            "id": "h7xzy3y",
            "score": 2,
            "text": "Just fluff…..all of these stories about how xyz business is now require proof have a poison pill in the story line—“exemptions for medical or religious reasons”",
            "title_similarity": "0.43094876",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h7y033j",
            "score": -2,
            "text": " I have to fly soon. I'll be checking United Airlines first.",
            "title_similarity": "0.46213317",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7y2cg2",
            "score": 2,
            "text": "It’s a win win…. Vaccinated staff and anti-bad people will boycott!",
            "title_similarity": "0.3727231",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h7yd1s7",
            "score": 2,
            "text": "Bravo. I hope to keep seeing more and more of these announcements.",
            "title_similarity": "0.11204301",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7yd6pm",
            "score": 2,
            "text": "The airlines are the main reason we have covid spreading, they are too greedy.",
            "title_similarity": "0.36464968",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h7yen15",
            "score": 2,
            "text": "And that kids, is why you always fly United.",
            "title_similarity": "0.22051579",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7yk73y",
            "score": -2,
            "text": "All anti-vac people: \"They are FORCING us to get the vac! What next? Gold starts on our arms?\"",
            "title_similarity": "0.40193003",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yl3ky",
            "score": 2,
            "text": "Brace yourself for the conspiracy theorist captains raging over being forced to get the poke. You’d be surprised at how many are out there flying your butt around.",
            "title_similarity": "0.3170806",
            "sentiment_compound": -0.836
        },
        {
            "id": "h7yom01",
            "score": 2,
            "text": "They should employ the same rule for their passengers too.  An added benefit would be an end to all the in-flight fights from the idiotic \"Don't tread on me.\" crowd.",
            "title_similarity": "0.31470746",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h7ysg4c",
            "score": 2,
            "text": "I don't get the push back. How is this any different than requiring MMR/TB/Tdap/Flu vaccine records prior to employment or school?",
            "title_similarity": "0.46903095",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yvst0",
            "score": 2,
            "text": "If there were to be adverse side effects would the employees be able to sue the company for requiring them to get it?",
            "title_similarity": "0.35182178",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h7z79vt",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7z8gtp",
            "score": 2,
            "text": "How in the world was this not already a thing??",
            "title_similarity": "-0.0013360102",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7zgl0j",
            "score": 2,
            "text": "For the first time UA did something awesome.",
            "title_similarity": "0.26347452",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h804sni",
            "score": 2,
            "text": "Well, it looks like there will be a bunch of openings for Democrats who want to work at United Airlines. Haha.",
            "title_similarity": "0.5818343",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h8062bp",
            "score": 2,
            "text": "Good! Every employee should do the same.",
            "title_similarity": "0.116398856",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h8265fs",
            "score": 2,
            "text": "You know how capitalism should solve this: \n\nHello, this is your health insurance. We’re happy to cover your expenses for Covid variant which slipped through the vaccine we covered. \n\nOh you aren’t vaccinated? Well, then we can’t cover your care.",
            "title_similarity": "0.56053275",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h7xnw1b",
            "score": -11,
            "text": "How does this comply or not comply with HIPAA?",
            "title_similarity": "0.1381562",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xqygt",
            "score": -10,
            "text": "Remind not fly that blood clotting airlines",
            "title_similarity": "0.28460336",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xu2tv",
            "score": -10,
            "text": "That’s horse crap. I hope they all strike, along with all the nurses that are being forced to do the same.",
            "title_similarity": "0.27617145",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h7xubgv",
            "score": -11,
            "text": "It baffles me how companies are requiring this and the vaccine hasn't yet been approved by the FDA.  Prepare yourselves for some major class action lawsuits regarding unlawful terminations in the future.",
            "title_similarity": "0.5396867",
            "sentiment_compound": -0.4932
        },
        {
            "id": "h7y1f58",
            "score": -10,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7yqqje",
            "score": -9,
            "text": "Very disappointing to hear.  These airlines all play follow the leader so this isn't good news for delta or American employees either. Carriers like jet blue and southwest pretend to care more about customers and employees than the big 3 so hopefully they will keep it optional.",
            "title_similarity": "0.38518113",
            "sentiment_compound": 0.616
        },
        {
            "id": "h7y7s1b",
            "score": 18,
            "text": "Your body, your choice but not your company. If you don’t like it, you’re free to find somewhere else to work.",
            "title_similarity": "0.10437295",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h7xm8fc",
            "score": 685,
            "text": "I have a friend who has a great job with a major air line. He has discussed his air line requiring vaccines for all employees. He is aware that they will eventually require them for all employees. He has stated that he will give up his 100k a year cushy job he has been at for 20 years if he is required to get a vaccine. \n\nThis man has a GED. He is also aware that he will not be able to find a comparable job with similar pay and benefits. In fact I have told him, as we work in the same type of industry, he is likely to end up with a job paying 40 to 60k a year of he quits his current. \n\nGiving up 60k a year to own the libs and not get vaxxed is just insane.",
            "title_similarity": "0.6961502",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h7yrgqc",
            "score": 11,
            "text": "This is an incredibly smart move. They get to enjoy the positive media coverage while at the same time allowing their most stupid employees to self select out of their jobs.",
            "title_similarity": "0.23737547",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h7xof4x",
            "score": 3,
            "text": "I support this. They are covering their ass from lawsuits: “I was force to work in an unsafe environment, exposed to the covid—19 virus”",
            "title_similarity": "0.36382243",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h7xoj66",
            "score": -3,
            "text": "[The 'planted things in your head' in this image means that a Earth spy agency implanted false memories.  I was going to edit the words into something else (along with brain surgery -> vaccination) - then I realized that the original context applies just as well to anti-vax propaganda.](https://www.schlockmercenary.com/strip/4223/0/schlock20120103.jpg?v=1532319941097)",
            "title_similarity": "0.42378917",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h7xvcyt",
            "score": 3,
            "text": "/r/NoNewNormal collectively losing their shit",
            "title_similarity": "0.096723855",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h7xvg5l",
            "score": 2,
            "text": "Why does everyone think there’s going to be these massive amounts of people quitting or strikes when over 70% of people 18+ have already gotten at least one dose lol.",
            "title_similarity": "0.642979",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h7y7jvk",
            "score": 3,
            "text": "Good, hope Delta follows suit",
            "title_similarity": "0.009870448",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h7y8c6p",
            "score": -3,
            "text": "United Airlines : We are now hiring\n\nEdit: downvote from those who've contracted vaccineism",
            "title_similarity": "0.5976616",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7yc10d",
            "score": -4,
            "text": "That’s respect for Nurmberg trials and human rights, right there 🤦🏻‍♂️",
            "title_similarity": "0.10698542",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h7yes7j",
            "score": -3,
            "text": "Hoo boy!  I see about 10,000 job openings in the very near future!",
            "title_similarity": "0.5656151",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yldor",
            "score": 3,
            "text": "At least they’ll be protected from the legions of idiots that travel unvaccinated.",
            "title_similarity": "0.22508647",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7yot8v",
            "score": 2,
            "text": "I hope my employer does this soon, I work in construction and we were deemed “essential” through this.",
            "title_similarity": "0.2756158",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7z4nra",
            "score": 3,
            "text": "If someone gets banned from one airline they should be banned from all of them. If I were running an airline I would want to know who the assholes are and not let them fly on my airline.",
            "title_similarity": "0.3645695",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h7z654r",
            "score": 4,
            "text": "Good.",
            "title_similarity": "-0.10822566",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7zj2p3",
            "score": 3,
            "text": "This should be under unpopular opinion, why give incentives? Americans are getting a life saving vaccine that other countries/people would walk 1,000 miles for. It's pure insanity. It's free WTF are we doing? Only in America.",
            "title_similarity": "0.61456347",
            "sentiment_compound": -0.6115
        },
        {
            "id": "h7zwt49",
            "score": 3,
            "text": "I do not understand why people are allowed to opt out for religious reasons. Medical reasons (allergies or immune system issues) that would make it too dangerous, okay. Their religion should not be a determining factor in this. If it only affected them, then sure but this is public health and their dumbass decision affects others.",
            "title_similarity": "0.2992959",
            "sentiment_compound": -0.6757
        },
        {
            "id": "h80b6pz",
            "score": 3,
            "text": "Had to burn 2 vacation days at my work to get mine. Don’t look a gift horse in the mouth",
            "title_similarity": "0.46490225",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7yje3g",
            "score": 12,
            "text": "It was going to get FDA approved regardless. Let's see what nonsense these anti-vaxxers will pull out of there buttholes when they can no longer say \"its not FDA approved\"",
            "title_similarity": "0.3772325",
            "sentiment_compound": -0.5318
        },
        {
            "id": "h7xsv0p",
            "score": 5,
            "text": "> sorted by: controversial\n\nI'm going in.",
            "title_similarity": "0.07493572",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h7y7xxs",
            "score": 4,
            "text": "Hopefully more companies require their employees to get vaccinated. It's probably our best bet to decrease the chances of new viruses developing because of mutations and evolution.",
            "title_similarity": "0.5485493",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h7ybez4",
            "score": 3,
            "text": "My brother in Mexico says that has been the rule with United in Mexico for some time now and no one in Mexico cares, they are happy to get the vaccine.",
            "title_similarity": "0.49900973",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h7ybp25",
            "score": -5,
            "text": "who’s love there mRNA shots?😏 Feels so good when the cells start changing... Made me get a second one!",
            "title_similarity": "0.28874242",
            "sentiment_compound": 0.8494
        },
        {
            "id": "h7yc6uj",
            "score": 5,
            "text": "They require vaccination now? It's been available for so long.",
            "title_similarity": "0.4407078",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yd2vy",
            "score": 5,
            "text": "Ironically if people just went out and got vaccinated companies wouldn't require them to do so. But enough idiots exists now that it's becoming mandatory.",
            "title_similarity": "0.4929573",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h7yigha",
            "score": 5,
            "text": "Well I'm glad when I have to fly United later this year at least I'll be safe from the staff. Now I just have to worry about the other passengers.",
            "title_similarity": "0.4696868",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h7yrccu",
            "score": 5,
            "text": "In Clark County,Nevada,in order to work in the food service industry you used to be required to get a hepatitis A vaccination in order to receive your health card. This is no different.",
            "title_similarity": "0.61292297",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7yvirx",
            "score": 2,
            "text": "A few thousand people die in a terrorist attack, and twenty years later I still can't get anywhere near my flight without taking off my shoes, throwing out any liquids over 3oz, and walking through a scanner that looks under my clothes.\n\nWe're probably going to see the \"one million Americans dead of covid\" mark, and willfully unvaccinated people are still allowed to fly?\n\nWhat kind of bullshit is that? Why are we still letting bioterrorists on planes?",
            "title_similarity": "0.6044332",
            "sentiment_compound": -0.9707
        },
        {
            "id": "h7z48et",
            "score": 5,
            "text": "my sister is an attendant for american airlines and keeps spewing bullshit about how they “cant make her” get the vaccine.... i want them to require it so bad",
            "title_similarity": "0.55700576",
            "sentiment_compound": -0.8398
        },
        {
            "id": "h7zygq6",
            "score": 4,
            "text": "Anti vaxxers gonna be fighting over the same jobs at the same 3rd tier companies, driving wages down in thar category…while normal people thrive",
            "title_similarity": "0.4518373",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h805fml",
            "score": 5,
            "text": "Unless you have a medical condition that would endanger your life, COVID vaccinations should be mandated across the population.",
            "title_similarity": "0.39496925",
            "sentiment_compound": 0.0
        },
        {
            "id": "h806b60",
            "score": 4,
            "text": "Why Do we expect some sort of award to get a goddamn vaccination to save our asses ??I’m just so sick of this I’m so sick of everybody having to be bribed to do something that they (IMHO all day long) should be doing anyway !?!!! Sure it’s nice BUT I would still get it with or without the incentive of money . And I did months ago like 4,5 months so come on people this is a global worldwide pandemic nobody seems to give a shit about your fellow human being .so selfish and greedy.",
            "title_similarity": "0.49807382",
            "sentiment_compound": -0.9399
        },
        {
            "id": "h80ajga",
            "score": -4,
            "text": "Do they even have any employees to vaccinate? All I keep seeing are videos of their employees quitting.",
            "title_similarity": "0.43877566",
            "sentiment_compound": 0.0
        },
        {
            "id": "h80gn0b",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h80ujr6",
            "score": 4,
            "text": "Just scrolling to find the Republican crying that we’re turning into socialists 😂",
            "title_similarity": "0.29108453",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h7xppyr",
            "score": 16,
            "text": "Spirit Airlines is charging its customers $100 extra to have a vaccinated crew.  $50 to ensure all the crew members wear masks.  $25 to ensure that crew members are not allowed to cough in your face.",
            "title_similarity": "0.67711496",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h7xsnb5",
            "score": -5,
            "text": "So when United employees refuse & are fired, we’ll pay them to stay home, right?  And since they don’t have a job, they won’t have to pay rent, right?  So in a not-so-roundabout way we’re rewarding them for not being vaccinated, right?",
            "title_similarity": "0.40821967",
            "sentiment_compound": -0.1684
        },
        {
            "id": "h7xxekp",
            "score": -4,
            "text": "This is great news in this particular situation, but I can't be the only one that does not like the idea of private businesses having this kind of power over employees. This should be a job for our elected representatives, not some random Karen from HR.",
            "title_similarity": "0.37655473",
            "sentiment_compound": -0.0297
        },
        {
            "id": "h7y1ild",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7y3lwd",
            "score": 5,
            "text": "A lot of travel companies are looking to the bigger brands to take initiative. This is huge.",
            "title_similarity": "0.44189316",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7yao0m",
            "score": 6,
            "text": "Awesome, I’ll be flying with them in two weeks.",
            "title_similarity": "0.47668234",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h7yb3mj",
            "score": 5,
            "text": "How many (more) Americans have to die, or be crippled for life, before they all wake the fuck up? \n\nNo one knows, folks, but it looks like they might finally be catching on that this is for real and the rest of the world didn't just make it up to make Trump look bad. \n\nBut who knows; someone might tweet something...",
            "title_similarity": "0.5317711",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h7yzwi3",
            "score": -5,
            "text": "99% survival rate. This is about control",
            "title_similarity": "0.34529155",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xtnw2",
            "score": -6,
            "text": "I can’t stand performative activism. If they wanted to ‘keep people safe’: When can we address that airlines contribute 4%-5% to greenhouse emissions annually?\n\nWhat about doing things now to prevent the damage glabal warming will have on our society in 20 years? \n\nOr, now even? Cause, you know, not that having 70% of federal land on fire in 2020 was enough to make people more worried?\n\nI’d rather not go through any of this ever again.",
            "title_similarity": "0.6242763",
            "sentiment_compound": -0.8102
        },
        {
            "id": "h7y7ngw",
            "score": 6,
            "text": "I hope all US companies follow suit.  Having employees walk around and interact with each other when they might be contagious is stupid and exposes the business to being sued.",
            "title_similarity": "0.340226",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h7yd8w3",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7yknbu",
            "score": 6,
            "text": "Im not an airline worker but the company I work for travels all over the country and they pretty much told us if we didn't get the vaccine, they weren't sure if our future in the company could continue. \n\nI'm not mad though I got it as soon as I could and thr company has to protect its interests (making money) and if we need to be vaccinated to access customer sites to do our job and get paid, then that's what we gotta do.",
            "title_similarity": "0.60820186",
            "sentiment_compound": 0.9042
        },
        {
            "id": "h7yn4vx",
            "score": -5,
            "text": "We’ll, say goodbye to most of your employees.",
            "title_similarity": "0.2643053",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7z7w4b",
            "score": -7,
            "text": "Straight to the Supreme Court.",
            "title_similarity": "0.27532724",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h7xt0lt",
            "score": 114,
            "text": "I was on a United flight not too long ago and they were VERY thorough about safety precautions for both employees and travelers. I was expecting the worst for a flight but I was pleasantly surprised.",
            "title_similarity": "0.50817657",
            "sentiment_compound": 0.7439
        },
        {
            "id": "h7yarto",
            "score": -8,
            "text": "Not surprised. It's what you do to your cattle",
            "title_similarity": "0.13119426",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h7yftv4",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7yfw9t",
            "score": -7,
            "text": "Will they pay for the vaccinations?",
            "title_similarity": "0.45705602",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h7yx9ka",
            "score": -7,
            "text": "Bring down these airlines. Boycott, quit, protest. Enough is enough.",
            "title_similarity": "0.24327746",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h7yhic5",
            "score": 9,
            "text": "Next up: Vaccines required for international travel.",
            "title_similarity": "0.47800988",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xt0jx",
            "score": 282,
            "text": "*browses by controversial*",
            "title_similarity": "0.076805405",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h7xniis",
            "score": 26,
            "text": "Can’t wait to see how this goes over at a certain other carrier which only flies 737s…",
            "title_similarity": "0.45761222",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7xdik7",
            "score": 3329,
            "text": "On an unrelated note now if they can only do something about unruly passengers like a complete lifetime ban air travel because it's getting out of hand for flight attendants",
            "title_similarity": "0.3812465",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7xomzp",
            "score": -10,
            "text": "So the FAA won’t let pilots fly if they were on anti depressants 30 years ago but are perfectly fine with people getting a vaccine that’s been out less then a year. Makes sense.",
            "title_similarity": "0.57836235",
            "sentiment_compound": 0.7615
        },
        {
            "id": "h7xoe4m",
            "score": 157,
            "text": "I am not the least bit surprised as more and more companies do this. They want things to get back to normal. They want to make as much money as they were making pre-pandemic. They don’t want to lose more money after losing so much in 2020.",
            "title_similarity": "0.48419636",
            "sentiment_compound": -0.4144
        },
        {
            "id": "h7ybsyd",
            "score": 17,
            "text": "Every vax required post I see, I grow more anxious for the r/leopardsatemyface post that I know are coming.\n\n“I regret quitting my $180k pilot job over bullshit!!!”",
            "title_similarity": "0.49905112",
            "sentiment_compound": -0.7157
        },
        {
            "id": "h7xohl2",
            "score": 279,
            "text": "Absolutely makes sense when a lot of your employees are crammed in a tube with a bunch of people and regularly crossing international borders.\n\nThe logistics of staffing based on vaccination status and various countries' laws on vaccination would be an absolute nightmare. They'd be opening themselves to a lot of headache if an unvaccinated pilot could no longer fly to a destination and had to completely rework their schedule.",
            "title_similarity": "0.56033254",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7y1616",
            "score": 23,
            "text": "Delta really missed their opportunity to be first with this.",
            "title_similarity": "0.1160232",
            "sentiment_compound": 0.1458
        },
        {
            "id": "h7y2ptd",
            "score": 23,
            "text": "can someone please explain to me why the COVID vaccine is such a polarizing issue? but if an HIV or cancer “vaccine” came out tomorrow, it would be the most celebrated achievement in modern medicine?",
            "title_similarity": "0.54241717",
            "sentiment_compound": 0.1026
        },
        {
            "id": "h7xmeib",
            "score": 9452,
            "text": "You’d think DELTA would be the first.",
            "title_similarity": "0.1436587",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7zbf8c",
            "score": 57,
            "text": "Well, of course United will do everything possible to stop Delta.",
            "title_similarity": "0.2361627",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h7xhrtp",
            "score": 3689,
            "text": "My in laws are pilots for United. They have already got the vaccine, but they had incentives. Aka, $2000 check for every pilot that got the vaccine. Not sure about the rest of the employees.",
            "title_similarity": "0.6943487",
            "sentiment_compound": 0.3415
        },
        {
            "id": "h7xk6l8",
            "score": 1,
            "text": "Good. Hopefully more employees do the same. Antivaxxers need to understand that freedom of choice does not mean freedom from consequences. Don’t want a shot? That’s your choice, but you’ll have to go find another job (if anyone will hire unvaccinated people).",
            "title_similarity": "0.28629956",
            "sentiment_compound": 0.5213
        },
        {
            "id": "h7xqgbf",
            "score": 1,
            "text": "Good because they don’t require shit to fly",
            "title_similarity": "0.035140365",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h7xqpui",
            "score": 1,
            "text": "does this mean my flight will be delayed?",
            "title_similarity": "0.25617394",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h7xth5h",
            "score": 1,
            "text": "Wonder how many will quit because of this",
            "title_similarity": "0.29450995",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xum2k",
            "score": 1,
            "text": "I wonder how many will leave the company",
            "title_similarity": "0.4008445",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h7xx48y",
            "score": 2,
            "text": "Maybe pilots are not easily replaceable",
            "title_similarity": "0.19663644",
            "sentiment_compound": -0.2584
        },
        {
            "id": "h7xz3p5",
            "score": 2,
            "text": "Well, they tend to get hands on with the passengers.",
            "title_similarity": "0.06998302",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7xzneu",
            "score": 1,
            "text": "I wonder how many they are single handedly responsible for before they decided to take action. No billionaire corpo takes this kind of action without coming close to legal action.",
            "title_similarity": "0.5036044",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h7y1ke6",
            "score": 1,
            "text": "Just like children....sad that grown adults have to be treated like this.",
            "title_similarity": "0.28147388",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h7y28tb",
            "score": 1,
            "text": "United shouldn't be commended for being responsible since over the last 15 years they have treated their customers like dirt. Just look at all the customer horror stories, especially the last 5 years. So now there doing what they're supposed to, what's so impressive about that? They got huge U.S. government aid both in 2008-2010 and again 2020 while most small businesses got nothing. Very difficult to give them a thumbs up.",
            "title_similarity": "0.66880006",
            "sentiment_compound": 0.7883
        },
        {
            "id": "h7y2fce",
            "score": 1,
            "text": "Good move, still a shit airline that I avoid like the plague.",
            "title_similarity": "0.2860561",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h7y7cfg",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7y7pp0",
            "score": 3,
            "text": "Just flew a bunch, United (especially) and Frontier (sort of) were serious about masks. Southwest did not care.",
            "title_similarity": "0.23258314",
            "sentiment_compound": -0.033
        },
        {
            "id": "h7yb53q",
            "score": 1,
            "text": "why should antivaxers care, they live in fly-over states",
            "title_similarity": "0.4172941",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h7yclmy",
            "score": 1,
            "text": "Your turn Southwest Airlines",
            "title_similarity": "0.27335367",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ye6hf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.05656311"
        },
        {
            "id": "h7ye7wx",
            "score": 1,
            "text": "At this point, it’s liability suicide not to do this. Five years from now, courts aren’t going to give the corps a pass because 35% of the country is currently batshit cult-heads. On second thought, 30 years ago courts wouldn’t have necessarily given them a complete pass. Now they can do whatever the fuck they want as long as Twitter has something else going on that day.",
            "title_similarity": "0.5909314",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h7yea76",
            "score": 1,
            "text": "This shouldn’t surprise anyone",
            "title_similarity": "-0.0008801352",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7yfwuc",
            "score": 1,
            "text": "67,000 United Airlines Employees Not Vaccinated",
            "title_similarity": "0.6865108",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7yhnk5",
            "score": 1,
            "text": " $2000. thtd change trump worshipers minds",
            "title_similarity": "0.5017592",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h7yjlf1",
            "score": 2,
            "text": "Hold up, they weren’t vaccinated yet?",
            "title_similarity": "0.27938175",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ykby7",
            "score": 2,
            "text": "Hold up, they haven’t been vaccinated this whole time?",
            "title_similarity": "0.40528917",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ymenl",
            "score": 2,
            "text": "Curious if other airlines will follow.",
            "title_similarity": "0.19711404",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7yml3l",
            "score": 3,
            "text": "Be careful if you're from another country. They may require one type of vaccine too and not mixed. Had to cancel a trip recently because the US won't except mixed vaccines.",
            "title_similarity": "0.5007108",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h7ymygx",
            "score": 1,
            "text": "Or… you get a black eye? Lets not forget.",
            "title_similarity": "0.081022136",
            "sentiment_compound": 0.1695
        },
        {
            "id": "h7ynbhd",
            "score": 2,
            "text": "For a company that will kill your dog during your flight, this is a pretty cool move.",
            "title_similarity": "0.2956341",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h7ypq8l",
            "score": 14,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7yrglk",
            "score": 1,
            "text": "A first? You'd think it'd be the norm. Specially when you fly overseas.",
            "title_similarity": "0.3430028",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yrmd9",
            "score": 1,
            "text": "Can they run their planes on time now?",
            "title_similarity": "0.35045955",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ytgwz",
            "score": 1,
            "text": "Well, gonna be a lot of jobs available at United soon.",
            "title_similarity": "0.32769784",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h7ytq3i",
            "score": 2,
            "text": "If they get sick then it should be workmans comp",
            "title_similarity": "0.23898625",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h7yuhvs",
            "score": 1,
            "text": "They'd sooner drag a doctor off the plane",
            "title_similarity": "0.35505873",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h7yuqi5",
            "score": 1,
            "text": "Reddit moment comment section",
            "title_similarity": "0.11685208",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yushq",
            "score": 2,
            "text": "Just one look at their international network and it makes 100% sense that they’re doing this",
            "title_similarity": "0.37770852",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yuxdk",
            "score": 1,
            "text": "They weren’t, already?",
            "title_similarity": "0.0064670546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yw4nm",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.023195429"
        },
        {
            "id": "h7ywuwx",
            "score": 9,
            "text": "Hmm looks like some jobs should be opening soon.",
            "title_similarity": "0.14613248",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7yyoef",
            "score": 1,
            "text": "I am pro-vax, but I have a random question. Why was there not this big of a push for other diseases such as H1N1 in 2009?",
            "title_similarity": "0.5032298",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yzlxy",
            "score": 1,
            "text": "Good!",
            "title_similarity": "-0.09465788",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h7yzs3v",
            "score": 1,
            "text": "My only worry about pilots and vaccines is that the vaccines has been known to cause some blood clots. Flying increases chance of blood clots.  I may not step on a plane for a little while.",
            "title_similarity": "0.56686044",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h7z0kc5",
            "score": 1,
            "text": "Time to sort by controversial!",
            "title_similarity": "0.014645682",
            "sentiment_compound": -0.2714
        },
        {
            "id": "h7z0qax",
            "score": 2,
            "text": "Just send covid antivaxers on a cruise.",
            "title_similarity": "0.28572702",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7z17ox",
            "score": 1,
            "text": "Serious question, with companies requiring larger numbers of employees to be vaccinated, what happens to the inevitable few that can’t get the second shot for legitimate reason (severe reaction, etc)?",
            "title_similarity": "0.6222117",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h7z1az7",
            "score": 2,
            "text": "I was randomly thinking about becoming a flight attendant the other day. Do you think this is going to cause a percentage of attendants to quit and then I could take their place?",
            "title_similarity": "0.47657222",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7z22ry",
            "score": 3,
            "text": "Cue Conservatives flip-flopping on private companies running their businesses as they see fit because the companies are doing something *they* don't like now.",
            "title_similarity": "0.44017926",
            "sentiment_compound": 0.1002
        },
        {
            "id": "h7z314l",
            "score": 3,
            "text": "Cant wait for all the fresh content for r/byebyejob",
            "title_similarity": "0.28598332",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7z3fbd",
            "score": 1,
            "text": "Meanwhile, civilians get shit on for being vaccinated 😂",
            "title_similarity": "0.41710016",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h7z9bf4",
            "score": 2,
            "text": "Relax folks it’s just a “pilot programme”",
            "title_similarity": "0.09431377",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7zb5m7",
            "score": 17,
            "text": "Jacobson v. Massachusetts, 197 U.S. 11 (1905), was a United States Supreme Court case in which the Court upheld the authority of states to enforce compulsory vaccination laws. The Court's decision articulated the view that individual liberty is not absolute and is subject to the police power of the state.",
            "title_similarity": "0.4856234",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h7zcaqy",
            "score": 1,
            "text": "I feel like it's only the travel companies that seem to get that staff and customer deaths are bad for business. Lately, I mean.",
            "title_similarity": "0.47926897",
            "sentiment_compound": -0.25
        },
        {
            "id": "h7zchp2",
            "score": 7,
            "text": "I've flown American and United several times in the last 2 years and United *ain't fuckin' around.*",
            "title_similarity": "0.5669905",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h7zf6o2",
            "score": 1,
            "text": "Come on American Airlines, you can do this too. I believe in you!",
            "title_similarity": "0.3429504",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7zju5t",
            "score": 2,
            "text": "Is this going to be an annual mandate?",
            "title_similarity": "0.39974418",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7zm3td",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.02319543"
        },
        {
            "id": "h7zpuip",
            "score": 1,
            "text": "Imagine if they made it a requirement to fly to certain airports. Maybe just O'Hare and bam, that's a lot of connecting flights already.",
            "title_similarity": "0.47376347",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7zqerl",
            "score": 4,
            "text": "I wish my retail job would do this. Instead they just brought back mask mandates so I get to protect the unvaccinated for the rest of my life.",
            "title_similarity": "0.43902683",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h7zqq20",
            "score": 2,
            "text": "Lol, no company wants covid isolation stories, anymore.",
            "title_similarity": "0.2090956",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h7zr5gg",
            "score": 13,
            "text": "The amount of outrage will be Amazing!! \n\nFuck off with your anti-vaccine bullshit and let’s start traveling again. 💉 up boys and girls!",
            "title_similarity": "0.37107462",
            "sentiment_compound": -0.826
        },
        {
            "id": "h7zth1z",
            "score": 4,
            "text": "How is this not mandated for ALL airlines",
            "title_similarity": "0.3908977",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7zuaek",
            "score": 2,
            "text": "I have always said it will be the corporations that drive this thing. You want to work for them - get a shot. You want to use their service - get a shot. Politicians have put these guys on quite a pedestal and you’ll rarely win if you go up against the company, especially in those right to work states.",
            "title_similarity": "0.48056817",
            "sentiment_compound": -0.3553
        },
        {
            "id": "h7zxo30",
            "score": 3,
            "text": "makes good business sense if your paying for the employee's health care insurance.",
            "title_similarity": "0.37043536",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h803qhq",
            "score": 1,
            "text": "I wonder how many will quit or get fired",
            "title_similarity": "0.2920062",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h804hqb",
            "score": 8,
            "text": "I personally want to fly with a group of professionals from the tarmac crews, baggage system to the pilots who are science driven. The Airline Industry/ Business is based on science and uses science to ensure a very high level of personal safety for all traveling. Fly with someone else, your decision.  I do not take it personally and hopefully United and you can work it out in the future.",
            "title_similarity": "0.46470588",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h805plu",
            "score": 8,
            "text": "All of this shit should've happened in March.",
            "title_similarity": "0.4454965",
            "sentiment_compound": -0.6428
        },
        {
            "id": "h805qb6",
            "score": 3,
            "text": "What's the cotton pickin' holdup on requiring the vaccines?",
            "title_similarity": "0.5333102",
            "sentiment_compound": 0.0
        },
        {
            "id": "h80639z",
            "score": 2,
            "text": "What about MMA Training for flight attendants,is that required now?",
            "title_similarity": "0.40591228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h807q7k",
            "score": 6,
            "text": "They need to do a \"We stand united against DETLA.\" ad. lol.",
            "title_similarity": "0.24263057",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h8080po",
            "score": 3,
            "text": "Seems like a missed opportunity for delta",
            "title_similarity": "0.047671817",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h80c3mm",
            "score": 3,
            "text": "You have to use reverse psychology and historical facts to get people to agree with something. \n\n[George Washington](https://www.snopes.com/fact-check/washington-order-troops-vaccinated/) and our founding fathers would have wanted us to get vaccinated, if you don't then you're a traitor, unAmerican, and not a patriot.",
            "title_similarity": "0.5431152",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h80ir7c",
            "score": 3,
            "text": "That’s great and all but never forget that United breaks guitars.",
            "title_similarity": "0.36622727",
            "sentiment_compound": 0.1408
        },
        {
            "id": "h80kxk5",
            "score": 1,
            "text": "Do they have a contract with just one manufacturer?",
            "title_similarity": "0.28157037",
            "sentiment_compound": 0.0
        },
        {
            "id": "h80uhoi",
            "score": 2,
            "text": "I feel like this should have been an obvious thing to do right away.",
            "title_similarity": "0.08780818",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h816uqf",
            "score": 2,
            "text": "60k employees...at least a few gotta be crazy anti-vaxxers. I await the hilarious \"infringing on my rights\" and \"Bill Gates 5g chip\" videos.",
            "title_similarity": "0.5042763",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h81bx2u",
            "score": 1,
            "text": "Heard. Apply at United. Jobs will be available in America.",
            "title_similarity": "0.39953136",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h81fooz",
            "score": 3,
            "text": "I’ll start flying United because they at least have some balls to say ‘enough is enough’",
            "title_similarity": "0.21328622",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h81kg52",
            "score": 1,
            "text": "But not the passengers!",
            "title_similarity": "0.010492501",
            "sentiment_compound": 0.0
        },
        {
            "id": "h846fbm",
            "score": 1,
            "text": "The unions aren’t happy... they said this was a bargaining issue.",
            "title_similarity": "0.19585945",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h866yvb",
            "score": 1,
            "text": "Complains about Apple scanning phones for child porn, but promotes mandatory vaccination. I'm baffled by some people's logic.",
            "title_similarity": "0.44580367",
            "sentiment_compound": 0.4118
        },
        {
            "id": "h8ivjyt",
            "score": 1,
            "text": "The carrot didn't work, time for the stick.",
            "title_similarity": "0.11314911",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8rc7qt",
            "score": 1,
            "text": "Fuck ‘em if they can’t take a poke.",
            "title_similarity": "0.043117497",
            "sentiment_compound": -0.5423
        }
    ]
}