{
    "Pentagon to require COVID vaccine for all troops by Sept. 15\n": [
        {
            "id": "h8bnpqs",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8bhvx6",
            "score": 36,
            "text": "I hope that this decision signals a step in the right direction for our country. We need mask and vaccine mandates and we need them immediately. Finding the appropriate consequences for scofflaws will be a test of ingenuity and perseverance for our leaders.",
            "title_similarity": "0.44461355",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8bh8g7",
            "score": -5,
            "text": "Can we expand this to veterans receiving benefits? Seems like a lot of ex military are anti science and bought into the GQP.",
            "title_similarity": "0.4934137",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8buks0",
            "score": 1,
            "text": "Good. Any idiots refusing should get court marshalled and dishonourably discharged.",
            "title_similarity": "0.23504174",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h8bm6tv",
            "score": 29,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8bfzkd",
            "score": 7,
            "text": "Hopefully the military has some balls and absolutely throws the book at anyone who disobeys this order.",
            "title_similarity": "0.43885487",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8btdwo",
            "score": 7,
            "text": "Has the FDA given the vaccine for any manufacturer the full authorization?",
            "title_similarity": "0.60848475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bewxo",
            "score": 9,
            "text": "Nice, was waiting for this one to drop.",
            "title_similarity": "0.07560771",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h8brh5x",
            "score": 8,
            "text": "Get fucked antivaxtrds",
            "title_similarity": "0.13919139",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8bhk4k",
            "score": 10,
            "text": " All the MAGA hats who don't want the government to tell them what to do and then happily signed up for the military are going to be so super mad guys.",
            "title_similarity": "0.5014738",
            "sentiment_compound": 0.7087
        },
        {
            "id": "h8bezk6",
            "score": 321,
            "text": "this is the death of freedom. troops can't just be *ordered* to vaccinate. people must understand that the military isn't some hierarchy where people have to do what they're told. horrendous.",
            "title_similarity": "0.3348713",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8biqta",
            "score": 20,
            "text": "This is how you do it. Should’ve happened six months ago.",
            "title_similarity": "0.44306222",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8btpxs",
            "score": 18,
            "text": "2 more weeks to flatten the curve",
            "title_similarity": "0.4394787",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bv5kr",
            "score": 1,
            "text": "Did this include people in the reserves?  I have two antivax dumbasses I'm forced to work next to and they're both in the reserves...",
            "title_similarity": "0.32778674",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h8bl050",
            "score": -2,
            "text": "Actually a perfect argument for Anti-vaxxers. “The military gets all the vaccines” “Do you hate the troops, and not support our military?” - they’ll just counter with more BS against it unfortunately…",
            "title_similarity": "0.5933886",
            "sentiment_compound": -0.5801
        },
        {
            "id": "h8baryi",
            "score": -10,
            "text": "Wait a minute.. I've seen this episode before\n\nEdit: not an anti-vaxxer just wondering why its news that soldiers are getting vaccines lol, they always mandate it",
            "title_similarity": "0.6305722",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8bbjml",
            "score": 18,
            "text": "Thank The Universe! Finally, some of the leadership are doing their jobs.",
            "title_similarity": "0.11809045",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h8b4szb",
            "score": 113,
            "text": "Fantastic.\n\nWe don’t need nutjobs in our military.",
            "title_similarity": "0.22061503",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h8bbcdu",
            "score": 2,
            "text": "This seems…later than I would expect it to be.",
            "title_similarity": "0.14935847",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bz2q4",
            "score": 1,
            "text": "Pretty sly solution to another problem.",
            "title_similarity": "-0.08649346",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8bd3oh",
            "score": 5,
            "text": "Tucker Carlson saw this pop up in his news feed and squealed with excitement",
            "title_similarity": "0.3897623",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h8b6bm9",
            "score": 50,
            "text": "Added benefit of weeding out the crazyest MAGA-QAnon bozos.",
            "title_similarity": "0.13477159",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8bkc5j",
            "score": 0,
            "text": "Sign up for the military and you should know you’re subject that whichever experiment they desire. Any service member is immediately given 15+ shots. Some for shit you’ve never heard about",
            "title_similarity": "0.73511547",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h8bm9np",
            "score": 40,
            "text": "**if** ***this*** **isn't proof the vaccine is actually safe, idk wtf is.**\n\nwe're literally injecting our **entire fucking fighting force** with this vaccine! if it was really \"dangerous\" at all, would the US really gamble all of its military power??",
            "title_similarity": "0.51996624",
            "sentiment_compound": -0.8457
        },
        {
            "id": "h8b845m",
            "score": 174,
            "text": "New rule: if you ask to be discharged from the armed forces because you're scared of a vaccine, you're never allowed to talk about how brave you are for defending this country",
            "title_similarity": "0.4517394",
            "sentiment_compound": 0.128
        },
        {
            "id": "h8bn8lp",
            "score": -13,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8bf2bq",
            "score": 3,
            "text": "That's one way to clean up the ranks.",
            "title_similarity": "0.117657825",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8b5tod",
            "score": 66,
            "text": "Wonder how many right-wing crybabies will ask for a discharge over this.",
            "title_similarity": "0.48467845",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8biq9n",
            "score": 9,
            "text": "I'm vaccinated.\n\nI've got a lot of buddies that are trying to find every regulation and exception to policy possible to not get it.\n\nI do not know why.",
            "title_similarity": "0.4934513",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bl7qh",
            "score": 1,
            "text": "Can’t wait to hear the conspiracy nuts in my shop freak out.",
            "title_similarity": "0.4165526",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h8bod9n",
            "score": 5,
            "text": "Look at that! Progress! Suck a dick anti vaxxors",
            "title_similarity": "0.21917182",
            "sentiment_compound": -0.7418
        },
        {
            "id": "h8buecq",
            "score": -4,
            "text": "How about for every one or get the fuck out",
            "title_similarity": "0.23099124",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8bmskb",
            "score": -64,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8bjme5",
            "score": -5,
            "text": "Now make it a condition of all employment!!!!!",
            "title_similarity": "0.34226108",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bmkj7",
            "score": -3,
            "text": "Unlike a civilian job they can’t quit. With so many Trumpers in the service I wonder what their reaction will be to taking away their right to infect others?",
            "title_similarity": "0.36022907",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bec0h",
            "score": 87,
            "text": "Some dumb ass rednecks are about to be kicked out of the military for refusing the vaccine, aren’t they?\n\nEdit: No apologies will be given to the dumbass in the comments that doesn’t know I’m a vet too 😂",
            "title_similarity": "0.4581865",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h8b8ovi",
            "score": 7,
            "text": "I'm surprised this hasn't been implemented already.",
            "title_similarity": "0.12685184",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8cmmdt",
            "score": 2,
            "text": "This is misleading. By mid-September the DOD will request a waiver to make the vaccine mandatory (if it’s not already FDA approved). The vaccine itself won’t necessarily be mandatory by then. \n\nYou can listen for yourself here: https://twitter.com/deptofdefense/status/1424813274806296586?s=21",
            "title_similarity": "0.6201081",
            "sentiment_compound": -0.5318
        },
        {
            "id": "h8bgp0c",
            "score": 29,
            "text": "It's ironic. The US military is filled with Conservatives but is as Socialist as it gets in this country.",
            "title_similarity": "0.29780972",
            "sentiment_compound": -0.0644
        },
        {
            "id": "h8biwfa",
            "score": 22,
            "text": "Laughing my ass off because I have two coworkers in the reserves and they have been so adamant about not taking the vaccine. Can’t wait until they hear the news. I’ve been waiting for a blow up.",
            "title_similarity": "0.5082948",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h8bk1dh",
            "score": 10,
            "text": "Didn't realize I had wandered into r/peanutgallery \n\nThe military has a better vaxx rate than most countries, including ours. Get over yourselves.",
            "title_similarity": "0.39217186",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8d3b9i",
            "score": -3,
            "text": "Hey… So basically I'm just gonna not take it (the vaccine)… I know… UGH, I know… It's just that, I'm not gonna take it is all… Hahahahahaha!",
            "title_similarity": "0.3038056",
            "sentiment_compound": -0.5893
        },
        {
            "id": "h8bd4j4",
            "score": 34,
            "text": "Can’t wait to hear conservatives bitch that soldiers should have the freedom to refuse .",
            "title_similarity": "0.43457037",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h8bhz21",
            "score": 13,
            "text": "The army maga's gonna cry.",
            "title_similarity": "0.3802703",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h8blsu2",
            "score": 13,
            "text": "This is a good way to remove “crazy Q” from the army.",
            "title_similarity": "0.30744153",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8bdi4b",
            "score": -118,
            "text": "[deleted]",
            "title_similarity": "0.021559004"
        },
        {
            "id": "h8bnreu",
            "score": 0,
            "text": "Surprised they didn’t mandate it a year ago for the troops honestly.",
            "title_similarity": "0.4900185",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h8bm93e",
            "score": 7,
            "text": "Sir you are government property. Act accordingly.",
            "title_similarity": "0.18710905",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bo9wb",
            "score": -8,
            "text": "My friend in the Army got the anthrax vaccine, 5 days later he was diagnosed as a type 1 diabetic and was discharged. No disability either.",
            "title_similarity": "0.56150997",
            "sentiment_compound": 0.25
        },
        {
            "id": "h8b5u19",
            "score": -24,
            "text": "[deleted]",
            "title_similarity": "0.021559004"
        },
        {
            "id": "h8cmh1r",
            "score": 3,
            "text": "Companies require vaccine > Anti-Vaxxers quit > Poor\n\nFederal Employee require vaccine > Anti-Vaxxers quit > Poor\n\nSchool require vaccine for teachers > Anti-Vaxxers quit > Poor\n\nMilitary require vaccine > Anti-Vaxxers desert > Jail\n\nStates requiring Vaccine Passport > Anti-Vaxxers leave state > Poor\n\nAnti-Vaxxers trying to find job. Cannot, it requires proof of vaccine. Poor.\n\nAnti-Vaxxers gets COVID. Insurance Bill too high. Maybe no insurance cause no job. Poor and in Debt again.\n\nAnti-Vaxxers get COVID. In ICU, regrets, wants vaccine. Too late. You cannot buy car insurance during an accident claim. \n\nA lot of stupid people in America fueled by Facebook as their source of truth.\n\nA lot of stupid people in America soon to give rise to more stupid people. Idiocracy is now a documentary.\n\nIt's 2024. Covid Omega Plus is rampant. Everything is in lock down. The unvaccinated are arrested on sight and forced to take the jab. Freedoms and Rights are non-existent, sweeping reform and bills has stripped away all the freedom we enjoy.\n\nAll because\n\nYou refuse to take a jab.",
            "title_similarity": "0.48958635",
            "sentiment_compound": -0.9842
        },
        {
            "id": "h8bnd52",
            "score": 5,
            "text": "Are you guys ready for the Recreationally Outraged™ people who normally can be seen with \"support our troops\" stickers cry foul about this?",
            "title_similarity": "0.37682974",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8c8zyt",
            "score": -16,
            "text": "I know I’m going to be badly downvoted, but here goes.\n\nIf you are not now, never have and do not plan on serving in the US military, shut all the fuck up.\n\nPeople will say we get like 12 vaccinations in Boot camp. They’re right. We don’t get a choice about it, and no one fucking informed us they were coming, either. To my knowledge, those are all FDA approved vaccinations…\n\nOr are they? They don’t fucking tell you. There’s no stopping to ask what they even *are*, let alone if they’re FDA approves. Boot camp- at least in the Marines- does a pretty good job of removing any sense of agency that you have. They remove your opportunity to think or act for your self. You’re counted down for *everything*- there’s a count down for brushing your fucking *teeth.* If you even so much as talk in the shot line at medical, you get ITed until your fucking lungs are exploding and put back in line. Rinse and repeat as many times as they feel like. That’s what boot camp **is**. There’s no time to stop and ask questions.\n\nSo stop with this argument that “we all get 12 vaccinations in boot camp, this is no different.”\n\n“We all have to get the flu shot, this is no different.”\n\nThose are all FDA approved vaccinations with significant years of research, study, and observation with well-known and documented side-effects.\n\nThis new vaccine for COVID isn’t nearly as well studied or time-tested yet.\n\n“It’s safe! Science says so!”\n\nBitch we had no idea that asbestos caused lung cancer for a LONG time. California has “this shit may cause cancer” on *every*fucking*thing*. Every year someone tells us eggs are bad for us, and then every *other* year those some someones come back and tell us eggs are good for us.\n\nThis isn’t some liberal vs. conservative plot to divide the world. It’s not a sudden media coverup to cause a divide between skeptics and believers, and it certainly isn’t your run of the mill “I signed up for this and voluntarily waived my rights to choose and most of my freedoms” that all military members signed up for.\n\nThis is some unprecedented, untrodden ground that we’re paving, and military members don’t deserve to be used as unwilling guinea pigs… **again**.\n\nWe’re not your fucking lab rats, we’re not your goddamn test tubes or incubators.\n\nWe’re people. Just like you. I served with prior teachers, high school students, mechanics, office clerks and a few former strippers. I served with a dude who came into the Marines as a Private and he was a fucking CEO in the normal world.\n\nNone of us gets to make these kinds of decisions for ourselves, and we shouldn’t be forced into taking experimental vaccines or vaccines developed a certain way for the first time in all of history before we’ve had a chance to watch the science emerge and genuinely observe the outcomes, whatever they may be.\n\nNow I’m not personally against the vaccine at all. If you wanna get it, get it. If you don’t, don’t. That’s the shit **I** served for- so people can have the freedom to make their own fucking choices. Why the fuck do service members not get a choice like this?\n\nI’m not your fucking lab rat, and I’m tired of Reddit’s hyper-sheltered dick-bag couch experts insinuating that **actual lab rats** should have more fucking freedom than we service members do.\n\nIf you’re not a service member- current or prior- shut the fuck up. If you’re planning on being a service member, go serve and then tell me how you feel. Until then, shut the fuck up.",
            "title_similarity": "0.5549291",
            "sentiment_compound": -0.5558
        },
        {
            "id": "h8b4sgf",
            "score": 20,
            "text": "Trying to stay optimistic, but between the very vague language around penalties for refusing a vaccine, and things like this:\n \n> *\"service members can seek an exemption from any vaccine — either temporary or permanent — for a variety of reasons including health issues or religious beliefs\"*  \n \nI'm not sure this will be super effective.  Here's hoping, though.",
            "title_similarity": "0.4494012",
            "sentiment_compound": 0.9015
        },
        {
            "id": "h8bz2ok",
            "score": -20,
            "text": "Can't wait for the unvaxxed armbands to come. As a US Marine, I am watching my country and our freedoms being destroyed by the same people that commanded me to \"protect our Freedoms\"...",
            "title_similarity": "0.40383923",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8bl41g",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8dhlv3",
            "score": 0,
            "text": "Gonna see a lot of Section 8's when they try to explain why they are refusing the shot",
            "title_similarity": "0.34658593",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h8cn6mh",
            "score": 3,
            "text": "Is the FDA going to approve it or not?",
            "title_similarity": "0.39730796",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d2qp7",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8b9698",
            "score": 9,
            "text": "Man I remember the Flu shots being a liberty item. I'd yeet over to medical to get that shit done asap.",
            "title_similarity": "0.59676105",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h8b1jrr",
            "score": 51,
            "text": "It's about to get FDA approved so it makes sense",
            "title_similarity": "0.4469983",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8bvipg",
            "score": 8,
            "text": "What's amazing is the talk of \"control\" and government mandates.  \n\nYou antivax fucktards are getting your info from LITERALLY 12 people, who are the primary source of Covid disinformation.\n\nLol funny word control. Being controlled by 12 rich people.",
            "title_similarity": "0.38625324",
            "sentiment_compound": 0.9201
        },
        {
            "id": "h8bjb1i",
            "score": 7,
            "text": "The government owns you when you are in the military so of coarse the will require a covid shot just like the 20 other shots you get with them.",
            "title_similarity": "0.525561",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8bpnih",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8bo2xo",
            "score": 3,
            "text": "Finally, brass showing some cajones on the matter. Sure some dudebro Marines will pout, but this is vastly overdue in the public sector.",
            "title_similarity": "0.3864302",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h8btbwz",
            "score": -2,
            "text": "Good time to be a Liberal",
            "title_similarity": "0.11655756",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8bobgo",
            "score": -3,
            "text": "It’s because it needed FDA approval to be mandated. Look it up. Not sure why this is being downvoted as it’s public knowledge that this is the reason. But keep being angry at the truth I guess. 🤣",
            "title_similarity": "0.39347672",
            "sentiment_compound": 0.5218
        },
        {
            "id": "h8bq5nv",
            "score": -5,
            "text": "Wow I love the military now",
            "title_similarity": "0.23083599",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h8c3jw6",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8bbnh4",
            "score": 14,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8bl5o6",
            "score": 18,
            "text": "Meanwhile my fellow military co-workers are complaining it’s not FDA approved while they take pre-workout that isn’t FDA approved, smoke cigarettes regularly, and struggle with passive functional alcoholism.",
            "title_similarity": "0.41652524",
            "sentiment_compound": -0.21
        },
        {
            "id": "h8bm7a9",
            "score": -64,
            "text": "Breaking news: military enrollment drops by 95%",
            "title_similarity": "0.45177692",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bppl8",
            "score": 6,
            "text": "\"Service members can seek an exemption from any vaccine — either   \ntemporary or permanent — for a variety of reasons including health   \nissues or religious beliefs. Regulations involving the other mandatory   \nvaccines say, for example, that anyone who had a severe adverse reaction  \n to the vaccine can be exempt, and those who are pregnant or have other   \nconditions can postpone a shot.\"\n\nLots of Christian Science converts today.",
            "title_similarity": "0.5726451",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h8btk1r",
            "score": 4,
            "text": "Reading the comments I swear it looks like bots talking to eachother here lmao",
            "title_similarity": "0.32261539",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h8ckg4h",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8blqra",
            "score": 3,
            "text": "I’ve got a buddy who has sworn up and down that he won’t get the vaccine. For the sake of his wife, kid, and general mental stability I hope he gets it.",
            "title_similarity": "0.46461666",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8c27ip",
            "score": -2,
            "text": "FYI, most of the military is right/republican, and that's who joins.",
            "title_similarity": "0.32478768",
            "sentiment_compound": 0.368
        },
        {
            "id": "h8bgju9",
            "score": -24,
            "text": "Why stop there? Make this shit mandatory for ALL. Don't want to get vaccinated? Track where their ancestors came from and deport their asses. This country needs real patriotism in times like these. It is not fair to make some people and the rest not? My COnsTiTuTioNal rIghT? Fuck that, No one whoever you are, no one has 100% plentiful or complete freedom. Look it up, the supreme court says so. Now, move your ass and get the fucking vaccine!",
            "title_similarity": "0.53192824",
            "sentiment_compound": -0.8653
        },
        {
            "id": "h8bl2ht",
            "score": 1,
            "text": "I assumed they had already been vaccinated. I sure as shit got shots for everything under the sun. Anthrax to yellow fever and everything in between.",
            "title_similarity": "0.5788101",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8bmecn",
            "score": 1,
            "text": "You'd think that this would put an end to the whole \"it's a slow-kill operation\" conspiracy, but it'll probably turn into \"BiDeN iS tRyInG tO cOuP DeETaT tHe mIliTaRy\"",
            "title_similarity": "0.37627727",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8bnz9a",
            "score": -1,
            "text": "I hate to break the news to anyone who’s unaware, but every single person who is or has been in the military has been stuck with a shitload of vaccinations and medications. Most of which aren’t FDA approved. This shouldn’t even be news.",
            "title_similarity": "0.49962202",
            "sentiment_compound": -0.1406
        },
        {
            "id": "h8bxv0x",
            "score": 1,
            "text": "Sounds reasonable, cant wait to hear all the \"patriots\" complain about this one.",
            "title_similarity": "0.34386677",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h8c2q3b",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8dsdnv",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8bv6kp",
            "score": -6,
            "text": "Breaking: Pentagon to require all other nations to become a \"liberal democracy\" or they will \"free you.\"",
            "title_similarity": "0.6060938",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8c2dk7",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8bmndi",
            "score": 17,
            "text": "Lmao I have a younger brother in the army who was just being a dick on FB yesterday about the vaccine and actually trying to defend Desantis. Can't wait to hear what he thinks about this.",
            "title_similarity": "0.5860573",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h8bla59",
            "score": -5,
            "text": "wasnt there some caveat that the vaccine had to be FDA approve after that whole bullshit they put the troops thru being the guinea pigs for some never gas bullshit in the gulf???",
            "title_similarity": "0.6023072",
            "sentiment_compound": -0.3111
        },
        {
            "id": "h8bzr78",
            "score": 5,
            "text": "Makes sense. They’re at huge risk! Most deadly pandemic in history!!",
            "title_similarity": "0.3393197",
            "sentiment_compound": 0.2677
        },
        {
            "id": "h8c4c2v",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8d9pyp",
            "score": -4,
            "text": "I just don’t understand how something not fda approved can be required.",
            "title_similarity": "0.15550122",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h8bj6hd",
            "score": -50,
            "text": "I recall something that goes like “my body my choice”",
            "title_similarity": "0.2222153",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8bs522",
            "score": -23,
            "text": "Why do they keep calling it a vaccine.",
            "title_similarity": "0.4298264",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c5xrn",
            "score": -12,
            "text": "Money printer go brrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr.",
            "title_similarity": "0.1924884",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bk60h",
            "score": 5,
            "text": "So do these rightwing nutjob conspiracy theorists think the top secret people above are killing all the troops ?",
            "title_similarity": "0.434958",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h8cyk7h",
            "score": 7,
            "text": "[Full list](https://www.reddit.com/r/YouveBeenGoofed/comments/p1fbbo/dont_forget_to_take_the_poll_folks/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) of all of the other vaccines they already have to take",
            "title_similarity": "0.6846381",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bcpu8",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8bh5b6",
            "score": 4,
            "text": "Smart move, the soldiers need to be protected",
            "title_similarity": "0.19666287",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h8bh6u0",
            "score": -1,
            "text": "If you get the vaccine then you’re not allowed to join any militias or do any coups once you’re discharged. Them’s the rules.",
            "title_similarity": "0.45500386",
            "sentiment_compound": -0.2235
        },
        {
            "id": "h8bjfxy",
            "score": 3,
            "text": "Oh boy. This might not go well",
            "title_similarity": "-0.004769602",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h8bljl4",
            "score": 3,
            "text": "Man the REAL PATRIOTS are gonna have some trouble with this one huh",
            "title_similarity": "0.23558898",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h8bmiw8",
            "score": 3,
            "text": "Honestly, this is kind of a 'duh' thing, but it will be politicized...\n\nI wonder how many might actually prefer a discharge vs the vaccine?",
            "title_similarity": "0.35090292",
            "sentiment_compound": 0.25
        },
        {
            "id": "h8bn39h",
            "score": 1,
            "text": "For anyone who joined the military where they take the risk of dying for the US, this should be no issue. The FDA is expected to give full approval by the end of this month anyway.",
            "title_similarity": "0.6875386",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h8c94mj",
            "score": 3,
            "text": "Good now expand that to DoD contractor and make it a requirement for your security clearance.  That’ll weed things very fast",
            "title_similarity": "0.44654158",
            "sentiment_compound": 0.765
        },
        {
            "id": "h8cbmlu",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8ctqe5",
            "score": -2,
            "text": "My father got shot in the head in Vietnam I always went to the VA with him. Was sitting in the waiting room and meet a soldier that and ied took his arm and leg. And they said he wasn’t 100% disabled and told him he could still work so they didn’t have to give his benefits.",
            "title_similarity": "0.5287362",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h8dn0mw",
            "score": 2,
            "text": "Like the mandatory anthrax vaccine? Like the pre deployment cow pox vaccine?  Like the government property you become ruled by the former uniform code of military justice.",
            "title_similarity": "0.6416565",
            "sentiment_compound": 0.89
        },
        {
            "id": "h8bgcpb",
            "score": 24,
            "text": "We had an aircraft carrier with a diminished state of readiness due to a massive covid outbreak onboard. Vaccinating all troops is a simple matter of national security.",
            "title_similarity": "0.5081504",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h8bn9at",
            "score": -24,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8bpv1v",
            "score": -22,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8b8kfr",
            "score": 58,
            "text": "So what you're saying is... Not getting the vaccine is unpatriotic.",
            "title_similarity": "0.24366862",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bizz2",
            "score": 11,
            "text": "Everyone of my wife's side of the family are career military, 30+ years kind people.  One cousin who has been in the service for years posts the most bat shit crazy stuff on social media all day long about covid; you know, \"plandimic\", \"sheeple\", 5G Nancy Soros government control kinda shit.  It's going to be interesting to see him post his thoughts on this.  Hopefully he just sticks out his arm like a rational person and never talks about it again, but I'm worried this event could tip him into leaving the service and becoming a wacko extremist guy who lives in the woods, thinks trump is still president, and hates the government that betrayed him after serving the country for so long.",
            "title_similarity": "0.5617484",
            "sentiment_compound": -0.9138
        },
        {
            "id": "h8d012c",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8bdear",
            "score": 19,
            "text": "So what? You already get tons of vaccines when you go through boot camp. One more isn’t a big deal and it helps prevent you from getting seriously ill and dying of Covid. I don’t see a downside to this.",
            "title_similarity": "0.57308924",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h8budx3",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8bk5ux",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.021559004"
        },
        {
            "id": "h8bz8nb",
            "score": 6,
            "text": "I served in the Air Force many years ago.\n\nFlu shot wasn't optional every year, nor were other less frequent vaccinations.\n\nIt blew my mind that covid vaccination was still optional. Bunch of wingnuts going so far with their damned anti-covid vaccination political statement that they'd put military readiness at risk. \n\nRoll up your sleeve and get your g\\*ddamn shot, or get the f\\*ck out.",
            "title_similarity": "0.55794",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h8c2az3",
            "score": -6,
            "text": "It needs to be administered to every single person by physical force at this point. It’s the only way.",
            "title_similarity": "0.3627354",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cko3t",
            "score": -9,
            "text": "I don't understand how they can even legally mandate it when it isn't FDA approved yet",
            "title_similarity": "0.28684348",
            "sentiment_compound": -0.234
        },
        {
            "id": "h8bd7al",
            "score": -17,
            "text": "This will be interesting to see how it plays out.. I’d reckon there are a fair share of soldiers who are totally against it but theyre not going to have a say. I bet some go AWOL tbh",
            "title_similarity": "0.32912403",
            "sentiment_compound": -0.1153
        },
        {
            "id": "h8bkpy1",
            "score": -5,
            "text": "Didn’t they say the other day that they will allow them to not take it if it’s for religious reasons",
            "title_similarity": "0.3132957",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8blsms",
            "score": 5,
            "text": "I’ll be shipping out for basic training on October 4th. Glad to see this, not surprised, just glad. Of all the things I’m willing to accept happening at basic “getting sick because some douche didn’t get the most high profile vaccine of our time” is not one of them.",
            "title_similarity": "0.51154995",
            "sentiment_compound": -0.5181
        },
        {
            "id": "h8bnkz3",
            "score": 3,
            "text": "Hopefully this will purge the trumpsters from within.",
            "title_similarity": "0.25203216",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8bp1tg",
            "score": 3,
            "text": "but their freedom /s... who bets that some yahoo is going to be dishonorably discharged over this because he or she is going to fight this in the media... then there will be the gofundme for them.",
            "title_similarity": "0.36192894",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h8bwbeo",
            "score": -3,
            "text": "I see a mass exodus of staff coming",
            "title_similarity": "0.3005156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c56n2",
            "score": -3,
            "text": "good luck fighting from an hospital bed guys!",
            "title_similarity": "0.31108606",
            "sentiment_compound": 0.5707
        },
        {
            "id": "h8c8x7c",
            "score": -2,
            "text": "US Army gonna be facing off the US Militia any day now cause of a vaccine 😂",
            "title_similarity": "0.72868216",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8c9rni",
            "score": -3,
            "text": "What a shame the military was strong due to idiots",
            "title_similarity": "0.19749591",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h8cbjfn",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8cm0he",
            "score": -5,
            "text": "First - I got my vaccine - but I do understand the concern about getting a shot that is not FDA approved.  If it’s approved, then fine force the military to get it.  But until then, it should not be forced.  How long does this t take to get FDA approval?  Not just FDA approval for emergency use.",
            "title_similarity": "0.551098",
            "sentiment_compound": 0.5486
        },
        {
            "id": "h8czk8w",
            "score": 3,
            "text": "I thought for a moment there may be some legal ramification for forcing soldiers to take a drug that is not fully approved by the FDA. Then I realized they have been forcing soldiers to take non-FDA approved drugs/shots for years.\n\nLook's like this is not the hill to die on",
            "title_similarity": "0.5368169",
            "sentiment_compound": -0.1652
        },
        {
            "id": "h8d0sx5",
            "score": 3,
            "text": "Oh no! Looks like the military is not in the anti-vax, Qanon, Trump loving side, but rather they will respond to their superiors as this is part of their duty to protect the constitution and not the politicians! Who knew?",
            "title_similarity": "0.2833419",
            "sentiment_compound": 0.8652
        },
        {
            "id": "h8dohu9",
            "score": -3,
            "text": "Looks like they’re losing a LOT of employees .",
            "title_similarity": "0.21424794",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h8bbrhd",
            "score": -5,
            "text": "Hmm why September? My work is making it mandatory by September also and I’m curious now",
            "title_similarity": "0.53091216",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h8bo48m",
            "score": 9,
            "text": "Oh you mean the men our government pretends they feel are important to them are FINALLY going to be forced to survive our countries idiots? Good. \n\nIf you're a patriot you should already be vaccinated. A true patriot cares about their country and their countryman well being before anything else. \n\nSo.. what's the holdup?",
            "title_similarity": "0.4322874",
            "sentiment_compound": 0.8205
        },
        {
            "id": "h8buwvj",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8b32dz",
            "score": 195,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8b7jgg",
            "score": 48,
            "text": "I am waiting for FOX to start interviewing former troops who dont want the shot and are angry at the mandate/gov't intrusion (i.e. Big Gov't Biden) and leave the military due to it. You know its coming.\n\nI am old enough to remember people leaving the military over the military possibly allowing openly gay folks serve (like they werent serving already!!!) and going on TV bitching about it.",
            "title_similarity": "0.46889785",
            "sentiment_compound": -0.6367
        },
        {
            "id": "h8bcqxc",
            "score": -22,
            "text": "That \"next wave insurrection\". It's here.",
            "title_similarity": "0.27215979",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bxj97",
            "score": -22,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8brkll",
            "score": 9,
            "text": "I hope this weeds out the Qanon troops. Those lunatics don't need military training.",
            "title_similarity": "0.28915334",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8cjfgi",
            "score": -6,
            "text": "you think they will walk this back if people stop enlisting?",
            "title_similarity": "0.301943",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8bkjmo",
            "score": -4,
            "text": "Great news for anyone hoping the next Republican administration won't use the military to size power lol",
            "title_similarity": "0.345754",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h8blm8p",
            "score": 2,
            "text": "Honestly, if people fear the COVID vaccine, try getting the Smallpox vaccine. \n\nI had to receive and admin that stuff when I was in Korea. \n\nIf you've ever received it, you know what it entails. \n\nAntivaxers would literally have an aneurysm if they saw it",
            "title_similarity": "0.5819485",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h8bly3v",
            "score": 5,
            "text": "I know someone who is so irate at this that they are calling their congressman and trying to get medically exempt. Nothing screams patriotism like risking everyone’s health.",
            "title_similarity": "0.47419435",
            "sentiment_compound": -0.7971
        },
        {
            "id": "h8bnejo",
            "score": 2,
            "text": "Good! If we don’t get to herd immunity, we’ll never get control of COVID. Exceptions should only be made for those who are allergic to one of the ingredients in the vaccine.",
            "title_similarity": "0.4901309",
            "sentiment_compound": 0.2481
        },
        {
            "id": "h8bnscj",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8bqmqa",
            "score": 6,
            "text": "Honestly it’s shocking to me that this wasn’t already in place.",
            "title_similarity": "0.07087462",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8bs5s6",
            "score": 5,
            "text": "Read the comment sections on the fox news post if you want to lose more faith in humanity",
            "title_similarity": "0.41676638",
            "sentiment_compound": 0.1761
        },
        {
            "id": "h8bugta",
            "score": 4,
            "text": "Maybe the anti-vaxx/Nazis will refuse and get tossed from service",
            "title_similarity": "0.22456707",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8bv4de",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8bw1ni",
            "score": 3,
            "text": "Fantastic , great method for also removing right wing traitors.",
            "title_similarity": "0.26011163",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h8bwu4p",
            "score": 0,
            "text": "Going forward, \"They took our jobs\" includes vaccinated US citizens lol.",
            "title_similarity": "0.5209776",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8bwy8v",
            "score": 0,
            "text": "too bad they can't extend it to every human being alive",
            "title_similarity": "0.15944941",
            "sentiment_compound": -0.3438
        },
        {
            "id": "h8bydbw",
            "score": 4,
            "text": "This could be a great way to filter out some of the nutjobs and extremists in the military.",
            "title_similarity": "0.34192327",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8bz346",
            "score": 0,
            "text": "Out of curiosity, what would happen to a soldier who refused to get it?",
            "title_similarity": "0.21241239",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8c36pk",
            "score": 3,
            "text": "As an active duty service member for the last 13 years, thank god. I’m so sick and tired of hearing coworkers say “I’ll never get the vaccine” or “it’d be unconstitutional for them to force us to get it.” \n\nYou joined the military. Shut the fuck up and take the poke. It’s not as bad as Anthrax or small pox and you’ve probably had those vaccines FFS.",
            "title_similarity": "0.5929955",
            "sentiment_compound": -0.7677
        },
        {
            "id": "h8c66w6",
            "score": -4,
            "text": "[This sounds familiar, but I can’t put my finger on it](https://ptsdlawyers.com/blog/anthrax-vaccine-presents-long-term-effects/)",
            "title_similarity": "0.44700134",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c6puv",
            "score": 0,
            "text": "Military still giving yellow fever shots😆",
            "title_similarity": "0.3431964",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h8chefb",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8cqnns",
            "score": 4,
            "text": "Be a good way to vet trumpers out of the military",
            "title_similarity": "0.31190377",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8cqtea",
            "score": 0,
            "text": "That military pension gets expensive.",
            "title_similarity": "0.22282143",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d4k2m",
            "score": 0,
            "text": "if this was hoi4 i would start deleting military factorys right about now",
            "title_similarity": "0.6128478",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d6riv",
            "score": 0,
            "text": "Why not September 11th? Then we can kill two birds with one stone",
            "title_similarity": "0.41229528",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h8d6rrl",
            "score": -3,
            "text": "What if they identify as a vaccinated person.",
            "title_similarity": "0.26893586",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d9apc",
            "score": 0,
            "text": "अमेरिकी सेना के सदस्यों को अगले महीने पेंटागन द्वारा निर्धारित योजना के तहत और राष्ट्रपति जो बाइडेन द्वारा समर्थित COVID-19 वैक्सीन प्राप्त करने की आवश्यकता होगी। सभी सैनिकों को वितरित मेमो में, पेंटागन के शीर्ष नेताओं ने कहा कि सैन्य तैयारी बनाए रखने के लिए टीका एक आवश्यक कदम है।  \nरक्षा सचिव लॉयड ऑस्टिन ने कहा कि यदि टीके को अंतिम एफडीए अनुमोदन प्राप्त होता है या संक्रमण दर में वृद्धि जारी रहती है तो मध्य सितंबर की समय सीमा को तेज किया जा सकता है।  \nऑस्टिन ने अपने ज्ञापन में कहा, \"मैं सितंबर के मध्य से बाद में टीकों को अनिवार्य बनाने के लिए राष्ट्रपति की मंजूरी की मांग करूंगा, या तुरंत\" खाद्य एवं औषधि प्रशासन द्वारा लाइसेंस \"जो भी पहले हो,\" ऑस्टिन ने अपने ज्ञापन में कहा, उन्हें आवश्यकता के लिए तैयार करने के लिए चेतावनी दी।",
            "title_similarity": "0.27425608",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8de933",
            "score": 0,
            "text": "Can we extend this to the rest of the “Well Regulated” FreeDumb lovers?",
            "title_similarity": "0.23908883",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8dem3p",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8e580g",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8eux14",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8fao8f",
            "score": 0,
            "text": "I'm curious, what happens if a soldier refuses to be vaccinated. I hope none do, but would they just force you? Or lock you in military jail?",
            "title_similarity": "0.3806997",
            "sentiment_compound": 0.4515
        },
        {
            "id": "h8fjp4y",
            "score": 0,
            "text": "Damn, poor troops. Glad ess were just gonna cut our army in half lol",
            "title_similarity": "0.36684853",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h8fo7pi",
            "score": 0,
            "text": "lol at the \"other vaccines already\" people like there is no difference...",
            "title_similarity": "0.28852406",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h8bleyc",
            "score": 25,
            "text": "Work for a biotech company. CEO just mandated vaccines by October. Basically said \"This is a scientific company, this is not political, 100% of leadership is behind the decision, there is fuck loads of misinformation out there and you should know better, get with it or GTFO (barring medical/*religious* exemption). I'm proud of my employer for having a spine.",
            "title_similarity": "0.6360768",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h8bzfrw",
            "score": 9,
            "text": "Finally! I couldn’t think of a better way to purge the US military of right wing covid denying lunatics. It’s also comforting to know that delta force/rangers/seals ect will be fully covered. Can’t have em getting ill and maybe it will help convince their skeptic friends cosplaying soldiers (delta forks) at BLM rallies",
            "title_similarity": "0.47274438",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h8bf3fj",
            "score": -12,
            "text": "What about the fucking people? I.E Not military!",
            "title_similarity": "0.13192517",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bqloq",
            "score": 5,
            "text": "Oh man I can’t wait to see people attempt to argue against this.",
            "title_similarity": "0.2637884",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8brsr3",
            "score": 4,
            "text": "“Looks like I’m getting discharged.” Way to serve your country with valor and bravery! If you can’t get a measly vaccine, then you obviously can’t do anything in the military. \n\nImagine being given an order by a CO and just saying “no! I’m getting discharged!”",
            "title_similarity": "0.4899513",
            "sentiment_compound": 0.7633
        },
        {
            "id": "h8btyol",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8bzrud",
            "score": 4,
            "text": "Orders are orders. And it's about time.",
            "title_similarity": "0.2689724",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c6vn6",
            "score": -4,
            "text": "By the way did you see that cruise ship where everyone on board was completely vaccinated and they had an outbreak how did that happen. Since the CDC is blaming all the unvaccinated people for the spread",
            "title_similarity": "0.5393338",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8cn7gd",
            "score": 6,
            "text": "Good. I am sick of working with people who find an excuse to be selfish.",
            "title_similarity": "0.06095723",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8co3bm",
            "score": 3,
            "text": "A friend’s dad is retiring from the Army for this reason alone. I seriously can’t believe the stupidity of some people.",
            "title_similarity": "0.29459697",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h8cqbir",
            "score": -5,
            "text": "My father almost died from the swine flu vaccine when he served along with many others and nobody batted an eye.",
            "title_similarity": "0.4899069",
            "sentiment_compound": -0.7102
        },
        {
            "id": "h8d4xpj",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8bqr00",
            "score": -21,
            "text": "And Moderna's stock spiked today as well. Reddit loves the authoritarian corporate state now.",
            "title_similarity": "0.3674001",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h8bf06o",
            "score": 143,
            "text": "Great way to boot out all the extremists",
            "title_similarity": "0.35130793",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8blw6t",
            "score": -15,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8cwxme",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8bivls",
            "score": -30,
            "text": "Have fun maintaining recruitment.",
            "title_similarity": "-0.015734877",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8bgwzb",
            "score": 7,
            "text": "Next: FDA approving a vaccine. These are good because they're going to push millions of people in the right direction. All they needed was approval or to be given an order. In turn, it'll leave only the real idiots to scream and look dumb with less of a group to cry/whine with 'em.",
            "title_similarity": "0.5737466",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h8bz9m0",
            "score": -6,
            "text": "What could go wrong?\n\nhttps://journalofethics.ama-assn.org/article/informed-consent-military-anthrax-vaccination-case/2007-10",
            "title_similarity": "0.51171935",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h8cgr84",
            "score": 7,
            "text": "As an Active duty troop who works with ignorant fucks still denying COVIDs existence after a single guy in my shop had 5 family members die from it........ Fucking good, fuck them. Turn your head and cough",
            "title_similarity": "0.36133718",
            "sentiment_compound": -0.855
        },
        {
            "id": "h8d3zeo",
            "score": 7,
            "text": "Win-win:  achieve full vaccination of the troops, while discharging self-identified white extremists due to the massive overlap between that sort and anti-vax sentiment.",
            "title_similarity": "0.52253306",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dm4to",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8bdi5l",
            "score": -65,
            "text": "They will lose so many troops.",
            "title_similarity": "0.33049548",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h8bvtpp",
            "score": -13,
            "text": "This is terrible. You do not want the government to control what you have to put in your body. This is a ridiculous loss of human rights. I could see some justification it the vacinne prevented transmission but it does not (if you want to argue that at this point it is pointless)",
            "title_similarity": "0.25013685",
            "sentiment_compound": -0.7872
        },
        {
            "id": "h8bkygi",
            "score": 1,
            "text": "If course, it's the military. They basically own you.",
            "title_similarity": "0.33345237",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8blc03",
            "score": 1,
            "text": "I wonder how much WW2 helped cure Polio full honesty.",
            "title_similarity": "0.47867417",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h8blrp6",
            "score": 1,
            "text": "Context: FDA approved vaccines are mandatory if decided by the higher ups. When you go through training, you will get more shots than you thought possible. I was stupid enough to have trusted that my records would have gone through the official channels and didn’t have a paper copy, so I got tons of shots. \n\nI got vaccinated immediately because I believed in the science, some people are much more cautious and don’t want to get a vaccine that hasn’t reached regular FDA approval. It looks like the second it gets full approval, it’s game on for forcing everyone to get them.",
            "title_similarity": "0.5713231",
            "sentiment_compound": 0.8887
        },
        {
            "id": "h8bn2bw",
            "score": 1,
            "text": "If we’re spending millions of dollars of tax payer money to train these troops and to buy them expensive equipment to protect them, then as a taxpayer I want my investment protected.  Give them a cheap shot and keep them safe.",
            "title_similarity": "0.45079967",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h8bn5pu",
            "score": 1,
            "text": "They inject tons of stuff into those troops as it is.  One more’s not going to cause them to stop…",
            "title_similarity": "0.4687887",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bo3im",
            "score": 1,
            "text": "That guy looks like Holt",
            "title_similarity": "0.13768737",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8bpdv0",
            "score": -1,
            "text": "Misleading headline: he said he’s going to seek approval for them to be mandatory by mid September",
            "title_similarity": "0.59520614",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h8bvim9",
            "score": 1,
            "text": "People are like “duh” but ignoring the fact that half the population thinks ***THIS*** vaccine is lucifer’s jizz… not the others they have no problem with, ***THIS*** particular covid vaccine one.",
            "title_similarity": "0.4255718",
            "sentiment_compound": 0.0225
        },
        {
            "id": "h8bvmqx",
            "score": -1,
            "text": "Might want to buy Pfizer or Moderna if you have some funds sitting around. This probably is tipping their hand that they’ll going to receive full approval from the FDA sooner rather than later. \n\nEdit: clarified - I meant to say they’re getting approval quicker than what I’d seen discussed (December or Spring of next year).",
            "title_similarity": "0.5803331",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h8c1ytd",
            "score": 1,
            "text": "Good luck with that utopian",
            "title_similarity": "-0.0033559771",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h8c2o3p",
            "score": 1,
            "text": "Look at all these anti-vax moronic posts to report for misinformation",
            "title_similarity": "0.35170656",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h8c3isc",
            "score": -1,
            "text": "Maybe you're right? Are you in the military? I am.",
            "title_similarity": "0.28368673",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c3qw8",
            "score": -1,
            "text": "There are plenty of people quitting their jobs over vaccine requirements. What do the kucoo heads in the military do? They can just up and quit.",
            "title_similarity": "0.5335666",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c475f",
            "score": -1,
            "text": "You must live in a bubble... Wait for it.",
            "title_similarity": "0.12643924",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c6gv3",
            "score": 1,
            "text": "'Good' ol' parents prefering that their kids get shot rather than get the shot.",
            "title_similarity": "0.25225613",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8c7dkr",
            "score": 1,
            "text": "Military leadership traits \"Know yourself and seek self-improvement a year later. Be technically and tactically inept. Develop a sense of irresponsibility after over 600 thousand deaths\"",
            "title_similarity": "0.5337218",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c8srw",
            "score": -1,
            "text": "USA doesn’t want their slaves getting sick,\nthankfully drones don’t catch the flu",
            "title_similarity": "0.25879425",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h8ca68m",
            "score": -1,
            "text": "Turn you into a corpsman so you give the shots.",
            "title_similarity": "0.3882518",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cfihy",
            "score": -1,
            "text": "I’m sure the government requires much more of our troops than a covid vax.  I’m sure the troops got some paperwork telling them this when they signed up.  Read and understand what you sign!  And I don’t know they sign anything (doubtful) but should read definitely.  I’m not anti vax.  I got it and encourage all to do so.  But I know many vaccinated who also got very sick.  Personally I don’t believe any of them and am staying home and laying low.  Y’all stay safe.  Please.",
            "title_similarity": "0.51012325",
            "sentiment_compound": 0.8909
        },
        {
            "id": "h8clv53",
            "score": 1,
            "text": "Mandatory is not a choice...get it done!",
            "title_similarity": "0.0714108",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h8cwr4r",
            "score": -1,
            "text": "Anyone else scroll past this and thought it was Andre Braugher and a good quote from 99? No…just me?",
            "title_similarity": "0.31719327",
            "sentiment_compound": 0.504
        },
        {
            "id": "h8d3o2o",
            "score": -1,
            "text": "Wait, I thought the main priority of the troops rn was the war on covid. Literally thought they were out there killing the rona. TIL",
            "title_similarity": "0.5371764",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h8d5auy",
            "score": -1,
            "text": "Yay we love government mandates!",
            "title_similarity": "0.22701855",
            "sentiment_compound": 0.8356
        },
        {
            "id": "h8dyqd2",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8fmb05",
            "score": 1,
            "text": "I love how anyone flexing a bit of healthy skepticism is being downvoted into oblivion",
            "title_similarity": "0.1247934",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h8bdd40",
            "score": -46,
            "text": "Because experimental drugs always work out for the troops historically.",
            "title_similarity": "0.47960374",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bhqfi",
            "score": 49,
            "text": "The oldest American military tradition: listening to science and getting your immunity boosted",
            "title_similarity": "0.46085155",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8bw8f8",
            "score": -6,
            "text": "I'm sure that there will be many many lawsuits filed over this 😬",
            "title_similarity": "0.34438932",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h8ci9kz",
            "score": -6,
            "text": "This comes upon FDA approval of the vaccine and should not be taken otherwise.",
            "title_similarity": "0.47947094",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h8cnya5",
            "score": -6,
            "text": "Good thing I didn’t go for Bootcamp. I wonder what I’d have to go through all in the name of serving a shit and racist country that doesn’t recognize and appreciate the effort of the Troops.",
            "title_similarity": "0.3629993",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h8diq4v",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8evei2",
            "score": -9,
            "text": "You can’t vaccinate against respiratory illnesses like covid, the common cold, and even the flu. That’s why theres “breakthrough” cases, because a vaccine against respiratory illness DOES NOT WORK. Read the scientific literature. The CDC doesn’t go off actual scientific backing for God knows what reason. Covid isn’t going anywhere and it’s a joke to think it can be contained. It has been around longer than anyone’s realized and it a part of life.",
            "title_similarity": "0.44321418",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h8bs7fy",
            "score": -15,
            "text": "I hope we have 2 weeks with no wars, get over the brain fog, headaches, anxiety, heart palpitations. \n\n&#x200B;\n\nNot to mention the women, they're f'd",
            "title_similarity": "0.4969655",
            "sentiment_compound": 0.8528
        },
        {
            "id": "h8bmae6",
            "score": -27,
            "text": "It kills lest than 1% of people who get it….. I’m talking about Covid, not the vaccine. Do your own research on multiple sites about things.",
            "title_similarity": "0.5520151",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8b7cei",
            "score": 440,
            "text": "Good.\n\nI wish the FDA would get on with the full approval. I’m tired of my conservative relatives arguing that it’s “experimental” while also arguing they don’t need it, they can just go get some pig deworming medicine from Tractor Supply. Tucker said that it’s a cure but the doctors don’t want you to know!",
            "title_similarity": "0.45165163",
            "sentiment_compound": 0.1635
        },
        {
            "id": "h8d28iw",
            "score": 9,
            "text": "I have a coworker who’s currently a non deployed army Sargent. He got called in to give his guys a debrief on how they are getting the vaccine.  He told me he said, quote: “I don’t want to hear any of you stupid motherfuckers complain about this. It comes from up top, and I don’t care about your opinion.”  One of his guys piped up “So, you’re saying we have to get it?  We don’t have a choice?”  He said, “no. I said you don’t have a choice, and you’re a stupid motherfucker”. \n\nNice to see someone being told their opinion does not matter. It’s refreshing.",
            "title_similarity": "0.52217054",
            "sentiment_compound": -0.3887
        },
        {
            "id": "h8d54oi",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8cmkj3",
            "score": -16,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8bffls",
            "score": 2,
            "text": "Queue entitled, anti-vaxx snowflakes whining about their rights in 3, 2, 1.",
            "title_similarity": "0.34602612",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h8bgyg1",
            "score": 2,
            "text": "I cannot wait to see the comments in private military drama/shitposting groups on Fb lose their minds. You would not believe have many AD and their families are anti vax/ anti mask.",
            "title_similarity": "0.4492911",
            "sentiment_compound": -0.743
        },
        {
            "id": "h8bj1wc",
            "score": 2,
            "text": "Reminder that soldiers are Government property and they can and will put things in you that are good and harmful. Just ask a Veteran.",
            "title_similarity": "0.37559777",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8bl4zx",
            "score": -2,
            "text": "To quote Chan to Mr. October during Char's Counterattack. \"Not good enough.\" \n\nIt should have been sooner, you crayon eating fuckheads.",
            "title_similarity": "0.40202492",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h8botw5",
            "score": -2,
            "text": "Better not be the J&J one that company should have been shut down long ago!",
            "title_similarity": "0.38747245",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h8bovs0",
            "score": 2,
            "text": "It's good that they are going to start requiring everyone to get vaccinated by covid. But it seems really bad that they weren't already doing this?",
            "title_similarity": "0.5585653",
            "sentiment_compound": -0.6416
        },
        {
            "id": "h8brql6",
            "score": -2,
            "text": "Can you believe that some people actually think gulf war syndrome was a thing....... Imagine.",
            "title_similarity": "0.2701692",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h8bubds",
            "score": 2,
            "text": "They knew what they signed up for ...",
            "title_similarity": "0.14164975",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bwxxy",
            "score": 2,
            "text": "Now we get to hear them talk about how the military ain’t what it used to be…",
            "title_similarity": "0.35880178",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8by8i6",
            "score": 2,
            "text": "Wow, can you believe their infringing on the rights of people they're legally allow to execute on the spot for cowardice?",
            "title_similarity": "0.21823056",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h8c04st",
            "score": 2,
            "text": "Does this grant a discharge for those that refuse? Or contempt? Surely not everybody is going to willingly get this.",
            "title_similarity": "0.24142066",
            "sentiment_compound": -0.2406
        },
        {
            "id": "h8c1z0e",
            "score": 2,
            "text": "Doesn’t the military already inoculate all their soldiers for like, everything? \n\nWhy wouldn’t Covid be on that list.",
            "title_similarity": "0.6103872",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8c4hlz",
            "score": 2,
            "text": "I love this shit. Try playing Karen to your owners…",
            "title_similarity": "0.23568664",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h8c5c72",
            "score": 2,
            "text": "My cousin joined the marines just before the pandemic. He said that randomly in the middle of boot camp they woke him and his entire group in the middle of the night to give them all shots. He said the difference between that shot and all the ones he got in the first week of training was they didn’t tell him what it was. Looking at the timing it was likely the moderna shot. He said they did it again 4 and a half weeks later. He was so lucky to get it way before any of us could.",
            "title_similarity": "0.6349989",
            "sentiment_compound": 0.5598
        },
        {
            "id": "h8c6dzn",
            "score": 2,
            "text": "I'm already vaxed but this completely eliminates any conspiracy or vax concerns because the govt would not risk all of the troops like that",
            "title_similarity": "0.34998292",
            "sentiment_compound": -0.1342
        },
        {
            "id": "h8c73lj",
            "score": -2,
            "text": "lol, my conservative uncle won't like that",
            "title_similarity": "0.1797936",
            "sentiment_compound": 0.1754
        },
        {
            "id": "h8cbgby",
            "score": -2,
            "text": "This is getting weirder and weirder",
            "title_similarity": "0.030309528",
            "sentiment_compound": -0.25
        },
        {
            "id": "h8cfma0",
            "score": 2,
            "text": "And DON'T YOU DARE lose your shot card, mister.  Or you will by gawd start all over with all of your shots.",
            "title_similarity": "0.40074146",
            "sentiment_compound": 0.3089
        },
        {
            "id": "h8chz1i",
            "score": 2,
            "text": "All the military people I know already got it because “they already pumped me full of everything imaginable.”",
            "title_similarity": "0.47753996",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cqagr",
            "score": 2,
            "text": "Why aren’t everyone in the White House, capital workers, basically every person in Washington get vaccinated too?",
            "title_similarity": "0.61992234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ctmy4",
            "score": 2,
            "text": "Just sneak it in a box of crayons if there's any resistance",
            "title_similarity": "0.22513877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cwr9m",
            "score": -2,
            "text": "What're the repercussions if someone refuses? Mandates are only useful if there are punishments when not followed.",
            "title_similarity": "0.0967688",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h8cz357",
            "score": -2,
            "text": "They’re gonna fight COVID the best! #DroneStrikeDisease",
            "title_similarity": "0.4872614",
            "sentiment_compound": 0.4389
        },
        {
            "id": "h8d5blw",
            "score": 2,
            "text": "For any other disease that is the case. So why would that not apply to covid? That is literal law within the navy. Antibodies and past infection with any other disease, could be smallpox, doesn’t matter, you get a medical exemption to the vaccine. If THAT applies to very deadly diseases, why doesn’t that apply to natural covid immunity?",
            "title_similarity": "0.4858028",
            "sentiment_compound": 0.4515
        },
        {
            "id": "h8dbb1d",
            "score": 2,
            "text": "Good. Where I live, there is lots of military presence with their families here. A lot refuse to vaccinate and our positivity rate has been climbing up steadily. I hope they mandate it to their direct family members as well as it affects our community.",
            "title_similarity": "0.5225862",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h8bqok9",
            "score": 19,
            "text": "can't wait to hear all the dumb cunts at work bitch about this",
            "title_similarity": "0.29280257",
            "sentiment_compound": -0.9001
        },
        {
            "id": "h8bpryv",
            "score": -10,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8cgp4h",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8bmhwq",
            "score": -20,
            "text": "Oh no, I won't get drafted.\n\nNext they should make unvaccinated people not pay taxes",
            "title_similarity": "0.32271808",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h8blurd",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8bn8vq",
            "score": 3,
            "text": "Know who’s going to be upset about this? People who don’t serve and like to be outraged about others business. The same as usual. \n\nEven more hilarious is this is nothing new. Just like medical field people being required.",
            "title_similarity": "0.29941052",
            "sentiment_compound": -0.4053
        },
        {
            "id": "h8bnrh8",
            "score": -2,
            "text": "Stop trying to make the Pentagon look good",
            "title_similarity": "0.30438974",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h8bo1uw",
            "score": 1,
            "text": "About fucking time. Don’t remember anyone asking me if I would “pretty please” take the anthrax and smallpox vaccines.",
            "title_similarity": "0.57644325",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bo4n5",
            "score": 3,
            "text": "Uhmmm....why is this even news?  The *only* part of this that, as retired US Army, I find surprising, is that they are waiting that long.  I would have expected full vaccination to be nearly, if not totally, complete by now.",
            "title_similarity": "0.5489",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8bowdo",
            "score": -4,
            "text": "It’s not the fact that they are doing it it’s the fact that they lied when they said it wouldn’t happen",
            "title_similarity": "0.046214342",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h8bsamr",
            "score": 2,
            "text": "Oh thank you so much. Finally. Why is this even up for debate. Pandemic, people. Deadly disease that you are being flippant about",
            "title_similarity": "0.36844504",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8bspp4",
            "score": 3,
            "text": "Conservative freak out in 3, 2, 1,…..",
            "title_similarity": "0.19514829",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8bw4br",
            "score": 3,
            "text": "“Ugh, the military CANT make me. If they do I’ll quit!” Congratulations, you’re a piece of shit. If you hear or see anyone say this, tell them to list all the shots they got in basic training. I’m 100% sure they won’t be able to remember..hell, I can’t remember all of them. They’re just going to add it to the list. Right after your peanut butter shot. Sign on bonuses will be through the roof if enough people do decide to to get kicked out",
            "title_similarity": "0.5519504",
            "sentiment_compound": 0.7574
        },
        {
            "id": "h8bw7gs",
            "score": 3,
            "text": "This is good. I get contracted to work on a base nearby from time to time and they've all been mandated to wear masks while on base because there's simply too many unvaccinated service members. The ones who did get vaccinated are fucking pissed as the ones who didn't.",
            "title_similarity": "0.48339638",
            "sentiment_compound": -0.3804
        },
        {
            "id": "h8c23t2",
            "score": 3,
            "text": "Gonna have a lot of people changing their religion or getting out! :):)",
            "title_similarity": "0.38873145",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c4ime",
            "score": -5,
            "text": "If you do not consent to the vaccine are you honorably discharged from governmental service!",
            "title_similarity": "0.46449313",
            "sentiment_compound": 0.4635
        },
        {
            "id": "h8c5p78",
            "score": -3,
            "text": "I'm all for a vaccine mandate, but what's up with this?\n\nBiden said the country is still on a wartime footing...",
            "title_similarity": "0.5398543",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c6dxh",
            "score": 3,
            "text": "Of all the “shots” the US military gives people this seems like by far the most harmless variety",
            "title_similarity": "0.24308635",
            "sentiment_compound": 0.5849
        },
        {
            "id": "h8c78aj",
            "score": -3,
            "text": "I've never seen so many algorithmic bots congregate themselves in my life , that is , until I saw r/news and r/politics on reddit. \n\nIt is impressive the swarm that has been let loose, less impressive are the exact same robotic comments they all put out daily.",
            "title_similarity": "0.44291335",
            "sentiment_compound": 0.6133
        },
        {
            "id": "h8c87sa",
            "score": 3,
            "text": "“I’ll take a bullet for ma Cuntry but I won’t get no vaccine-ation for my community!!!!”  /s",
            "title_similarity": "0.4591866",
            "sentiment_compound": -0.6083
        },
        {
            "id": "h8c98mm",
            "score": -3,
            "text": "Oof I wonder how many will troops we will lose",
            "title_similarity": "0.37365824",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h8cbo4q",
            "score": -4,
            "text": "Congress doesn’t need vaccines, but Federal\nEmployees do? Okay",
            "title_similarity": "0.3231778",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h8ccvp9",
            "score": 3,
            "text": "Can you imagine being a lifer and throwing ALL of that away for a fuckin' jab?\n\nYeah, I don't see it either.",
            "title_similarity": "0.23367827",
            "sentiment_compound": 0.3566
        },
        {
            "id": "h8cd1mr",
            "score": 3,
            "text": "I mean, we took a hell of a lot of vaccines when I was in. Anthrax, smallpox.......I mean. The covid vaccine was nothing like what I experienced with the mentioned two.",
            "title_similarity": "0.5410516",
            "sentiment_compound": -0.7724
        },
        {
            "id": "h8ci6n4",
            "score": 2,
            "text": "Shouldn't be surprising. I got like eleven shots in one day once before I deployed. Even anthrax. I survived just fine.",
            "title_similarity": "0.42161387",
            "sentiment_compound": 0.699
        },
        {
            "id": "h8ct9a5",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8cmifi",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8d6s7l",
            "score": -14,
            "text": "I’d be more than happy to leave the shithole known as the military over this (if I bothered to be in it in the first place). I’m surprised more haven’t left considering we have an 80 something year old dementia patient as our CiC, and that we’re the laughingstock of the world at the moment.",
            "title_similarity": "0.4869033",
            "sentiment_compound": 0.5233
        },
        {
            "id": "h8bqctl",
            "score": 27,
            "text": "Can't wait to see how many people choose to let their families fall apart and go homeless because they're afraid of a needle",
            "title_similarity": "0.34672976",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bu8oh",
            "score": 25,
            "text": "Should have happened months ago \n\nPeople bring up the fact that the vaccines are still only under EUA as if that matters.\n\nThe military can order you to defuse a half ton IED, invade terrorist held territory, walk into a place after a chemical weapon attack, and drop bombs on cities.\n\nWhy the hell should it matter if the vaccine is fully approved? Especially since it is demonstrably very safe. (Certainly more safe than getting deployed to a warzone)",
            "title_similarity": "0.58109075",
            "sentiment_compound": -0.6534
        },
        {
            "id": "h8bsuw4",
            "score": 13,
            "text": "Imagine joining the military knowing full well that you maybe given orders one day which put you at risk for being shot or bombed to death in service to your country only to throw a hissy fit when ordered to get a vaccination in service for your country",
            "title_similarity": "0.6320045",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8btvw5",
            "score": 14,
            "text": "I love how Republicans complain about \"Big Pharma\" when they give out vaccines for free, but not when they charge exorbitant prices for insulin that costs pennies in other countries.",
            "title_similarity": "0.37707686",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8c19vx",
            "score": -15,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8clkb8",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8bllvm",
            "score": -14,
            "text": "I look forward to our illustrious nanobot microchip army marching in lockstep as we conquer the globe, dispensing mandatory freedom. All under the control of glorious industrialist leader Bill \"Megabrain\" Gates.",
            "title_similarity": "0.526626",
            "sentiment_compound": 0.8658
        },
        {
            "id": "h8c5m7w",
            "score": -12,
            "text": "This shit is out of control",
            "title_similarity": "-0.0042479658",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8bi2ks",
            "score": -5,
            "text": "IBH I am surprised they weren't test subjects for the vaccine. Since they are property of the government, military readiness, and all the other arguments, I genuinely thought they would be group #1 before a public rollout.",
            "title_similarity": "0.60259604",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h8bjzip",
            "score": 3,
            "text": "It requires vaccinations and other inoculations and shots of every soldier that goes overseas to a war zone, so what is the big fucking deal about this? More politicized blather.",
            "title_similarity": "0.63727427",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h8bk16r",
            "score": 4,
            "text": "Weird. I got jacked with so many shots serving as a paratrooper in the infantry. I do not recall ever having any say, or even what 1/2 the shots were.",
            "title_similarity": "0.4306943",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h8bkxki",
            "score": 5,
            "text": "Umm… nobody tell the conspiracy theorists that military members are already required to get all CDC recommended vaccinations, as well as any vaccinations required in the countries they will visit.    I personally got a dozen vaccinations in boot camp, and several more as I visited places throughout Europe and South America in my time in the Navy.",
            "title_similarity": "0.6978128",
            "sentiment_compound": -0.128
        },
        {
            "id": "h8bmyhw",
            "score": 5,
            "text": "Add it to the list of other vaccines required to join the armed services AND travel to other countries. We do this for a half of dozen viruses.\n\nA tale as old as General Washington vaccinating his troops in the 1770’s",
            "title_similarity": "0.70158213",
            "sentiment_compound": 0.296
        },
        {
            "id": "h8bny4l",
            "score": 4,
            "text": "Real patriots vaccinate to protect their loved ones and country.",
            "title_similarity": "0.38439602",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h8boxdr",
            "score": 4,
            "text": "Oh I didn't know I had a choice to get vaccinated in 30tg ag ... Propaganda on the highest level. Vaccinating soldiers. Motherfuckers I got 12 anthrax shots with no permission. Small pox. Peanut butter shots.",
            "title_similarity": "0.6406182",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8bq3z6",
            "score": 4,
            "text": "My brother is in the army and he’s has been trying to get a covid shot for the past 2 months and they won’t let him. So this is a breath of fresh air.",
            "title_similarity": "0.5453204",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8brc8i",
            "score": 4,
            "text": "As a concession to red state troops, Pentagon officials have confirmed all the racists and bigots can fly the confederate flag for a week post vaccine shots.",
            "title_similarity": "0.73118603",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8brrtn",
            "score": 4,
            "text": "My friend who’s in the military and a staunch anti vaxxer republican is going to be floored by this! I can’t wait to see it unfold.",
            "title_similarity": "0.46335593",
            "sentiment_compound": 0.2942
        },
        {
            "id": "h8bsihw",
            "score": 4,
            "text": "That should purge the Trumpanzees from the military.  \n\nTake the shot or take a DD.",
            "title_similarity": "0.43972448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8btorz",
            "score": -6,
            "text": "I'll never join green isis!",
            "title_similarity": "0.19263524",
            "sentiment_compound": -0.2914
        },
        {
            "id": "h8buyrb",
            "score": 4,
            "text": "MANDATORY VACCINES FOR TROOPS GO BACK TO 1777 as a direct order by George Washington. I would think this will work out the same.",
            "title_similarity": "0.6023972",
            "sentiment_compound": 0.2577
        },
        {
            "id": "h8bwk7r",
            "score": 4,
            "text": "This is hopefully going to driving some Qultists out of the woodwork and open some eyes in the Pentagon as to just how much the racist right has infiltrated our military.",
            "title_similarity": "0.46754953",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8byie0",
            "score": 4,
            "text": "Anti Vaxxers define cognitive dissonance.\n\n\"It's not approved by the FDA the gubment can't tell me what to do.\"\n\nFederal GOVERNMENT Institution approves it.\n\n\"Off course it's safe idiot the US FDA told me it's safe\"\n\nI fuckin can't even with these people anymore.",
            "title_similarity": "0.43864834",
            "sentiment_compound": 0.1451
        },
        {
            "id": "h8byszx",
            "score": 3,
            "text": "My first week in the army I think I got 9 different vaccinations over 3 days.   Even though I already had them. They didn’t give a fuck.  Turned me into a pin cushion. Arm hurt for days.",
            "title_similarity": "0.5983701",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h8c3mek",
            "score": -4,
            "text": "Not in the circles I travel. Time will tell.",
            "title_similarity": "0.124671645",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c4sa0",
            "score": 5,
            "text": "NOOOOO. How dare they inject military members with the covid vaccine!\n\nThey already are mandated to get most (if not all) of…\n\ndiphtheria, tetanus, and pertussis \nmeasles, mumps, rubella \nhepatitis A\nhepatitis B\nmeningococcal disease \nhuman papillomavirus \nvaricella\nPolio\n\n\nTheir bodies can’t handle another vaccine. Bad America! Bad!",
            "title_similarity": "0.624916",
            "sentiment_compound": -0.8349
        },
        {
            "id": "h8c6vhn",
            "score": -3,
            "text": "What if the reason they waited was because of recruiting?  They know they could make everyone currently enlisted get it, but people joining might not join otherwise.",
            "title_similarity": "0.35531235",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h8c8t00",
            "score": -4,
            "text": "Totally unrelated news: Right wing militias have recruiting surge of resigned military officers.",
            "title_similarity": "0.3861904",
            "sentiment_compound": -0.25
        },
        {
            "id": "h8cac5k",
            "score": -6,
            "text": "Why now?? The vaccine is *so close* to FDA approval. Seems like saying, “we’ll require full vaccination within 8 weeks of FDA approval” would go down better with the troops, have fewer legal challenges, probably get the same percentage of troops fully vaccinated by any given future date. 🤷🏻‍♀️",
            "title_similarity": "0.66471624",
            "sentiment_compound": 0.8645
        },
        {
            "id": "h8captd",
            "score": -5,
            "text": "Best time in history to be Liberal",
            "title_similarity": "0.24217623",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h8cc3oz",
            "score": 4,
            "text": "I swear if there was social media back in the 50's we'd still be dealing with widespread polio.",
            "title_similarity": "0.5360243",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h8ccqv7",
            "score": 5,
            "text": "Government property will do as they’re told.",
            "title_similarity": "0.22844267",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cfwcp",
            "score": 4,
            "text": "This isn't new, its been happening for years. \nDuring the swine flu I showed up to the shop one day and was told to go to medical and get a shot or sign your discharge papers. \nHad no idea what the shot was for and didn't find out until years later when I got out.",
            "title_similarity": "0.64286005",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h8cimea",
            "score": 3,
            "text": "That should put a stop to the ignorant, “it’s population control.” Bullshit. Every day I hear some new dumb shit about getting vaccinated from people who are scared shitless of a damn needle. Nut up and take your fucking medicine so we can get on with life FFS.",
            "title_similarity": "0.5539736",
            "sentiment_compound": -0.9754
        },
        {
            "id": "h8db97s",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8dl5lc",
            "score": -5,
            "text": "I'm expecting lots of AWOL",
            "title_similarity": "0.2963849",
            "sentiment_compound": -0.4648
        },
        {
            "id": "h8ds3qj",
            "score": 5,
            "text": "I am willing to get shot, but i am unwilling to get a shot. \n\nLogic.",
            "title_similarity": "0.12866771",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bqt6i",
            "score": 15,
            "text": "Fuck yeah, it’s cleanup time",
            "title_similarity": "0.23822635",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8brzst",
            "score": 14,
            "text": "So I’m currently serving and I’ve been vaccinated from the time it was available. The amount of my co-workers who talk about everything from cellular restructuring to waiting for FDA approval as excuses is insane. When we just recently went back to masks almost every single one of them was calling everyone who got vaccinated clowns for getting vaccinated and now having to be back in masks. It blows my mind that they don’t realize we are back in masks because of them. It’s really hard to sit in these offices and listen to these people spew their internet knowledge and tell me things like “I’ve done the research.” My new favorite is now the tough guys telling everyone “they can kiss my ass, they can’t force me to get this vaccine” as if I won’t be walking by waving to them while they’re waiting in line.",
            "title_similarity": "0.5233878",
            "sentiment_compound": 0.4601
        },
        {
            "id": "h8bmh9d",
            "score": -32,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8cgn50",
            "score": -15,
            "text": "This is going against basic human rights, but ok. Just keep forcing ppl to get something they don’t want and see how that turns out in a couple of years.",
            "title_similarity": "0.36790872",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h8brti4",
            "score": 6,
            "text": "The only people outraged or surprised by this are people who never served. To this day I couldn’t tell you everything I got during my time in service.",
            "title_similarity": "0.23708652",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h8cfsp3",
            "score": 4,
            "text": "Maybe injecting US property with vaccines will be enough for the “not fda approved” crowd to stfu. \n\nWho am i kidding, they’re already yanking at the goalposts in anticipation",
            "title_similarity": "0.5482487",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h8cgivs",
            "score": 4,
            "text": "My sister recently enlisted in the navy. I have a huge amount of respect for her decision to serve our country. It's not something I could do. But her new favorite phrase is that she \"Identify as vaccinated.\" She's super against the covid vaccine because it is \"more dangerous then covid.\" I find this kind of funny because now she has to take it.",
            "title_similarity": "0.45531297",
            "sentiment_compound": 0.8973
        },
        {
            "id": "h8cj5ae",
            "score": -4,
            "text": "Imagine all the Rona related suicides coming",
            "title_similarity": "0.38136584",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cliwb",
            "score": 6,
            "text": "most people in the armed forces saw this coming. it was sad and eye opening when i got my in feburary, the personnel in the \"no\" line were discussing how insane it was to be getting the vaccine and they'd not be getting it \n\nwe get multiple shots annually and most could not tell you what it was for, hell even in boot camp we received that we had no clue what was for. The point im trying to get across is not getting the vaccine affects unit readiness which is what the tippy top CoC cares about. \n\nThose who disagree can bitch, moan, and complain all they want but i'd go out my way to say they'll change their mind if they're faced with an OTH / Dishonorable discharge",
            "title_similarity": "0.5311326",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h8ct7gw",
            "score": -5,
            "text": "Hmmm. Could there be something they know we don’t if all of a sudden all troops must be vaccinated in 30 days? Just sayin…",
            "title_similarity": "0.6969355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cypod",
            "score": 5,
            "text": "If you don’t want the government telling you what you can do with your body then don’t give the government temporary ownership of your body.",
            "title_similarity": "0.2582534",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8d02vf",
            "score": 4,
            "text": "What’s next?! Forcing soldiers to march?! Forcing them to do push ups?! Forcing them to be on base?! Soldiers are losing all their freedoms! Reeeeeeeeeeeeeeeeeeee!",
            "title_similarity": "0.48084357",
            "sentiment_compound": -0.5466
        },
        {
            "id": "h8d4mhk",
            "score": 5,
            "text": "Honestly if you think that's wrong then you don't know that the military can literally experiment on soldiers without their consent.",
            "title_similarity": "0.3937558",
            "sentiment_compound": -0.194
        },
        {
            "id": "h8d4prz",
            "score": 4,
            "text": "Do the people who are outraged by this really not know that the troops already get vaccinations for everything under the sun? Really?",
            "title_similarity": "0.52205354",
            "sentiment_compound": -0.594
        },
        {
            "id": "h8d64cp",
            "score": -5,
            "text": "How is the same group of people that consider themselves “pro-choice” all for everyone being vaccinated?",
            "title_similarity": "0.3959072",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8djwbn",
            "score": 4,
            "text": "If you won’t even take a simple\nshot , how can you handle being shot at ?",
            "title_similarity": "0.20407629",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c3spr",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8bvpt2",
            "score": -18,
            "text": "Sucks to have something like this forced onto you, thank god I’m out of the military",
            "title_similarity": "0.25188833",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h8cx61x",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8b1itn",
            "score": 883,
            "text": "This should weed out some crazy",
            "title_similarity": "0.05880794",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8bn8du",
            "score": -20,
            "text": "Tuskegee Experiment 2.0",
            "title_similarity": "0.22866544",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c37ls",
            "score": -20,
            "text": "For everyone say, \"this is what you signed up for,\" I can assure you that not a single person signed up to be an experiment. Yes, we get more than our fair share of vaccines, including many the general public never thinks of. Fact is that this is an experimental procedure that is about to be forced onto people. Those other vaccines are tested and have existed for years. Literally no one knows what effect this will have in 5 years on your body, or what effects iflt could have on your offspring.\n\nI signed up to protect this country, and this is the price I am going to have to pay. I can say that more than half the people I work with in the military has said \"fuck the vaccine\" and the ones that got it already have offspring of their own.\n\nThe fact that no one at the CDC is even pushing for other options, despite the research being readily available, should go to show that they don't care about you. They aren't even mandating the vaccines in the CDC or the companies making them.\n\nIt's a bullshit move and I hope to God canceled before that time.",
            "title_similarity": "0.57784545",
            "sentiment_compound": -0.3103
        },
        {
            "id": "h8buf7j",
            "score": 5,
            "text": "This is standard procedure for vaccination in the military. \n\nThe only reason this is suddenly a headline to to rile up the morons.",
            "title_similarity": "0.4926703",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8bwdcd",
            "score": 6,
            "text": "I’m genuinely happy to hear this. Guys in my unit that are a higher rank than me are talking about the “side effects” of mutated DNA, making them infertile, or causing birth defects to their future children. I had a ball fucking with them (before I was offered the vaccine) that I couldn’t wait to get jabbed. Either I won’t have kids or they’ll have 6 fingers. Can’t wait to hear them “never reenlist” because of this and see them doing the oaths again in less than a year.",
            "title_similarity": "0.58872557",
            "sentiment_compound": 0.25
        },
        {
            "id": "h8by8zx",
            "score": -5,
            "text": "Omg the communists have taken over the military 😱",
            "title_similarity": "0.3700828",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h8bycaj",
            "score": 6,
            "text": "When I was in the Army, I lost track of how many shots I got.\n\nIt was a fuck-ton. You deploy and you get all the crazy shit no one in the US has gotten since the 60s.\n\nI got inoculated against fucking plague, smallpox and anthrax, and smallpox was eradicated in humans in the 70's.\n\nThey sure as shit didn't ask if I wanted to get the shots.",
            "title_similarity": "0.57215405",
            "sentiment_compound": -0.8957
        },
        {
            "id": "h8c6r4g",
            "score": -4,
            "text": "that will do wonders for the invasion yall are planning",
            "title_similarity": "0.31411782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c9oo9",
            "score": -7,
            "text": "I require the 911 video from the pentagon.",
            "title_similarity": "0.60089964",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cbc7c",
            "score": 5,
            "text": "I think all these anti-vaxxers are really just afraid of needles and made up all this voodoo bullshit to cover it up.",
            "title_similarity": "0.31232113",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h8cp70p",
            "score": 6,
            "text": "Washington made the American troops get inoculated. Take the vax and END THIS BULLSHITE!!!\n\nhttps://www.loc.gov/rr/scitech/GW&smallpoxinoculation.html",
            "title_similarity": "0.569312",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cyxfe",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8dfj0h",
            "score": -4,
            "text": "Slippery slope this one is",
            "title_similarity": "-0.13087843",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bnu4r",
            "score": -23,
            "text": "Soldiers should be given a choice no one should make you get something you don’t want.",
            "title_similarity": "0.21769832",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h8buzo7",
            "score": 23,
            "text": "I'm active duty military. Typically vaccines are mandatory for us. We get a whole litany of them in boot camp, a flue vaccine every year, and then are specific ones you need if you're going overseas.  The reason they gave for covid not being mandatory is because it was still considered experimental. We were offered it, I'm vaccinated, and over 80% of my command has been vaccinated.  I'm thrilled that it's mandatory now.\n\nEdit: I see a lot of posts talking about how many anti-vaxxers are going to go nuts and get kickes out over this. That's not how that works. They'll bitch and moan about the vaccine, but they'll get it. I also can't see this preventing people from joining. Joining the military isn't a decision people make lightly, and most times, politics isn't a consideration.",
            "title_similarity": "0.71290743",
            "sentiment_compound": -0.1402
        },
        {
            "id": "h8bv5u5",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.021559004"
        },
        {
            "id": "h8bwluw",
            "score": 8,
            "text": "Now force the people on Medicare/Medicaid to get it. That’ll be about 70% of the antimask conservatives.",
            "title_similarity": "0.6089974",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bymrv",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.021559004"
        },
        {
            "id": "h8cllii",
            "score": -9,
            "text": "Because they want more control over them. So the nano bots from the vaccine will affect their brain and the goverment will be able to control them better so they can send them on missions they wouldn't be willing to go otherwise.",
            "title_similarity": "0.4236563",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h8cplym",
            "score": 6,
            "text": "Can they please make it mandatory for anyone receiving VA benefits as well? My step dad refuses to get the vaccine and he refuses to acknowledge that if he catches covid he will 100% be hospitalized bc of pre existing health issues. No amount of statistics or reasoning will change his mind.",
            "title_similarity": "0.55610573",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8bsrib",
            "score": 8,
            "text": "Can't believe they're going to start telling soldiers what to do.",
            "title_similarity": "0.3630522",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cbkyt",
            "score": 8,
            "text": "Just like General George Washington figured out, vaccinated troops are an advantage. In addition, the military is concerned about the extremists in the ranks, this might screen some out.",
            "title_similarity": "0.42097065",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h8ch591",
            "score": -8,
            "text": "But this one is different, not approved by FDA",
            "title_similarity": "0.10684513",
            "sentiment_compound": -0.4585
        },
        {
            "id": "h8cs97i",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8b2h55",
            "score": 346,
            "text": "The military iirc has been vaccinated at a slightly higher rate than the general public. \n\nEither way, I expect those waiting on approval are gonna move the goalposts again.",
            "title_similarity": "0.521742",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h8bmx10",
            "score": 71,
            "text": "I cant wait for people outside the military to be far far more outraged about this than actual people serving.",
            "title_similarity": "0.41272852",
            "sentiment_compound": -0.5849
        },
        {
            "id": "h8blxf1",
            "score": -25,
            "text": "This is absolutely terrible!",
            "title_similarity": "0.051632453",
            "sentiment_compound": -0.5697
        },
        {
            "id": "h8bpcnm",
            "score": 26,
            "text": "This and other large employers mandating it will go a long ways toward helping the US reach vax numbers that will turn this around. Let’s get this thing knocked out and get back to normal!!",
            "title_similarity": "0.53691417",
            "sentiment_compound": 0.4374
        },
        {
            "id": "h8bwudb",
            "score": 9,
            "text": "I’m a veteran. I’m all for this. I know a LOT of active duty buddies who have pledged that it’s government overreach and plan to sue the government and also separate when their contract is up. \n\nIt’s fucking baffling to me. But these are the same people who hate Biden and love trump so it’s on brand for them.",
            "title_similarity": "0.44511914",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h8c7nd7",
            "score": 10,
            "text": "If the vaccine were risky, there's no way in hell the US government would require it for the entire armed forces.",
            "title_similarity": "0.40975663",
            "sentiment_compound": -0.8225
        },
        {
            "id": "h8cayya",
            "score": -10,
            "text": "Insane and ridiculous",
            "title_similarity": "0.020697758",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h8cewwy",
            "score": -9,
            "text": "Aka american military loses half their members",
            "title_similarity": "0.42484814",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8d1j7i",
            "score": -7,
            "text": "Congrats, every human disease just now became declarable which you must provide at the request of someone or face some punitive actions.",
            "title_similarity": "0.49818486",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h8bsmcq",
            "score": 121,
            "text": "Lets see how many people are willing to take a bullet for this country, but not a shot for their neighbors.",
            "title_similarity": "0.37192312",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8b1cw6",
            "score": -56,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8c77p0",
            "score": 8,
            "text": " Canadian military was vaccinated before our civilians, as they were essential in helping get the vaccine logistics handled",
            "title_similarity": "0.54730356",
            "sentiment_compound": 0.296
        },
        {
            "id": "h8cg528",
            "score": -11,
            "text": "Great reason for all these young kids not to join military. Also they do realize most of people that join military are in the south, also that's same group that's anti vax. Good luck with draft.",
            "title_similarity": "0.44215152",
            "sentiment_compound": 0.8407
        },
        {
            "id": "h8d7ot4",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8dg55f",
            "score": 11,
            "text": "“But it’s not FDA approved” scream the people who believed hydroxychloroquine was a miracle cure cause a moron told them it was.",
            "title_similarity": "0.39510036",
            "sentiment_compound": 0.4325
        },
        {
            "id": "h8bgwwx",
            "score": 183,
            "text": "Best part is all the folks who suddenly don’t remember that first day at basic training/boot camp where you get 8+ vaccines in a matter of 5 minutes. \n\nRemember when you sign that dotted line your body autonomy is owned by the DOD and US government.",
            "title_similarity": "0.62727565",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h8bq5hl",
            "score": 135,
            "text": "Wait till they find out that they are required to wear uniforms.",
            "title_similarity": "0.3707093",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bqevw",
            "score": 9,
            "text": "Im not nervous about vaccinations, but I have to admit when I was in the USAF and we had to do anthrax vax I wasn't delighted. But I did it.",
            "title_similarity": "0.43965656",
            "sentiment_compound": -0.2373
        },
        {
            "id": "h8buvkh",
            "score": -11,
            "text": "Some may die or suffer serious side effects, but remember the positives outweight the negative",
            "title_similarity": "0.11877377",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h8bz2h9",
            "score": 11,
            "text": "Can’t wait to hear all my coworkers bitch and complain about their choices being taken away…in the military.",
            "title_similarity": "0.46299464",
            "sentiment_compound": -0.743
        },
        {
            "id": "h8c8xxd",
            "score": -12,
            "text": "Joe needs some numbers to boost his struggling COVID response. I bet he regrets taking shots at Trump over the issue.",
            "title_similarity": "0.33904427",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h8cn0hx",
            "score": 13,
            "text": "Most of the people against this don’t even know half of the shots we got in basic. Soldiers get much worst stuff administered to them. If your not a solider you shouldn’t have a opinion. Imho",
            "title_similarity": "0.36915922",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h8cw7nk",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8cwbo9",
            "score": -12,
            "text": "[deleted]",
            "title_similarity": "0.021559004"
        },
        {
            "id": "h8bx4vl",
            "score": 11,
            "text": "Not for nothin, but when I was active duty inn the 90s, they made *us* take a very sketch Anthrax vaccine... so, you know, pardon me if I don't shed a tear for those whining about the Covid vaccine.",
            "title_similarity": "0.54879606",
            "sentiment_compound": 0.631
        },
        {
            "id": "h8ciwtk",
            "score": 12,
            "text": "Vaccines are a regular part of being in the armed forces. This is the most manufactured outrage I’ve seen yet, and proof positive most of these people are doing zero research into the matter.",
            "title_similarity": "0.4874801",
            "sentiment_compound": 0.0314
        },
        {
            "id": "h8cmf0w",
            "score": -13,
            "text": "CHINA WINS! Once a large portion of the military started clotting like 80 year olds, its over. China doesn't even need to hack shit or go to war with anything. wow.",
            "title_similarity": "0.41329724",
            "sentiment_compound": 0.5461
        },
        {
            "id": "h8cr6r0",
            "score": 12,
            "text": "Soldier gets 10 different shots to protect them from disease in foreign deployment.\n\n\"Wait...wait...wait? Covid? Na, I didn't sign up for that communist 5g camera.\"",
            "title_similarity": "0.5565952",
            "sentiment_compound": 0.4515
        },
        {
            "id": "h8d7kug",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8c7uou",
            "score": 37,
            "text": "Oh god, it hilarious watching anti-vaxxers SEETH over this. They really  have no clue about the military.\n\nFor those unaware, watch this:\n\n\nFor any Former or Active serving military members: How many shots did you take before you could join, or how many did they give you at boot camp?",
            "title_similarity": "0.414052",
            "sentiment_compound": 0.6621
        },
        {
            "id": "h8br2w1",
            "score": 13,
            "text": "I can't wait for the former guy's supporters to all suddenly become \"Conscientious Objectors™\".",
            "title_similarity": "0.37302607",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8bu1az",
            "score": -14,
            "text": "Would you be ok with vaccine mandates for the whole population?",
            "title_similarity": "0.57346815",
            "sentiment_compound": 0.296
        },
        {
            "id": "h8cnjhd",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8b5294",
            "score": 764,
            "text": "youd think the rah-rah patriots would want our military to be ready for anything and not hampered by a preventable pandemic",
            "title_similarity": "0.4449675",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8bv8cx",
            "score": -15,
            "text": "Aaaaaand enlistments drop dramatically",
            "title_similarity": "0.18506777",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h8bw1op",
            "score": 13,
            "text": "I can see it now. “the govErNmEnT CaN’T tell mE WhAt TO Do!” like bro you’re literal government property whose whole job is to take orders from the government",
            "title_similarity": "0.44255704",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h8cs9e9",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "-0.0041517373"
        },
        {
            "id": "h8c4vfo",
            "score": -16,
            "text": "Looks like America will be bringing back the draft.",
            "title_similarity": "0.4763708",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8cqb3q",
            "score": -14,
            "text": "Well there just went the strongest military in the world. They can’t quit but if don’t get it they will get kicked out. This is pure stupidity. Makes you think China might actually be controlling the US",
            "title_similarity": "0.39416534",
            "sentiment_compound": -0.3291
        },
        {
            "id": "h8cv30z",
            "score": -14,
            "text": "As someone actively in the military 10 years active currently in the Reserves I know a lot of Senior Enlisted(NCOs) that will be refusing the shot . People can refuse but guidance has not came down on what the consequences of those actions will be. I will have to make my decision soon. I do think that it’s a little asinine that you can come here illegally and be released with no vaccine but if you serve you must get the Vaccine. In my honest opinion they will loose a lot of the force and have a hard time filling the ranks",
            "title_similarity": "0.53165114",
            "sentiment_compound": -0.2144
        },
        {
            "id": "h8ce7q6",
            "score": -17,
            "text": "They’re trying to kill off our troops and healthcare workers with their heart inflaming vaccine",
            "title_similarity": "0.5167464",
            "sentiment_compound": -0.128
        },
        {
            "id": "h8bsaqp",
            "score": 50,
            "text": "Our daughter was Security Forces in the Air Force and deployed to Kuwait. She has had all the vaccines for all sorts of disease, viruses, snd even Anthrax. It was understood that her body belonged to the government. 20+ years later, she is healthy and the mother of 2 healthy 12 & 13 year old boys.",
            "title_similarity": "0.6368516",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h8cva06",
            "score": -20,
            "text": "Fuck that shit.  I'm vaccinated but fuck forcing ANYONE",
            "title_similarity": "0.42659864",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h8c74kj",
            "score": -20,
            "text": "You people will not win this. I promise you",
            "title_similarity": "0.10678365",
            "sentiment_compound": -0.1955
        },
        {
            "id": "h8bmx5p",
            "score": -21,
            "text": "The military is made up of a majority of healthy young people,  they are not at risk of covid and have a higher chance of surviving the virus. This is ridiculous and not a very smart thing to do. Can you imagine pilots or tank operators getting severe reactions to the vaccine? They won't be able to do their job...it's not like you can shit out a skilled operator at will. It takes years and this dude wants to gamble his assets like this. Not cool.",
            "title_similarity": "0.43111312",
            "sentiment_compound": -0.516
        },
        {
            "id": "h8bs07z",
            "score": 22,
            "text": "Months ago I heard service members in my NG unit proclaim they'd sooner leave the army than get vaccinated. It should come as no surprise that those soldiers aren't exactly in prime physical or mental condition. Can't wait to find out who really meant it!",
            "title_similarity": "0.59155124",
            "sentiment_compound": -0.3195
        },
        {
            "id": "h8c00yy",
            "score": 103,
            "text": "The military is not a democracy. So your ideas of freedom does not apply.",
            "title_similarity": "0.12572515",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h8b2y7j",
            "score": 5283,
            "text": "When I went through US Air Force basic training, we walked down a literal assembly line of nurses with needles injecting just about every square inch of both our arms with all kinds of shit. 20 years later and I'm still fine. These troops will be just fine as well. Besides, what the fuck did you think was going to happen when you joined the military?",
            "title_similarity": "0.6279483",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h8c0hsx",
            "score": 72,
            "text": "I am a government contractor. I received an all hands email stating the vaccine mandate is also for government civilians and contractors",
            "title_similarity": "0.6491611",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bv0jg",
            "score": 28,
            "text": "It's about preparedness and the safety of your unit, this should not be controversial.",
            "title_similarity": "0.108584434",
            "sentiment_compound": 0.5255
        },
        {
            "id": "h8b6ukg",
            "score": 3381,
            "text": "I know certain crowds are going to whine about this ... but you pretty much sign off on losing various aspects of \"liberty\" when you join the U.S. Military. You are a cog in a larger machine, and by hook or by crook, the Military is going to damn well make sure you are alive *and* useful.",
            "title_similarity": "0.49137396",
            "sentiment_compound": 0.9545
        },
        {
            "id": "h8bw6mw",
            "score": 575,
            "text": "Ex military here. This aint anything new. If you are in any military service you are government property. Suck it up buttercup",
            "title_similarity": "0.36934882",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8bh5lb",
            "score": 2884,
            "text": "I was in the military (navy) for 14 years and I don't remember vaccines ever being an option.  Going to Iraq we have to get smallpox poke with the pus scab that forms, there was no \"opting out\", anthrax vaccine, all the other regular vaccines.  I don't understand how this is optional, when you take the oath you agree to become U.S. Government property basically.",
            "title_similarity": "0.68554914",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8brpw6",
            "score": 2291,
            "text": "I mean if you aren’t into taking orders from the national government you probably shouldn’t be in the army\n\nEdit: should have said military not army. Thought army went better with the joke but here we are.",
            "title_similarity": "0.37653938",
            "sentiment_compound": 0.3716
        },
        {
            "id": "h8bx6ap",
            "score": 105,
            "text": "I have my anthrax vaccine scar, kinda don’t see what the hype is about THIS vaccine\n\nEdit: someone in the comments is correct, I didn’t mean the anthrax scar but the smallpox scar.",
            "title_similarity": "0.46644115",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bfq23",
            "score": 7508,
            "text": "I was laughing at comments on Facebook over this policy.  Parents were saying their kids would just quit rather than get the shot. They really don't understand what their kids go through in the military do they?",
            "title_similarity": "0.41859442",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h8b3b2u",
            "score": 17742,
            "text": "BREAKING: U.S. military doing the same thing they've done for hundreds of years.",
            "title_similarity": "0.54665446",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cdtho",
            "score": 55,
            "text": "The Roosevelt had to return to port because of all the COVID cases. Not exactly mission capable at that point. Good thing we weren't at war with China or something.  The \"my body my choice\" thing isn't going to fly in the military. When faced with punishment for not obeying an order they might wise up.",
            "title_similarity": "0.3627062",
            "sentiment_compound": 0.5806
        },
        {
            "id": "h8cct7n",
            "score": 315,
            "text": "The conspiracy nuts are going to have to convince themselves the government is willing to kill off their military with this deadly vaccine aren’t they?",
            "title_similarity": "0.52629805",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h8btywe",
            "score": 164,
            "text": "The veteran community is inundated with lots of anti-vaxx covid deniers these days. Half the veteran Instagram pages are having meltdowns right now. It’s so fucking stupid. You’re required to be vaccinated against everything else in the military but they’re losing their minds over the Covid vaccine.",
            "title_similarity": "0.56710905",
            "sentiment_compound": -0.7533
        },
        {
            "id": "h8bvrc2",
            "score": 82,
            "text": "Makes perfect sense. A covid outbreak on a ship or in a unit could easily become a national security risk.",
            "title_similarity": "0.34590182",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h8bidpj",
            "score": 1,
            "text": "So, what is likely to happen if someone refuses to get vaccinated?",
            "title_similarity": "0.3398044",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bimue",
            "score": 3,
            "text": "SecDef: I want you to know that I will seek the President's approval to make the vaccines mandatory no later than mid-September, or immediately upon the U.S. Food and Drug Agency (FDA) licensure, whichever comes first.",
            "title_similarity": "0.7593039",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8bm5o8",
            "score": 1,
            "text": "Better than the peanut butter shot.",
            "title_similarity": "0.10492399",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8bmozs",
            "score": 1,
            "text": "\"Say what again motherfucker!\"",
            "title_similarity": "0.20368284",
            "sentiment_compound": -0.7088
        },
        {
            "id": "h8bn1pl",
            "score": 3,
            "text": "They didn’t even tell me which shots I was getting in the military, unless there was some big allergy to call out.",
            "title_similarity": "0.47234637",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bn4d6",
            "score": 1,
            "text": "You'd think the military would be the first thing they vaccinate... like they do in China before even any vaccines were authorized",
            "title_similarity": "0.5890168",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8bnwe5",
            "score": 1,
            "text": "Somehow the 45 supporters will be apoplectic",
            "title_similarity": "0.19463602",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8bohzl",
            "score": 2,
            "text": "My buddy is a Naval Officer and I'm pretty sure he was required to get vaccinated before he deployed a few months ago. I just sorta figured it was compulsory across all branches already",
            "title_similarity": "0.68821937",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h8bpm34",
            "score": 4,
            "text": "so what's the conservative take here? they love the military and the troops so much but hate the vaccine. does this make the military bad now? ignoring the fact this is something they've always done, i really can't wait to see bootlicking GOP'ers try to figure out how to feel about this one.",
            "title_similarity": "0.45178515",
            "sentiment_compound": -0.9261
        },
        {
            "id": "h8bqgog",
            "score": 2,
            "text": "Oh boy, imagine the justbootthings sub",
            "title_similarity": "0.18672204",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bqvir",
            "score": 1,
            "text": "Can’t wait to see the far right snowflakes lose their shit!",
            "title_similarity": "0.35954994",
            "sentiment_compound": -0.7644
        },
        {
            "id": "h8brmb3",
            "score": 2,
            "text": "I'm fine with this but legit question...if someone refuses then what happens?  are you discharged? is it honorable or dishonorable?",
            "title_similarity": "0.14642014",
            "sentiment_compound": 0.7711
        },
        {
            "id": "h8brrk8",
            "score": 2,
            "text": "Seems like such a big mission liability they would’ve been right out the gate with this sort of thing. Having groups of people down for the count needing to be quarantined for two weeks and trying to contain spread overseas must be a nightmare why did it take so long lol.",
            "title_similarity": "0.5177409",
            "sentiment_compound": 0.5829
        },
        {
            "id": "h8bs0lc",
            "score": 3,
            "text": "Im suprised it took this long.",
            "title_similarity": "0.13441007",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bs9me",
            "score": 2,
            "text": "great let's now do it for all the countries they're deployed in too!",
            "title_similarity": "0.5048963",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h8bsaw5",
            "score": 3,
            "text": "They already require a lot so what's one more",
            "title_similarity": "0.20775218",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bsox8",
            "score": 1,
            "text": "Cost saving measure for them",
            "title_similarity": "-0.020366227",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8bsppb",
            "score": 2,
            "text": "And you know the fuck what? I hat2d having to wear a goddamn mask in boot last February. Mainly cuz we had to make em ourselves out of blousing straps and shreds of cloth, and because they fogged my glasses and made it even harder to pick out ranks on anyone more than 5 feet away!\n\nShould just call people sir or ma'am and be done with it.",
            "title_similarity": "0.5218253",
            "sentiment_compound": -0.784
        },
        {
            "id": "h8bt1w2",
            "score": 1,
            "text": "Thought that was a picture of Holt",
            "title_similarity": "0.16914317",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8btjwn",
            "score": 5,
            "text": "The Military has pretty much always required vaccinations so certain people shouldn't lose their minds over this.",
            "title_similarity": "0.51340806",
            "sentiment_compound": 0.802
        },
        {
            "id": "h8btxy8",
            "score": 8,
            "text": "When you're trying to get the most out of what you paid for, so you're getting them shot.\n\nI'm glad they're finally doing this. It's a great first step.",
            "title_similarity": "0.23829576",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h8bufhc",
            "score": 2,
            "text": "Like their supposed to",
            "title_similarity": "0.07482682",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8bumq7",
            "score": 4,
            "text": "> The Department of Defense (DoD) administers 17 different vaccines, as outlined in the Joint Instruction on Immunizations and Chemoprophylaxis (Secretaries of the Air Force, Army, Navy, and Transportation, 1995), for the prevention of infectious diseases among military personnel, where appropriate. The vaccines are administered to military personnel on the basis of military occupation, the location of the deployment, and mission requirements. \n  \nThis makes 18",
            "title_similarity": "0.6747633",
            "sentiment_compound": 0.128
        },
        {
            "id": "h8bvbbx",
            "score": 1,
            "text": "I’m surprised it hasn’t already been done with all the inoculations they tested me on back in the day",
            "title_similarity": "0.53155863",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8bvvcs",
            "score": 2,
            "text": "Yet the politicians are allowed to opt out of it? Let’s get Greene one! 😍",
            "title_similarity": "0.23312652",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h8bw644",
            "score": 2,
            "text": "It's not like they can refuse it. Commands will start rejecting leave request lockdown personal on bases.",
            "title_similarity": "0.4544173",
            "sentiment_compound": -0.7587
        },
        {
            "id": "h8bx1r7",
            "score": 3,
            "text": "These fools are gonna post shit on social media that's going to get them in trouble at the very least.",
            "title_similarity": "0.29337573",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h8bx20z",
            "score": 3,
            "text": "Well then, seeing as it seems there is a large amount of Trump supporters and alt right types in the military I wonder how this is going to go over. Could be interesting.",
            "title_similarity": "0.3940527",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h8bx8p5",
            "score": 2,
            "text": "This thumbnail looks like it’s from some kind of alien war sci-fi movie",
            "title_similarity": "0.3946813",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8byqcj",
            "score": 1,
            "text": "i figured that would have been mandatory first as with healthcare workers",
            "title_similarity": "0.44121146",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8c0959",
            "score": 2,
            "text": "Lol I remember getting 7 shots in a row plus the peanut butter shot right in my ass when I was in the Army. I love how all of a sudden it’s a big deal. They’ve been doing this since forever.",
            "title_similarity": "0.5504621",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h8c0bni",
            "score": 1,
            "text": "Can't wait for the heads of all the fake patriots explode.",
            "title_similarity": "0.44938752",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h8c0jr0",
            "score": 2,
            "text": "I had to get the anthrax vaccine when I was in the Marines.",
            "title_similarity": "0.64857125",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c0knp",
            "score": 2,
            "text": "I don’t recall being even told what shots we got in basic training back in the day. Line up and get the needle or the gun. Several at a time then more the next time.  I wonder if it is in my permanent record somewhere?",
            "title_similarity": "0.52324855",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8c0l6l",
            "score": 5,
            "text": "I can hear the whining already",
            "title_similarity": "0.21826857",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h8c0rky",
            "score": 2,
            "text": "Ha. That's gonna be fun. A lot of those are deeply conservative, so I guess a lot of them have an anti-vaxx attitude.",
            "title_similarity": "0.15271555",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h8c0rs5",
            "score": 1,
            "text": "Yeah when you sign up for the military you’re body belongs to the government. If you are dumb and don’t put sun screen and get burnt to the point where you are unable to preform your duties you can get in trouble. Vaccines are no different, don’t want to take the vaccine here’s your discharge paper my question is whether people will get honorably discharges for not taking the vaccine.",
            "title_similarity": "0.51641685",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8c0udc",
            "score": 5,
            "text": "anti vaxxers will say biden is committing genocide on the troops",
            "title_similarity": "0.42371997",
            "sentiment_compound": -0.25
        },
        {
            "id": "h8c11t4",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8c14dp",
            "score": 2,
            "text": "and any of the troops that were paying even a little bit of attention should have seen this coming 10 miles away.",
            "title_similarity": "0.509146",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c1585",
            "score": 5,
            "text": "Once you join the armed forces you are property of the US Government.  You have no say so if you get the shot or not.  They will just line everyone up and do it anyway.  As my 84 year old Stepdad said, we were shot full of experimental crap while in the military so what difference does another vaccine make.",
            "title_similarity": "0.65522057",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h8c1cdk",
            "score": 3,
            "text": "Oh no, but that means that Rand Paul will have to cut funding!? ... I see what you did there...",
            "title_similarity": "0.32584736",
            "sentiment_compound": -0.4482
        },
        {
            "id": "h8c1cj7",
            "score": 5,
            "text": "How many Proudbois gonna quit?",
            "title_similarity": "0.3288481",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c22xb",
            "score": 2,
            "text": "Agreed, for certain \"approved\" vaccines. You are correct.",
            "title_similarity": "0.38649476",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h8c24d4",
            "score": 4,
            "text": "Hopefully when the 35% of holdouts get the vaccine and they realize that they're still living and breathing and not being controlled by a micro chip in their arm, they'll let their crazy friends who aren't in the military know.",
            "title_similarity": "0.5405689",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h8c2t7o",
            "score": 1,
            "text": "Oh man... pretty sure the only people surprised are the people who never served and use soldiers as narrative fodder instead of actually supporting them",
            "title_similarity": "0.269344",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h8c2y2c",
            "score": 1,
            "text": "Will they kick the soldiers out if they refuse?",
            "title_similarity": "0.2947641",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8c32az",
            "score": 1,
            "text": "Fox News: \"How dare the president tell the troops what to do!\"",
            "title_similarity": "0.4697213",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c35pq",
            "score": 1,
            "text": "By the end of the year, I wouldn't be surprised if all companies or organizations require covid vaccine for all employees",
            "title_similarity": "0.7826091",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h8c36q8",
            "score": 4,
            "text": "Interested to see how the conspiracy nuts react to this. How are the global elites going to kill half the world’s population by using the vaccine AND successfully give it to their minions?",
            "title_similarity": "0.5508197",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h8c3fc3",
            "score": 1,
            "text": "Or not join. We'll see.",
            "title_similarity": "0.10610955",
            "sentiment_compound": -0.2235
        },
        {
            "id": "h8c3nyh",
            "score": 3,
            "text": "Good, this is nothing new or political.",
            "title_similarity": "-0.08103165",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h8c3pxm",
            "score": 26,
            "text": "When I was in the Gulf during Desert Storm, I was loaded onto a deuce and a half, driven to a tent in the middle of the desert where I was told I was getting a shot. When we asked what the shot was for the answer was Anthrax. Apparently the brain trust thought Saddam had a weaponized form of the disease.  \n\nWhen we asked if there was an Anthrax vaccination approved for human use we were told \"Quit asking questions and get in the line\".  A lot of troops tried to refuse but we were in an active AO and the army's attitude towards dissenters is such situations is, shall we say, inflexible. Afterwards, some of the skeptics that tried to claim that the vaccination was the cause of Gulf War syndrome but no link was ever established.",
            "title_similarity": "0.5509832",
            "sentiment_compound": -0.5789
        },
        {
            "id": "h8c3rzp",
            "score": 1,
            "text": "Oh no. Those poor antivaxxxers in the military",
            "title_similarity": "0.22771679",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h8c496y",
            "score": 3,
            "text": "This policy seems like the get out of jail free card all the fatties in the navy have been waiting for.",
            "title_similarity": "0.42333907",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h8c4fb7",
            "score": 2,
            "text": "Marine here I HAD to get the anthrax vaccine in 2001 …and there is no quitting US military it isn’t the Cub Scouts.",
            "title_similarity": "0.5901697",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8c4gsd",
            "score": 5,
            "text": "The sky is blue and the water is wet. Normal practice for the military, nothing new.",
            "title_similarity": "0.1646178",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c4ip0",
            "score": 2,
            "text": "Finally, a way to keep troops out of other countries",
            "title_similarity": "0.26589197",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c4o8f",
            "score": 1,
            "text": "I mean what about the anthrax shot that crap hurt",
            "title_similarity": "0.30506498",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h8c52r9",
            "score": 2,
            "text": "I'm curious if and when this will be mandated to dependents at overseas bases. Specifically, those crazy anti-vax wives that sit on Facebook every hour and post insane \"put Fauci in prison\" statements, while in government-provided housing.",
            "title_similarity": "0.5695131",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h8c53mw",
            "score": 2,
            "text": "My dad had a hole in his arm, not huge but small dent, from vaccinations he got in the reserves In the 70s. It never went away so weird",
            "title_similarity": "0.4073798",
            "sentiment_compound": -0.5176
        },
        {
            "id": "h8c5dpr",
            "score": 3,
            "text": "My ass and arm got hella vaccines. I didnt have a mf choice lol",
            "title_similarity": "0.46451104",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h8c5mmq",
            "score": 3,
            "text": "I went through an assembly line of corpsman giving out shot after shot when I got to boot camp. This isn’t new. It is made pretty clear you are government property to such a degree a bad enough sunburn can be prosecuted as destruction of property. Good luck trying to fight it",
            "title_similarity": "0.48721874",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h8c5t9o",
            "score": 4,
            "text": "I am astounded that this was not a requirement before.",
            "title_similarity": "0.06352709",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8c6bm4",
            "score": 3,
            "text": "i'm surprised it's taken this long with how it basically grounded an aircraft carrier last year\n\nthat's kind of a big deal",
            "title_similarity": "0.4247417",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8c6cds",
            "score": 2,
            "text": "I mean a very large percentage of them are only not doing it because they were told they didnt have to do it.\n\nIn the military if you get told \"oh ya you can say no\" about something, people are just gonna say \"well then fuck you no\" just because they dont normally get the option.\n\nWhen they get told they have to do it they're going to say \"oh ya ok, how long does this shit take\" and get it done.\n\n\nLiterally the first thing I heard from my buddies mouth when found out he didnt have to go do it was \"I'm not gonna do it until they tell me I have to\".",
            "title_similarity": "0.44801387",
            "sentiment_compound": -0.7684
        },
        {
            "id": "h8c6ifc",
            "score": 7,
            "text": "Was in the Army in 09 during swine flu. We had no choice but to get vaccinated. The only question was, which arm or which nostril you want to take it. I'm not surprised that the Pentagon is requiring it.",
            "title_similarity": "0.65759003",
            "sentiment_compound": -0.4495
        },
        {
            "id": "h8c71k5",
            "score": 2,
            "text": "Ask not what your country can do for you - ask what you can do for your country",
            "title_similarity": "0.21171169",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c772a",
            "score": 1,
            "text": "If COVID is a weapon by China, why isn't every troop already vaccinated?\n\nYou'd expect at least a huge chunk to be as a contingency plan.",
            "title_similarity": "0.57260686",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h8c7bhs",
            "score": 5,
            "text": "We’ll that’s one way to de-radicalize a military.",
            "title_similarity": "0.37994102",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c7dpg",
            "score": 2,
            "text": "So many military brats I know. This will be interesting.",
            "title_similarity": "0.30546588",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8c7yh9",
            "score": 5,
            "text": "get ready for patriots willing to take sniper bullets to the head refuse vaccines to the shoulder.",
            "title_similarity": "0.5295769",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8c80j0",
            "score": 2,
            "text": "What  is funny is people think in the future. we won't have  worse viruses that will kill thousands and maybe millions.   It may also require a vaccine shot.  So just get used to it.",
            "title_similarity": "0.5318501",
            "sentiment_compound": -0.0634
        },
        {
            "id": "h8c82fp",
            "score": 1,
            "text": "What is the likelihood that the idiot State Governor contingency undermines this for National Guard?",
            "title_similarity": "0.28741136",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h8c8ai3",
            "score": 4,
            "text": "Sack up, embrace the suck, follow your orders soldier.",
            "title_similarity": "0.2635803",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8c8k8b",
            "score": 4,
            "text": "My bro's in the army and he got the shots a long time ago.  I doubt this will come as a surprise to very many soldiers.",
            "title_similarity": "0.4555624",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8c8uz7",
            "score": 3,
            "text": "You're a pincushion day one. If you draw the line here, you're obviously doing for reasons other than health, and should just get a general discharge.",
            "title_similarity": "0.47084922",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c9rbk",
            "score": 5,
            "text": "Yep. I don’t even know half of what they injected me with in boot camp. So many shots they don’t even use needles for a bunch of them. They use a pneumatic blast to literally shoot the vax thru the skin.",
            "title_similarity": "0.5130751",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h8c9u0j",
            "score": 1,
            "text": "I’m guessing we’re about to have some openings at the NCO ranks. \n\nWorks for me.",
            "title_similarity": "0.39203537",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ca0f1",
            "score": 4,
            "text": "Honestly, I’ve jumped at every chance to get whatever vaccines the military has offered me. Vaccinations/immunizations are a mature science/medical procedure. Why wouldn’t I want to get free no-risk immunity to something that could potentially infect me? I signed up for the first COVID shots I could and if they decide to make boosters available, I’ll be sure to volunteer for those too. (Speaking of, with all the anti-vaccine craze going around, I would really like to get a measles booster if that’s a thing…)\n\nSide note, the official SECDEF letter I saw literally just said \"mid September\" with no date implied…where is the 15th coming from?",
            "title_similarity": "0.6062488",
            "sentiment_compound": 0.9194
        },
        {
            "id": "h8ca9y5",
            "score": 5,
            "text": "Say what you want about the US Military, but it really has taken COVID-19 seriously from the beginning.\n\nI got out in 2013, but still have plenty of old comrades still in.\n\nDuring the first six months there was no leave that let you leave the immediate area. Personnel living on base were restricted there. They stuck by it too. Your mother died? Fuck you, send flowers to the funeral. The DoD was not playing.\n\nMost PCSes were halted and travel was heavily restricted.",
            "title_similarity": "0.5382395",
            "sentiment_compound": -0.9778
        },
        {
            "id": "h8cbwg9",
            "score": 1,
            "text": "The only group of people the government has complete and total control over.",
            "title_similarity": "0.24703294",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cbwls",
            "score": 3,
            "text": "My little brother told me when he was in basic training that the amount of inoculations he received was insane. So what’s 1 more?",
            "title_similarity": "0.50918126",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h8cbx53",
            "score": 3,
            "text": "Military were forced to take the anthrax vaccine. I rather receive the Covid vaccine then anthrax.",
            "title_similarity": "0.6250037",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h8cc6y6",
            "score": 5,
            "text": "Whole bunch of \"don't disrespect muh flag!!!\" types are about to get booted from the military. Probably for the best.",
            "title_similarity": "0.50066435",
            "sentiment_compound": 0.813
        },
        {
            "id": "h8ccd3a",
            "score": 4,
            "text": "If you’re all butthurt about the covid vaccine just wait until you try the smallpox. Still have the scar to this day.",
            "title_similarity": "0.54816836",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ccd62",
            "score": 4,
            "text": "It's a great idea that should have happened a year ago",
            "title_similarity": "0.3710038",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8cch96",
            "score": 4,
            "text": "A harrowing day for anti vaxx dependapotamusses everywhere",
            "title_similarity": "0.372931",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8ccipm",
            "score": 3,
            "text": "Fuck it, they made us get the anthrax shot, whats another shot gonna do?",
            "title_similarity": "0.51231515",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8ccuug",
            "score": 3,
            "text": "My vet friend said he had to get a 3 panel for anthrax, he said COVID vaccine wasn’t bad compared to that",
            "title_similarity": "0.55819434",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h8ccyqo",
            "score": 4,
            "text": "Are military personnel still required to get the anthrax vaccine? If so how is this any different?",
            "title_similarity": "0.56179774",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cd3wt",
            "score": 3,
            "text": "This sure puts a damper on the whole \"military is gonna round up the vaccinated\" conspiracy theory",
            "title_similarity": "0.4691005",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h8cdek8",
            "score": 3,
            "text": "Day late and a dollar short in my opinion. Should have done this the day the vaccines rolled out. I would have told those that didn’t want the vaccine, there is the door, you can leave if you want but you get no benefits, no discharge papers, nothing. Just go on your way.",
            "title_similarity": "0.50023395",
            "sentiment_compound": -0.0629
        },
        {
            "id": "h8ce82b",
            "score": 10,
            "text": "“IM NOT GONNA GET IT, THE GOVERNMENT CANT CONTROL ME!”\n\n*gets taxes taken out of paycheck*",
            "title_similarity": "0.31320924",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ce9uv",
            "score": 3,
            "text": "What’s next? Body armor?",
            "title_similarity": "0.24656433",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cep51",
            "score": 7,
            "text": "Well the troops are usually given the experimental drugs and shit before the rest of us so I don’t see how this is surprising or newsworthy",
            "title_similarity": "0.49309248",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8cfbou",
            "score": 5,
            "text": "I can't wait for the far right to claim this is AOC doing this to try and turn the military into a socialist empire.",
            "title_similarity": "0.4610206",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cfk8u",
            "score": 4,
            "text": "I am kind of surprised this wasn't already done? They already vaccinate the forces for many other diseases so why was this not just automatically a thing?",
            "title_similarity": "0.49118838",
            "sentiment_compound": 0.2422
        },
        {
            "id": "h8cftx2",
            "score": 1,
            "text": "If Republicans want to cosplay they should start the cosplayw/ the vaccine requirement part instead of the bs parts…",
            "title_similarity": "0.45453793",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8cfxvc",
            "score": 6,
            "text": "You give yourself to the government, you kind of have to listen what they tell you to do.",
            "title_similarity": "0.38031426",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cgz3k",
            "score": 5,
            "text": "Not at all a shocker. When I went to basic training I got 6 vaccinations in a single day. They ain’t playing. When I was deployed, I had to get the anthrax vaccine as well. So this is run of the mill military business.",
            "title_similarity": "0.62173814",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8ch2hc",
            "score": 5,
            "text": "Just like the Continental Army.",
            "title_similarity": "0.28494054",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h8cha2i",
            "score": 2,
            "text": "Maybe I just don’t understand politics or most government things, but isn’t the Pentagon just for the CIA? Doesn’t the DOD or Homeland or whoever is in charge of the military operate out of a different building?",
            "title_similarity": "0.3345935",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8chha6",
            "score": 2,
            "text": "Nice! That’s like 20% of the US population, right?",
            "title_similarity": "0.34148967",
            "sentiment_compound": 0.68
        },
        {
            "id": "h8ciktb",
            "score": 7,
            "text": "If you’re upset about this you have no idea how much shit they inject into your body being in the military. Much worse things than the covid vaccine.",
            "title_similarity": "0.45917803",
            "sentiment_compound": -0.8885
        },
        {
            "id": "h8cjal1",
            "score": 1,
            "text": "what does your username mean",
            "title_similarity": "0.06786364",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cjr5m",
            "score": 1,
            "text": "Smells like re-enlistment bonuses..",
            "title_similarity": "0.20009603",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h8cjtl8",
            "score": 1,
            "text": "I was wondering wondering when they would do this, the Canadian army was like \"you don't have to get the shot; *buuuuuuut* if you don't you won't be given any cool taskings or deployments\"",
            "title_similarity": "0.36825678",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h8cjygm",
            "score": 2,
            "text": "Tbh I'm surprised that this wasn't mandated last year, in order to maintain force readiness, and especially if troops would have been needed to assist with field hospitals and such.  Whether you \"trust\" the vaccine or not, my thoughts are that critical personnel would've been the first to receive vaccinations and then be used in the distribution of supplies to regions need.",
            "title_similarity": "0.62446725",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h8cjzy2",
            "score": 6,
            "text": "Rep. Mark Green, R-Tenn., however, said Austin should not mandate a vaccine that doesn’t have full FDA approval. “Wearing our country’s uniform does not mean our service members sign away the right to make personal medical decisions,”\n\nHung over private: \"Sorry top, I choose not to take that PT test because the risk of heart attack is greater than the risk that that asshole over there would die from a Covid shot. Personal medical freedom and body autonomy, hooah.\"",
            "title_similarity": "0.44185615",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h8cmnw2",
            "score": 7,
            "text": "The “peanut butter” shot was the worst. My ass was sore for a week",
            "title_similarity": "0.42314577",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h8cmorw",
            "score": 7,
            "text": "Meh. Not like it is any worse than the peanut butter or the anthrax shot.",
            "title_similarity": "0.25777736",
            "sentiment_compound": -0.6715
        },
        {
            "id": "h8cmqka",
            "score": 3,
            "text": "And they’re gonna get the whole day off because of the immune response symptoms.  It’s good for everyone because now you get a day off to drink your asses off that you otherwise wouldn’t have gotten.",
            "title_similarity": "0.4680652",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h8cobrq",
            "score": 3,
            "text": "It's funny that Republicans always make an issue out of something that's been going on for a hundred years, then the media continues to amplify the nonsense.",
            "title_similarity": "0.46337283",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h8cosdt",
            "score": 9,
            "text": "Soldiers have always basically been property of the government. You don't sign up for the military if you are afraid of someone else making decisions for you.",
            "title_similarity": "0.3628608",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cpi7j",
            "score": 4,
            "text": "Soldiers are ripe with conspiracy and distrust of the government (ironic, I know). Very few are vaccinated. I was just at my unit yesterday giving counseling’s to soldier for not being vaccinated yet and it was roughly 90% of the unit.",
            "title_similarity": "0.5507331",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h8cpvpf",
            "score": 7,
            "text": "As it should have been, from day 1 of having a vaccine.",
            "title_similarity": "0.6293689",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cq7jq",
            "score": 7,
            "text": "It’s absurd that this is news. Soldiers and Sailors get stuck with every vaccine known to man, smallpox included. Who the hell are all these people who won’t get it? Seriously - do we have an approximation of how many people in the US are “anti-Covid” vaccination?",
            "title_similarity": "0.5784501",
            "sentiment_compound": -0.8253
        },
        {
            "id": "h8cqonw",
            "score": 2,
            "text": "Dishonored: Injection Edition",
            "title_similarity": "0.2016342",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cr4cf",
            "score": 5,
            "text": "If anyone wasn't aware, you through an assembly line of shots in your first week of boot camp. \n\nYou roll up your sleeves and take a step and get hit with a shot on each side, then take like 10 more steps. A couple in the ass too if I remember correctly.",
            "title_similarity": "0.5942021",
            "sentiment_compound": -0.25
        },
        {
            "id": "h8crh6g",
            "score": 3,
            "text": "Lmao, the Smallpox vaccine is likely OOM more dangerous than the Covid vaccine and you don't hear any of these anti-vax chucklefucks worried about it.",
            "title_similarity": "0.41496179",
            "sentiment_compound": -0.1761
        },
        {
            "id": "h8crovp",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8crq30",
            "score": 8,
            "text": "I had a fellow member tell me that if they mandate it, he was going to refuse to take it as he is a conscientious objector… I told him good luck with that.",
            "title_similarity": "0.23256382",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h8crwal",
            "score": 2,
            "text": "Yeah, why is this even a headline. I'm surprised it hasn't been required already.",
            "title_similarity": "0.20516816",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h8csgzb",
            "score": 4,
            "text": "People in the armed services get over a dozen a vaccinations.",
            "title_similarity": "0.58159536",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cttih",
            "score": 9,
            "text": "Of course. Just an update on shots required for troops. Did the anti-vaxers really think their minority mindset was going to prevail?",
            "title_similarity": "0.43429673",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ctys7",
            "score": 12,
            "text": "Yea!!!!!\n\nOh, and go ahead an quit.....that is a whole other world of desertion and fort leavenworth.\n\nUS Army vet here.  Take your shots or face the consequences.",
            "title_similarity": "0.4490581",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8cuyd2",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.021558985"
        },
        {
            "id": "h8cv138",
            "score": 7,
            "text": "Can’t wait to read dumb ass anti-vaxxer comments",
            "title_similarity": "0.24787813",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h8cv426",
            "score": 22,
            "text": "If it wasn't for george Washington inoculating troops during the American revolution yall would've lost against the British due to dieses. \n\nGet your damn vaccine.",
            "title_similarity": "0.5638997",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h8cv5tf",
            "score": 4,
            "text": "Kudos to our military personnel for putting the good of the nation ahead of political grandstanding… God Bless!",
            "title_similarity": "0.342635",
            "sentiment_compound": 0.8858
        },
        {
            "id": "h8cwula",
            "score": 2,
            "text": "I reckon false(fox) news that impast public health should be a crime.  USA, be better wtf?",
            "title_similarity": "0.3023387",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8cyrfo",
            "score": 12,
            "text": "So they’re requiring vaccines exactly like they always have. Nothing has change but we got a good news story lol.",
            "title_similarity": "0.5049486",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h8cz7v7",
            "score": 9,
            "text": "I'm pretty sure nobody in the Army gives one single fuck.  I was vaccinated like 50 times in my eight years in the Army.",
            "title_similarity": "0.50453424",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h8d1edu",
            "score": 2,
            "text": "Great news! We can wipe out the idiots in the army.",
            "title_similarity": "0.46772373",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h8d1hhh",
            "score": 4,
            "text": "Time to find out who REALLY wants to protect their country",
            "title_similarity": "0.24967164",
            "sentiment_compound": 0.5459
        },
        {
            "id": "h8d1xcu",
            "score": 2,
            "text": "Some would rather get shot than get the shot.",
            "title_similarity": "0.11103113",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d2hq7",
            "score": 3,
            "text": "But how can the troops fight for my freedoms if they’re….are the troops Antifa?\n\n\n/s",
            "title_similarity": "0.32027465",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8d2t1u",
            "score": 5,
            "text": "Im ignorant to the military. My brother enlisted in the navy earlier this year. Does this guarantee he must get it by Sept 15?",
            "title_similarity": "0.6503602",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h8d2zuv",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.0041517857"
        },
        {
            "id": "h8d2zvj",
            "score": 3,
            "text": "How to stop a pandemic 101.",
            "title_similarity": "0.44471326",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8d3r4o",
            "score": 3,
            "text": "I'm honestly surprised that it took this long.",
            "title_similarity": "0.08403118",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h8d5k57",
            "score": 3,
            "text": "Cue outrage from Q mil spouses, even though tons of other vaccines are mandatory for members.",
            "title_similarity": "0.55304956",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h8d5pzo",
            "score": 4,
            "text": "Good, the sooner the better",
            "title_similarity": "0.17521006",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h8d5tf7",
            "score": 4,
            "text": "What’s next, they’ll tell members and their families where they have to live? S/",
            "title_similarity": "0.4158017",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d63uv",
            "score": 1,
            "text": "Shut up and obey....[https://www.youtube.com/watch?v=G9nQSLdbGGw](https://www.youtube.com/watch?v=G9nQSLdbGGw)",
            "title_similarity": "0.23501132",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d6599",
            "score": 1,
            "text": "This is an important move for our nation for our service members to get vaccinated. The only way to protect the US both foreign and domestic is to be able to have all of the members medically fit.",
            "title_similarity": "0.5717428",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h8d6fap",
            "score": 1,
            "text": "oh now they're getting serious. Yay",
            "title_similarity": "0.078443065",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h8d70m2",
            "score": 5,
            "text": "Hell I was the child of someone in the military and was required to get vaccinated when we went to Okinawa.",
            "title_similarity": "0.60990536",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h8d71sa",
            "score": 4,
            "text": "Get the spouses while your at it. That will help a lot.",
            "title_similarity": "0.15037802",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8d7bx3",
            "score": 2,
            "text": "Honestly don’t know why this has taken so long…",
            "title_similarity": "0.1011122",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8d7rzf",
            "score": 1,
            "text": "I wound think they wound be one of first to receive it. Biden Administration should of insisted",
            "title_similarity": "0.3902884",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d7yi1",
            "score": 1,
            "text": "What would happen if they refuse?",
            "title_similarity": "0.046937816",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8d8bzp",
            "score": 5,
            "text": "Before getting deployed to Iraq we all got the small pox vaccine and had to watch videos of small pox in action. Holy shit those videos were scary, and sad. The worse part about the vaccine was the itching and I'll take that anyday compared to getting small pox. \nCovid shot number 2 tore me up for a couple days but still, better than getting the real thing. I can't wait for all this to be over with and it'll always get worse before getting better but at least it will get better. Right? You'd think so after a certain amount of time anyways. Unless we all just die slowly of this shit and new strains form one after the other. Like some apocoplyse movie but instead of walking dead we have talking heads. Until they're gone too. What a way to go. Not in some grand meteoric extinction like dinosaurs but to a damn flu that we could've slowed and prevented. And we fade away. \n\nI'm hungry. What's for dinner?",
            "title_similarity": "0.542452",
            "sentiment_compound": -0.9711
        },
        {
            "id": "h8d9a7z",
            "score": 3,
            "text": "I never served directly. I was a navy child growing up. I didn’t even get an option on the shots they gave me. If they gave my dad orders to go to Europe, we got injected with shit and sent to another country.",
            "title_similarity": "0.4413591",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8d9h7e",
            "score": 6,
            "text": "Why is this news?  Vaccines have never been an option in the military.   When I was in I got every thing known to man.  Japanese Encephalitis, Small Pox, Anthrax.\n\nOne year during my transfer over seas they lost my immunization record twice so I got the same set of shots twice. \n\nSo it makes me laugh when these people are so scared of a little covid shot.  If vaccines were bad for you I would definitely know it.  But I'm perfectly healthy.",
            "title_similarity": "0.5328004",
            "sentiment_compound": 0.8492
        },
        {
            "id": "h8d9ml1",
            "score": 2,
            "text": "Let's see if those resignations they talked about start rolling in 🙄😂",
            "title_similarity": "0.30969337",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h8d9uhs",
            "score": 9,
            "text": "George Washington required all his troops to be vaccinated against smallpox in 1777. So there’s that…",
            "title_similarity": "0.6894965",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d9uo3",
            "score": 3,
            "text": "Hopefully this will weed out some nut jobs. Less chance of a coup.",
            "title_similarity": "0.08025823",
            "sentiment_compound": 0.5279
        },
        {
            "id": "h8d9wjc",
            "score": 2,
            "text": "Why so long? Or maybe this is one of those things where national says Sep 15, divisions say Sep 7, brigade says Aug 31, battalion says Aug 24, company says Aug 13...so basically this week.",
            "title_similarity": "0.59584284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8da2oe",
            "score": 3,
            "text": "You better have your damn shot record or you’re going to have like 4 COVID shots. Bwahahaha!",
            "title_similarity": "0.40800595",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h8daeih",
            "score": 5,
            "text": "This reminds me of the Asian flu pandemic of the late 1950s when I was in the military and stationed at the Pentagon.  Inoculation was mandatory then also.",
            "title_similarity": "0.56967956",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8dage0",
            "score": 3,
            "text": "But what if you war from home?",
            "title_similarity": "0.33031166",
            "sentiment_compound": -0.7469
        },
        {
            "id": "h8db8ug",
            "score": 5,
            "text": "My dependa sister was wailing about this during the afternoon today all about how unfair this was that my brother in law is forced to do this to keep serving, how she and my niece won’t get the “Fauci ochie” (yes, she’s one of *those*), etc.\n\nI was about to post a lengthy post about how he already had to a battery of vaccines (including the “peanut butter” shot), but another woman shut her down already with all the same things I was going to say. Sister then wailed about some of the usual “I won’t post sources here so do your own research, don’t be a sheeple” bullshit that they always post when backed into a corner. \n\nSo wish that other woman was my sister instead…",
            "title_similarity": "0.50991786",
            "sentiment_compound": -0.3639
        },
        {
            "id": "h8dbb6t",
            "score": 3,
            "text": "I mean fucking obviously, the military isn’t just going to let you partake in smooth brain behavior... most of the time",
            "title_similarity": "0.29538304",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dbzee",
            "score": 8,
            "text": "Almost 20 years in (AF), this doesn’t bother or surprise me a bit. Just another added to the sheet. Side note, I’ve had mine since March so way ahead of them.",
            "title_similarity": "0.3935713",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h8dcn31",
            "score": 2,
            "text": "Congrats on your new career",
            "title_similarity": "0.21171796",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h8dcn77",
            "score": 1,
            "text": "I remember getting to reception in early 02 and they asked us if we wanted to be part of a trial program where they would inject us with god knows what but there was a chance we could get the placebo. This was after we got all our vaccines of course.",
            "title_similarity": "0.6982301",
            "sentiment_compound": 0.4678
        },
        {
            "id": "h8dgnng",
            "score": 2,
            "text": "How does every service member feel about the other than Covid vaccines that they must have and/or receive?\nhttp://www.hcvets.com/data/military/2007_vaccine_department_of_defense.htm",
            "title_similarity": "0.6525869",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dgv6b",
            "score": 3,
            "text": "“Sorts by controversial”",
            "title_similarity": "0.0020099059",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dhcb9",
            "score": 6,
            "text": "Standard procedure. This should be a surprise to nobody who is familiar with US Military approach to vaccination and combatting diseases.",
            "title_similarity": "0.39497358",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8djdwp",
            "score": 4,
            "text": "They put a big ass needle in one of your butt cheeks the first few days you’re there lol..\n\nI’m Ex navy",
            "title_similarity": "0.56312037",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h8dk7zz",
            "score": 2,
            "text": "Something tells me the military and the police will have the most resistance to vaccine mandates..",
            "title_similarity": "0.49379262",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8dmjbb",
            "score": 2,
            "text": "I'm surprised it took this long for the Pentagon to decide and announce this.  They had no such qualms with Anthrax vaccines, Pyridostigmine Bromide and who knows what else because it isn't in our records in the run up to Desert Storm.",
            "title_similarity": "0.4645419",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h8dmm2x",
            "score": 10,
            "text": "This is such non-news.\n\nEveryone in the military gets a massive cocktail of vaccines already and it's absolutely not optional, just like medical professionals. \n\nAll these stories are doing is stirring stupid people up and making them dig deeper into their conspiracies.",
            "title_similarity": "0.5684866",
            "sentiment_compound": -0.6715
        },
        {
            "id": "h8dmz6v",
            "score": 2,
            "text": "Fun fact, Q Shaman Jacob Chansley was discharged from the Navy for refusing to get the anthrax vaccine.",
            "title_similarity": "0.4498191",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h8dp72g",
            "score": 1,
            "text": "Buddies in my unit are gonna shit",
            "title_similarity": "0.29306936",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h8dpk8p",
            "score": 2,
            "text": "Most troops have already had them for over a year now lol. I don't see how this is really news.",
            "title_similarity": "0.50984174",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8dpx5t",
            "score": 4,
            "text": "I got a ridiculous amount of vaccinations in the Navy. I don’t remember them ever giving me a choice.",
            "title_similarity": "0.47353435",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h8dry35",
            "score": 6,
            "text": "Don't American soldiers get a bunch of vaccines before deploying around the world? Isn't this totally standard operation?",
            "title_similarity": "0.65196633",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8e8lo4",
            "score": 1,
            "text": "man thats ma birthday",
            "title_similarity": "0.2804155",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8edtwg",
            "score": 3,
            "text": "Good. I was in the Army for 8 years 2009-2017. During that time I got every vaccine under the sun. Neither me, nor anyone I know I served with never once complained about getting vaccines. It's just part of the job. Hell, the first week you're in you probably get a good 14-15 different vac's. Everything from Malaria so a thick Penicillin shot right into your left ass cheek. The fact that these servicemen even once dreamed the thought that they wouldn't be forced to get the vaccine, is fanatical at best. At worst its blind arrogance and stupidity. Get the stupid shot, and get the fuck over yourselves.",
            "title_similarity": "0.61757743",
            "sentiment_compound": -0.9367
        },
        {
            "id": "h8ee2em",
            "score": 5,
            "text": "I work at a DoD facility as a subcontractor, god damn I can’t wait until we’re all required to be vaccinated. Government personnel is nearly 100% vaccinated already, the contracted company running it are much, much less so.",
            "title_similarity": "0.6625111",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h8efp8j",
            "score": 6,
            "text": "When signing on the dotted line also swearing into the military, You become government property no longer a civilian. Good luck terminating that contract with honorable discharge if you can’t obey orders.",
            "title_similarity": "0.45640802",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h8ehtav",
            "score": 4,
            "text": "The military gave me a vaccine against anthrax and a whole other giant cocktail of vaccines. What’s another one",
            "title_similarity": "0.65483445",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8ei3fv",
            "score": 2,
            "text": "I'm sure all of the Patriots® agree with this since [George Washington required inoculation against Smallpox](https://www.loc.gov/rr/scitech/GW&smallpoxinoculation.html).",
            "title_similarity": "0.5201953",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h8eij0b",
            "score": 2,
            "text": "This will be the way businesses operate soon enough. I personally work at two different businesses, one retail and one food service, and both struggle to staff due to the recent surge, one has shut down. \n\nNOW, in hindsight, they are thinking of mandating the vaccine for employees. Too little too late IMO.",
            "title_similarity": "0.5714431",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h8eqif2",
            "score": 2,
            "text": "I think the order includes DoD civilians and contractors too.",
            "title_similarity": "0.39759672",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8eyhqf",
            "score": 2,
            "text": "It's been \"strongly recommended\" and very much available for some time now. The only people who will be affected by this order are the anti-vaxx idiots in the ranks.",
            "title_similarity": "0.34054226",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h8f6zcc",
            "score": 1,
            "text": "This can't possibly go wrong either way. Got my popcorn 🍿",
            "title_similarity": "0.17034929",
            "sentiment_compound": 0.3724
        },
        {
            "id": "h8fac4r",
            "score": 3,
            "text": "Good. Like I've said before, don't like it fuck right off and seek discharge.",
            "title_similarity": "0.20378557",
            "sentiment_compound": 0.7303
        },
        {
            "id": "h8ffjrk",
            "score": 2,
            "text": "Bro you get like 30 shots in boot camp all on the same day and are pushed through a line like cattle for them. No questions asked, and if you refuse you can be easily discharged. Anyone who though this wouldn’t be shot #31 is an idiot. Standard practice.",
            "title_similarity": "0.47224313",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h8hrbr1",
            "score": 1,
            "text": "I guess a bunch of you are for forcing the vaccine on people? WTF?",
            "title_similarity": "0.48279887",
            "sentiment_compound": -0.7089
        },
        {
            "id": "h8ky1oc",
            "score": 2,
            "text": "Not surprised. I had to get anthrax vaxx when i was in first gulf era army",
            "title_similarity": "0.6095849",
            "sentiment_compound": -0.1695
        }
    ]
}