{
    "Texas school district makes masks part of dress code to get around Gov. Abbott's order\n": [
        {
            "id": "h9eie6k",
            "score": -2,
            "text": "The governor now has COVID! He’s a fucking idiot! Let’s all see how it turns out for him..",
            "title_similarity": "0.35597974",
            "sentiment_compound": -0.6342
        },
        {
            "id": "h9eiby4",
            "score": -1,
            "text": "These idiots are trying to run for president instead of protecting their state.  This is going to blow up in their faces.  Biden is going to get 4 more years.",
            "title_similarity": "0.46427393",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9en32a",
            "score": 0,
            "text": ">The vote was 5-1 to alter the dress code in the district, which will welcome back students on Thursday.\n\nWho was the asshole that voted against it?",
            "title_similarity": "0.5600382",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9egi2k",
            "score": 8,
            "text": "I have been asking for weeks why a school doesn’t just make this part of their dress code and be done with it. Looking forward to seeing the mental gymnastics required to untangle this one",
            "title_similarity": "0.6102587",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9e7al3",
            "score": -6,
            "text": "Abbott is like a bad habit",
            "title_similarity": "0.19351323",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9eg4hj",
            "score": 41,
            "text": "I will never understand voting someone into office who gives so little shits about your safety.",
            "title_similarity": "0.3235018",
            "sentiment_compound": -0.0735
        },
        {
            "id": "h9eg07f",
            "score": 2,
            "text": "Surprised these mask bans aren’t being challenged in court.",
            "title_similarity": "0.33600777",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9ekpsw",
            "score": 4,
            "text": "Dumb leaders like this Texas governor are only possible if there are dumb people.",
            "title_similarity": "0.35283163",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9efpzp",
            "score": 1,
            "text": "Modern problems, require modern solutions.",
            "title_similarity": "0.22567801",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9ehl71",
            "score": 3,
            "text": "Yesssssss. Called it!\n\nhttps://reddit.com/r/Austin/comments/p533hh/_/h93jsc8/?context=1",
            "title_similarity": "0.3223964",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eq9vl",
            "score": -22,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9em6gt",
            "score": -1,
            "text": "Why does Greg Abbott always look like he’s at his own wake?..\n\nDude looks like he’s been embalmed.",
            "title_similarity": "0.38227314",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9epw70",
            "score": -6,
            "text": "People in Texas are ok with Gov. Abbot telling them what they can’t wear? \n\nIf it were California, Abbot would be up for recall. \n\nTexas failed the freedom test.",
            "title_similarity": "0.5665184",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h9ezauw",
            "score": -1,
            "text": "Got to love these opportunist GOP terrorists aligning themselves with Trumps lowest possible ignorant idiot trash voting block. It would be funny if it wasn’t so pathetic and tragic.",
            "title_similarity": "0.36595133",
            "sentiment_compound": -0.9403
        },
        {
            "id": "h9er5ws",
            "score": 1,
            "text": "“Girls are not allowed to show their nostrils or they get sent home.”",
            "title_similarity": "0.36904198",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ezhz8",
            "score": 2,
            "text": "Is Abbott *actively trying* to kill Texans?",
            "title_similarity": "0.44592696",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9fau21",
            "score": 0,
            "text": "Its amazing the gops election plans are to fight for americans rights to kill their neighbors and put other peoples kids in harms way.\n\nmasks are so asymptomatic people with covid dont unknowingly spread to others. and the most vocally antimask, their kids we need in masks the most because the parents have advocaked doing a god damn thing to mitigate their kids possibility of getting covid. If this was a just world, we'd start to take their kids away.\n\nThey are literally abusing them.\n\nand we should start to make people civilly responsible for outbreaks when, and only when, they refuse to do even the minimum to help stop spreading covid. People with conditions preventing that would be exempt of course.",
            "title_similarity": "0.6017443",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h9etk7h",
            "score": -15,
            "text": "Ok if there’s a conservative here, please explain to me why these governors are mandating death. It’s one thing to force people to wear masks, and another thing to penalize them for wanting to be safe. My healthy brain doesn’t compute this.",
            "title_similarity": "0.54854953",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9eg73e",
            "score": 35,
            "text": "Meanwhile, I'm in a mask mandated state but the school board decided \"nah fam, not us\". My daughter's coach and principal have both said \"if you get it, you get it\". These people are supposed to be responsible for my children's well being but that's obviously not how they see it.",
            "title_similarity": "0.65142727",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9eqq3b",
            "score": 5,
            "text": "I mostly have republican beliefs, but holy shit I'm too embarrassed of Republicans to actually identify as one. The banning of mask mandates is so hypocritical its not even funny. The same people banning mask mandates also yell because the federal government is overstepping its bounds with recommending vaccines and masks.\n\nThe federal governments job is to manage what is best for the country, not control individual states. The states governments jobs are to manage what is best for the state, not control individual counties and cities. The counties and cities governments jobs are to manage what is best for the county and cities, not control individuals. The individuals jobs are to manage what's best for them, not control others.\n\nBlocking the ability for a lower level to implement what is best for them in a way that literally does no harm to anyone or anything else, should be illegal in itself. An individual school district requiring masks is at worst, inconvenient for the students and staff. It harms no one outside of the school district, it inconveniences no one outside of the school district.",
            "title_similarity": "0.55559975",
            "sentiment_compound": -0.3415
        },
        {
            "id": "h9egc35",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.04497664"
        },
        {
            "id": "h9f1f8d",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9emfjn",
            "score": -1,
            "text": "looks a mortician did his hair and makeup.",
            "title_similarity": "0.42790484",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fodaj",
            "score": 1,
            "text": "Sounds like some schools will be losing government money and possibly face fines.",
            "title_similarity": "0.4388876",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h9ek8tb",
            "score": -54,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9ewxcb",
            "score": -9,
            "text": "Oh, so NOW dress codes are ok.",
            "title_similarity": "0.23677593",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fku0m",
            "score": 3,
            "text": "I don't like mask mandates from the governor. I also don't like anti-mask mandates from the governor. Both point to an unreasonable level of power a single person has to affect my life. \n\nThe school dress code is a great way to 'keep politics local' and out of the hands of clueless people at the top.\n\nGive adults the information, and let us make the decision. Of course, since the government has completely tarnished its reputation as an arbiter of truth, deciding *where* to get accurate information is a problem too.",
            "title_similarity": "0.6109412",
            "sentiment_compound": -0.0567
        },
        {
            "id": "h9f75hr",
            "score": 1,
            "text": "Shit don't matter. We're all getting COVID before it's over. Get yer fucking vaccine so you don't die and we'll deal with what's next as it comes.",
            "title_similarity": "0.5452961",
            "sentiment_compound": -0.0681
        },
        {
            "id": "h9ehibw",
            "score": -10,
            "text": "Wouldn’t it be ironic if covid is the “cure” for this weird affliction of antimaskers and antivaxxers?",
            "title_similarity": "0.41630822",
            "sentiment_compound": -0.3346
        },
        {
            "id": "h9f83k2",
            "score": -15,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9ez2c8",
            "score": -5,
            "text": "Damn these kids are never going get their masks off",
            "title_similarity": "0.22144113",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9essa8",
            "score": -7,
            "text": "You can’t run a state if you can’t walk.",
            "title_similarity": "0.22849327",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fbmut",
            "score": -8,
            "text": "This man is literally trying to kill as many children as possible. He should be recalled and thrown in jail.",
            "title_similarity": "0.35649818",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h9ei2hv",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9ehp4j",
            "score": -39,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9etvqu",
            "score": 5,
            "text": "Americans have a deeply stupid and petulant idea of what constitutes freedom. \n\nAnyway, best of luck to Gov. Abbott's coronavirus.",
            "title_similarity": "0.3572545",
            "sentiment_compound": 0.8275
        },
        {
            "id": "h9f082h",
            "score": 3,
            "text": "How do kids eat in the cafeteria?",
            "title_similarity": "0.2625011",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9f1dlm",
            "score": 0,
            "text": "Sweden Sweden.. 2 waves, now a classic endemic curve.  If only we didn’t try to re-write science these past couple years.",
            "title_similarity": "0.4305719",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fsqw0",
            "score": 1,
            "text": "He looks like a puppet from Team America",
            "title_similarity": "0.42137262",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9enkpr",
            "score": -52,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9emnyl",
            "score": -7,
            "text": "When I'd heard this argument about \"parental rights\" in regards to kids masking at school. I told my son; \"well, looks like you can start wearing hoodies and thongs again.\"\n\nMy parental right also informs me that he should start packing a BB Gun or Taser -- to defend himself from masked men.\n\n/Just kidding. I just wonder not when we get peak virus transmission, but when we reach peak stupid excuses.",
            "title_similarity": "0.65667933",
            "sentiment_compound": -0.6796
        },
        {
            "id": "h9ehtfz",
            "score": -56,
            "text": "Why are people more worried about mask then they are about the vaccine. \n\nAlso. As a Texan, it is WAY too fucking hot for a mask outside. Literally with my thin mask at work it becomes a sauna. \n\nPeople need to get vaccinated so I can take my fucking mask off. (I am vaccinated, but according to y’all the vaccination doesn’t mean no mask and so my work bought into that and so I still have to wear one. It’s so fucking hot with a mask on rn.)\n\nOk to stop people from calling Texans a baby. People without masks are passing out and dying from the heat in Texas and other states. Killing people to stop killing people is not the way to do it.\n\nOverall if you got the president that “cares about us” to force covid vaccines for students over 12, then there would be enough people vaccinated to stop the source and stop the spread",
            "title_similarity": "0.6056852",
            "sentiment_compound": -0.978
        },
        {
            "id": "h9f1b84",
            "score": -3,
            "text": "Glad I'm not in school anymore",
            "title_similarity": "0.16299762",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9el3i7",
            "score": -16,
            "text": "People who support this aren’t very smart.",
            "title_similarity": "0.102708146",
            "sentiment_compound": 0.6901
        },
        {
            "id": "h9f72lz",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9eb8ii",
            "score": 62,
            "text": "Our city has a mask mandate that has been in place since last week. It’s never enforced, however, so any time I’m at the store, there’s still tons of people eschewing it. Wearing it is the EASIEST thing to do to at least try and mitigate the spread (cases are rising where we are, and hospital beds are filling up), and they won’t even do that. \n\nSo now I’m tempted to stroll in pantsless (but with a mask!), and when they tell me I can’t come in because there’s a rule you have to wear pants, I’ll just gesture wildly at the throngs of people not wearing a mask.",
            "title_similarity": "0.4750439",
            "sentiment_compound": 0.3733
        },
        {
            "id": "h9elab8",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9emyvx",
            "score": -1,
            "text": "Modern problems require modern solutions",
            "title_similarity": "0.23951481",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9enz4m",
            "score": -1,
            "text": "This will also stop random acts of blowjob.",
            "title_similarity": "0.4250328",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9exav9",
            "score": 1,
            "text": "That's a good way to do it",
            "title_similarity": "0.0040131547",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9fcauu",
            "score": 1,
            "text": "South Carolina should take note. Luckily, we have the option for remote learning, but if masks and social distancing were in place, I'd consider letting my vaccinated child go back. Unfortunately, with the current variants, no masks and 3 ft social distancing \"when possible,\" I'm not willing to take that chance. Sadly, there are too many anti-mask, COVID deniers here and I'm concerned they'll just be incubating even worse variants.",
            "title_similarity": "0.57547975",
            "sentiment_compound": -0.9144
        },
        {
            "id": "h9fd3b9",
            "score": -1,
            "text": "yeah good luck with that.",
            "title_similarity": "-0.064495824",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h9ehxwo",
            "score": -42,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9er7xi",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9ekpl6",
            "score": -34,
            "text": "Fuck them both, just let kids do what they want to with masks. Why does everyone want to enforce rules.",
            "title_similarity": "0.5350609",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h9ezrf0",
            "score": 5,
            "text": "This asshole governor who is suing school districts that have imposed mask mandates, tested positive for Covid this morning.  He's such a big pos.",
            "title_similarity": "0.50743526",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9fgnbq",
            "score": 2,
            "text": "Good! SOMEone has to stand up to these terrorist-republicans while they try to tear our democracy down!",
            "title_similarity": "0.47308052",
            "sentiment_compound": 0.5399
        },
        {
            "id": "h9e74yo",
            "score": 54,
            "text": "Clever. Just don't more zealously enforce it on girls *so they don't distract the boys*.",
            "title_similarity": "0.3341962",
            "sentiment_compound": 0.5978
        },
        {
            "id": "h9fntmd",
            "score": 3,
            "text": "Finally, other kid's lips won't distract me from my education anymore",
            "title_similarity": "0.31389412",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h9efo3f",
            "score": 100,
            "text": "You know, I sort of get people not wanting to wear masks. It's stupid and they're acting like whiney 5 year olds, but I can comprehend how they got there at least. Going the extra step to ban them though, what the fuck?\n\n(Yes, I know he's only banned \"mask mandates\" not actual masks but it's a difference of degree not substance)",
            "title_similarity": "0.5205812",
            "sentiment_compound": -0.9217
        },
        {
            "id": "h9f5ku4",
            "score": -7,
            "text": "Having pointed out how obviously in violation of the law this dumbass supposed workaround is, I know I'll get downvoted. The very first time this \"dress code\" gets challenged in court, it's going to be found in violation of the law. It's the equivalent of sovereign citizens saying they're \"travelling\" not \"driving\" to try to get around driver's license laws. Yes, they are travelling, but clearly in violation of drivers license laws. And yes, masks are a mandatory part of the dress code, clearly in violation of a law against mandatory masking. Frankly, everyone in this sub celebrating this ingenuous workaround to a bad law is ignorant and goofy.",
            "title_similarity": "0.59479415",
            "sentiment_compound": -0.3559
        },
        {
            "id": "h9ept01",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.04497664"
        },
        {
            "id": "h9ensju",
            "score": -13,
            "text": "Masks today, bunny suits tomorrow.",
            "title_similarity": "0.3539368",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9f9zvp",
            "score": 4,
            "text": "This is absolutely a genius move. \"Conservatives\"  are typically known to discover and take advantage of loopholes, so I'm extra happy that the tables have turned. Touché my friend, touché. 🥳",
            "title_similarity": "0.3090272",
            "sentiment_compound": 0.8948
        },
        {
            "id": "h9felek",
            "score": -19,
            "text": "Democrats and the Taliban, forcing people to cover their faces worldwide. Looking forward to the red armbands with which I can display my vaccination card.",
            "title_similarity": "0.6587029",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ejeux",
            "score": -27,
            "text": "Clearly the Texas school district is mentally challenged",
            "title_similarity": "0.30696666",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9em4n5",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.04497664"
        },
        {
            "id": "h9f3404",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9fls1y",
            "score": 6,
            "text": "That is so fucking cool",
            "title_similarity": "-0.089784175",
            "sentiment_compound": 0.4351
        },
        {
            "id": "h9fwmmo",
            "score": 6,
            "text": "Why are so many positive comments being shown as hidden/controversial? Most of them are supporting this which is good",
            "title_similarity": "0.1895147",
            "sentiment_compound": 0.8651
        },
        {
            "id": "h9f36hs",
            "score": -1,
            "text": "dress code? I thought Texas was about that freedom life",
            "title_similarity": "0.5693535",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9f6tzp",
            "score": 1,
            "text": "Dress code says no shorts or skirts above the knee.\nLiberals: This is religious propaganda you can't tell them what to wear!\nDress code says masks are required.\nSame liberals: Yea! That'll stick it to them. You have to abide by the dress code!\n🙄🙄🤭",
            "title_similarity": "0.6289175",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fbhoh",
            "score": 1,
            "text": "Good for them, jmo, clever",
            "title_similarity": "0.00312866",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h9fdexy",
            "score": 1,
            "text": "Education wins! Yay.   \n\n\nThis is why we need education, so that people can use critical and creative thinking to solve problems that other people who didnt made.",
            "title_similarity": "0.45365572",
            "sentiment_compound": 0.7959
        },
        {
            "id": "h9fduj0",
            "score": 1,
            "text": "Smart. I love that little bit of MC to give the Gov. the middle finger.",
            "title_similarity": "0.2452035",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h9fenq3",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.044976644"
        },
        {
            "id": "h9fff7z",
            "score": 1,
            "text": "He won’t win this war",
            "title_similarity": "0.18365115",
            "sentiment_compound": -0.2083
        },
        {
            "id": "h9fl9sq",
            "score": 8,
            "text": "That’s Governor Abbott (R - COVID Victim No. 37,453,385)",
            "title_similarity": "0.41352838",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9e898y",
            "score": 329,
            "text": "Abbott can scream about it on Facebook to his bot followers from his ventilator.",
            "title_similarity": "0.46306026",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9elbbh",
            "score": 2,
            "text": "You mean, to get around Covid - infected governor??",
            "title_similarity": "0.44010425",
            "sentiment_compound": -0.5514
        },
        {
            "id": "h9enytl",
            "score": 2,
            "text": "This is the way. \n\nAmazing that schools have to do stunts like to protect the public health of children while conservatives are trying to March everyone off a cliff and into the ICU by insisting “there is no pandemic. We won’t admit we were wrong”",
            "title_similarity": "0.6511135",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h9eqze3",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.044976644"
        },
        {
            "id": "h9ere5t",
            "score": 2,
            "text": "Smart cookies! There's always a work around.",
            "title_similarity": "0.16186859",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h9f9kzp",
            "score": 2,
            "text": "Smart move, now it’s not something the parents can really argue about either since it’s dress code.",
            "title_similarity": "0.46828324",
            "sentiment_compound": 0.0018
        },
        {
            "id": "h9fazkj",
            "score": 2,
            "text": "He has covid now, so it’ll be real funny to watch him try and still strike this down….\n\nSorry did I say funny? I meant heart breakingly sad",
            "title_similarity": "0.33389002",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h9fdjsk",
            "score": 2,
            "text": "Someone's been reading threads on Reddit.",
            "title_similarity": "0.36453554",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fgtzj",
            "score": -2,
            "text": "All they are doing is playing the political game… both Democrats and Republicans do this bullshit. “Can’t beat em join” I guess lol",
            "title_similarity": "0.38129783",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h9fjsle",
            "score": 2,
            "text": "It's kinda funny how conservatives are all for local government. Oh except when it goes against what their state says. Then we should just stop at state level.",
            "title_similarity": "0.5384699",
            "sentiment_compound": 0.1045
        },
        {
            "id": "h9fjvo3",
            "score": 2,
            "text": "To make it completely foolproof, they should specify the mask must prominently feature both Stars and Stripes and Lone Star flags. One on each cheek.\n\nTry ripping that off kids faces you unpatriotic parents!\n\n/s",
            "title_similarity": "0.5893972",
            "sentiment_compound": 0.2698
        },
        {
            "id": "h9flehm",
            "score": 2,
            "text": "very good to see the school board showing their true colors :) wonder how long this will last.",
            "title_similarity": "0.3811595",
            "sentiment_compound": 0.8399
        },
        {
            "id": "h9ee1ws",
            "score": 28,
            "text": "It's gonna be weird seeing Republicans argue that kids shouldn't be wearing any pants...well, after their love of Gaetz, Moore, and Trump, not so much weird as completely expected.",
            "title_similarity": "0.47219104",
            "sentiment_compound": 0.4261
        },
        {
            "id": "h9ei5l1",
            "score": 30,
            "text": "Can’t wait until 2024 and he’s running for President on a platform of dead children.",
            "title_similarity": "0.35546994",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9ekv49",
            "score": -9,
            "text": "This is as obscene as setting ridiculous requirements on abortion facilities under the pretense of \"protecting women's safety\", or blocking an execution because the drug used for lethal injection is past its expiration date.",
            "title_similarity": "0.5351025",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h9fk74c",
            "score": -9,
            "text": "Nice try nbc. They can not require masks… whether or not they require another article of clothing",
            "title_similarity": "0.39732912",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9flvre",
            "score": 9,
            "text": "Genius move.  The \"muh freedumbz\" folks LOVE school uniforms.",
            "title_similarity": "0.37081262",
            "sentiment_compound": 0.7125
        },
        {
            "id": "h9fp5z6",
            "score": 9,
            "text": "As usual , teachers find a way.",
            "title_similarity": "0.30594328",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9erfi3",
            "score": -20,
            "text": "[removed]",
            "title_similarity": "0.035071313"
        },
        {
            "id": "h9erql9",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.035071313"
        },
        {
            "id": "h9ex0qn",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9efu0e",
            "score": 51,
            "text": "This is the kind of innovative thinking I wish our DC democrats had. Godspeed to these fine Americans.",
            "title_similarity": "0.2774521",
            "sentiment_compound": 0.7275
        },
        {
            "id": "h9eikuw",
            "score": 3,
            "text": "Get him and DeSatis/Satan off the same planet as us please",
            "title_similarity": "0.38281333",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9eo799",
            "score": -2,
            "text": "To get around the governor, Ventilators are now mandatory so schools can bill the facility fee like hospitals.",
            "title_similarity": "0.7029214",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9etiw0",
            "score": 1,
            "text": "Yeah, that’s right, it’s not a “mAsK mAnDaTe,” it’s a dress code, what you going to do about it gOvErNoR Abbott? You murdering, bio-terrorist piece of shit…",
            "title_similarity": "0.59169745",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9f3qcm",
            "score": 3,
            "text": "I really can't believe the GOP. \n\nOver 625,000 Americans are dead of COVID and instead of letting people handle it responsibly, they've turned it into Bugs and Daffy switching signs from \"Duck Season\" to \"Rabbit Season.\"",
            "title_similarity": "0.44619393",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9f8npl",
            "score": -4,
            "text": "This is where I remind you that NBC is jointly owned by Microsoft, for MSNBC, and Comcast, for CNBC-- who is otherwise responsible for all NBC content:  \n\n\n**Comcast.** Now, go on, tell me why it doesn't matter and how neoliberal you are.",
            "title_similarity": "0.4271313",
            "sentiment_compound": 0.3018
        },
        {
            "id": "h9fb24r",
            "score": 5,
            "text": "TFW you have to act around your supposedly representational government for your own safety",
            "title_similarity": "0.5474826",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9fb4gy",
            "score": 2,
            "text": "You listening, Florida?",
            "title_similarity": "0.10874955",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fdhmv",
            "score": 4,
            "text": "good to know there are still sane folks in Texas...",
            "title_similarity": "0.13214482",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9fe8bl",
            "score": 3,
            "text": "That’s pretty clever. I got a chuckle out of that.",
            "title_similarity": "-0.0062135085",
            "sentiment_compound": 0.836
        },
        {
            "id": "h9fqurp",
            "score": 2,
            "text": "\"But children's brains need oxygen to grow! \"    /S",
            "title_similarity": "0.28404638",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ft5ls",
            "score": 4,
            "text": "Who’s the jerk who voted against it??",
            "title_similarity": "0.22768155",
            "sentiment_compound": -0.4137
        },
        {
            "id": "h9ejiiu",
            "score": 43,
            "text": "I don’t want Abbott to die, I just want the SOB to get sick enough to take this shit seriously and stop trying to score political points with his anti science stands. But if he does die it won’t be a big loss in my books.",
            "title_similarity": "0.49348345",
            "sentiment_compound": -0.9565
        },
        {
            "id": "h9efxrl",
            "score": 11,
            "text": "South Carolina needs to do the same thing.",
            "title_similarity": "0.3362477",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ei51i",
            "score": 12,
            "text": "This has been my argument the whole time, so a school can say students cant wear short skirts or ripped jeans or whatever, but they cant say students must wear a mask? What is the difference? It is all clothing",
            "title_similarity": "0.6249822",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h9ej1xd",
            "score": 12,
            "text": "“Abbott has sought to portray his stance as protecting the freedoms of Texans. \"The path forward relies on personal responsibility — not government mandates,\" the governor said earlier this month.”\n\nThat is some Texas-sized irony when Abbott uses a government mandate to thwart individual school districts from requiring masks, and then defends that decision by saying he’s protecting freedoms of Texans from government mandates.",
            "title_similarity": "0.7021271",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9efq2f",
            "score": 35,
            "text": "This governor deserves the worst life can throw at a person. I hope he gets what’s coming to him.",
            "title_similarity": "0.41159445",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9etyb3",
            "score": -14,
            "text": "Parents, pull your kids out, find a different school.",
            "title_similarity": "0.52301776",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ewwg7",
            "score": -4,
            "text": "No judgment on the ethics of this, but from a purely legal standpoint, I feel like it takes a judge about 10 seconds to decide this goes against the recent supreme court ruling.  All it takes is one parent filing for an injunction.",
            "title_similarity": "0.3774765",
            "sentiment_compound": 0.867
        },
        {
            "id": "h9f4eje",
            "score": 4,
            "text": "Normally I'm completely against school dress codes because 9 times out of 10 it's just sexist rules against girls. But this is too funny.",
            "title_similarity": "0.50421184",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h9f9saq",
            "score": 4,
            "text": "I can't believe it took them this long to come up with it.",
            "title_similarity": "0.06118741",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fif7p",
            "score": 4,
            "text": "He's already done his hardliner showboating to try to impress Trump and his army of sycophants.\n\n I have to imagine he's a little bit relieved that they were able to circumvent him, without making him look like a chump by forcing him to backpedal on the policy directly.\n\nI imagine like preachers they're a lot less indoctrinated than the actual congregation and they know it's just an act in greater proportions.",
            "title_similarity": "0.47783077",
            "sentiment_compound": 0.8913
        },
        {
            "id": "h9fknav",
            "score": 4,
            "text": "I love this so much, it’s absolutely part of a district’s perogative",
            "title_similarity": "0.12541236",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9fwyll",
            "score": 14,
            "text": "They’re literally having to resort to loopholes in order to protect each other. I would call it a failure of “leadership”, but it’s hard to fail when you’re actively working to do the opposite.",
            "title_similarity": "0.40390673",
            "sentiment_compound": -0.5789
        },
        {
            "id": "h9ejaxk",
            "score": 5,
            "text": "This is perfect. Now they'll either have to argue that masks aren't part of how a person dresses themselves, which is silly.  Or they'll have to argue against dress codes, which I suspect they won't.",
            "title_similarity": "0.54321754",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9eovc3",
            "score": -4,
            "text": "He probably gives no shits. He literally is giving people the freedom to mandate masks in their own cities/counties so the people can decide for themselves whether they want to utilize them for themselves or not",
            "title_similarity": "0.5404484",
            "sentiment_compound": 0.8575
        },
        {
            "id": "h9es9dl",
            "score": 4,
            "text": "Abbott needs to just stay the F away from schools. From holding medical/psychological/educational psychology licensing boards hostage over the bathroom bill in 2016 to this current idiocy, he has shown time and time again that he’s willing to sacrifice schoolchildren as pawns to score political points.",
            "title_similarity": "0.60102373",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9f0h0r",
            "score": -6,
            "text": "How is it that changing a dress code is evading what's essentially illegal?  If they changed the dress code to everyone being nude that wouldn't just bypass laws and make it acceptable.   \n\nThis is moronic.",
            "title_similarity": "0.5479119",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h9f9hil",
            "score": 5,
            "text": "Smart. Why Republicans are so antimask it’s a mystery. I think they are just playing to their base for political gain, putting that ahead of Covid deaths and suffering. Sociopathic BS.",
            "title_similarity": "0.3937181",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h9fjzji",
            "score": 4,
            "text": "Brilliant move.  At least someone knows how to think critically.  Education IS important.",
            "title_similarity": "0.25549385",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h9fl56g",
            "score": 5,
            "text": "It’s amazing they let traitors be governors",
            "title_similarity": "0.3292029",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h9em51f",
            "score": -19,
            "text": "Masks simply don’t work with delta .  You’re trying to stop a mosquito with a tennis racket",
            "title_similarity": "0.41602272",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9eokcb",
            "score": -6,
            "text": "This will never stand up in court.  It's an easy argument to strike it down.  Dress codes have AWAYS been about tradition to govern style.  Never once in the history of America has a dress code been about the potential health benefit or detriment of a particular item worn on the body.\n\nThis is a blatant attempt of one organization to over reach its existing authority to govern style to extend to an attempt to govern behavior possibly effecting health.\n\nIt easily breaks down when examining the extreme conditions of extending the authority to govern ANY item worn or not worn: Could the school decide to require kids to wear a holstered firearm as part of their dress code?\n\nEDIT:  To all you people not understanding the legal merits of this argument, here's the start of Abbott's mandate being upheld by the Texas State Supreme Court:\n\nhttps://www.npr.org/sections/back-to-school-live-updates/2021/08/18/1028760318/paris-texas-school-district-mandate-masks-dress-code-gov-abbott-ban\n\nThe Texas Supreme Court handed Abbott his first legal victory over the weekend when it struck down temporary restraining orders that enabled two counties to institute mask requirements.",
            "title_similarity": "0.5624538",
            "sentiment_compound": 0.8938
        },
        {
            "id": "h9expzc",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.04497664"
        },
        {
            "id": "h9f5b8k",
            "score": -7,
            "text": "Okay, interesting headline. Made me click on it. But, once again, it was nothing but click bait. There’s nothing in the article that says how making it part of the dress code circumvents the governor’s order. \n\nThey are defying his order - not “getting around it.”\n\n🤷🏻‍♀️",
            "title_similarity": "0.48296177",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9fido4",
            "score": -6,
            "text": "Isn’t this kind of undemocratic, though? The people of TX elected Abbot and this is an unelected committee. Say the situation were reversed and a school board prohibited masks in the dress code even when masks were required by law— that would be bullshit, would it not?",
            "title_similarity": "0.66325855",
            "sentiment_compound": -0.2328
        },
        {
            "id": "h9fjx19",
            "score": 7,
            "text": "I love this school board. They care about the kids.",
            "title_similarity": "0.29242685",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h9ehjo0",
            "score": -20,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9ejbqv",
            "score": -26,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9ehu3d",
            "score": 7,
            "text": "Honestly, masks are easier to put on and wear than any other piece of clothing",
            "title_similarity": "0.12226991",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h9ey1vd",
            "score": 6,
            "text": "If the school can enforce midriff they can enforce a mask",
            "title_similarity": "0.6325934",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eyhg2",
            "score": 8,
            "text": "Remember when the Republicans claimed to be the party of small government and let local government rule the locals? lol funny how everything changes when people do something you don't agree with.",
            "title_similarity": "0.47222614",
            "sentiment_compound": 0.7423
        },
        {
            "id": "h9f4ox1",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9fhbc8",
            "score": -6,
            "text": "I doubt this would hold up in court. It’s clearly an illegal mask mandate.",
            "title_similarity": "0.28593624",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9edtcs",
            "score": 1120,
            "text": ">Abbott has sought to portray his stance as protecting the freedoms ofTexans. \"The path forward relies on personal responsibility — notgovernment mandates,\" the governor said earlier this month.\n\nExcept your freedom ends where my nose begins and Jacobson v. Massachusetts is established SCOTUS case law stating that one of the key government responsibilities is protecting the common good (i.e. public health) which allow exactly this sort of mandate.\n\nUsing their logic we should ban all speed limits on roads to protect the freedom of people to drive according to their \"personal responsibility\" behind the wheel.  Not wearing a mask according to current medical and scientific knowledge/guidelines and speeding are both reckless acts by individuals with the potential to harm innocent people who happen to cross their paths.  Why are they hell bent on protecting one freedom but not the other?\n\n(I don't really need an answer to that)",
            "title_similarity": "0.6169627",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h9ef9dq",
            "score": 305,
            "text": "How did we turn into this nation of idiots.\n\nWearing a mask is anti-freedom to these people yet every single aspect of life has 27 rules and regulations attached to it that they go along with.",
            "title_similarity": "0.5557203",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eh5ng",
            "score": 8,
            "text": "I hope Abbott lives long enough to seriously regret his decisions",
            "title_similarity": "0.33343926",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h9eodhr",
            "score": 8,
            "text": "I can’t believe this is all real. People banning people from wearing ppe.",
            "title_similarity": "0.33144552",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9f497n",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9ffaes",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9ffasn",
            "score": -7,
            "text": "Good. Time to go back to normal. Vaccines don’t kill the virus, it just allows it to mutate. This will never go away. Might as well just go back to normal.",
            "title_similarity": "0.4279392",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h9ejnm9",
            "score": 27,
            "text": "That school board is goat",
            "title_similarity": "0.3774035",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eii0z",
            "score": 9,
            "text": "Covid is really exposing the right wing assholes. How can any sane person vote for this party? How?!?!?",
            "title_similarity": "0.40031838",
            "sentiment_compound": -0.682
        },
        {
            "id": "h9ek58i",
            "score": 10,
            "text": "When you have to defy your leaders because they're braindead.. sad times we live in.",
            "title_similarity": "0.35069138",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9ent61",
            "score": -8,
            "text": "Only in USA and now in Afganistan. Epic",
            "title_similarity": "0.14751469",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eod2o",
            "score": 10,
            "text": "Somebody should mention to anti-maskers that a bodybag is just a face-mask, but for your entire body 🤷🏻‍♂️",
            "title_similarity": "0.5922209",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9er2tt",
            "score": -8,
            "text": "They can mandate mask idc about that as long as they don’t mandate vaccines I think this is totally fine",
            "title_similarity": "0.47447515",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h9esl6d",
            "score": 11,
            "text": "The \"muh freedom\" crowd's heads are exploding, and it's fucking glorious.",
            "title_similarity": "0.09193986",
            "sentiment_compound": 0.8655
        },
        {
            "id": "h9fghtu",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.035071313"
        },
        {
            "id": "h9emvfj",
            "score": 9,
            "text": "Businesses should start doing this too. No shoes, no shirt, no mask, no service.",
            "title_similarity": "0.358194",
            "sentiment_compound": 0.3536
        },
        {
            "id": "h9errvi",
            "score": -13,
            "text": "I can't believe anybody is celebrating this",
            "title_similarity": "0.027962174",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h9erv6z",
            "score": -11,
            "text": "[deleted]",
            "title_similarity": "0.04497664"
        },
        {
            "id": "h9ejfaa",
            "score": -15,
            "text": "[removed]",
            "title_similarity": "0.035071284"
        },
        {
            "id": "h9erwf1",
            "score": 13,
            "text": "Hahahahahaha. Brilliant. A giant middle finger to Governor Pestilence.",
            "title_similarity": "0.23850045",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h9ei6lr",
            "score": 95,
            "text": "Call them Freedom Masks… why does the Governor hate freedom?",
            "title_similarity": "0.40021062",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h9elvdw",
            "score": 15,
            "text": "Paging /r/maliciouscompliance",
            "title_similarity": "0.20732085",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ek9hz",
            "score": 212,
            "text": "*Gov. Abbott*: Am I a joke to you?\n\n*Paris Independent School District*:  . . . Yes?",
            "title_similarity": "0.48683304",
            "sentiment_compound": 0.644
        },
        {
            "id": "h9ehfoi",
            "score": 176,
            "text": "I love the irony of racist/sexist dress codes coming back around to haunt conservative governors. Karma is a bitch, huh?",
            "title_similarity": "0.437647",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9el164",
            "score": -16,
            "text": "So now they are forced to wear it at all times while at school? Doesn't sound any better to me\n\n*Let the downvotes commence*",
            "title_similarity": "0.571088",
            "sentiment_compound": -0.6604
        },
        {
            "id": "h9ee5te",
            "score": 1519,
            "text": "This is a pretty ingenious solution. Kudos to whoever came up with this idea. Congratulations schools.",
            "title_similarity": "0.30110782",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h9emq12",
            "score": -18,
            "text": "It should be up to the kids if they wanna wear one or not",
            "title_similarity": "0.43596214",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eiw66",
            "score": 297,
            "text": "Conservatives: we can’t let the urban elitists decide what’s good for rural areas!!!!!\n\nAlso conservatives: rural conservatives know what’s best for urban areas",
            "title_similarity": "0.45852056",
            "sentiment_compound": 0.8507
        },
        {
            "id": "h9eath8",
            "score": 2830,
            "text": "Can’t wait for the ma freedums crowd to try to claim a dress code restricts their freedums  then justify why my kid can’t wear spaghetti straps .",
            "title_similarity": "0.713011",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9e8sgv",
            "score": 8211,
            "text": "[deleted]",
            "title_similarity": "0.04497664"
        },
        {
            "id": "h9elm1t",
            "score": 119,
            "text": "[removed]",
            "title_similarity": "0.035071313"
        },
        {
            "id": "h9f6587",
            "score": 39,
            "text": "Isn't it weird that businesses have been having no shirt, no shoes, no service signs for decades and no one's had any issue with that? But now that they've added masks to the mix, all to help prevent the spread of a pandemic, you get all the \"infringing on my freedoms\" people coming out of the woodworks?",
            "title_similarity": "0.45369655",
            "sentiment_compound": 0.7787
        },
        {
            "id": "h9ejuk4",
            "score": 103,
            "text": "I hope like hell people in their states remember where officials stood during the pandemic and get out there and vote till their fingers bleed .",
            "title_similarity": "0.5365102",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9eelzu",
            "score": 2825,
            "text": "I'm Gonna Do What's Called a Pro Gamer Move",
            "title_similarity": "0.22738802",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ekpjt",
            "score": 1232,
            "text": "Gov Abbott has had two Covid shots and a booster.  \n\nWhen he contracted the Delta variant he immediately started expensive monoclonal antibody treatment, despite the fact that he felt fine and was extremely unlikely to get very sick. Why?\n\nBecause he knows the long term effects of COVID could be just as bad or worse than the actual virus.",
            "title_similarity": "0.48989683",
            "sentiment_compound": -0.8553
        },
        {
            "id": "h9egu4r",
            "score": 1878,
            "text": "Am I the only one who just figured out he’s in a wheelchair?  Every pic I’ve ever seen of him is just a headshot like the one above. Weird.",
            "title_similarity": "0.2912588",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h9ey3z9",
            "score": 214,
            "text": "After struggling to find dress-code appropriate warm-weather school clothes for my long-legged 11-year-old, and raging at the fact that masks aren’t required but my daughter can’t wear tank tops, this tickles me to no end.",
            "title_similarity": "0.55304104",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h9ecw5q",
            "score": 10058,
            "text": "If you stand very still and listen very carefully, you can hear Abbott furiously writing a new law that gives him control of school dress codes.",
            "title_similarity": "0.6666366",
            "sentiment_compound": -0.2748
        },
        {
            "id": "h9eewzv",
            "score": 7405,
            "text": "“Pants and masks must be worn at all times.”",
            "title_similarity": "0.32894838",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9ehwue",
            "score": 14,
            "text": "I wish we could evaluate ALL politicians and see how many have psychopathy narcissism or the like, it would be interesting.",
            "title_similarity": "0.545429",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h9ejbll",
            "score": 5,
            "text": "You know, I've been comparing mask mandates in schools to dress codes forever, surprised it hasn't happened earlier.",
            "title_similarity": "0.6536471",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h9ek2pe",
            "score": 10,
            "text": "I've been wondering why more school districts don't do this. If a school district can regulate how students can and can't dress, why can't they regulate face masks?",
            "title_similarity": "0.6815024",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ek33r",
            "score": 2,
            "text": "There’s another Abbott I wish that was still around to be put in his place. \n\nDarrell Abbott\n\nDIMEBAG Darrell Abbott. \n\nI’ll leave now.",
            "title_similarity": "0.46155912",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9ek9vc",
            "score": 2,
            "text": "In a few weeks I'll be very curious to see the differences in reported covid outbreaks from these schools.",
            "title_similarity": "0.5077396",
            "sentiment_compound": 0.3804
        },
        {
            "id": "h9eklhu",
            "score": 2,
            "text": "I had thought about this and whether or not it would work. Guess I'll get my answer",
            "title_similarity": "0.24781111",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9el6vo",
            "score": 1,
            "text": "I used the stupidity to destroy the stupidity",
            "title_similarity": "0.23689575",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h9eleyw",
            "score": 2,
            "text": "Improvise, Adapt, Overcome",
            "title_similarity": "0.20638755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eli15",
            "score": 3,
            "text": "All schools should have done this at the beginning of Covid.",
            "title_similarity": "0.47892445",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ellvy",
            "score": 1,
            "text": "No doubt Abbot is thankful they found it. He gets to show his base he's a super awesome Freedom Man while they do the bare minimum things he knows they should be doing.",
            "title_similarity": "0.22303689",
            "sentiment_compound": 0.9584
        },
        {
            "id": "h9elyfh",
            "score": 4,
            "text": "It’s difficult to even imagine, an elected official would be using the denial of science, during a pandemic, to define themselves politically.",
            "title_similarity": "0.40773365",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9em3lm",
            "score": 1,
            "text": "This will go over well.",
            "title_similarity": "0.031225909",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9emc4a",
            "score": 5,
            "text": "Awesome,  I used to like gov Abbott but he been licking the Desantis boots for to long. What an ass wipe to hinder schools ability to keep children safe .  The entire bunch needs to be kicked out.",
            "title_similarity": "0.58679163",
            "sentiment_compound": 0.6542
        },
        {
            "id": "h9emdyx",
            "score": 3,
            "text": "Oh you mean the vaccinated fuck head that just got COVID again? But he’s okay since the vaccine protected him, even though he won’t tell his cult supporters to get the vaccine themselves.",
            "title_similarity": "0.5023352",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h9emlxw",
            "score": 2,
            "text": "The governor that has Covid?",
            "title_similarity": "0.20543066",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9en41u",
            "score": 3,
            "text": "These darn kids and their saggy jeans are infringing on my kids right to breath!",
            "title_similarity": "0.35196114",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9en51v",
            "score": 1,
            "text": "Can someone share this on /conservative? I’m",
            "title_similarity": "0.24294572",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9en70e",
            "score": 1,
            "text": "Someone here suggested that very thing when the news first hit about mandates being banned.",
            "title_similarity": "0.47488767",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h9enbqg",
            "score": 2,
            "text": "> The vote came the same day that Abbott's office announced that the governor had tested positive for Covid-19. Abbott is fully vaccinated, his office said.\n\nFully vaccinated, and received a booster, and getting a fetal stem cell sourced experimental treatment. Truly a man of the people.",
            "title_similarity": "0.51027244",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h9end4w",
            "score": 1,
            "text": "Wait for some schools to go the other direction and ban masks as not part of the dress code and need Dr permission to wear it. I’m sure this is not the end sadly.",
            "title_similarity": "0.681402",
            "sentiment_compound": 0.0083
        },
        {
            "id": "h9ent1p",
            "score": 6,
            "text": "This is how it *should* have been handled across the entire country last year.",
            "title_similarity": "0.39509705",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eobkz",
            "score": 5,
            "text": "Why are they scared of the governor?  Just make them mandatory and make the governor challenge them on it. \n\nHere is to hoping the Governor has a really bad case of Covid.  Non-Life Threatening and without long term issues, but a case that knocks his smirking ass on the ground.",
            "title_similarity": "0.47637373",
            "sentiment_compound": -0.8441
        },
        {
            "id": "h9eoioz",
            "score": 3,
            "text": "\"Teachers need to carry firearms to protect the kids.\"\n\"Teachers should NOT wear masks\" to protect the kids?\nLogic does not compute.",
            "title_similarity": "0.55267173",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9eoji8",
            "score": 2,
            "text": "ASSHOLE GOVERNMENT gop MOB WANTS US ALL TO DIE A HORRIBLE DEATH!!!!!!! As their treasonous party will!\n\nThere is no other conclusion!",
            "title_similarity": "0.3982008",
            "sentiment_compound": -0.9631
        },
        {
            "id": "h9eok5k",
            "score": 7,
            "text": "Meanwhile in Denton ISD and Lewsiville ISD, they are saying they just can't enforce masks and the parents are responding \"well you manage to enforce dresscode on my kid every other day, especially the girls, just fine. So we call BULLSHIT.\"",
            "title_similarity": "0.6369659",
            "sentiment_compound": -0.4398
        },
        {
            "id": "h9eordq",
            "score": 1,
            "text": "Anyone from Texas here? I’d love to hear  your opinions. \n\nI would guess that this will probably become a court case or Abbott will put a hold on those districts State funding until they remove the illegal dress code policy. I mean, the Executive Order states that face masks cannot be forced upon people so going directly against it will likely bring consequences. Should be interesting to see what happens.",
            "title_similarity": "0.7397091",
            "sentiment_compound": 0.6985
        },
        {
            "id": "h9eoti0",
            "score": 1,
            "text": "If you’re in high school and they try to make you wear a mask, could you say the governor said I don’t have to? Would that work?",
            "title_similarity": "0.66061133",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eotpt",
            "score": 1,
            "text": "I don't get how this circumvents his mask ban? I mean, I'm glad they're doing it, I just don't see how making it part of their dress code, which is the very thing Abbott is banning, circumvents that.",
            "title_similarity": "0.5747206",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h9ep431",
            "score": 4,
            "text": "Proud of that school district. Big brain time.",
            "title_similarity": "0.17007412",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h9epdef",
            "score": 2,
            "text": "Fuck Abbott and everything he stands for.",
            "title_similarity": "0.22652721",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9ephxw",
            "score": 1,
            "text": "This if god damn brilliant. As a parent of 2 kids in high school in Hillsborough county Florida, yes,  the same one that has made headlines the past few days nationally for the fact that we have nearly 9000 kids in quarantine or isolation only 6 days into the school year.  The school board has an emergency meeting today at 1pm to address the situation. I really hope they use this an inspiration and follow suit. Prior to Covid my daughter would tell me stories about how kids were constantly getting dress code violations and how rigorous some of the APs were about enforcement of it. This would allow the district to skirt the insane “executive order” Desantis has enacted banning school districts from implementing mask mandates with the threat of withholding funds from them. It would be the chefs kiss of fuck yous to him and these crisis actor “parents” that will show up to today’s meeting crying about how there special little snowflake is somehow being  detrimentally harmed by having to wear a piece of fabric over their mouths so they can possibly, you know, not get sick and fucking die.",
            "title_similarity": "0.5648452",
            "sentiment_compound": -0.9231
        },
        {
            "id": "h9epjap",
            "score": 1,
            "text": "Modern problems require **traditional** solutions.",
            "title_similarity": "0.27096984",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9eqb0u",
            "score": 4,
            "text": "Party of “small government”",
            "title_similarity": "0.04305049",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9eqg3c",
            "score": 2,
            "text": "It wouldn't be shocking to see him trying to gain control the school districts power of dress code.  I'm waiting to see if they want to try to become rulers of their states.",
            "title_similarity": "0.7005745",
            "sentiment_compound": 0.7147
        },
        {
            "id": "h9eqi2w",
            "score": 10,
            "text": "What ever u believe in ppl don’t realize how covid have sucked up all the hospital resources that leaves every other health crap on hold. The same heart attack, seizure, motor vehicle accident, gun shot wound, trauma rate does not decrease and by having covid patients taking up the ICU rooms, where the fuck you gonna put these other patient at? Most likely they are at the waiting room waiting to die cause there is no resources.",
            "title_similarity": "0.4089033",
            "sentiment_compound": -0.9657
        },
        {
            "id": "h9eqli8",
            "score": 1,
            "text": "damn these kids must fucking hate this shit. Being a kid going through this pandemic must be tough, if I was a kid I can't imagine not being able to see my friends or play sports for months.",
            "title_similarity": "0.37645417",
            "sentiment_compound": -0.8059
        },
        {
            "id": "h9eqm14",
            "score": 3,
            "text": "These governors that are trying to prevent mask mandates, are only going to prevent themselves from being reelected. This is a Worldwide Pandemic. It's a public health emergency, and they are actively taking actions to undermine efforts to prevent the spread of a virus.",
            "title_similarity": "0.5490541",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9er9oa",
            "score": 1,
            "text": "No Shirt\nNo Shoes\nNo Dice",
            "title_similarity": "-0.006613735",
            "sentiment_compound": 0.1471
        },
        {
            "id": "h9erzfs",
            "score": 5,
            "text": "Finally, I can be proud of one of my local municipalities while reading national news.",
            "title_similarity": "0.30875427",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h9esh97",
            "score": 2,
            "text": "Improvise, adapt, overcome",
            "title_similarity": "0.20638755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9esq0r",
            "score": 1,
            "text": "Modern problems require modern solutions.",
            "title_similarity": "0.24477114",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9esscl",
            "score": 2,
            "text": "So someone finally did the thing they’ve been saying they couldn’t do?",
            "title_similarity": "0.2644572",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9esxyc",
            "score": 2,
            "text": "Haha! Fucking love it.",
            "title_similarity": "-0.03539095",
            "sentiment_compound": 0.831
        },
        {
            "id": "h9et42h",
            "score": 15,
            "text": "You mean Vaccinated Governor Abbott?",
            "title_similarity": "0.43898505",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eth66",
            "score": 1,
            "text": "My question would be is he vaccinated?",
            "title_similarity": "0.36315057",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ethzg",
            "score": 1,
            "text": "I hope he gets hit with Covid hard. Fuck this prick",
            "title_similarity": "0.3343392",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9etiee",
            "score": 1,
            "text": "He’s going to *real* *school*, just like the fat orange guy!",
            "title_similarity": "0.39346066",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h9etjmk",
            "score": 1,
            "text": "As long as the local governments remain sane and the courts fair, we’ll be able to avoid a second catastrophe like we had when Covid hit the state last year. Abbott is a cancer and too many Texans support him. I personally can’t stand him. He’s a racist, misogynistic bigot who doesn’t give a shit about anyone but his wealthy donors and radical Christian fundamentalist base.",
            "title_similarity": "0.4876663",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h9etm4r",
            "score": 1,
            "text": "No dont mandate masks take a different tack...\n\nAny student not wearing a mask must wear a belled-up 12ft hula hoop on straps and a vest with biological hazard signs on it. Maybe hazard lights as well.\n\n(Legit medical exemptions allowed though)\n\nI would say make a high-ventilation portable for anti maskers but I doubt that the budget would be approved for it.",
            "title_similarity": "0.6119407",
            "sentiment_compound": -0.0644
        },
        {
            "id": "h9eu262",
            "score": 2,
            "text": "Nice, gov. Abott, what a loser.",
            "title_similarity": "0.06554644",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h9eu4g4",
            "score": 3,
            "text": "Great idea! now if only the Lee County School board in Florida had that kind of initiative and balls to stand up to Gov DeathSentence for his policies endangering children",
            "title_similarity": "0.59584653",
            "sentiment_compound": 0.6588
        },
        {
            "id": "h9eu7u9",
            "score": 1,
            "text": "Gov. Abbott prefers big government and centralized control.  I think he should leave local decisions to the schools and families that are affected by those decisions and consider taking a more conservative approach to the issue.",
            "title_similarity": "0.57387257",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h9eu7x3",
            "score": 7,
            "text": "Abbott and Desantis both need a swift kick in the ass. I honestly can't believe there are this many dimwitted people in both states.  \n\nAs a Floridan, I get what the GOP does.  They go to the redneck towns and tell them the libs are gunna take yer gunz.  Then they go to the retirement communities and tell the oldies \"remember how happy you were when Reagan was president?\" with a straight face. \n\nThe rednecks are born, get married, have kids and die in the same spot.  If they do move, they move to another hicksville town. The oldies remember the 80s favorably not because Reagan was president, but rather because their knees still worked. Both of these groups are out of touch with reality and Republicans exploit the shit out of them.  I'm sure this is the Republican formula for every swing state. Just a bunch of crooks and con-artists.",
            "title_similarity": "0.46260136",
            "sentiment_compound": 0.8793
        },
        {
            "id": "h9eug97",
            "score": 2,
            "text": "Not sure where Republican leadership got the idea that they'll be seen as \"pro-vaccine\" while vehemently fighting against public health measures like masks. \n\nTepidly suggesting folks get a miracle vaccine while pretending masks are \"fascist\" is legit deranged. There's no logic beyond right-wing histrionic horseshit.  They are indistinguishable from anti-vaxxers.",
            "title_similarity": "0.52923554",
            "sentiment_compound": -0.374
        },
        {
            "id": "h9eujn2",
            "score": 1,
            "text": "Now he has to make the impossible choice.  Does he hate public health enough to ban dress codes and risk girls wear spaghetti straps.",
            "title_similarity": "0.52395594",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h9eukk1",
            "score": 1,
            "text": ">A small Texas school district\n\n>The board of the Paris Independent School District, which has about 4,000 students\n\n4000 students is SMALL?",
            "title_similarity": "0.29744267",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eumd7",
            "score": 1,
            "text": "In what platform or promises did Texans vote for this guy?",
            "title_similarity": "0.39737737",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h9eus1g",
            "score": 3,
            "text": "Modern problems require modern solutions",
            "title_similarity": "0.23951481",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9ev6ua",
            "score": 1,
            "text": "Texas is so dumb. Have high cases and still refuse to make mask mandatory. You guys are the reason why we can’t go back to\nNormal.",
            "title_similarity": "0.37332517",
            "sentiment_compound": -0.7304
        },
        {
            "id": "h9evb30",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.044976644"
        },
        {
            "id": "h9evhgu",
            "score": 1,
            "text": "I've been saying for the past couple of weeks that a mask as part of a dress code was an easy workaround.",
            "title_similarity": "0.35604304",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9evj1m",
            "score": 1,
            "text": "In Texas you can literally beat (paddle / spank) kids in public school. Like any school they can micromanage everything like the length of shorts or banning tanktops. But it's illegal to make them wear a mask. Right.",
            "title_similarity": "0.64097536",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h9evzqk",
            "score": 1,
            "text": "It's not gonna be pretty when those parents figure out the magic words that defeat dress code every time: \"It is against my faith to do that.\"  You don't have to define what faith or what you have faith in. You are in no way required to justify your faith. They must either offer an alternative or or allow him that liberty.",
            "title_similarity": "0.50961137",
            "sentiment_compound": 0.8258
        },
        {
            "id": "h9ew3ph",
            "score": 6,
            "text": "\"No masks with spaghetti straps\"",
            "title_similarity": "0.2080267",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ewalj",
            "score": 6,
            "text": "Is it just me, or is it hilarious Texas education Trumped Texas politics through Textual manipulation on Technicalities, there are so many layers of irony in this",
            "title_similarity": "0.51089054",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9ex6p6",
            "score": 2,
            "text": "Modern problems require modern solutions",
            "title_similarity": "0.23951481",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9ex9gi",
            "score": 2,
            "text": "In response Gov Abbott makes education illegal.",
            "title_similarity": "0.4406171",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9exf3w",
            "score": 9,
            "text": "This is hilarious. Maybe if Abbott had followed the dress code, he wouldn't have fallen sick.",
            "title_similarity": "0.5143733",
            "sentiment_compound": 0.7588
        },
        {
            "id": "h9exmt0",
            "score": 3,
            "text": "United States, you alright?",
            "title_similarity": "0.069359176",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h9exs77",
            "score": 1,
            "text": "Lol fuck I forget Texas has school dress codes lol",
            "title_similarity": "0.5898545",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h9exwj0",
            "score": 2,
            "text": "Is this a ‘Life Hack’?\n\nOr a ‘Pro Tip’\n\nThis is hilarious",
            "title_similarity": "0.2001985",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9exyp1",
            "score": 5,
            "text": "Democrats should learn from this. You can’t deal with Republicans by being straightforward,honest and truthful. It’s doesn’t work with them! You have to lie and cheat. You have to fight corruption by being as corrupt as the law allows. Don’t worry about ethics violations because Republicans stop caring about those years ago. Ethics violations are like penalty flags in football that don’t cause a team to lose any yards. It’s meaningless.",
            "title_similarity": "0.49765214",
            "sentiment_compound": -0.9493
        },
        {
            "id": "h9ey52x",
            "score": 3,
            "text": "Would be funny if Republicans now got rid of dresscodes in response",
            "title_similarity": "0.47329962",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9ey70j",
            "score": 2,
            "text": "All jokes aside I have a first grader in Leander ISD which is just North of Austin and I’m incredibly relieved that the board superintendent grew a backbone and mandated masks again starting today.  I’m seeing a lot of parents in the area on social media in an uproar about it, rabble-rousing, threatening to pull their kids out, threatening to send their kids without masks to defy the mandate that defies the order that outlaws the mandate.  Good riddance - quit fucking around.",
            "title_similarity": "0.5361693",
            "sentiment_compound": -0.0018
        },
        {
            "id": "h9eybzn",
            "score": 4,
            "text": "i dont live anywhere near texas let alone the usa and even i don’t like this guy at all",
            "title_similarity": "0.18937288",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9eyeti",
            "score": 8,
            "text": "The thing I don’t understand is… if we require masks for kids in the first place at schools, and several of them can’t yet receive the vaccine. Why are we rushing them back to in person learning? The best way to avoid spreading the disease is to just stay home.",
            "title_similarity": "0.60403633",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9eyy9k",
            "score": 1,
            "text": "Literally every government does all of the things you mentioned...",
            "title_similarity": "0.21597275",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9eyyia",
            "score": 3,
            "text": "Good for them!  It's so nice to see administration *somewhere* doing the right thing and being willing to stand up for the safety of their people.",
            "title_similarity": "0.2646497",
            "sentiment_compound": 0.8627
        },
        {
            "id": "h9eyzns",
            "score": 4,
            "text": "NICE\n\nMake them MAGA masks. \n\n\"Masks Are Good Again\"\n\n/nevermind, they probably have a trademark on that, and people will probably misinterpret.  But just thinking about the governor banning MAGA anything.",
            "title_similarity": "0.6108353",
            "sentiment_compound": 0.4967
        },
        {
            "id": "h9ezpd3",
            "score": 3,
            "text": "That'll teach them! We all know kids follow dress code at school!",
            "title_similarity": "0.62239146",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ezpow",
            "score": 4,
            "text": "Ha. Good on Texas. I NEVER thought I’d say that. \n\n\nKidding Texas is wonderful. Just very long to drive through.",
            "title_similarity": "0.31544465",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h9f0cz4",
            "score": 3,
            "text": "Should say Texas school district is now forced to change dress codes because of one of the stupidest people in America.",
            "title_similarity": "0.6074766",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h9f0etb",
            "score": 1,
            "text": "If schools can control what a girl can/can’t wear they have the authority to require masks to prevent spreading Covid. At least until the greatest danger passes",
            "title_similarity": "0.6932825",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9f0t1x",
            "score": 1,
            "text": "The problem is that he challenged an entire state of public educators. Turns out they’re smart? 🤷🏻‍♂️",
            "title_similarity": "0.3675463",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9f11z9",
            "score": 2,
            "text": "“Personally believe that COVID has a right to self determination & will sign any anti-BDS COVID bill that passes my desk.”",
            "title_similarity": "0.5050146",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9f1xhw",
            "score": 1,
            "text": "Honestly I was wondering if anyone e would twig to this work around. I mean, honestly, the while argument that schools can't tell kids to wear masks is stupid anyway, since schools have had dress codes if not outright uniforms for long enough that no one living can recall a time before. Even public schools have rules regarding what can and cannot and must be worn, despite what some may think.\n\nIf this was really a question of freedom, then where the hell were these people who are protesting masks when schools made the rule that guys couldn't come to school in just a speedo, or girls a bikini?",
            "title_similarity": "0.62206745",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h9f1xv5",
            "score": 130,
            "text": "You talking about Governor Abbot who contracted covid-19 and took a booster shot in addition to his previous two vaccination shots while telling everyone else to not wear a mask, that Abbot?",
            "title_similarity": "0.5992472",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9f2008",
            "score": 2,
            "text": "That's one of the dumbest analogies I've ever heard, especially from someone who's pretending to be smart. A better analogy would be you don't put a seat belt on your child because the odds of being in an accident are super small. See that's how it's done.",
            "title_similarity": "0.4092484",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h9f2bqv",
            "score": 14,
            "text": "Just imagine being a parent and joining a cult that requires the possible sacrifice of your childs life as a test of loyalty, you know like god did to Abraham in the Old Testament.  Yes there are parents who will sacrifice their children for a political or religious belief.  Welcome to the MAGA Republican Death Cult.",
            "title_similarity": "0.6069808",
            "sentiment_compound": 0.836
        },
        {
            "id": "h9f2rfn",
            "score": 2,
            "text": "😂😂😂 cracks me up. Good job Texas ISDs",
            "title_similarity": "0.3086112",
            "sentiment_compound": 0.891
        },
        {
            "id": "h9f2yn6",
            "score": 6,
            "text": "This is a game changer - I hope the school districts in Florida are listening",
            "title_similarity": "0.43037465",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9f2zu5",
            "score": 3,
            "text": "Very clever. Find the loopholes it is what our politicians have taught us best.",
            "title_similarity": "0.4057843",
            "sentiment_compound": 0.8173
        },
        {
            "id": "h9f32d3",
            "score": 3,
            "text": "Abbott will likely issue a statement condemning this action, once he is done being treated for Covid.",
            "title_similarity": "0.508595",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9f32sn",
            "score": 2,
            "text": "Jesus Christ was a sheet show!! Having to do stuff like this because the authorities at the top of your state act like children!",
            "title_similarity": "0.5095219",
            "sentiment_compound": 0.7701
        },
        {
            "id": "h9f3aq3",
            "score": 2,
            "text": "r/maliciouscompliance",
            "title_similarity": "0.15866622",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9f3y2s",
            "score": 6,
            "text": "This asshat shouldn't be trusted to manage a McDonald's, and he runs a state...",
            "title_similarity": "0.35606176",
            "sentiment_compound": -0.3724
        },
        {
            "id": "h9f3yl4",
            "score": 5,
            "text": "Whoever had this idea is a genius. Now the other school districts can do the same. No need for lawsuits.",
            "title_similarity": "0.2880422",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h9f401z",
            "score": 3,
            "text": "Ah yes the most at risk group, young children, need masks",
            "title_similarity": "0.2946589",
            "sentiment_compound": 0.0828
        },
        {
            "id": "h9f4xnh",
            "score": 2,
            "text": "Wonder if Abbott is going to act like the Riddler and gloat about how the district solved his \"riddle\" like he did last year when counties discovered that while they couldn't mandate masks they could fine businesses that didn't follow safety standards.",
            "title_similarity": "0.54555106",
            "sentiment_compound": 0.6776
        },
        {
            "id": "h9f4ybf",
            "score": 1,
            "text": "Florida schools - ya listening?",
            "title_similarity": "0.26639324",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9f54ij",
            "score": 10,
            "text": "As a Texan the fact that any of my fellow citizens think this guy is in any way shape or form fit to govern ANYTHING let alone an entire state is absolutely infuriating.",
            "title_similarity": "0.3624733",
            "sentiment_compound": -0.4927
        },
        {
            "id": "h9f5ku6",
            "score": 1,
            "text": "Yeah, it's revealed the selfishness at a level I really didn't see until now. It's the smallest thing you can do for your community.",
            "title_similarity": "0.229461",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9f5s4v",
            "score": 1,
            "text": "This photo of him makes him look like a wax figure you’d see at one of those museums. If I squint I can almost mistake him for a human being. First time that’s every happened. Weird.",
            "title_similarity": "0.4445867",
            "sentiment_compound": -0.079
        },
        {
            "id": "h9f6ro8",
            "score": 2,
            "text": "Republicans on suicide watch rn",
            "title_similarity": "0.29164073",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h9f6sc9",
            "score": 1,
            "text": "Florida schools, this is how you do it.",
            "title_similarity": "0.30790877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9f6usb",
            "score": 2,
            "text": "On a completely subjective platform it’s beautiful when the citizens stand together and fight against to the governments tyrannical policies.\n\nBecoming United we are no longer under control. \n\nWe dictate the government we want. The government dosnt dictate its citizens",
            "title_similarity": "0.46142882",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9f79nh",
            "score": 3,
            "text": "Hey! A story that flies in the face of the ‘Hur Dur Texas Bad’ Circle jerk going around here lately. \n\nIt’s almost like a state twice the size of lots of COUNTRIES has varied regions, peoples, and political views. \n\nShouldn’t be a surprise there are smart, practical people around who actually do give a shit about others in the state.",
            "title_similarity": "0.37591153",
            "sentiment_compound": 0.077
        },
        {
            "id": "h9faw0y",
            "score": 3,
            "text": "As a parent in Texas I'm just praying for an ice storm so he'll hide out for a few weeks and we can protect our children from a life threatening disease again.",
            "title_similarity": "0.5910683",
            "sentiment_compound": -0.0717
        },
        {
            "id": "h9faycm",
            "score": 5,
            "text": "What the real issue is TX has a Governor who gets medical treatment way beyond a regular Texan. At the same time schools have to work against the TX gov to circumvent his mandates that will kill children.  The terrifying twilight zone.",
            "title_similarity": "0.61532605",
            "sentiment_compound": -0.4468
        },
        {
            "id": "h9fbqbp",
            "score": 2,
            "text": "What will big government do next?",
            "title_similarity": "0.21180768",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fdqdn",
            "score": 4,
            "text": "I’ve been wondering this entire time why masks wouldn’t just be treated like the rest of the dress code. Like, obviously schools can mandate and enforce mask rules, they already enforce rules on shoes and such.",
            "title_similarity": "0.733615",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9fe0t8",
            "score": 2,
            "text": ">small Texas school district  \n>[...]  \n>4,000 students\n\nEverything really is bigger in Texas.",
            "title_similarity": "0.283884",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ffk3d",
            "score": 3,
            "text": "Big ole Fuck you Noodle Leg Greg!",
            "title_similarity": "0.09378507",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h9ffo9u",
            "score": 13,
            "text": "How long until Texas schools amend the dress code to ban face masks with flirty spaghetti straps.",
            "title_similarity": "0.76303554",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h9fgqzm",
            "score": 5,
            "text": "It'd be funny as fuck if republicans now start calling to abolish dress codes..",
            "title_similarity": "0.5049685",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h9fgz7v",
            "score": 1,
            "text": "Bwahahahaha brilliant!",
            "title_similarity": "-0.03712755",
            "sentiment_compound": 0.6239
        },
        {
            "id": "h9fhq45",
            "score": 1,
            "text": "Yes. This is exactly how you do it. Take note.",
            "title_similarity": "0.14799342",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9fht8v",
            "score": 1,
            "text": "Definitely masks work.  Instead of letting dangerous criminals out of jail because of increased risk of COVID in there we should just give them a mask.",
            "title_similarity": "0.544566",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9fhyk2",
            "score": 2,
            "text": "i remember i used to want mask back in school to do hood rat shit lol",
            "title_similarity": "0.6414799",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9fi79e",
            "score": 5,
            "text": "This is the first time I think a school dress code will actually improve the environment",
            "title_similarity": "0.4329183",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9ficoe",
            "score": 4,
            "text": "Modern problems require modern solutions.",
            "title_similarity": "0.24477114",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9ficr6",
            "score": 4,
            "text": "The party of small government is about to come after school dress codes next.",
            "title_similarity": "0.5327307",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9fisod",
            "score": 7,
            "text": "Now THAT'S how to loophole",
            "title_similarity": "0.1786094",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fj1lg",
            "score": 11,
            "text": "Take a second to realize how crazy it is that Republicans have turned a *public health measure* into a wedge political issue for literally no other reason than to get low-information jackasses frothed up.  \n\nWe, as a country, are doomed.",
            "title_similarity": "0.41237125",
            "sentiment_compound": -0.9118
        },
        {
            "id": "h9fj70p",
            "score": 3,
            "text": "Hooray! That's creative!",
            "title_similarity": "-0.028235305",
            "sentiment_compound": 0.7772
        },
        {
            "id": "h9fk39y",
            "score": 3,
            "text": "r/MaliciousCompliance",
            "title_similarity": "0.15866622",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9fl2jt",
            "score": 2,
            "text": "It makes me wonder how many laws were weirdly mandated just because two sides would agree to science or public safety because of dumb reasons.",
            "title_similarity": "0.4933222",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9fl338",
            "score": 3,
            "text": "Based Texas school district.",
            "title_similarity": "0.44640994",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ftg66",
            "score": 10,
            "text": "Clever fuckers. I love it!",
            "title_similarity": "0.004953066",
            "sentiment_compound": 0.5562
        },
        {
            "id": "h9fw9m0",
            "score": 4,
            "text": "Why aren't vaccines available for kids yet?",
            "title_similarity": "0.31573474",
            "sentiment_compound": 0.0
        }
    ]
}