{
    "Danny DeVito Abruptly Loses Twitter Verification After Tweeting Support For Nabisco Strike\n": [
        {
            "id": "h9mgtkr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.27559328"
        },
        {
            "id": "h9lxz5z",
            "score": 30,
            "text": ">It is unclear if DeVito's verified status disappeared because of his tweet. IGN reached out to Twitter for comment, and will update this article if we hear back.\n\n>Twitter verification is at best a finicky process. Recently, Twitter reopened the application process, whereupon the company was immediately inundated with requests for the blue checkmark. Many users across a multitude of industries — including some boasting tens of thousands of followers — have been denied verification.\n\nI’m no fan of Twitter, nor some of thier policies, but can we wait a little bit for all the facts to come in before we get outraged about this?\n\nEdit: [Correlation does not imply causation](https://en.wikipedia.org/wiki/Correlation_does_not_imply_causation)",
            "title_similarity": "0.73589945",
            "sentiment_compound": -0.7454
        },
        {
            "id": "h9m5442",
            "score": 0,
            "text": "Why is this something that IGN is covering? \n\nI might be going crazy but isn't IGN for video game related things? Why are they covering something that has nothing to do with video games?",
            "title_similarity": "0.5592916",
            "sentiment_compound": -0.3049
        },
        {
            "id": "h9mb5j5",
            "score": 33,
            "text": "We really need a decentralized twitter.  Jack Dorsey holds too much power, this is starting to look scary.",
            "title_similarity": "0.51895416",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9mc9ld",
            "score": -13,
            "text": "And conservatives say Twitter and other Social Media platforms have a left wing bias lol",
            "title_similarity": "0.60145205",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9mf8um",
            "score": 29,
            "text": "Those happy about conservatives being kicked off twitter they'll come for you too. BuT iTz a PrIVAtE COmPAnY.",
            "title_similarity": "0.6609304",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h9lw3xh",
            "score": 71,
            "text": "With that blue check you can say whatever dumb garbage you want in support of any amount of rightwing shit but the moment you support a union?  Danny should be glad Jack Dorsey didn't have him executed.",
            "title_similarity": "0.6034205",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h9ne3r3",
            "score": -3,
            "text": "> It is unclear if DeVito's verified status disappeared because of his tweet. IGN reached out to Twitter for comment, and will update this article if we hear back.\n\nThe title is false and misleading. Stop spreading fake news.",
            "title_similarity": "0.75116277",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h9lvy0t",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.3195326"
        },
        {
            "id": "h9mbb1r",
            "score": 0,
            "text": "Couple of questions, why does this matter? Who actually gives a fuck about the little verification mark? Isn't it just a tool used by twitter for their branding purposes?",
            "title_similarity": "0.588825",
            "sentiment_compound": -0.6014
        },
        {
            "id": "h9mi8nu",
            "score": -1,
            "text": "Private company can do anything they want because it is their platform?",
            "title_similarity": "0.22386032",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9lz6t5",
            "score": 27,
            "text": "Just this alone makes me not want to buy Nabisco products again but they make Fig Newton's so this is a hard decision.",
            "title_similarity": "0.62034714",
            "sentiment_compound": -0.2984
        },
        {
            "id": "h9lz29t",
            "score": 117,
            "text": "[deleted]",
            "title_similarity": "0.3195326"
        },
        {
            "id": "h9mftz5",
            "score": -5,
            "text": "so deplatforming has officially become okay in our society. scary stuff",
            "title_similarity": "0.35573518",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9m2ahn",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.3195326"
        },
        {
            "id": "h9n1kju",
            "score": 3,
            "text": "Yeah, I get that Twitter is a private platform, but isn’t it a public square at this point?\n\nDoesnt a corporation that facilitates a public square being able to squelch criticism of any topic concern people?\n\nDo you think DeVito would be better served moving to Gab?  Because any alternative to Twitter is a cesspit and any new alternative will be tagged as such.\n\nJust because a platform is private doesn’t mean it can’t be minimizing speech with rules like this.",
            "title_similarity": "0.55486906",
            "sentiment_compound": 0.6586
        },
        {
            "id": "h9md4c2",
            "score": 11,
            "text": "Freedom of speech doesn't mean freedom from consequences. They're a private company they can do whatever they want. If you don't like it make your own Twitter.",
            "title_similarity": "0.43581742",
            "sentiment_compound": 0.0057
        },
        {
            "id": "h9mccnh",
            "score": 1,
            "text": "Surprise surprise. Twitter probably doesn't want its own workers to get any ideas. Well I hope they all get ideas",
            "title_similarity": "0.67409015",
            "sentiment_compound": 0.7893
        },
        {
            "id": "h9mg9xk",
            "score": -1,
            "text": "Twitter sucks anways.  Can't understand why anyone uses that garbage",
            "title_similarity": "0.6560267",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9ly0re",
            "score": 45,
            "text": "Jfc, the world would be a better place if we ditched all these dumbass 'megaphone as a service' platforms.\n\nYea, reddit too. But at least this has the vaneer of information exchange in the less divisive subs.",
            "title_similarity": "0.55256814",
            "sentiment_compound": -0.09
        },
        {
            "id": "h9mlab3",
            "score": 0,
            "text": "Awwwwwwww now we are supposed to give a shit about big tech censorship? LOL",
            "title_similarity": "0.52615637",
            "sentiment_compound": -0.0173
        },
        {
            "id": "h9ocut8",
            "score": 0,
            "text": "I’m liberal, but this is starting to sound a lot like censorship. Everyone has the right to their opinion",
            "title_similarity": "0.34970197",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h9r1sdu",
            "score": 0,
            "text": "Why is this news? I hate this timeline",
            "title_similarity": "0.517578",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h9mgo0l",
            "score": 9,
            "text": "Twitter bans Trump but let's the taliban post freely.  They are a hostile foreign actor and should be treated as such.",
            "title_similarity": "0.6589917",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h9mi4uy",
            "score": 40,
            "text": "You all LOVED IT when Twitter was after Trump. Now because it's someone you like, suddenly the whole \"they're a private company that can do as it's terms dictates\" isn't rolling so quickly off the tongue is it?",
            "title_similarity": "0.49196017",
            "sentiment_compound": 0.7983
        },
        {
            "id": "h9mx2vw",
            "score": -7,
            "text": "Can someone help me understand why this matters?  Frankly, if people were following him only because of who he is, not what he says or does, then that's a cult like MAGA.  If a fake Danny DeVito says funnier things and does cooler shit, shouldn't people WANT to follow the fake Danny?  Am I missing the point of Twitter entirely?  Is it really just a cult breeding ground?",
            "title_similarity": "0.6473584",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h9nazsa",
            "score": 3,
            "text": "Am I the only one that doesn't think this was malicious? Maybe just an unfortunate coincidence?.. I mean his verification badge is back in less than a day, the article says it doesn't know if things are related, Twitter has made no comment, \"verified\" people have said much more controversial things, Twitter has never taken away verification as a \"punishment\" and would be very weird if they did... The list goes on... my guess was this was just a small mistake by Twitter and it happened to be after DeVito tweeted that\n\nEdit: Like /u/datnetcoder said, and the article now says, his profile was incomplete and that's why it was removed.",
            "title_similarity": "0.7409554",
            "sentiment_compound": -0.8944
        },
        {
            "id": "h9m09bl",
            "score": -25,
            "text": "Anyone thinking it's related is a dumb fuck lmao",
            "title_similarity": "0.49926758",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h9m8yw3",
            "score": 24,
            "text": "This is why de-platforming is a bad idea. Don't tow the line, lose your voice.",
            "title_similarity": "0.5911727",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h9mlesh",
            "score": -1,
            "text": "Reddit is always stupid but this is extra stupid. There is a zero percent chance the two things are related.",
            "title_similarity": "0.5294969",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9mtgon",
            "score": -1,
            "text": "Of all the shut going on in this world, THIS is my front page news? God reddit is turning into the tabloids.",
            "title_similarity": "0.6193179",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9ne2xd",
            "score": 1,
            "text": "Who actually fucking cares",
            "title_similarity": "0.26769277",
            "sentiment_compound": 0.5095
        },
        {
            "id": "h9nhyi1",
            "score": 1,
            "text": "Blue checkmark on Twitter is a joke. You thought blue check on Twitter means you're verified to be the genuine article? No. It means you follow the Twitter Hive mind.",
            "title_similarity": "0.5683464",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9ns1lq",
            "score": -1,
            "text": "Who gives a flying fuck about Danny Devitos Twitter verification?",
            "title_similarity": "0.66350794",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9nt45n",
            "score": 1,
            "text": "Okay? It's a little blue checkmark. Reason for why he lost it doesn't matter. It's not news worthy. Why does that require a new story? Like, who really gives a fuck at all? I don't understand why everyone is so weirdly obsessed with celebs and their lives.",
            "title_similarity": "0.6165135",
            "sentiment_compound": -0.86
        },
        {
            "id": "h9ob304",
            "score": -1,
            "text": "Much more likely that it was an accident; he already has his verification back. If you’re wondering what left wing conspiracy theories look like - this is it.\n\nEdit: \n\nhttps://twitter.com/IGN/status/1428737848128245762?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet",
            "title_similarity": "0.61864877",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h9mhykt",
            "score": 12,
            "text": "[deleted]",
            "title_similarity": "0.3195326"
        },
        {
            "id": "h9n2s45",
            "score": -9,
            "text": "Democrats are about the working class and I thought the twitter blue check was a democrat aligned thing. I guess the blue check is reduced to shit talking about the right and identity politics, and simping for big business. Better working conditions please.",
            "title_similarity": "0.49571922",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9n1g20",
            "score": -7,
            "text": "Twitter is responsible for trump and the excess death he caused, if they hadn't given him infrastructure and special rules, he would not have been elected. \n\nTwitter is hostile to many good things, needed for life and safety.",
            "title_similarity": "0.6307248",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9m7w4v",
            "score": 5,
            "text": "This is very strange.  I wonder if that was a coincidence or what.  I don't understand why Twitter would defend Nabisco and only Nabisco.  There are plenty of leftwing and outright communist statements on Twitter, and they don't get unverified or modded in anyway.\n\nI hope Twitter puts out an explanation soon.",
            "title_similarity": "0.6708988",
            "sentiment_compound": 0.204
        },
        {
            "id": "h9m8ch2",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.27559328"
        },
        {
            "id": "h9mbc26",
            "score": 1,
            "text": "Gotta love America. one of the only 1st world countries happily screwing over the little guys every chance they get. \n\n\\#freedanny",
            "title_similarity": "0.37671134",
            "sentiment_compound": 0.8242
        },
        {
            "id": "h9mbvtc",
            "score": -2,
            "text": "I can’t be the only one who had a fucking panic attack",
            "title_similarity": "0.4119504",
            "sentiment_compound": -0.7889
        },
        {
            "id": "h9me40h",
            "score": 2,
            "text": "What a fucking joke Twitter is. These workers are a few minutes from my house. They were standing outside in 100° heat for all last week. Fuck Twitter.",
            "title_similarity": "0.6532917",
            "sentiment_compound": -0.2516
        },
        {
            "id": "h9mfwie",
            "score": -3,
            "text": "These verification things on social media are the stupidest shit anyway. When neo nazis can get special checkmarks, no one should feel bad if they lose one.",
            "title_similarity": "0.5784031",
            "sentiment_compound": -0.9136
        },
        {
            "id": "h9mg5ey",
            "score": 3,
            "text": "Fuck Nabisco even more now.",
            "title_similarity": "0.5125104",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9mkmq8",
            "score": 1,
            "text": "Cancel culture at its finest, folks.   Fuck this muzzling of speech and expression.",
            "title_similarity": "0.5713148",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h9ntwax",
            "score": 1,
            "text": "So the Taliban terrorists get to have Twitter but our president and celebrities don't? Fuck Twitter and fuck the taliban-supporting CEO Jack Dorsey.",
            "title_similarity": "0.7368623",
            "sentiment_compound": -0.5657
        },
        {
            "id": "h9mde79",
            "score": 17,
            "text": "How about we do a Twitter that isn't run by our corporate overlords?\n\nRemember when we thought the internet was this untouchable bastion of free speech?\n\nThanks Ajit.  You cunt.",
            "title_similarity": "0.6647972",
            "sentiment_compound": 0.5204
        },
        {
            "id": "h9m28gd",
            "score": 13,
            "text": "Twitter is a toxic cesspool.",
            "title_similarity": "0.5373484",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mu0sr",
            "score": 6,
            "text": "**Yuk yuk yuk, so funny, hahaha.**  \n\nBig tech censoring and manipulating free speech is nothing to laugh about.",
            "title_similarity": "0.5422603",
            "sentiment_compound": 0.7576
        },
        {
            "id": "h9mnglo",
            "score": 3,
            "text": "I remember when Milo Yiannopoulos lost his check mark for saying whatever insane shit he said that week. They basically use checkmarks as a political tool. It's disgusting. I still can't believe they removed the Hunter Biden story. Talk about interfering with an election.",
            "title_similarity": "0.7934307",
            "sentiment_compound": -0.9001
        },
        {
            "id": "h9m4yy1",
            "score": 0,
            "text": "That's a shame Twitter was perfect for him.",
            "title_similarity": "0.39586055",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9mbtia",
            "score": 0,
            "text": "Who didn’t see this coming?",
            "title_similarity": "0.3141207",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mg80w",
            "score": 4,
            "text": "Good way to spread awareness on the topic, I had no idea about the strike until now.\n\nWay to Streisand Effect yourself, Twitter.",
            "title_similarity": "0.6653428",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h9mi9py",
            "score": 0,
            "text": "verified on twitter being a thing is a sure sign the end times are nigh !\n\nverified ?? a solution in need of a problem.",
            "title_similarity": "0.48960292",
            "sentiment_compound": 0.372
        },
        {
            "id": "h9mihi0",
            "score": 0,
            "text": "Who gives a fuck about twitter verification? It doesn't alter who you are, it doesn't alter your opinion on things, sounds to me like twitter is trying to push their agenda, which is completely stupid.",
            "title_similarity": "0.6093112",
            "sentiment_compound": -0.6901
        },
        {
            "id": "h9mijam",
            "score": 0,
            "text": "The article actually says they don’t know why he lost his verification. Could have been an error on their end. No one knows, but the title of the article makes it seem like someone does.",
            "title_similarity": "0.6220237",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h9mjhfz",
            "score": 0,
            "text": "Probably tweeted that suicide is badass or something",
            "title_similarity": "0.56468713",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9mjlsp",
            "score": 0,
            "text": "I'm not going to deny the possibility, but it's incredibly unlikely DeVito lost his check for speaking out against Nabisco.\n\nVerified people on people regularly speak about social movements without losing verification.\n\nHell, I've seen a bunch of verified accounts, including Bernie Sanders, talk about this specifically today. If Twitter were dropping checks because people were speaking about it, many more people than DeVito would've been caught up in it.\n\nDon't manufacture shit to be angry about, there's plenty of dumb shit happening worth being angry about that's actually happening. This is a waste of energy.\n\nFor a bunch of people who talk regular shit about \"the media\" preying on outrage culture for clicks, Reddit certainly falls for it immediately without even an ounce of skepticism.\n\nI'm saying this all as someone who agrees wholeheartedly with DeVito's take.",
            "title_similarity": "0.6866069",
            "sentiment_compound": -0.9563
        },
        {
            "id": "h9mp0v4",
            "score": 0,
            "text": "Wait, you mean supporting megacorporations censoring people we don't like can come back to bite us in the ass?",
            "title_similarity": "0.6189865",
            "sentiment_compound": -0.4039
        },
        {
            "id": "h9mtjx8",
            "score": 0,
            "text": "Rly? This is what we come to? A blue fucking check mark?",
            "title_similarity": "0.22823408",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mx6il",
            "score": 0,
            "text": "I mean he still has it idk why they’re reporting this",
            "title_similarity": "0.29160184",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9mzdbr",
            "score": 0,
            "text": "EVERYONE who is a real person should be verified on Twitter. As of right now, if you're not verified, you may as well not even exist there. Two people could have the exact same comment, but the only one that gets any attention is a verified one...even if that verified person is a complete unknown. Just having that check-mark makes people go \"well, they must be important...they have the check mark.\" That's just a general complaint and doesn't really matter really. It's just irksome.\n\n***BUT***...If you're a real person that can be verified that you're a real person...then you should be verified. I think this would cut down on the number of bots. I'm sure they would find a loophole/exploit as spam and bots always do, but I think it would be a step in the right direction. Right now though, with Twitter it's just some elite status symbol. If you're not verified, you're shit.",
            "title_similarity": "0.62179124",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h9n17zj",
            "score": 0,
            "text": "Imagine making this a news article… so a celebrity isn’t notified on Twitter big deal. I’m genuinely curious as to why people cover stuff like this",
            "title_similarity": "0.6743579",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h9n1ga1",
            "score": 3,
            "text": "I hope this really drives home the point to everyone that the ONLY thing that big government cares about (both parties) is keeping worker's rights and pay in the toilet! Everything they say they care about is a carefully constructed smokescreen so we don't talk about this one thing...Both parties have to raise a minumin of 3-5 million a day to keep afloat and the only way they do this is taking the big checks from the biggest conglomerates who employ the most people and have the most to lose from worker's pay and benefits going up. \n\nThrough their many tendrils they reached out to/through Twitter and hit ol Danny DeVito in the guy for DARING to speak for worker's rights...my friends we are being bamboozeled...we pay ALL the taxes while corps and billionaires pay zero...they keep us fighting with guns, religion, immigration etc while they care nothing about these things....WE NEED A WORKERS RIGHTS PARTY WITH BOTH SIDES COMING TOGETHER and that's the only way this crime against humanity stops!!!",
            "title_similarity": "0.5522857",
            "sentiment_compound": 0.9603
        },
        {
            "id": "h9n7du6",
            "score": 0,
            "text": "Correlation ≠ causation",
            "title_similarity": "0.049738683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n99of",
            "score": 0,
            "text": "Great advertising. Thanks Danny and Twitter. I had never heard of Nabisco before.",
            "title_similarity": "0.55886376",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h9n9him",
            "score": 0,
            "text": "Why would Twitter take away his checkmark only to reinstate it hours later? Probably a mistake or a rogue employee.",
            "title_similarity": "0.77255255",
            "sentiment_compound": -0.34
        },
        {
            "id": "h9nhf9b",
            "score": 0,
            "text": "Can y'all just leave Twitter already? I literally never used it and I'm doing just fine. I suspect you could survive without it as well",
            "title_similarity": "0.57621974",
            "sentiment_compound": -0.343
        },
        {
            "id": "h9noxnw",
            "score": 0,
            "text": "Oh no, what's he gonna do now without a verified mark? 🤷‍♀️",
            "title_similarity": "0.5433502",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9noyhi",
            "score": 0,
            "text": "You damn right this is going to be an IASIP episode.",
            "title_similarity": "0.2494883",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9ns6c6",
            "score": 0,
            "text": "That’s it, boycott Twitter.",
            "title_similarity": "0.6111511",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9nsmbl",
            "score": 0,
            "text": "Tell me again why these companies have Section 230 protection still?",
            "title_similarity": "0.37674886",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nv5x5",
            "score": 0,
            "text": "Remember when Hostess Workers did a strike?  Shortly later we lost twinkies for like a year.",
            "title_similarity": "0.65526474",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h9o01v7",
            "score": 0,
            "text": "Wait, so people think this wasn't a random mistake, but was because of a benign tweet supporting a strike?\n\nDo you think Oreo's owns Twitter?",
            "title_similarity": "0.632244",
            "sentiment_compound": 0.7862
        },
        {
            "id": "h9o0prl",
            "score": 0,
            "text": "hahaha wrong-think is punished!! blue check marks are furious!! what a joke, you tyrannical asshats better know ur days are numbered",
            "title_similarity": "0.5370251",
            "sentiment_compound": 0.4885
        },
        {
            "id": "h9o821d",
            "score": 0,
            "text": "Let this be a lesson: Don't fuck with Nabisco.",
            "title_similarity": "0.5143013",
            "sentiment_compound": 0.431
        },
        {
            "id": "h9obfxn",
            "score": 0,
            "text": "Idk what Nabisco is so i automatically assumed strike to be air-strike. Man was I ever confused",
            "title_similarity": "0.627529",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9qpzux",
            "score": 0,
            "text": "Someone was fired for speaking about this. It's not a joke",
            "title_similarity": "0.50846845",
            "sentiment_compound": -0.6692
        },
        {
            "id": "h9ma7rc",
            "score": 13,
            "text": "Twitter obviously never heard of the Streisand effect",
            "title_similarity": "0.64177215",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n2eok",
            "score": -10,
            "text": "Gotta love Hollywood millionaires pushing socialism/communism on the rest of us.",
            "title_similarity": "0.41195363",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9m6mpi",
            "score": 6,
            "text": "Jack Dorsey retire bitch",
            "title_similarity": "0.5403335",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9mdlrq",
            "score": 7,
            "text": "So anyway, he started blasting.",
            "title_similarity": "0.28070045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mi0ki",
            "score": 6,
            "text": "ITT: People who don't know the actual reason Danny DeVito was unverified.\n\nThe notion that Twitter would do this over support for the nabisco strike would be very, very odd given their repeated statements that politics cannot be a reason for verification.  There's a ton of ways to temporarily lose verification like an account details change.  Not saying it's completely impossible that it was over the strike, it would just be a total and bizarre 180 on Twitter's part if that was the case.",
            "title_similarity": "0.76538074",
            "sentiment_compound": -0.6059
        },
        {
            "id": "h9mlzut",
            "score": 5,
            "text": "But the taliban can have twitter,\nTwitter tell us how you really feel about workers rights",
            "title_similarity": "0.56720614",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lxscz",
            "score": 73,
            "text": "Also Twitter: \"we diddle kids\"",
            "title_similarity": "0.4201269",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m63l8",
            "score": 97,
            "text": "Oh no…. Not Twitter verification. What’s next… only fans takes down his dick pics??",
            "title_similarity": "0.74570066",
            "sentiment_compound": -0.5661
        },
        {
            "id": "h9m8u0u",
            "score": 1,
            "text": "Streisand Effect in full force",
            "title_similarity": "0.12898824",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mabso",
            "score": 1,
            "text": "Lol twitter, the way of the donkey she'll go",
            "title_similarity": "0.2639438",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9mctno",
            "score": 1,
            "text": "So, I’m going to take an objective and technology-centric view view of the situation, simply because that’s kinda my job:\n\nThis likely means they have some ML pointed at verified accounts that will automatically throw up some flags if it detects messages that are substantially out of line with historical tweets that have come from the same user, in an algorithmic natural language processing sense. If DeVito hasn’t historically posted about this sort of thing, a watchdog like that would absolutely catch it and alert on it.",
            "title_similarity": "0.5050719",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h9mctz7",
            "score": -1,
            "text": "They Silence and he won’t who doesn’t agree with them they control who sees What that’s why they took away his blue checkmark so not as many people see it and look into it and gain support for large corporations together and come to screwing over their workers reddit isn’t any better it’s not worse but it’s probably on the same level every penny Nick isn’t the status quo is done boarded all hell no one sees it",
            "title_similarity": "0.71404016",
            "sentiment_compound": -0.6277
        },
        {
            "id": "h9md83n",
            "score": 1,
            "text": "IS the strike over wages? Im sure we could all ...chip in to assist?",
            "title_similarity": "0.51560724",
            "sentiment_compound": 0.2869
        },
        {
            "id": "h9mekug",
            "score": 1,
            "text": "He is gold. Fucking love this man",
            "title_similarity": "0.123413175",
            "sentiment_compound": 0.6697
        },
        {
            "id": "h9mfapf",
            "score": 1,
            "text": "It's a non-stop disco",
            "title_similarity": "0.24770887",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mfe5c",
            "score": 1,
            "text": "So anyway, I stopped snacking",
            "title_similarity": "0.41730547",
            "sentiment_compound": -0.2878
        },
        {
            "id": "h9mgqq5",
            "score": -1,
            "text": "If anything is considered a First World Problem, it has to be this.",
            "title_similarity": "0.21901685",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9mgryr",
            "score": 1,
            "text": "Support labor or big companies will erase you. Got it.",
            "title_similarity": "0.6152242",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9mhro6",
            "score": 1,
            "text": "I kept saying to people that we shouldn't let large tech giants control the course of public discourse, but usually its people that suck.\n\n\nWe'll be seeing more of this, as well as them twisting the definition of who sucks.",
            "title_similarity": "0.5899739",
            "sentiment_compound": -0.6652
        },
        {
            "id": "h9mjgpn",
            "score": -1,
            "text": "He eats cat food and huffs glue.",
            "title_similarity": "0.22470704",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mjqtd",
            "score": 1,
            "text": "Can someone tell me why this matters?",
            "title_similarity": "0.1955042",
            "sentiment_compound": 0.0323
        },
        {
            "id": "h9mlbmh",
            "score": 1,
            "text": "Y’all are up in arms over what is likely an AI mistake.  Twitter doesn’t care what he says.  He already got it back.",
            "title_similarity": "0.6370551",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h9mltvj",
            "score": 1,
            "text": "This was the exact thing people warned about when Milo Yiannopolous lost his verification. You might think he's a piece of shit and should be banned, but the point of the verification was to prove ones identity to avoid fake profiles. He is still Milo even if he's a piece of shit. But when people act like a twitter verification is an endorsement from twitter, well then they're going to act like it is.",
            "title_similarity": "0.73659956",
            "sentiment_compound": -0.7391
        },
        {
            "id": "h9mmg3c",
            "score": 1,
            "text": "Whole lotta chumps fall for anti-union propaganda, but Danny stands tall.",
            "title_similarity": "0.54870135",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9mmnia",
            "score": -1,
            "text": "FFS a blue checkmark next to his name disappeared for a few hours, if anyone seriously thinks that it happened because Twitter willingly took action over that particular tweet (as if there's even anything unusually provocative about it in the first place) by removing a celebrities verification over it obviously knowing that would just draw more attention to it then honestly I'm just embarrassed for you.",
            "title_similarity": "0.7254101",
            "sentiment_compound": -0.7672
        },
        {
            "id": "h9mqfj4",
            "score": -1,
            "text": "Good this shit is so fucking stupid. Fuck the internet, and fuck Twitter. Who cares",
            "title_similarity": "0.61270213",
            "sentiment_compound": -0.881
        },
        {
            "id": "h9msg0a",
            "score": 1,
            "text": "Can you slowly lose your Twitter verification? Like you can only helplessly watch it slowly fade away like Marty McFly's arm while he's playing guitar.",
            "title_similarity": "0.6915972",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h9mttcw",
            "score": 1,
            "text": "You never fuck around with Nabisco, never ever.\n\nMy father once complained to them via mail. Now he is eating dirt and worms...Ice cream....In his grave.\n\nJust be thankful he didn't diss Peak Freans.",
            "title_similarity": "0.6683363",
            "sentiment_compound": -0.0387
        },
        {
            "id": "h9n1f3y",
            "score": 1,
            "text": "Twitter is free to ban who they want. \n\nBanning Danny Devito is not how you gain or even think about gaining my support. \n\nI believe in Danny Devito more than America. \n\nNot even sure where some shitty social media platform comes into it. I still don’t think his “FiRsT aMeNdMeNt RiGhTs” are infringed. \n\nHe opposed their anti-delicious snack treat bi-laws. It’s unfortunate. We should all discontinue our use of Twitter in support of Danny Devito. \n\nI already don’t use it. It’s weird how this open market shit works.",
            "title_similarity": "0.7212801",
            "sentiment_compound": -0.6945
        },
        {
            "id": "h9n4mxe",
            "score": 1,
            "text": "Twitter has done this multiple times, verification isn’t about verification anymore the blue check is now a stamp of approval.",
            "title_similarity": "0.44583967",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h9n8zgl",
            "score": 1,
            "text": "I mean it’s been known for a while that Twitter withholds ‘verification blue checks’ based on if they like what you say, as if suddenly you aren’t you based on the opinion you hold.\n\nThis is just people realising it doesn’t only affect weirdos.",
            "title_similarity": "0.61206317",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h9ncdmx",
            "score": 1,
            "text": "Remember when the news was about Pearl Harbor and the twin towers?",
            "title_similarity": "0.39210495",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ncog2",
            "score": 1,
            "text": "Why does anyone still use Twitter?  It's just shills shilling to other shills.",
            "title_similarity": "0.52155554",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nddjd",
            "score": 1,
            "text": "how is this fucking news?",
            "title_similarity": "0.31248865",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ndjah",
            "score": 1,
            "text": "Oh no! You took his check mark, whatever will the already legendary entertainer do? 🙄",
            "title_similarity": "0.5924436",
            "sentiment_compound": 0.4389
        },
        {
            "id": "h9ndlln",
            "score": -1,
            "text": ">It is unclear if DeVito's verified status disappeared because of his tweet.\n\nI don't get the controversy, how do we know this was retaliatory?\n\nI also don't understand the harm.",
            "title_similarity": "0.6163174",
            "sentiment_compound": -0.0129
        },
        {
            "id": "h9nfuir",
            "score": 1,
            "text": "So, you have chosen death",
            "title_similarity": "0.30394638",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h9nkt19",
            "score": -1,
            "text": "Check the back of your Oreos folks. The ones made in Mexico taste like shit. On the east coast I've noticed all of the 6 packs of oreos and oreo mini's are made in Mexico. You can still find some of the originals made in Jersey but now that the plants shut down I imagine we'll be getting those from Mexico too. Trump was right.",
            "title_similarity": "0.5308056",
            "sentiment_compound": -0.1406
        },
        {
            "id": "h9nljks",
            "score": -1,
            "text": "I am getting so damn sick of companies like this destroying freedom of speech.",
            "title_similarity": "0.6021527",
            "sentiment_compound": -0.6828
        },
        {
            "id": "h9np4ep",
            "score": 1,
            "text": "You think he gives a fuck?",
            "title_similarity": "0.323478",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9npzoo",
            "score": 1,
            "text": "Reddit in 2021: they're a private company, they can what they want, it isn't censorship if it's not the government!\n\nReddit, when twitter does whatever it wants: Hey, they can't do that!",
            "title_similarity": "0.5696465",
            "sentiment_compound": 0.2225
        },
        {
            "id": "h9nrefs",
            "score": 1,
            "text": "This is “increased murder rates due to ice cream sales!” levels of bad correlation. What a fucking atrocious article; and what a gullible set of people here who think upvoting this is helping spread awareness of some grand conspiracy.\n\nIf you’re wondering how you become the people you hate, this is exactly how it starts.",
            "title_similarity": "0.58474666",
            "sentiment_compound": -0.9312
        },
        {
            "id": "h9nvlhr",
            "score": 1,
            "text": "Twitter is a hop away from achieving myspace status.",
            "title_similarity": "0.650789",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9objby",
            "score": 1,
            "text": "Its a nonstop disco, bet you its Nabisco, bet you didn’t know. Ooh ooooh.",
            "title_similarity": "0.45662105",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ocsth",
            "score": -1,
            "text": "Even the article quoted explains that De Vitos required info was out of date, he corrected it, and was restored. This is just a bullshit post to trigger people. \n\nI want to find real bad actors, not this bullshit. Left can believe bullshit as well as right. Helter skelter, the Oligarchs need helter skelter.",
            "title_similarity": "0.6261597",
            "sentiment_compound": -0.5733
        },
        {
            "id": "h9qjerr",
            "score": 1,
            "text": "So…did it occur to anyone that these are not related?",
            "title_similarity": "0.3700239",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9t6veq",
            "score": 1,
            "text": "Probably best posted to /r/unpopularopionion, but here goes... I don't  get why so many people jump to the conclusion that the one event is inevitably, positively, without doubt, without patience, and without further research, related to the other.\n\nThe article title is 100% true, and also 100% misleading, and thus 100% irresponsible.  Twitter's official response is that the profile was incomplete.  Without other information to prove otherwise, any statement saying otherwise is presumptive, assumptive, and says more about the speaker than the subject of the speech.\n\n\"Danny DeVito Abruptly Loses Twitter Verification After Having Coffee With His Breakfast\" could just as easily be the headline.   Just because both are true does not mean they are related to each other.\n\nThe separation of causation from correlation appears to be a lost art these days...\n\nLooking forward to the downvotes...",
            "title_similarity": "0.62267387",
            "sentiment_compound": 0.7944
        },
        {
            "id": "h9xp5kl",
            "score": 1,
            "text": "“Man right wingers are fucking insane with their conspiracy theories also this one celebrity tweeted at this one union protest and got deverified so it must be the corporations.”\n\nSome of you people need to double dose on your meds lol.",
            "title_similarity": "0.70989203",
            "sentiment_compound": -0.6801
        },
        {
            "id": "h9mdmqo",
            "score": 6,
            "text": "Twitter was a bad idea in general.",
            "title_similarity": "0.48463959",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9mkfpg",
            "score": 7,
            "text": "Wow, seriously?  For that, but not for all the shit Trump was dumping on it over 4 years?",
            "title_similarity": "0.5422884",
            "sentiment_compound": 0.7149
        },
        {
            "id": "h9n1hnm",
            "score": 7,
            "text": "I hope this sheds a light on how often this occurs. Left wing or right ideas and thoughts are shaped and culled by media outlets. \n\nThis includes Reddit, Facebook, Twitter.\n\nIf your opinion opposes dollar signs it will be shut down.\n\nRight or wrong this is the way of thing now.",
            "title_similarity": "0.66061246",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9lxzch",
            "score": 62,
            "text": "I will now read the following prepared statement: \"Fuck you, crackers!\"  That is all.",
            "title_similarity": "0.54643905",
            "sentiment_compound": -0.4389
        },
        {
            "id": "h9ly1qo",
            "score": 190,
            "text": "Fuck Twitter. It's yesterday's news.",
            "title_similarity": "0.6035832",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9mepsk",
            "score": -2,
            "text": "So conservatives can finally STFU about them acting like they're the only ones censored?",
            "title_similarity": "0.5570383",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h9mftvo",
            "score": 2,
            "text": "Twitter has become **a complete joke** of Social Media now--\n\n&#x200B;\n\nReddit is working hard though",
            "title_similarity": "0.60227084",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h9mllj3",
            "score": 2,
            "text": "Uh, he still has the checkmark.",
            "title_similarity": "0.065209314",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mlr9y",
            "score": 2,
            "text": "*Why* do celebrities feel they must insert themselves into every corporate negotiation, let alone political conflicts…??\nStay in your lane!",
            "title_similarity": "0.57769364",
            "sentiment_compound": -0.3923
        },
        {
            "id": "h9mlv3u",
            "score": 2,
            "text": "*checks Twitter*\n\n*sees checkmark*",
            "title_similarity": "0.37277287",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mn7e1",
            "score": 2,
            "text": "Twitter is an absolute fucking joke",
            "title_similarity": "0.5870086",
            "sentiment_compound": 0.3597
        },
        {
            "id": "h9mnfwm",
            "score": 2,
            "text": "Oh no, how will he ever recover from such a devastating blow.",
            "title_similarity": "0.46746927",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9mo2lx",
            "score": 2,
            "text": "So anyway, I started tweeting",
            "title_similarity": "0.27434927",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mokob",
            "score": 2,
            "text": "Is this an elaborate prank going on in the comments section? Like are people on here really so fucking dumb that they think Danny Devito and only Danny Devito lost verification because he tweeted out support for Nabisco workers strike? Meanwhile plenty of other people both verified and unverified have tweeted out support for various strikes and unions and nothing ever happened to them. It makes zero fucking sense. Like how much of a smooth brained knuckle dragging caveman do you have to be to actually think that Twitter did this because of the Nabisco strike.",
            "title_similarity": "0.7835407",
            "sentiment_compound": -0.1573
        },
        {
            "id": "h9mpgg2",
            "score": 2,
            "text": "Just looked at his twitter account and the check mark is back. \nWe did it reddit?",
            "title_similarity": "0.5624541",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mpvuv",
            "score": 2,
            "text": "Do these people not understand how beloved this man is? If he wants to tweet let him fucking tweet. Ever wonder why it's the 1st one of all the other amendments?",
            "title_similarity": "0.54343784",
            "sentiment_compound": -0.47
        },
        {
            "id": "h9mvk3l",
            "score": 2,
            "text": "Just remember this the next time you stick up for \"muh social media platform rights,\" kids.  Corporate interests will not always be your interests.",
            "title_similarity": "0.47680494",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9n00w4",
            "score": 2,
            "text": "There's no evidence whatsoever that it was removed because of that tweet. This is the Unidan Jackdaw shit all over again.",
            "title_similarity": "0.6432198",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h9nc8jm",
            "score": -2,
            "text": "Oh no! What will a person do without a blue check mark that means absolutely dick?",
            "title_similarity": "0.51219946",
            "sentiment_compound": -0.5974
        },
        {
            "id": "h9nenyk",
            "score": 2,
            "text": "Does anyone know how to find his address? I will mail him a [rum ham](https://www.youtube.com/watch?v=9SULSoOYmRs) to assuage his no doubt frayed nerves.\n\nBut in all seriousness, the timing is most circumspect.",
            "title_similarity": "0.631441",
            "sentiment_compound": 0.1568
        },
        {
            "id": "h9nesi4",
            "score": 2,
            "text": "Why would anyone fuck with DDV?",
            "title_similarity": "0.48023754",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9nf8bl",
            "score": 2,
            "text": "i guess nabisco is a twitter  advertiser",
            "title_similarity": "0.5665476",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nt9fg",
            "score": 2,
            "text": "Hello, I am Sanjir from India. I am Nevada at Uinversity of Las Vegas where I am study physics with my friend Manish Jain. We go to night clubs and afterwards surf Internet. We enjoy your website much. Thank you.",
            "title_similarity": "0.40947518",
            "sentiment_compound": 0.836
        },
        {
            "id": "h9nwspv",
            "score": 2,
            "text": "Well who ever did that just helped the cause much more than the tweet did. Never heard of any of this but now I have thanks to whoever removed the verified status.",
            "title_similarity": "0.5422691",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h9ok6no",
            "score": 2,
            "text": "Want to piss off the internet? ‘Cause this is how you piss off the internet.",
            "title_similarity": "0.5450704",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9r0nf1",
            "score": 2,
            "text": "All together now, \n\n#STREISAND EFFECT",
            "title_similarity": "0.1143516",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9xgagn",
            "score": 2,
            "text": "How is this still the top story here wtf who cares?",
            "title_similarity": "0.23955013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m7hvi",
            "score": 10,
            "text": "Fuck twatter. Shit hole company.",
            "title_similarity": "0.4986832",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h9m8wju",
            "score": 111,
            "text": "So Nabisco and Twitter are financially intertwined and they feel threatened by one of the nicest men in Hollywood who is expressing support for workers in the middle of a pandemic? Jeebus.",
            "title_similarity": "0.6146214",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9ma81q",
            "score": 98,
            "text": "This is the stupidest thing for Twitter (and the industrial military snack cabal   /s) to do. I  just think the timing is sus, so fuck Twitter. It just makes it something bigger.\n\nPersonally I would have had no idea about Danny DeVito’s position on Nabisco, hell I didn’t even know there was a strike. Now I (and a lot more people) do. \n\nWorked at a Lay’s manufacturing plant, they Suuuucked.",
            "title_similarity": "0.7311765",
            "sentiment_compound": -0.945
        },
        {
            "id": "h9mc418",
            "score": 3,
            "text": "Twitter is fucking garbage. Social media is a fucking waste",
            "title_similarity": "0.57550216",
            "sentiment_compound": -0.4754
        },
        {
            "id": "h9mdl11",
            "score": 2,
            "text": "Twitter is in the hand of big cracker.",
            "title_similarity": "0.3286544",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9mfvab",
            "score": -3,
            "text": "Who the fuck reads Twitter?",
            "title_similarity": "0.46668315",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9mgb6o",
            "score": 2,
            "text": "Had a mini heart attack. Thought he was gone. 😮‍💨",
            "title_similarity": "0.5862166",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9miyxd",
            "score": 3,
            "text": "Twitter doesn’t give a fuck about nabisco. This is definitely just a coincidence/glitch that got upvoted because Reddit loves danny devito and junping to conclusions",
            "title_similarity": "0.68795574",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9mleoa",
            "score": 4,
            "text": "I mean, Danny is a liberal.\nHe campaigned w Sanders.\n\nNo shit he'd stand for a strike.\n\nGood for him",
            "title_similarity": "0.5661962",
            "sentiment_compound": 0.6513
        },
        {
            "id": "h9n657p",
            "score": 4,
            "text": "Yeeeeeep not surprised.\n\n Meanwhile i get banned from r/worldnews because i posted a comment with a link to a fundraiser for a plane to evacuate afghan women/activists people on a kill list.",
            "title_similarity": "0.7089175",
            "sentiment_compound": -0.8543
        },
        {
            "id": "h9mdkf2",
            "score": 54,
            "text": "Heh, sounds likes there's a real panic! at Nabisco",
            "title_similarity": "0.6248828",
            "sentiment_compound": -0.3382
        },
        {
            "id": "h9m36v8",
            "score": 210,
            "text": "[deleted]",
            "title_similarity": "0.3195326"
        },
        {
            "id": "h9mclc3",
            "score": 13,
            "text": "Imagine letting blue checks control your free speech.",
            "title_similarity": "0.2246951",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h9m0m8l",
            "score": 5,
            "text": "Damn the elves got him!",
            "title_similarity": "0.26437858",
            "sentiment_compound": -0.4574
        },
        {
            "id": "h9mf6wk",
            "score": 4,
            "text": "Twitter should lose Danny Devito verification for this. \n\nNew idea for the internet: every website has to be approved by Danny Devito to be on the internet and if he can change his mind anytime he wants.",
            "title_similarity": "0.695045",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9mgcbv",
            "score": 4,
            "text": "After trump incited physical violence for years with that blue check next to his name",
            "title_similarity": "0.5369413",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9mhgy4",
            "score": 4,
            "text": "Danny didn't lose shit.\n\nTwitter lost a verified Danny Devito.",
            "title_similarity": "0.4964709",
            "sentiment_compound": 0.4371
        },
        {
            "id": "h9mkc9b",
            "score": 4,
            "text": "Uh...he has it back already.",
            "title_similarity": "0.14583927",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mn9um",
            "score": 4,
            "text": "Ah, the left-beware what you wish for...",
            "title_similarity": "0.33890036",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9mx7g7",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.3195326"
        },
        {
            "id": "h9ngydk",
            "score": 5,
            "text": "Man American hatred for unions is insane. No other country on earth covertly hates their own right to fight for fair treatment as much as the US.",
            "title_similarity": "0.5412674",
            "sentiment_compound": -0.9062
        },
        {
            "id": "h9m9v3v",
            "score": 147,
            "text": "Today in Proletariat news: Conditions for Revolution Continue to Improve!",
            "title_similarity": "0.2785117",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h9mrye5",
            "score": 57,
            "text": "[deleted]",
            "title_similarity": "0.3195326"
        },
        {
            "id": "h9ma3nx",
            "score": 17,
            "text": "Until more information comes out that links these together, I'm more inclined to think that this is a case of unfortunate timing (especially considering how slow Twitter is to act on anything). \n\nCelebrities and other verified accounts make tweets that decry companies all the time. Why would Twitter retaliate so pointlessly against a high-profile celebrity to defend another company in this instance? There has to be more to the story here.",
            "title_similarity": "0.70352834",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h9m2f9k",
            "score": 6,
            "text": "I’m just gonna get real weird with it",
            "title_similarity": "0.2909547",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h9ma40l",
            "score": 4,
            "text": "Has anyone offered him an egg in these trying times?",
            "title_similarity": "0.3469978",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mdm6i",
            "score": 5,
            "text": "Throw Twitter in to the trash",
            "title_similarity": "0.59183645",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9me5uk",
            "score": 6,
            "text": "The only possible result of this is people getting mad, and DeVito likely doesn't care that much, so he's not going to stop saying shit. It doesn't really make any sense to pretend these two things are related, because this clearly achieves the opposite of stifling him, and Twitter would know that.",
            "title_similarity": "0.61062306",
            "sentiment_compound": -0.7018
        },
        {
            "id": "h9mpheu",
            "score": 6,
            "text": "Danny DeVito is a goddamn national treasure.",
            "title_similarity": "0.31086528",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h9n55l4",
            "score": 5,
            "text": "So MTG and the Taliban is ok, but supporting workers isn’t?\n\nAt least we know where Twitter’s priorities are and where it’s loyalties lie.",
            "title_similarity": "0.50691354",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h9mfn9e",
            "score": 19,
            "text": "Fucking with Danny DeVito is a quick way to get everyone to hate you.  Might as well go after Keanu and Tom Hanks too.",
            "title_similarity": "0.6483198",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9lyv1w",
            "score": 675,
            "text": "See kids, never do the right thing. Sell out as soon as you can and always look out for numero uno.\n\n Thanks for the life lesson, Twitter.",
            "title_similarity": "0.5331931",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9me7xb",
            "score": 6,
            "text": "What connection does Twitter have with Nabisco?",
            "title_similarity": "0.52332234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mclgf",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.3195326"
        },
        {
            "id": "h9m9jbu",
            "score": 30,
            "text": "Well fuck Nabisco and Twitter",
            "title_similarity": "0.6725043",
            "sentiment_compound": -0.34
        },
        {
            "id": "h9mrpdz",
            "score": 9,
            "text": "To be fair, I'm pretty sure that happens automatically if an account gets reported a lot at once, because if the account got hacked or something they don't want someone with a blue check mark running around taking advantage of people.\n\nAnd ultimately I'd rather Danny Devito have a temporary identity crisis over whether he's irrelevant than say, the Barack Obama account scam a thousand people.\n\nIt sounds like as soon as a human being reviewed the reports they realized it was bullshit.",
            "title_similarity": "0.66434264",
            "sentiment_compound": -0.6395
        },
        {
            "id": "h9miqp5",
            "score": 35,
            "text": "He appears to be verified again.",
            "title_similarity": "0.14966623",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lw6mh",
            "score": 131,
            "text": "Don’t make it too obvious Twitter, as if it weren’t already.",
            "title_similarity": "0.4720646",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m0oru",
            "score": 203,
            "text": "System of a Down said far worse about Nabisco. [Bet you didn't know](https://youtu.be/WWXcpWliHSY)",
            "title_similarity": "0.70477474",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9mtu7u",
            "score": 14,
            "text": "Thanks Twitter wouldn't have heard about this if you hadn't made such a brave move to make it more well known. Barbara Streisand would be proud.",
            "title_similarity": "0.46159804",
            "sentiment_compound": 0.8955
        },
        {
            "id": "h9n3kzp",
            "score": 13,
            "text": "There’s no way this is anything but a strange coincidence. Who the fuck removes Twitter verification as some sort “get back” at a guy who posted NO CONTRACT NO SNACKS? Yeah, I get big corporations are big and evil baddies, but there’s zero logic behind this as an overt response. And yes, I get that these companies are led by those whose logic is that of crocodiles but I can’t even imagine people in a room discussing responses to Danny DeVito’s tweet then deciding to they better get moving cause they got some verification to remove.",
            "title_similarity": "0.7365953",
            "sentiment_compound": -0.8765
        },
        {
            "id": "h9m8vox",
            "score": 470,
            "text": "It'll suddenly reappear after a few days of backlash & they'll claim it was a 'glitch'",
            "title_similarity": "0.6287139",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m46oi",
            "score": 66,
            "text": "Sounds like some always sunny ploy where Frank is trying to out do someone for personal gain like mayb supporting a strike so D can't have snacks",
            "title_similarity": "0.6454133",
            "sentiment_compound": 0.9118
        },
        {
            "id": "h9m5jlj",
            "score": 63,
            "text": "The Gang loses verification",
            "title_similarity": "0.604685",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9m1biy",
            "score": 614,
            "text": "If I had the money I'd buy Twitter just to turn it off.",
            "title_similarity": "0.5894503",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lzwpk",
            "score": 74,
            "text": "\"and this is the day... I lost my identity...\" -Danny DeVito (probably)",
            "title_similarity": "0.6129017",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9mqk2c",
            "score": 131,
            "text": "The Streisand effect is working hard with this one. I would not even be aware of the Nabiaco strike, were it not for this little stunt. It's not mentioned on any major news site or in any of my news feeds. I actually googled it and there is very little beyond local stories. But there are two articles about this Twitter mess.",
            "title_similarity": "0.69799364",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h9lziqm",
            "score": 356,
            "text": "Did he forget to pay the troll toll?",
            "title_similarity": "0.570879",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9m7cxe",
            "score": 1072,
            "text": "Remember kids, Corporations aren't your friends! Even ones that we like using!",
            "title_similarity": "0.5809318",
            "sentiment_compound": -0.1625
        },
        {
            "id": "h9mdggq",
            "score": 73,
            "text": "The funny thing is this if anything gave more attention to the strike. I know I first heard about it a few hours ago thanks to this news.",
            "title_similarity": "0.53478354",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h9m6rca",
            "score": 33,
            "text": "I imagine this to be at the top of the list of things that Danny Devito couldn’t possibly care less about.",
            "title_similarity": "0.30653933",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9m0tdm",
            "score": 3160,
            "text": "Taliban accounts are still up though right?",
            "title_similarity": "0.15669045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lvq1x",
            "score": 2830,
            "text": "Damn it, when they go after Danny DeVito, they've gone too far!",
            "title_similarity": "0.52366966",
            "sentiment_compound": -0.4574
        },
        {
            "id": "h9lxlfz",
            "score": 8543,
            "text": "Now every verified person on Twitter knows what they need to tweet.  If a large percentage of verified users did this, Twitter loses.",
            "title_similarity": "0.6561032",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9lwxjg",
            "score": 6183,
            "text": "So anyway, I started blasting.",
            "title_similarity": "0.22214569",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9lypuf",
            "score": 466,
            "text": "Twitter has verified Donkey Brains",
            "title_similarity": "0.3488685",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m4r3r",
            "score": 5313,
            "text": "Nabisco's history is weird. It used to be owned by R. J. Reynolds (the cigarette company that makes Camel). Then the Altria Group (formerly Philip Morris, a different cigarette company that makes Marlboro) bought Nabisco and combined it with Kraft. After, Kraft separated from Altria with Nabisco. Next, Kraft turned into Mondelez International, but spun off Kraft Foods Group, which later merged with Heinz. \n\nThe important thing here is that Mondelez International owns Nabisco now, if you're looking to do a complete boycott of the company in charge.",
            "title_similarity": "0.6319197",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9lw3pd",
            "score": 8706,
            "text": "The Gang supports the union.",
            "title_similarity": "0.26595595",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9m87pu",
            "score": 9179,
            "text": "I don't get what justifications they used to remove his verified mark.. What rules did he break? Not that Danny would care..",
            "title_similarity": "0.6276218",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9lw60c",
            "score": 19529,
            "text": "I guess this means he might not be Danny DeVito anymore.\n\nEDIT: Four hours later I got around to looking at his twitter account. There’s a blue check mark next to his name now … maybe it was missing four hours ago. There are also disturbing pictures of his trollish right foot. I highly recommend it.",
            "title_similarity": "0.60463005",
            "sentiment_compound": -0.4033
        },
        {
            "id": "h9lyjo5",
            "score": 2,
            "text": "dem Arby's boys wheels up!",
            "title_similarity": "0.25260505",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m1on8",
            "score": 2,
            "text": "Season 16 episode 1, Frank becomes CEO of Nabisco and drives it to the ground.",
            "title_similarity": "0.6081753",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m6x7n",
            "score": 5,
            "text": "🎶 “You can’t scare me I’m sticking with the Union, I’m sticking with the Union, til the day I die”  🎵",
            "title_similarity": "0.44985795",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9m742k",
            "score": 1,
            "text": "Time to verify The Barnacle",
            "title_similarity": "0.27204603",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m8312",
            "score": 1,
            "text": "But you guys, another four seasons!",
            "title_similarity": "0.19748893",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m846l",
            "score": 1,
            "text": "Rhea Pearlman’s feet really weren’t that bad",
            "title_similarity": "0.10501803",
            "sentiment_compound": -0.5809
        },
        {
            "id": "h9m8kk9",
            "score": 2,
            "text": "You have defied [corporation] personhood is revoked",
            "title_similarity": "0.5917132",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m8xx2",
            "score": 2,
            "text": "Verified: The Trashman",
            "title_similarity": "0.37896848",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m9ftd",
            "score": 1,
            "text": "Oh no. How will we know it’s still really him",
            "title_similarity": "0.28921908",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m9pa5",
            "score": 2,
            "text": "Can I offer you all an egg in these trying times?",
            "title_similarity": "0.2772964",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9m9s03",
            "score": 2,
            "text": "He just started blasting.\n\nI love Devito. Slay!",
            "title_similarity": "0.42070755",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h9mak3x",
            "score": 1,
            "text": "The barnacle strikes again.",
            "title_similarity": "0.28789544",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9mavhe",
            "score": 2,
            "text": "We can't have people supporting the Nabisco strike! They need to get back to work! I need my unholy Most Stuffed Oreos that I eat because I hate myself! /s",
            "title_similarity": "0.68103015",
            "sentiment_compound": -0.8167
        },
        {
            "id": "h9mb9da",
            "score": 2,
            "text": "Twitter is already calling this a false flag.",
            "title_similarity": "0.6607015",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mbl0x",
            "score": 1,
            "text": "10:28 a.m. on Tuesday...",
            "title_similarity": "0.30901235",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mboys",
            "score": 1,
            "text": "It’s mostly overshadowed by people squabbling over Trump’s account or some other political stuff, but Twitter does some sketchy ass stuff outside of all that.",
            "title_similarity": "0.5594852",
            "sentiment_compound": -0.6956
        },
        {
            "id": "h9mbp3n",
            "score": 1,
            "text": "maybe he did it intentionally so he can claim his account got hacked",
            "title_similarity": "0.5277732",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9mbq3m",
            "score": 1,
            "text": "They probably figured the real Danny DeVito couldn't possibly defy a snack company",
            "title_similarity": "0.5214516",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mbu9k",
            "score": 1,
            "text": "Is being verified really that big of a deal?",
            "title_similarity": "0.18132871",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mbuvd",
            "score": 2,
            "text": "oh ho, immunity from identification? The Penguin is back, BITCHES!",
            "title_similarity": "0.4812722",
            "sentiment_compound": -0.7118
        },
        {
            "id": "h9mbxfj",
            "score": 1,
            "text": "normalizing censorship by major corporations is hurting us as a species",
            "title_similarity": "0.58027387",
            "sentiment_compound": -0.4522
        },
        {
            "id": "h9mbxq6",
            "score": 1,
            "text": "Wait I'm actually asking for clarification. He sided with the workers then got banned? Is that the header for this?",
            "title_similarity": "0.72268856",
            "sentiment_compound": -0.5204
        },
        {
            "id": "h9mbxxs",
            "score": 2,
            "text": "DENNIS: is doing cocaine every morning your routine?\n\nFRANK: yeah",
            "title_similarity": "0.49440768",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9mc004",
            "score": 1,
            "text": "if he gets his twin brother involved, there coulkd be trouble",
            "title_similarity": "0.49282312",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9mc0oy",
            "score": 1,
            "text": "I had no idea there was a Nabisco strike until now.  Thanks Danny.",
            "title_similarity": "0.6515724",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h9mc3m3",
            "score": 1,
            "text": "Big Cookie is too powerful",
            "title_similarity": "0.17250553",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9mca2q",
            "score": 1,
            "text": "If we need anymore evidence Capital will fight the working class at every turn, here's more. Don't let them divide us, we need to stand together to demand economic justice and prosperity for all. These criminals would rather let the planet burn than let the working class live in dignity and stop climate change. Don't fight for conservative or liberal elites, fight for the working class. SOLIDARITY FOREVER.",
            "title_similarity": "0.5059589",
            "sentiment_compound": -0.0984
        },
        {
            "id": "h9mccp6",
            "score": 1,
            "text": "And the gang just got a story for a future episode!",
            "title_similarity": "0.40007585",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mcfha",
            "score": 1,
            "text": "Barbara Streisand effect incoming",
            "title_similarity": "0.1842745",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mcvnn",
            "score": 1,
            "text": "Twitter is such a joke",
            "title_similarity": "0.52465045",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9mcwy4",
            "score": 1,
            "text": "Fuck it. Ritz crackers were too rich for my blood anyway.",
            "title_similarity": "0.4550894",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9md4h7",
            "score": 1,
            "text": "lucky not to get banned",
            "title_similarity": "0.29192",
            "sentiment_compound": 0.6463
        },
        {
            "id": "h9md86s",
            "score": 1,
            "text": "It's a nonstop disco, bet you it's Nabisco, bet you didn't know woohoo!",
            "title_similarity": "0.50559545",
            "sentiment_compound": -0.4577
        },
        {
            "id": "h9md9rs",
            "score": 1,
            "text": "Honestly, this publicity is the best thing that could happen for Nabisco's workers cause",
            "title_similarity": "0.285887",
            "sentiment_compound": 0.802
        },
        {
            "id": "h9mdabn",
            "score": 1,
            "text": "Does verification matter for anything? Lol",
            "title_similarity": "0.18775918",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9mdbhk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.27559328"
        },
        {
            "id": "h9mdlum",
            "score": 2,
            "text": "I always take my magnum condoms to a strike.",
            "title_similarity": "0.41205525",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9mdp2p",
            "score": 1,
            "text": "So what you're saying is now ANYONE can be Danny Devito now? My time to shine!",
            "title_similarity": "0.41310313",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mdzqr",
            "score": 2,
            "text": "Reddit is going to go ape shit over that. Nobody fuck with a Devito!",
            "title_similarity": "0.6660894",
            "sentiment_compound": -0.8122
        },
        {
            "id": "h9me04l",
            "score": 1,
            "text": "Danny DeVito is based. Standing up for Unions representing hard working folk who just don't want to be run roughshod over (because their corporate overlords are pricks who consider them cattle) is more American than apple pie.",
            "title_similarity": "0.50887215",
            "sentiment_compound": -0.3658
        },
        {
            "id": "h9me0c8",
            "score": 1,
            "text": "I grant him the title of \"Ritz Bitz,\" because he's a cheesy, tiny cracker.",
            "title_similarity": "0.3591246",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9me0el",
            "score": 1,
            "text": "Taking down big corporations is BAAAAAAAD AAAAAAASSSSSS",
            "title_similarity": "0.53546286",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9me0s4",
            "score": 6,
            "text": "[Todd in the Shadows had a pretty correct take on this whole thing, I think.](https://twitter.com/ShadowTodd/status/1428495752339202053)\n\nCoincidences happen, folks.",
            "title_similarity": "0.38491067",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9meamq",
            "score": 2,
            "text": "I like how the article is all about Danny & not much is said about [Nabisco Strike](https://www.today.com/food/workers-all-us-nabisco-bakeries-are-strike-t228753).\n\nI suppose that is because people care more about a tick next to a celebrity's name than about workers & their rights.",
            "title_similarity": "0.5983759",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h9mee79",
            "score": 2,
            "text": "Fuck reddit. I tgought he had died for a split second. Fuck my heart",
            "title_similarity": "0.6688883",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h9mehz5",
            "score": 2,
            "text": "FWIW - Danny also tweeted support to the UAW during their strike.",
            "title_similarity": "0.5393644",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9meo7n",
            "score": 1,
            "text": "I support whatever he supports without question. \n\nFuck Nabisco. Strike harder",
            "title_similarity": "0.45901287",
            "sentiment_compound": 0.7615
        },
        {
            "id": "h9mesbg",
            "score": 1,
            "text": "\"Abruptly\" as opposed to \"gradually?\"",
            "title_similarity": "0.22806594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9metis",
            "score": 2,
            "text": "Nabisco closed 90% of its Chicago plant because they opened the plant in Mexico for a fraction of the cost then the cunt ceo takes a multimillion $ raise",
            "title_similarity": "0.6037078",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9mewi2",
            "score": 3,
            "text": "The fucking thumbnail for this is Danny with a bright light behind him I thought he fucking died and I was not ready",
            "title_similarity": "0.6800518",
            "sentiment_compound": -0.4772
        },
        {
            "id": "h9meywo",
            "score": 3,
            "text": "Big Cookie does it again",
            "title_similarity": "0.17560679",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mezok",
            "score": 2,
            "text": "I didn’t know I could respect him harder than I already did, but here we are.",
            "title_similarity": "0.35057777",
            "sentiment_compound": 0.2617
        },
        {
            "id": "h9mf3n9",
            "score": 1,
            "text": "I saw “Danny Devito…” in a title on the top of r/news and my heart dropped all the way into my basement",
            "title_similarity": "0.6044267",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h9mf77z",
            "score": 1,
            "text": "I thought Always Sunny ended... am I being Mandela'd here?",
            "title_similarity": "0.47829908",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9mf966",
            "score": 1,
            "text": "I bet this is purely a coincidence. Plenty of other people have tweeted pro union stuff and not lose there verification status.",
            "title_similarity": "0.48112258",
            "sentiment_compound": 0.3089
        },
        {
            "id": "h9mfan4",
            "score": 2,
            "text": "This probably is due to his tweet about the strike, but it probably isn’t direct retaliation by Twitter. He most likely got mass reported by bootlickers who rightly figured a bot and/or random person would fall for it.",
            "title_similarity": "0.7253696",
            "sentiment_compound": -0.0644
        },
        {
            "id": "h9mfdgi",
            "score": 1,
            "text": "Remember when they unverified Milo like 5 years ago for having unfavorable opinions of a Sony film?\n\nWell, now the same treatment is coming to Unionists – have fun in the hole you dug yourselves, sycophants.",
            "title_similarity": "0.6696323",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h9mffqc",
            "score": 1,
            "text": "Fuck Twitter. I hope it goes bankrupt soon.",
            "title_similarity": "0.71692723",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h9mffqe",
            "score": 1,
            "text": "Key sentence\n\n> It is unclear if DeVito's verified status disappeared because of his tweet.",
            "title_similarity": "0.6204278",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9mfgm9",
            "score": 2,
            "text": "Twitter is cancer. Close your account.",
            "title_similarity": "0.6943214",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h9mfjev",
            "score": 2,
            "text": "The only prank call I ever did as a kid was when I dialed 1-800-NABISCO. A woman answered and I didn’t know what to do so I just sat there, saying nothing. After a few seconds, she started reciting my phone number, which made me freak out and hang up. Hugely successful prank.",
            "title_similarity": "0.5322912",
            "sentiment_compound": 0.3597
        },
        {
            "id": "h9mfjmz",
            "score": 2,
            "text": "Twitter is a joke, Twitter verification is a joke, social media is a joke. Lemme go view some posts from actual terrorist organizations now",
            "title_similarity": "0.64742446",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h9mfkix",
            "score": 1,
            "text": "Wait. How will I know if it's really him now?",
            "title_similarity": "0.27846962",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mfm0z",
            "score": 3,
            "text": "Deliberate Streisand effect?\n\n\nDo nothing and he gets 20k likes. Remove his blue tick for 2 days and the retweets get 5m likes.",
            "title_similarity": "0.5752022",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h9mfmr6",
            "score": 1,
            "text": "That seems Uber shady",
            "title_similarity": "0.2645349",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mfql5",
            "score": 1,
            "text": "Have fun with the Barbara Streisand effect Twitter x Nabisco",
            "title_similarity": "0.41377407",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h9mfs26",
            "score": 1,
            "text": "I am trying to think of a story that is less important than whether or not an actor has a blue checkmark on the shittiest web site ever invented. I cannot think of one.",
            "title_similarity": "0.5365547",
            "sentiment_compound": -0.5984
        },
        {
            "id": "h9mfsh4",
            "score": 1,
            "text": "So is he still Danny Devito",
            "title_similarity": "0.21105509",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mft2c",
            "score": 2,
            "text": "BEING WOKE ISNT ENOUGH. YOU NEED STAND UP AND FIGHT. All in all, this is a class warfare.",
            "title_similarity": "0.4695406",
            "sentiment_compound": -0.6739
        },
        {
            "id": "h9mftam",
            "score": 1,
            "text": "so if verified is not actually \"this person is who they say they are\", doesn't that open twitter up to all sorts of liability as they are no longer simple a platform but are now curators?",
            "title_similarity": "0.57640696",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9mftib",
            "score": 1,
            "text": "But the Taliban is on there.",
            "title_similarity": "0.25897765",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mfvb1",
            "score": 1,
            "text": "You mean tweeting in support of labour unions is something authoritarian websites don't like? \n\nYa don't say!",
            "title_similarity": "0.6754551",
            "sentiment_compound": 0.222
        },
        {
            "id": "h9mfvnh",
            "score": 1,
            "text": "So every verified Twitter user should tweet the way they want it?",
            "title_similarity": "0.3468312",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9mfyru",
            "score": 1,
            "text": "What is the point of a verification anyway? Why does it matter so much?",
            "title_similarity": "0.2806477",
            "sentiment_compound": 0.1179
        },
        {
            "id": "h9mfzzk",
            "score": 2,
            "text": "This move makes no sense from Twitter like zero. Verification means next to nothing and only brought a ton of attention to the situation. What was there best case scenario here? People forget who Danny devito is?",
            "title_similarity": "0.6901053",
            "sentiment_compound": 0.6072
        },
        {
            "id": "h9mg3jy",
            "score": 1,
            "text": "The TALIBAN are still on TWITTER. Fuck TWITTER.",
            "title_similarity": "0.5384298",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9mg4ns",
            "score": 2,
            "text": "Didn't this same thing happen to the ~~President~~ Vice President of India a few months ago? Sounds like a bug; not something done on purpose.  \n  \nedit: \nI found the article.  \nhttps://www.hindustantimes.com/india-news/twitter-restores-blue-verification-tick-of-vp-naidu-s-personal-account-101622870258839.html\n  \nBut, apparently, his verification was removed because his account was inactive for a while, so it's not exactly the same case here. But, it still sounds like a glitch to me, or someone fat-fingering something... Occam's razor, and all that jazz.",
            "title_similarity": "0.7180662",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h9mg53l",
            "score": 1,
            "text": "How will I know the trollfoot I'm looking at is the real deal????",
            "title_similarity": "0.3792094",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mg6qg",
            "score": 2,
            "text": "Well that's just about the dumbest thing I've heard. Does Nabisco own most of Twitter or something?",
            "title_similarity": "0.61927384",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9mg88m",
            "score": 1,
            "text": "It's a private company der. They can do whatever they want derp de der.",
            "title_similarity": "0.26341146",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9mgbce",
            "score": 1,
            "text": "A Keebler Elf would never not support Nabisco!/s",
            "title_similarity": "0.56543326",
            "sentiment_compound": 0.3011
        },
        {
            "id": "h9mgbkr",
            "score": 1,
            "text": "I'm not saying the people behind Twitter aren't the kind of people who would take money from corporations and all that jazz. \n\n\nBut this is probably just a coincidence and a bug or something.",
            "title_similarity": "0.5128821",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mgc6r",
            "score": 5,
            "text": "Delete twitter and FB.",
            "title_similarity": "0.46606585",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mgcta",
            "score": 1,
            "text": "Ita because Wolf Cola is sending scabs.",
            "title_similarity": "0.48997062",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mgdtx",
            "score": 1,
            "text": "It’s like everyone thinks shutting down peoples expression of opinion one after another is a joke",
            "title_similarity": "0.63056767",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h9mge7g",
            "score": 2,
            "text": "#Word bitch, Streisand effect like a mother fucka!",
            "title_similarity": "0.46214953",
            "sentiment_compound": -0.3802
        },
        {
            "id": "h9mghl2",
            "score": 1,
            "text": "He should change his handle to “theunverifieddannydevito”",
            "title_similarity": "0.4149266",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mgj0s",
            "score": 2,
            "text": "I'm thankful i never got on the Twitter bandwagon.",
            "title_similarity": "0.6575142",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h9mgks5",
            "score": 1,
            "text": "Does this qualify as censorship?",
            "title_similarity": "0.3170544",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mgo6i",
            "score": 1,
            "text": "Danny Devito  =   comedy.",
            "title_similarity": "0.37102664",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9mgqkw",
            "score": 2,
            "text": "I got worried for half a second just seeing his name trending",
            "title_similarity": "0.5063716",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9mgs4t",
            "score": 1,
            "text": "On my deathbed I may realize this is the most useless knowledge still swimming in my head.",
            "title_similarity": "0.5384016",
            "sentiment_compound": -0.4754
        },
        {
            "id": "h9mgsm3",
            "score": 1,
            "text": "So... Why is IGN reporting this? It has absolutely nothing to do with video games...",
            "title_similarity": "0.55753946",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mh2pv",
            "score": 1,
            "text": "My roommate was a frog kid….ya ever see a frog kid!?!?",
            "title_similarity": "0.3190226",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mh4eo",
            "score": 5,
            "text": "Non-stop disco bet you it's Nabisco!",
            "title_similarity": "0.45462257",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mhc2d",
            "score": 2,
            "text": "Danny DeVito is a comrade.",
            "title_similarity": "0.22422294",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mhe64",
            "score": 1,
            "text": "All i can offer him is an egg in these trying times.",
            "title_similarity": "0.34045643",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mhel1",
            "score": 1,
            "text": "Who do these people think they are?",
            "title_similarity": "0.23586062",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mhf2o",
            "score": 2,
            "text": "I'm still seeing him verified, did he got it back already?",
            "title_similarity": "0.2720142",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mhg35",
            "score": 1,
            "text": "What u want from a nazi outfit. Can’t speak your mind anymore.",
            "title_similarity": "0.56124556",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9mhj97",
            "score": 2,
            "text": "twitter can fuck themselve",
            "title_similarity": "0.50784886",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9mhk9f",
            "score": 1,
            "text": "Its safe to assume that Nabisco is now under the umbrella of Frank's Fluids! Wolf Cola and Fight Milk welcome you",
            "title_similarity": "0.45651704",
            "sentiment_compound": 0.5562
        },
        {
            "id": "h9mhlc3",
            "score": 3,
            "text": "I have like 12 bot followers and teeeted in support. You can too.",
            "title_similarity": "0.33573854",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9mhli5",
            "score": 1,
            "text": "Fuck you Twitter!\n\nAll my homies hate Twitter!",
            "title_similarity": "0.66655684",
            "sentiment_compound": -0.8309
        },
        {
            "id": "h9mhpv6",
            "score": 2,
            "text": "Oh no, not a blue checkmark.",
            "title_similarity": "0.2398979",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mhs4n",
            "score": 1,
            "text": "I don't think having your verification removed is a Twitter punishment for supporting unionization, blue checks literally talk about murdering bezos all the time. There are openly revolutionary violent communists who are verified, this was likely an error.",
            "title_similarity": "0.6601441",
            "sentiment_compound": -0.9042
        },
        {
            "id": "h9mhwls",
            "score": 2,
            "text": "Thanks for doing your part Twitter. I hadn’t heard of this strike until you shown a spotlight on it.",
            "title_similarity": "0.6382363",
            "sentiment_compound": 0.3127
        },
        {
            "id": "h9mi0ph",
            "score": 1,
            "text": "Crazy how much power these people hold.",
            "title_similarity": "0.18796977",
            "sentiment_compound": -0.34
        },
        {
            "id": "h9mi5qr",
            "score": 1,
            "text": "I have deleted my Twitter account for good. How dare they disrespect double D.",
            "title_similarity": "0.7870108",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9mib5o",
            "score": 1,
            "text": "I didn’t even know they were on strike",
            "title_similarity": "0.5143248",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9mibje",
            "score": 1,
            "text": "**Maybe single parents eat crackers, we don't know. Frankly, we don't want to know.**",
            "title_similarity": "0.58948165",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h9mibou",
            "score": 2,
            "text": "\"Whoa! Danny would never say something like that. Must have had his account hacked. Take his check mark away. It's obviously not him anymore.\"",
            "title_similarity": "0.7263427",
            "sentiment_compound": -0.6251
        },
        {
            "id": "h9mic71",
            "score": 1,
            "text": "I have feeling he couldn't care less about a blue checkmark.",
            "title_similarity": "0.44078547",
            "sentiment_compound": -0.2796
        },
        {
            "id": "h9mifzh",
            "score": 1,
            "text": "If I were on Twitter I would quit Twitter over this.",
            "title_similarity": "0.6657585",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9miibh",
            "score": 1,
            "text": "What I don't understand is what a Twitter verification has to do with Nabisco employees striking. It seems so... disconnected. An account ban or suspension for violating their TOS, sure.. but a de-verification? It's like a state trooper pulling you over for a seatbelt violation and then taking your umbrella. None of this makes any sense...",
            "title_similarity": "0.79355925",
            "sentiment_compound": -0.6059
        },
        {
            "id": "h9mirgh",
            "score": 1,
            "text": "In other news, Danny DeVito is a fucking legend and the moderators at Twitter are out of touch with reality",
            "title_similarity": "0.7539474",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9miroy",
            "score": 2,
            "text": "It should be obvious by now that the real conflict in this country is the ruling class vs everyone else, and supporting a union is one of the biggest salvos you can launch at them",
            "title_similarity": "0.46537715",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9miv4p",
            "score": 4,
            "text": "Twitter is such a terrible company. No idea why people still use that garbage",
            "title_similarity": "0.6445745",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9mivkd",
            "score": 3,
            "text": "Mother fucker I was not about to see the word \"dead\" after \"Danny DeVito.\" Not today thank God",
            "title_similarity": "0.58856857",
            "sentiment_compound": -0.9104
        },
        {
            "id": "h9mizvq",
            "score": 5,
            "text": "Good job with the Streisand Effect! I never would have known about Nabisco had Twitter not tried to screw DeVito.",
            "title_similarity": "0.6503878",
            "sentiment_compound": 0.5405
        },
        {
            "id": "h9mj064",
            "score": 1,
            "text": "So he's no longer confirmed to be Danny Devito? What does Twitter think their verified checkmark means? Fucking idiots.",
            "title_similarity": "0.7479192",
            "sentiment_compound": -0.4288
        },
        {
            "id": "h9mj09j",
            "score": 1,
            "text": "Ironic. Seems eerily family to a certain country",
            "title_similarity": "0.25792456",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9mj2uf",
            "score": 3,
            "text": " But, why. Is he not verified Danny devito? Is he someone else? Why does this matter? I can't imagine a less effective but exceedingly stupid and petty punishment.",
            "title_similarity": "0.5676054",
            "sentiment_compound": -0.829
        },
        {
            "id": "h9mj6wb",
            "score": 1,
            "text": "The 'Bisco boys back at it.",
            "title_similarity": "0.33528596",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mj7mb",
            "score": 5,
            "text": "They added it back for anyone wondering",
            "title_similarity": "0.32075393",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mjcr2",
            "score": 1,
            "text": "This is like a headline written by an AI.",
            "title_similarity": "0.27386034",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9mjebr",
            "score": 1,
            "text": "My heart!!!!\n\nCan we put the predicate before the subject when dealing with national treasures!!",
            "title_similarity": "0.23811795",
            "sentiment_compound": 0.8469
        },
        {
            "id": "h9mjp1z",
            "score": 1,
            "text": "Twitterr is be like a fugging poo that is a fact",
            "title_similarity": "0.45223188",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9mjpnx",
            "score": 2,
            "text": "Cue the Barbra Streisand effect in 3… 2… 1…",
            "title_similarity": "0.24371755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mjrey",
            "score": 1,
            "text": "The Trash Man strikes again.",
            "title_similarity": "0.46404338",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9mjx7d",
            "score": 1,
            "text": "Streisand Effect in 3....2....1..",
            "title_similarity": "0.15805888",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mjxxa",
            "score": 2,
            "text": "My girlfriend works next to the Nabisco plant here in Portland and it's outrageous what they're doing. America needs stronger unions",
            "title_similarity": "0.568649",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9mjywc",
            "score": 1,
            "text": "Socialism is \"in\" unless you call for unions?  I'm confused, it seems like companies love grifting off of socialism, but when it comes to implementing it.  Boom shut down.",
            "title_similarity": "0.6525452",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9mjz2x",
            "score": 1,
            "text": "He's Oswald Cobblepot.",
            "title_similarity": "0.29521528",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mjzff",
            "score": 2,
            "text": "Why the fuck is IGN writing about danny devito's twitter account? I thought they only did video game news.",
            "title_similarity": "0.67129093",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9mkekk",
            "score": 1,
            "text": "For a second I thought I was going to read that he died. 😮‍💨",
            "title_similarity": "0.5235256",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9mkfte",
            "score": 1,
            "text": "You've gone too far this time, Twitter!",
            "title_similarity": "0.4000709",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mkglb",
            "score": 1,
            "text": "They were just mad he did that Discord commercial.",
            "title_similarity": "0.6640028",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h9mkgya",
            "score": 1,
            "text": "I can't have anything gotta boycott frito/lay, Nabisco, nestle, and twitter plus the garbage i won't use like robinhood, facebook, tiktok. Guy had to look shit up before he can take a bite of anything.",
            "title_similarity": "0.731014",
            "sentiment_compound": -0.7912
        },
        {
            "id": "h9mkh7a",
            "score": 2,
            "text": "Would he like an egg in these trying times?",
            "title_similarity": "0.25972378",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9mkkhk",
            "score": 1,
            "text": "Ohhh hell naw you messed with the wrong melon farmers!!",
            "title_similarity": "0.51513654",
            "sentiment_compound": -0.893
        },
        {
            "id": "h9mklj0",
            "score": 2,
            "text": "I thought he only endorsed Wolf Cola",
            "title_similarity": "0.516141",
            "sentiment_compound": 0.25
        },
        {
            "id": "h9mklq9",
            "score": 2,
            "text": "I'm gonna need a Wolf Cola to get over this.",
            "title_similarity": "0.4809283",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mkw6y",
            "score": 2,
            "text": "He'll go by Frank the Tank now",
            "title_similarity": "0.36018854",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mkynb",
            "score": 2,
            "text": "So does that mean the verified badge IS a Twitter endorsement?",
            "title_similarity": "0.4525553",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9ml24a",
            "score": 2,
            "text": "So anyway I started blasting.",
            "title_similarity": "0.2203616",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ml547",
            "score": 2,
            "text": "That's literally all the information I need to boycott Nabisco",
            "title_similarity": "0.63931656",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9ml8u7",
            "score": 2,
            "text": "Can someone post the infographic of which, like 7 companies own every brand in the store?",
            "title_similarity": "0.31600022",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9mlaos",
            "score": 1,
            "text": "Who cares twitter sucks",
            "title_similarity": "0.50606",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9mldga",
            "score": 1,
            "text": "The Gestapo called, they said that Twitter got out of hand ...",
            "title_similarity": "0.70468664",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9mldl1",
            "score": 1,
            "text": "Big cookie don't play",
            "title_similarity": "0.43361986",
            "sentiment_compound": -0.2584
        },
        {
            "id": "h9mlfup",
            "score": 1,
            "text": "America abruptly is distracted by, not the point. They work at a place that is earning a profit. Their well being is conditioned upon rather than included within profit margins. \n\nThe cost of potatoes may change, but potatoes are a go/no-go condition. \nThat we're Potatoes is an argument for another. That we're on the same side of the ledger is as potatoes is Capital's errant understanding.",
            "title_similarity": "0.47816503",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9mlg7r",
            "score": 2,
            "text": "Let's abruptly lose twitter. So anyways I started blasting.",
            "title_similarity": "0.6834203",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9mlgk6",
            "score": 2,
            "text": "This just makes Twitter look shitty. Like what fucking tech company is in the pocket of Nabisco?",
            "title_similarity": "0.7036346",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9mlin3",
            "score": 3,
            "text": "they want to create a tiered system for employees which is what the auto industry already did.  they also want to totally fuck with their schedule, hours, and how OT pay is determined which means people will work long hours, weekends, and have the door left open for even more fuckery whenever nabisco feels like it.  they're totally striking for legit reasons.",
            "title_similarity": "0.5839051",
            "sentiment_compound": 0.3415
        },
        {
            "id": "h9mljgu",
            "score": 1,
            "text": "Losing twitter blue check status is a step up in my book.",
            "title_similarity": "0.50303787",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9mlr25",
            "score": 2,
            "text": "If Danny isn’t verifiable... who is?????????",
            "title_similarity": "0.31665546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mltzt",
            "score": 1,
            "text": "It's a private company",
            "title_similarity": "0.2152187",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mlvt6",
            "score": 3,
            "text": "No actors stood up for the amazon strike because they didnt want to lose a future job",
            "title_similarity": "0.64820457",
            "sentiment_compound": 0.0093
        },
        {
            "id": "h9mlxkk",
            "score": 2,
            "text": "Great now your making me look up what the Nabisco Strike",
            "title_similarity": "0.65551364",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h9mlyxy",
            "score": 2,
            "text": "Ah, yes. This must be how Oswald Cobblepot makes his comeback. \n\n\nReturn of The Penguin.\n\n\n\nEdit:typo",
            "title_similarity": "0.4120602",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9mm4rs",
            "score": 2,
            "text": "Boycott Twitter! Sounds like they are corrupt as fuck.",
            "title_similarity": "0.6658924",
            "sentiment_compound": -0.5562
        },
        {
            "id": "h9mma11",
            "score": 2,
            "text": "Just gave him a follow and shared his \"Nabisco\"-tweet.",
            "title_similarity": "0.50104624",
            "sentiment_compound": 0.34
        },
        {
            "id": "h9mmjdt",
            "score": 1,
            "text": "What does that even mean?  I thought \"verified\" simply meant they had checked his ID and were asserting that he is who he claims to be.  Are they saying someone else took over his account and is now impersonating him?  Otherwise this just makes no sense.",
            "title_similarity": "0.51968",
            "sentiment_compound": -0.3736
        },
        {
            "id": "h9mmkbo",
            "score": 1,
            "text": "Damn, Patti Harrison’s ‘Nilla Wafers by Nabisco’ impersonation was more based in reality than we thought",
            "title_similarity": "0.51052606",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9mmt76",
            "score": 2,
            "text": "The blue check mark is back. Twitter is stupid to remove it and create unnecessary outrage.",
            "title_similarity": "0.62585044",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h9mmw2x",
            "score": 1,
            "text": "Wow what an interesting story.  😑",
            "title_similarity": "0.100888915",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h9mmwcg",
            "score": 2,
            "text": "God don't fucking scare me like that. This man is my last tether of childhood lmao",
            "title_similarity": "0.5599363",
            "sentiment_compound": 0.8912
        },
        {
            "id": "h9mmzia",
            "score": 2,
            "text": "Wait, so his account is no longer verified because of what he said?  I’m just trying to understand that.",
            "title_similarity": "0.6067152",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9mn15z",
            "score": 2,
            "text": "Verification on twitter is a joke. They made normies second class citizens",
            "title_similarity": "0.67608917",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9mn2tx",
            "score": 4,
            "text": "Boycott Nestle too while we are at it….they are what is wrong with corporate mentality",
            "title_similarity": "0.72403115",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h9mn7n2",
            "score": 1,
            "text": "Oh they done fucked with the wrong donkeybrain today..",
            "title_similarity": "0.5641296",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h9mn9fn",
            "score": 1,
            "text": "I'll never forget when Jaboukie lost his verification for impersonating the FBI. Iconic.",
            "title_similarity": "0.652482",
            "sentiment_compound": -0.1615
        },
        {
            "id": "h9mnbyc",
            "score": 2,
            "text": "You gotta pay the troll toll",
            "title_similarity": "0.38855565",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9mncim",
            "score": 2,
            "text": "Support for collective bargaining is getting more controversial during its waning days, I guess.",
            "title_similarity": "0.4737936",
            "sentiment_compound": 0.1548
        },
        {
            "id": "h9mncjn",
            "score": 2,
            "text": "I'm not a religious person but I immediately wanted to go to war for my boy Devito, they may as well go after Mr Rogers",
            "title_similarity": "0.57203805",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h9mnha6",
            "score": 2,
            "text": "Maybe they removed the verification because he supports Nabisco which, not widely known, is a subsidiary of wolf cola. That brand is a PR nightmare",
            "title_similarity": "0.71661645",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9mnkmk",
            "score": 2,
            "text": "This headline got wilder and wilder at each word.",
            "title_similarity": "0.21924601",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mnkzo",
            "score": 1,
            "text": "Wait wait wait. So he wasn’t racist, didn’t sexually harass or something, and didn’t kneel for a worthy cause? He just didn’t agree with employees getting screwed over? Well then fuck nabisco and twitters. We all are and still remain an employee in some way. Devito is a legend, it’s always sunny is my jam. Batman returns he was fabulous. Nah, I choose Danny. Support Devito, he supports you.",
            "title_similarity": "0.56551707",
            "sentiment_compound": 0.4012
        },
        {
            "id": "h9mno4r",
            "score": 3,
            "text": "Maybe they got him confused with his twin, Arnold.",
            "title_similarity": "0.5010332",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9mnqui",
            "score": 2,
            "text": "Is this how the ensure that everyone with a Twitter verification is a complete dipshit",
            "title_similarity": "0.4639423",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9mnwpv",
            "score": 2,
            "text": "It’s like Twitter went, “EVERYBODY knows Danny DeVito doesn’t give a crap about Nabisco workers so this obviously can’t be him.  Kill the verification.”",
            "title_similarity": "0.75988626",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h9mnyot",
            "score": 1,
            "text": "Looks like he's verified again either just a mistake or if youre wearing your tinfoil after twitter saw the pushback they reverified",
            "title_similarity": "0.62441874",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9mo8xs",
            "score": 2,
            "text": "Seems he has the checkmark back already.",
            "title_similarity": "0.3017444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9moblh",
            "score": 1,
            "text": "Nabisco? They probably wanted less eyes on this but now there will be more.",
            "title_similarity": "0.4864622",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9moetp",
            "score": 2,
            "text": "The blue check has returned.",
            "title_similarity": "0.10246828",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9moh8b",
            "score": 2,
            "text": "*Frank Starts A Worker’s Revolt*",
            "title_similarity": "0.62232304",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mop7n",
            "score": 1,
            "text": "Maybe it was all about that Wolf Cola Boku Haram snafu.",
            "title_similarity": "0.434938",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9moq1o",
            "score": 1,
            "text": "I did *not* appreciate that title with the thumbnail combo. Thought it was going to be real bad news.",
            "title_similarity": "0.58582664",
            "sentiment_compound": -0.6964
        },
        {
            "id": "h9mox1j",
            "score": 3,
            "text": "Hollywood has really strong unions. If anything it’s annoying they don’t speak out more often.",
            "title_similarity": "0.3478487",
            "sentiment_compound": 0.2247
        },
        {
            "id": "h9mp56u",
            "score": 1,
            "text": "This feels like its from The Onion.",
            "title_similarity": "0.18620026",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9mp9e7",
            "score": 1,
            "text": "everything about this story and who is reporting it seems to be on acid.",
            "title_similarity": "0.44307953",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mp9ld",
            "score": 2,
            "text": "I had a friend in college who was flush with money. One day I asked him where he got his money. He told me he inherited it. Come to find out, his grandfather started the National Biscuit Company.",
            "title_similarity": "0.51589084",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9mpdl8",
            "score": 1,
            "text": "Danny DeVito doesn't need some bitch-ass Twitter verification. He's fucking Danny DeVito.",
            "title_similarity": "0.5250993",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mpdvh",
            "score": 3,
            "text": "Everything I heard about Danny DeVito seems to indicate hes a genuine gem of a human being. So it makes sense Twitter and their cold blooded lizard overlords find him distasteful.",
            "title_similarity": "0.5281227",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mpewu",
            "score": 1,
            "text": "Try new Wolf Brand Crackers. The official cracker of Afghanistan.",
            "title_similarity": "0.47237006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mpmtk",
            "score": 2,
            "text": "_a fate worse than death_",
            "title_similarity": "0.27233037",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h9mqsi7",
            "score": 2,
            "text": "Clearly Twitter intimately knows Danny Devito and supporting issues like this are just not who he really is, such tweets simply had to be the work of Doppelganger Devito.\n\nThe moustache was a dead give away.",
            "title_similarity": "0.67870665",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9mr5je",
            "score": 1,
            "text": "But Twitter will let the taliban have a platform. F off Twitter.",
            "title_similarity": "0.579583",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mrf6o",
            "score": 1,
            "text": "If Danny freaking DeVito ever gets cancelled, imma RIOT",
            "title_similarity": "0.68911064",
            "sentiment_compound": -0.8455
        },
        {
            "id": "h9mrfmv",
            "score": 1,
            "text": "I thought he died from the image at first sight",
            "title_similarity": "0.57900256",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9mru6s",
            "score": 2,
            "text": "losing the blue check is news?\nfuuuuck sakes",
            "title_similarity": "0.54011774",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9msf2l",
            "score": 1,
            "text": "Nabisco actually owns WolfCola so it make sense he’d support",
            "title_similarity": "0.34455585",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9mt770",
            "score": 2,
            "text": "Twitter and Facebook are pieces of shit companies that protect pedophiles, neo-Nazis and big companies.",
            "title_similarity": "0.58576804",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9mth7p",
            "score": 1,
            "text": "Am I the only one that thinks verification is a shitty artificial way to espouse status onto people? It doesn't even mean anything",
            "title_similarity": "0.46687213",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9mtif6",
            "score": 2,
            "text": "So...apparently I like him more if that was possible?",
            "title_similarity": "0.153779",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9mtiit",
            "score": 1,
            "text": "I feel dumber for having read this shitty article",
            "title_similarity": "0.5272974",
            "sentiment_compound": -0.775
        },
        {
            "id": "h9mtn8d",
            "score": 2,
            "text": "These tech giants need to keep doing this until people realise they need to be whipped into their proper place.",
            "title_similarity": "0.3356892",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mtwo7",
            "score": 8,
            "text": "\"Mondelez reported a 12.4% increase in net revenue in the second quarter of this year and shares of their stock rose 6% in 2020 as snack sales jumped with millions of Americans at home during the pandemic.\"\n\nCan't have pesky everyday Americans take part of that profit",
            "title_similarity": "0.43995845",
            "sentiment_compound": 0.8068
        },
        {
            "id": "h9mu7xh",
            "score": 2,
            "text": "And how many f@&?$ do you think Devito actually gives?",
            "title_similarity": "0.34822375",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mubjx",
            "score": 1,
            "text": "How dare they challenge the trash can man!",
            "title_similarity": "0.56568575",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h9mueet",
            "score": 1,
            "text": "Just proves there are corporate brigades online, protecting their interests.",
            "title_similarity": "0.3502155",
            "sentiment_compound": 0.25
        },
        {
            "id": "h9muhqf",
            "score": 8,
            "text": "Well thanks twitter, I didn't even know there was a strike. And now I won't touch those products. Or twitter, but that's nothing new.",
            "title_similarity": "0.72215617",
            "sentiment_compound": 0.3071
        },
        {
            "id": "h9mulcp",
            "score": 1,
            "text": "By Allah you deserve nothing but my sword Twitter\n\n\n\nHow dare you recer to him as anything but Sheik Devito",
            "title_similarity": "0.6041559",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mulcu",
            "score": 1,
            "text": "Well to be perfectly fair, he does look a lot like this one man-cheetah I met in a bar",
            "title_similarity": "0.3043077",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h9muswj",
            "score": 3,
            "text": "How many of you would like to see Danny DeVito voted as People magazine's Sexiest Man of the Millennium?",
            "title_similarity": "0.44496787",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9muyth",
            "score": 6,
            "text": "I don’t know what Nabisco is, but Danny’s always right, and twitter sucks.",
            "title_similarity": "0.5931532",
            "sentiment_compound": -0.5023
        },
        {
            "id": "h9mv1bb",
            "score": 4,
            "text": "And Twitter won't stop abusing their powers to force people to change their minds.",
            "title_similarity": "0.56099296",
            "sentiment_compound": 0.5216
        },
        {
            "id": "h9mvai5",
            "score": 1,
            "text": "Sexiest man in the world right there. God damn treasure.",
            "title_similarity": "0.20681208",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9mvdy9",
            "score": 1,
            "text": "Twitter highly underestimates the power or reddit.......... IASIP.... also good luck getting a cab Twitter.....",
            "title_similarity": "0.5322479",
            "sentiment_compound": 0.5434
        },
        {
            "id": "h9mvjwe",
            "score": 1,
            "text": "Is Danny DaVito not the sexiest man you’ve ever seen?",
            "title_similarity": "0.37571925",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mvnih",
            "score": 3,
            "text": "Danny DeVito is the most charming man in the world.",
            "title_similarity": "0.20611022",
            "sentiment_compound": 0.624
        },
        {
            "id": "h9mvs8b",
            "score": 1,
            "text": "I love reading tabloids online.",
            "title_similarity": "0.25574082",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9mvxiv",
            "score": 2,
            "text": "I hope this won't affect his onlyfans account.",
            "title_similarity": "0.43605363",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9mw041",
            "score": 2,
            "text": "Twitter is a joke. They allow the tallibans and ban us politicians so I dont know how people are suprised by this.\n\n\n\nJack is a litteral facist",
            "title_similarity": "0.7830011",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9mx73j",
            "score": 7,
            "text": "Uh... why is “verification” status linked to opinion? Is he not Danny DeVito anymore or something? Lol! Imagine power tripping so hard you think this matters in any way. “I’ll show you, you.... you... hateful person, you!”... “yeah! Sure told HIM!”",
            "title_similarity": "0.6390593",
            "sentiment_compound": 0.3993
        },
        {
            "id": "h9mxzq4",
            "score": 3,
            "text": "And the official Taliban still has their verification. Oh gawd that Nabisco.",
            "title_similarity": "0.4148985",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9my5aj",
            "score": 2,
            "text": "*The Gang Loses Twitter Access*",
            "title_similarity": "0.741454",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9mydmy",
            "score": 2,
            "text": "It'll never cease to amaze me how redditors feel the need to absolutely fill a common section with nothing but references. I CANT FIND THE ACTUAL DISCUSSIONS",
            "title_similarity": "0.4875641",
            "sentiment_compound": -0.2323
        },
        {
            "id": "h9mymxj",
            "score": 3,
            "text": "The Taliban has their page going though",
            "title_similarity": "0.34513128",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9myt6q",
            "score": 2,
            "text": "My heart stopped when I saw this thumbnail. It looked like he was waddling through the pearly gates. I was just like no... not him...",
            "title_similarity": "0.6044116",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h9mzm8m",
            "score": 1,
            "text": "Could really go for a nice egg right about now",
            "title_similarity": "0.18421626",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h9mzrr9",
            "score": 9,
            "text": "Twitter keeps saying that the blue check mark isn’t an endorsement of their political views or anything but when things like this happen I get very suspicious.",
            "title_similarity": "0.6621435",
            "sentiment_compound": 0.0543
        },
        {
            "id": "h9mzx6v",
            "score": 1,
            "text": "Remember when IGN was gaming news?",
            "title_similarity": "0.398773",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9mzyyx",
            "score": 1,
            "text": "I don't think people will now assume DeVito wasn't real.",
            "title_similarity": "0.36903724",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n03qt",
            "score": 1,
            "text": "No crossing the corporations",
            "title_similarity": "0.4282955",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9n0hft",
            "score": 2,
            "text": "Thought police at work",
            "title_similarity": "0.30222443",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n0ri7",
            "score": 2,
            "text": "Twitter the company creeps me out. They send \"cute\" emails telling you to stop being shy when you haven't posted in a while. That would be a red flag for any person.",
            "title_similarity": "0.71746635",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9n0san",
            "score": 2,
            "text": "I got a one day ban for talking about the dangers of nicotine in reply to a tobacco ad.\n\nI got censored on twitter for saying,\"God is love. Jesus loves you. We should love everyone.\" under the Zuckerberg hate speech laws.",
            "title_similarity": "0.78899264",
            "sentiment_compound": 0.25
        },
        {
            "id": "h9n146b",
            "score": 5,
            "text": "Twitter says Corporations are people. Fuck Twitter. Fuck Nabisco.  I support the strike.  I support Danny DeVito.",
            "title_similarity": "0.6871183",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9n1jnj",
            "score": 2,
            "text": "Shocked redditors = 100%. % deactivating their twitter = 0.",
            "title_similarity": "0.66771305",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9n2by1",
            "score": 1,
            "text": "Streisand effect on the nabisco strike in operation.",
            "title_similarity": "0.64356494",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9n2wcd",
            "score": 2,
            "text": "Back off snail youre just mashin it",
            "title_similarity": "0.44797322",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n2yx7",
            "score": 2,
            "text": "I think he would want us to just throw him in the trash now",
            "title_similarity": "0.5479914",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9n31ox",
            "score": 1,
            "text": "If I  boycott the products I use from mondolez , I’ll lose weight and live longer... oreos, sour patch kids, philadelphia cream cheese and a couple of other things I eat when I’m depressed.",
            "title_similarity": "0.5947048",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h9n4li7",
            "score": 5,
            "text": "They can't handle his magnum dong.",
            "title_similarity": "0.5101862",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n4r6m",
            "score": 2,
            "text": "No worries, it’s old Danny boy. He’ll make a fantastic comeback\n\nEdit: or die",
            "title_similarity": "0.48184073",
            "sentiment_compound": 0.2575
        },
        {
            "id": "h9n538r",
            "score": 1,
            "text": "“Obviously the real Danny Devito wouldn’t compromise his Oreo intake” -Twitter\n\nEdit- “Sorry Danny, the Twitter staff has been fired for undermining you”",
            "title_similarity": "0.80634385",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h9n54by",
            "score": 1,
            "text": "Um, he's still verified.",
            "title_similarity": "0.03083653",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n5sda",
            "score": 2,
            "text": "So he paid the troll toll!",
            "title_similarity": "0.4177618",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n5zu0",
            "score": 2,
            "text": "What a joke of an article.  There is absolutely nothing linking his Nabisco tweet and the temporary loss of his blue check mark.",
            "title_similarity": "0.6742765",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h9n66iu",
            "score": 4,
            "text": "Welcome to the technocracy. Where have you fools been.",
            "title_similarity": "0.46826625",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9n6a5d",
            "score": 1,
            "text": "I was totally hoping it was gonna have something to do with the Keebler elves",
            "title_similarity": "0.30079615",
            "sentiment_compound": 0.4754
        },
        {
            "id": "h9n6g3y",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.3195326"
        },
        {
            "id": "h9n6j5e",
            "score": 1,
            "text": "Must’ve broke the terms of service",
            "title_similarity": "0.48217052",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h9n7yjy",
            "score": 3,
            "text": "Cancel Twitter. I don't need to see twits tweets all day anyway.",
            "title_similarity": "0.69268936",
            "sentiment_compound": -0.25
        },
        {
            "id": "h9n7zrk",
            "score": 2,
            "text": "I hope someone has offered him an egg in these trying times",
            "title_similarity": "0.34617752",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9n80a9",
            "score": 1,
            "text": "When even the rich and incredibly famous aren't safe from the Owner Class.",
            "title_similarity": "0.48795983",
            "sentiment_compound": 0.2336
        },
        {
            "id": "h9n89h0",
            "score": 1,
            "text": "The Gang becomes the Good Guys",
            "title_similarity": "0.20492062",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9n8qd1",
            "score": 1,
            "text": "who gives a flying fuck about blue check marks?!?! as if the blue check mark will give you the eligibility to receive a monthly check of $1000...",
            "title_similarity": "0.38287932",
            "sentiment_compound": -0.6645
        },
        {
            "id": "h9n8rd2",
            "score": 1,
            "text": "Maybe giving tech oligarchs defacto control over our online voices is a bad thing. Say what you want about trump (not a supporter of the guy at all) but I think it's fucked he was removed from the Internet almost completely. The fucking leader of the taliban has a Twitter account. Let that sink in.",
            "title_similarity": "0.7561076",
            "sentiment_compound": -0.8363
        },
        {
            "id": "h9n8szf",
            "score": 1,
            "text": "Came for the story, stayed for the Frank Reynolds quotes",
            "title_similarity": "0.3344527",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n97p9",
            "score": 1,
            "text": "Big Cracker keeps the little guy down again",
            "title_similarity": "0.28744727",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n9eu5",
            "score": 1,
            "text": "So Nabisco has a hold on Twitter, then.",
            "title_similarity": "0.51655936",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9n9ggr",
            "score": 1,
            "text": "oh darn, its gonna wreck his career-",
            "title_similarity": "0.52906907",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h9na0l0",
            "score": 2,
            "text": "Who needs verification when you have rum ham.",
            "title_similarity": "0.35755193",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nalua",
            "score": 2,
            "text": "I did not expect Danny Devito to lead the rebellion in the labor wars.",
            "title_similarity": "0.5763211",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h9naya1",
            "score": 2,
            "text": "Twitter botched it, botch job, they need some trash to plug up the app!!",
            "title_similarity": "0.68625677",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nb4ct",
            "score": 3,
            "text": "Is this the same Twitter that openly gives \"minor attracted persons\" a soapbox to promote child abuse? The same Twitter that is still okay with the Taliban being on their platform?",
            "title_similarity": "0.5280938",
            "sentiment_compound": 0.3527
        },
        {
            "id": "h9nbgh4",
            "score": 1,
            "text": "Twitter messed up here, you don’t mess with the double D",
            "title_similarity": "0.58527863",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h9nc1h6",
            "score": 1,
            "text": "nooo not danny devitos twitter account NOOOO",
            "title_similarity": "0.58538866",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nc4u9",
            "score": 1,
            "text": "Had to check this wasn’t a post for a pitch in r/IASIP",
            "title_similarity": "0.46850413",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nco96",
            "score": 2,
            "text": "Because that’s what the rich really fear and are fighting: people working together.",
            "title_similarity": "0.47613823",
            "sentiment_compound": -0.3384
        },
        {
            "id": "h9ndgn5",
            "score": 1,
            "text": "Don’t mess with our Danny",
            "title_similarity": "0.3647592",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h9ndh75",
            "score": 1,
            "text": "But the dude has the AIDS.. not the gay AIDS!!",
            "title_similarity": "0.43672985",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ndh8h",
            "score": 3,
            "text": "Donkey brain behaviour from Twitter",
            "title_similarity": "0.342974",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ndpiq",
            "score": 2,
            "text": "the knock-off Oreos from Lidl are better anyways",
            "title_similarity": "0.21552296",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9ndqyw",
            "score": 1,
            "text": "Support Brand Buy Brand",
            "title_similarity": "0.15839638",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9ndrge",
            "score": 4,
            "text": "Twitter is something I never liked. I get it that Twitter isn’t a platform for free speech, but you remove verification for speaking your mind on a company and the taliban and other terrorists have official Twitter accounts. Why would I want to use and support a platform whose standards and practices are not clear?",
            "title_similarity": "0.73167753",
            "sentiment_compound": -0.6049
        },
        {
            "id": "h9ng8ij",
            "score": 1,
            "text": "The account is actually ran by Danno DaVoti now",
            "title_similarity": "0.35127833",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nga92",
            "score": 3,
            "text": "Maybe allowing social media companies to policy what users say isn't such a good idea after all? The fact that Twitter has turned it's blue checkmarks into a reward/punishment system is dumb as all hell.",
            "title_similarity": "0.6690798",
            "sentiment_compound": -0.8835
        },
        {
            "id": "h9nh2q6",
            "score": 1,
            "text": "My first thought was he supported *drone striking* a *place called* Nabisco. Figured that was disappointing, but still didn’t get why Twitter did that.\n\nReading it a second time and having everything click, Twitter looks even stranger for how they reacted.",
            "title_similarity": "0.743369",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h9nh50u",
            "score": 2,
            "text": "I have a bridge for sale if anyone thinks Twitter isn't as bad as facebook",
            "title_similarity": "0.5177135",
            "sentiment_compound": 0.431
        },
        {
            "id": "h9nhfm3",
            "score": 1,
            "text": "I’m sorry, is he now *less* Danny Devito?",
            "title_similarity": "0.5120092",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h9nhmdn",
            "score": 2,
            "text": "It’s ok thought, the Taliban still have a voice.   Fuck Twitter.",
            "title_similarity": "0.466733",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9nhmp1",
            "score": 2,
            "text": "I’m sure he’s devastated.",
            "title_similarity": "0.35973448",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9nhxvu",
            "score": 1,
            "text": "I'm OOTL. How do we know this was an intentional act by Twitter? And why does temporarily losing the verification checkmark matter, anyway?",
            "title_similarity": "0.68433714",
            "sentiment_compound": -0.4329
        },
        {
            "id": "h9ni04i",
            "score": 2,
            "text": "I honestly think that Danny probably has more important things on his mind then “Oh no, blue check mark gone from internet page”. Nice move, Twitter. /s",
            "title_similarity": "0.6149785",
            "sentiment_compound": 0.7841
        },
        {
            "id": "h9nipke",
            "score": 1,
            "text": "Why would he not support the labor action? Why should Twitter care? Support the workers….",
            "title_similarity": "0.6572962",
            "sentiment_compound": 0.6126
        },
        {
            "id": "h9nj1wc",
            "score": 2,
            "text": "Someone probably tried to report him as a fake. It automatically removes blue check. Twitter investigated and now its fixed.",
            "title_similarity": "0.7214866",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9njfog",
            "score": 1,
            "text": "I wrote a song on Danny De Vito’s birthday I named after him. I hope you like it fam\n\nhttps://soundcloud.com/funkytaco/danny-devito-wip",
            "title_similarity": "0.536932",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h9njlvo",
            "score": 2,
            "text": "Can I offer you some Nabisco in these trying times?",
            "title_similarity": "0.4754377",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9njqp8",
            "score": 1,
            "text": "Had me worried for a second he said or did something bad, good for Danny",
            "title_similarity": "0.537925",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h9nk5hp",
            "score": 1,
            "text": "Twitter is a corporate ass-monkey",
            "title_similarity": "0.538726",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nkoju",
            "score": 1,
            "text": "I guess that’s not Danny DeVito afterall.",
            "title_similarity": "0.3795717",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nlis3",
            "score": 2,
            "text": "Here is what I so love about these company's;\n\nDirect from https://www.mondelezinternational.com/About-Us/Who-We-Are/Our-Values\n\n\"We do what’s right. Always. We treat everyone with care and integrity.\"\n\n\"Our people are at the heart of everything we do.\"\n\nYou can't make this shit up.\n\nHahahahahahahahahahahahahahahahaha. \n\nHey Bob lets put some bullshit about how we do what is right blah blah blah. Yeah sure we treat our workers like shit, but hey no one cares as long as we put those words on a screen.",
            "title_similarity": "0.4118364",
            "sentiment_compound": 0.1124
        },
        {
            "id": "h9nlv50",
            "score": 2,
            "text": "can't wait to hear the \"\"\"official\"\"\" reason!",
            "title_similarity": "0.22267509",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nly05",
            "score": 1,
            "text": "My dumb ass didn't know Nabisco was a company and thought that the US had dropped an airstrike on a place called Nabisco.",
            "title_similarity": "0.70628566",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h9nm0nb",
            "score": 1,
            "text": "Can twitter disappear for a week?",
            "title_similarity": "0.59231406",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h9nm6li",
            "score": 4,
            "text": "Guess they’re making him pay the troll toll",
            "title_similarity": "0.5019066",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9nm9et",
            "score": 1,
            "text": "Twitter and Facebook are two sides of the same coin. Unsure why most people realize we need a mass exodus from Facebook but never mention Twitter.",
            "title_similarity": "0.73649037",
            "sentiment_compound": -0.128
        },
        {
            "id": "h9nmf0z",
            "score": 2,
            "text": "That was a terrible article",
            "title_similarity": "0.31936565",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9nn0et",
            "score": 2,
            "text": "He's such a sweet person. I always picture him as a keebler  elf.",
            "title_similarity": "0.16250032",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9nnghj",
            "score": 1,
            "text": "Remember how tech companies are allegedly “liberal” or whatever. It’s bullshit. Same as a “liberal” media.",
            "title_similarity": "0.49992266",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9nnj2g",
            "score": 1,
            "text": "I don't look ahead. I'm right here with you. It's a good way to be. - Danny DeVito",
            "title_similarity": "0.2828877",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9nnp2o",
            "score": 1,
            "text": "Twitter: You are *definitely* Danno DeVito\n\nDanny: Hell yeah go Nabisco workers! Strike!\n\nTwitter: We are no longer sure you're the real Danny DeVito",
            "title_similarity": "0.77508974",
            "sentiment_compound": -0.7137
        },
        {
            "id": "h9nnpro",
            "score": 2,
            "text": "We’ll I mean shit, it worked. No one on this thread is talking about the strike, just fucking Twitter verification. Death to corporate tyranny! Viva la revolución!",
            "title_similarity": "0.7631384",
            "sentiment_compound": -0.9011
        },
        {
            "id": "h9no2xb",
            "score": 1,
            "text": "....fuck nabisco, and Twitter.",
            "title_similarity": "0.68299294",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9no39o",
            "score": 1,
            "text": "I’m also for the working people.. No contract no snacks",
            "title_similarity": "0.52976",
            "sentiment_compound": -0.0803
        },
        {
            "id": "h9no687",
            "score": 1,
            "text": "Why are IGN the ones reporting on this!?",
            "title_similarity": "0.3749724",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9no6lv",
            "score": 1,
            "text": "There's no way this is true, guys.",
            "title_similarity": "0.27582747",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9nol1y",
            "score": 1,
            "text": "They only recognize him as The Barnacle now",
            "title_similarity": "0.43638217",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nou7p",
            "score": 2,
            "text": "You can only be the right kind of woke now. The kind of woke that doesn’t impede rich people becoming richer. The kind of woke that pits the poor against the slightly less poor.",
            "title_similarity": "0.34836313",
            "sentiment_compound": 0.3338
        },
        {
            "id": "h9npe24",
            "score": 1,
            "text": "Nabisco’s Parent company owns dozens of popular brans aside from Nabsico: Oreo, Chips Ahoy, Sour Patch Kids; theyre all owned by a single company. Its no use boycotting just one of them, you have to boycott ALL of their parent companies products",
            "title_similarity": "0.6202438",
            "sentiment_compound": 0.1426
        },
        {
            "id": "h9nprjo",
            "score": 1,
            "text": "1. Who cares \n\n2. Twitter needs to be regulated",
            "title_similarity": "0.45995516",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9nqjdc",
            "score": 2,
            "text": "Fuck social media it’s truly harming society",
            "title_similarity": "0.53191966",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h9nquef",
            "score": 1,
            "text": "Can we please stop reporting tweets as news?",
            "title_similarity": "0.63156235",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9nqv7q",
            "score": 1,
            "text": "The artist formerly known as Danny DeVito",
            "title_similarity": "0.33478695",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nr0hl",
            "score": 1,
            "text": "Plot twist. What if his account got hacked. What a beautiful and calculated way to spread a message.",
            "title_similarity": "0.45755976",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9nrd36",
            "score": 2,
            "text": "Should be more worried about wolf cola",
            "title_similarity": "0.404154",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h9nrde3",
            "score": 1,
            "text": "Join your businesses union. If you don't work somewhere with a union, join the IWW and learn how to start workplace organizing. I am a IWW Delegate, organizing is as easy as talking to the people you work with.\n\nJoin today: https://iww.org/membership/",
            "title_similarity": "0.415448",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h9nrj1g",
            "score": 1,
            "text": "So we can no longer be sure this account is truly Danny DeVito. Because obviously Twitter knows the *real* Danny DeVito would never support a communist. Hmm\n\nMaybe I can be the new Danny DeVito!!",
            "title_similarity": "0.74320894",
            "sentiment_compound": 0.2645
        },
        {
            "id": "h9ns3s2",
            "score": 1,
            "text": "Hey, you know what's not in here? Any proof that Mr. DeVito is upset by their decision. Maybe there were some suspicious logins that we don't know about? How often does he post blatantly political messages?",
            "title_similarity": "0.67547464",
            "sentiment_compound": -0.6848
        },
        {
            "id": "h9ns67p",
            "score": 1,
            "text": "So Danny de Vito is no longer Danny de Vito? Sad",
            "title_similarity": "0.519574",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h9nsdvu",
            "score": 1,
            "text": "Can the ‘masters’ or ‘real owners’ be this sensitive 🤣🤣🤣 you’ve mastered mass manipulation and political disinformation BUT Danny de Vito OMFG🙌🏼",
            "title_similarity": "0.5403237",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h9nszv9",
            "score": 1,
            "text": "His checkmark is still there",
            "title_similarity": "0.037281994",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ntwuh",
            "score": 1,
            "text": "Danny DeVito would probably say Fuck it then tell twitter to shove it up there ass",
            "title_similarity": "0.70307624",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h9nu0ug",
            "score": 1,
            "text": "r/OutOfTheLoop. \n\nApart from Ol' Danny Boy, why is this news?",
            "title_similarity": "0.49872124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nudf7",
            "score": 2,
            "text": "Is there any actual evidence at all pointing to these things being related? Not saying it's impossible, but it seems like just two different things/companies and somehow it's being suggested one caused the other?",
            "title_similarity": "0.4042562",
            "sentiment_compound": 0.5588
        },
        {
            "id": "h9nuho2",
            "score": 1,
            "text": "Is it likely this was done by twitter Ai due to reports or some such by Nabisco PR machine? Would be interesting to find out....and if so...are those who falsely reported being punished?",
            "title_similarity": "0.603289",
            "sentiment_compound": -0.168
        },
        {
            "id": "h9nunvx",
            "score": 1,
            "text": "Wow. Didn’t know Twitter was scabby. I will boycott Twitter in support of my union brothers.",
            "title_similarity": "0.84094715",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9nuuo0",
            "score": 3,
            "text": "I dont think Danny gives a shit about his stupid blue check (which he still has). What he does want you to know about and support is THE NABISCO STRIKE. \n\n[https://www.wsws.org/en/articles/2021/08/17/nabi-a17.html](https://www.wsws.org/en/articles/2021/08/17/nabi-a17.html)\n\n[https://news.yahoo.com/nabisco-workers-strike-against-outsourcing-220858927.html](https://news.yahoo.com/nabisco-workers-strike-against-outsourcing-220858927.html)\n\nhttps://www.thestranger.com/slog/2021/08/19/60511471/portland-nabisco-workers-enter-second-week-of-strike",
            "title_similarity": "0.6906997",
            "sentiment_compound": -0.7378
        },
        {
            "id": "h9nv47a",
            "score": 1,
            "text": "So….Twitter no longer believes Danny De Vito controls the Danny De Vito Twitter account ?",
            "title_similarity": "0.7297584",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9nvh7e",
            "score": 2,
            "text": "Maybe he can post something in support of the Taliban or Hamas and get it back?",
            "title_similarity": "0.46180943",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h9nvl7n",
            "score": 5,
            "text": "He’s been a huge proponent of Food worker rights since he escaped from the Keebler Elf Tree.",
            "title_similarity": "0.43885982",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9nvq7y",
            "score": 2,
            "text": "Most Black people I see wearing masks. It’s the rich assholes driving Mercedes that tend to be white here in Tennessee that I see not wearing them",
            "title_similarity": "0.37656522",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h9nvuqb",
            "score": 2,
            "text": "I just went to his Twitter and he's verified, so either Twitter did a really quick about face or this article is some bullshit.",
            "title_similarity": "0.65672994",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h9nw1r2",
            "score": 1,
            "text": "Wow. Well, fuck you Twitter. And fuck nabisco, too.",
            "title_similarity": "0.7173541",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h9nw2s2",
            "score": 1,
            "text": "Mess with DeVito, your app gets the DeLeteO!",
            "title_similarity": "0.54316705",
            "sentiment_compound": -0.4199
        },
        {
            "id": "h9nw5hk",
            "score": 1,
            "text": "Holy Double standard Batman!",
            "title_similarity": "0.24505933",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nwcil",
            "score": 1,
            "text": "No rumham? Strike supported.",
            "title_similarity": "0.5323403",
            "sentiment_compound": 0.1205
        },
        {
            "id": "h9nx1ei",
            "score": 1,
            "text": "My odd self read it as Demi Lovato. And I'm like...huh?? 😭",
            "title_similarity": "0.32330978",
            "sentiment_compound": -0.6966
        },
        {
            "id": "h9nx6yf",
            "score": 1,
            "text": "It's hard out here for a pimp.",
            "title_similarity": "0.29226637",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h9nxcti",
            "score": 1,
            "text": "It is universally understood that one must side with Danny Devito.",
            "title_similarity": "0.266447",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9nxt0a",
            "score": 1,
            "text": "Its fuckig danny de vito.... who in their right mind attack him i  the internet? Its like asking for a big backlash",
            "title_similarity": "0.6559478",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h9nycze",
            "score": 1,
            "text": "He’s supporting workers rights for a big corporations and they are attempting to de platform, he didn’t break TOS so that was the best they can do.",
            "title_similarity": "0.44913316",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h9nyd7d",
            "score": 1,
            "text": "He supports Wolf Cola",
            "title_similarity": "0.3101365",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9nyglg",
            "score": 2,
            "text": "Does this really surprise you? Twitter gives the taliban a platform lol",
            "title_similarity": "0.64964867",
            "sentiment_compound": 0.6361
        },
        {
            "id": "h9nyu07",
            "score": 1,
            "text": "DeVito hurt an advertisers feelings! waah!",
            "title_similarity": "0.5360384",
            "sentiment_compound": -0.6103
        },
        {
            "id": "h9nzgj6",
            "score": 2,
            "text": "I knew nothing about the Nabisco strike until I saw this post. So thanks Twitter. Your slimy tactic assisted in spreading the word!",
            "title_similarity": "0.72080004",
            "sentiment_compound": 0.5474
        },
        {
            "id": "h9nzmq7",
            "score": 1,
            "text": "Thank goodness! Another victory for those underdog mega corps",
            "title_similarity": "0.3245535",
            "sentiment_compound": 0.6996
        },
        {
            "id": "h9nzn6v",
            "score": 1,
            "text": "WTF, he needs to go Frank on them",
            "title_similarity": "0.36927047",
            "sentiment_compound": -0.6739
        },
        {
            "id": "h9o15ci",
            "score": 1,
            "text": "Troll foot doesn’t care",
            "title_similarity": "0.3790673",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h9o15jv",
            "score": 1,
            "text": "Oh no not a blue check! Why is this news?",
            "title_similarity": "0.40296477",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h9o18jb",
            "score": 1,
            "text": "Can someone please explain, if everyone knows that person account is the person, why does the verification matter??  Or does that account get deleted?",
            "title_similarity": "0.5181528",
            "sentiment_compound": 0.4479
        },
        {
            "id": "h9o1fbm",
            "score": 1,
            "text": "Censorship sponsored by Twitter. \n\nI am not sure why a private company is allowed to have censorship rights.",
            "title_similarity": "0.56747866",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h9o1jpa",
            "score": 1,
            "text": "Danny devito can't be the only verified person to tweet about the strike. This is probably just a bug and IGN made a clickbait article out of it. \n\nOf course Reddit ate it up, not surprising in the least.",
            "title_similarity": "0.67615485",
            "sentiment_compound": -0.3213
        },
        {
            "id": "h9o1oqm",
            "score": 1,
            "text": "As his verified check is back on his Twitter account, I'd have to say it was a bunch of \"reports\".  Most likely done by Nabisco's hired PR firm.  All these corps have a PR firm they don't want you to know about whose main purpose is to trash people they have a problem with.  \n\n  We see posts about \"products\" all the time on reddit.  We see thousands of posts upvoted for no damn reason.  It's \"PR\" firms and their legions of hired \"posters\" trying shape public opinions.   Don't forget these guys are operating in the realm of billions of $$, whereas we make $30k and think we have had a good year.   Spending $10k is nothing compared to what you'll save busting a union. \n\n  Crazy if you don't acknowledge that this is happening all the time.",
            "title_similarity": "0.661476",
            "sentiment_compound": 0.5722
        },
        {
            "id": "h9o22ke",
            "score": 2,
            "text": "My heart skipped a few beats before getting through the title\n\nKeep giving no fucks about the Oligarchy @TheRealDannyDevito, you're an inspiration to many and have given many of us tons of laughs",
            "title_similarity": "0.51110494",
            "sentiment_compound": 0.9408
        },
        {
            "id": "h9o2kcr",
            "score": 1,
            "text": "Has anyone ever beaten The Warthog? The correct answer is no.",
            "title_similarity": "0.49476922",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h9o2mf0",
            "score": 1,
            "text": "He’ll survive. Frank probably owns Twitter anyway.",
            "title_similarity": "0.3791318",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9o2xvt",
            "score": 1,
            "text": "The real reason is that I started following him the other day",
            "title_similarity": "0.41836295",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9o35jl",
            "score": 1,
            "text": "I guess Twitter doesn't support unions, which is no dam surprise!!!",
            "title_similarity": "0.66757274",
            "sentiment_compound": -0.7309
        },
        {
            "id": "h9o3gge",
            "score": 2,
            "text": "I know it’s a private company and can use their platform however they please. But their censorship is super impactful. Like Trump being banned but allowing the Taliban to have an official account? They should be held to a standard different from your average person. If I made a tweet with 200 follows how much of an impact does it really have? If they block/restrict/unverify posts that are capable of reaching millions look at that impact.",
            "title_similarity": "0.6211963",
            "sentiment_compound": 0.9044
        },
        {
            "id": "h9o4459",
            "score": 1,
            "text": "Guys. His account is still verified.\n\nWhat am I missing?",
            "title_similarity": "0.28906444",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9o4atw",
            "score": 1,
            "text": "They tried covering their asses and saying \"his profile was incomplete.\" Uh-huh. Sure.",
            "title_similarity": "0.5524657",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h9o4kif",
            "score": 1,
            "text": "\"Alright, you can support our Sheep Dog democratic candidate Bernie Sanders, but don't support any movements we can't stop at a moments notice\"",
            "title_similarity": "0.5996915",
            "sentiment_compound": 0.2011
        },
        {
            "id": "h9o4x6i",
            "score": 1,
            "text": "Oh, I guess that blue checkmark is more like the golden banana stickers from *Metalocalypse* and not even distantly related to verification.\n\nDanny went out of line and got the stick, that’s how I read the situation. What else could it be? That the real Danny Devito was not predicted to say such things?",
            "title_similarity": "0.5419185",
            "sentiment_compound": 0.4859
        },
        {
            "id": "h9o6x6q",
            "score": 1,
            "text": "So anyway, I started Tweeting.",
            "title_similarity": "0.28332943",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9o6y4p",
            "score": 1,
            "text": "It’s literally so when his tweet is retweeted by thousands of people who agree, there is NO certified blue check. So everyone else sees it and thinks it’s not a tweet from a real celebrity who prob has more influence than me. I can’t even get people to not microwave fish in the office.",
            "title_similarity": "0.69233257",
            "sentiment_compound": -0.1111
        },
        {
            "id": "h9o77vc",
            "score": 1,
            "text": "Hhhh…. I’ll go get the reddit union",
            "title_similarity": "0.41416967",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9o79iy",
            "score": 2,
            "text": "So we have no way of knowing that the strike is retaliation because of Nabisco.  It's basically a conspiracy theory.  \n\nBelow I've quoted the reason given by Twitter.  The reason was that he had a \"famous person\" account that wasn't fully verified. Yes maybe it was a \"coincidence\" that it came after the comment.  But maybe the attention brought to him *because* of the comment also brought his account to the attention of Twitter.  Or maybe it really was a coincidence and whatever algorithm sweeps the accounts hit his at this time.\n\nAnd then take the fact that his account was quickly restored, with him able to keep tweeting with free reign against Nabisco. If this was some effort to silence him, it basically did absolutely nothing to silence him.  This really makes this theory make no sense.\n\nThis article is a good example with how bad logic in news articles can propagandize us. The article doesn't say anything not true yet persuades is to believe something with no evidence and weak connections. It should be an opinion piece. \n\n>In a statement to IGN, a Twitter spokesperson wrote: \"The account referenced was debadged temporarily because the account’s information was incomplete. Our verification policy states that blue badges may be automatically removed from inactive and incomplete accounts, which require a confirmed email address or phone number. We have worked with the account holder to confirm the necessary information and the account’s verification has since been restored. \"",
            "title_similarity": "0.7502949",
            "sentiment_compound": -0.6075
        },
        {
            "id": "h9o7bxq",
            "score": 1,
            "text": "Why in the world is IGN reporting on Danny’s Twitter status?",
            "title_similarity": "0.6641481",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9o7og5",
            "score": 1,
            "text": "I heard from a friend that these can be deactivated if you log in from a different device, but I can't check since I am not famous :D",
            "title_similarity": "0.6315657",
            "sentiment_compound": -0.5051
        },
        {
            "id": "h9o8btp",
            "score": 2,
            "text": "Twitter said he’s back up and there was a problem with his “verification process”, not the nabisco strike thing. What is going on at Nabisco?",
            "title_similarity": "0.69178534",
            "sentiment_compound": -0.3248
        },
        {
            "id": "h9o8puw",
            "score": 2,
            "text": "Good. What better way to bring more attention to the strike :)",
            "title_similarity": "0.37180942",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h9o9kbm",
            "score": 3,
            "text": "He didn’t lose his verification due to that tweet…\n\nhttps://twitter.com/IGN/status/1428737848128245762?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet",
            "title_similarity": "0.44609347",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9oadex",
            "score": 1,
            "text": "Haha Twitter feeling triggered.",
            "title_similarity": "0.31344748",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h9oagch",
            "score": 1,
            "text": "Twitter done fucked up now…You messed with our Golden Egg",
            "title_similarity": "0.66449404",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h9oaieh",
            "score": 1,
            "text": "I didn't even know Danny DeVito was on Twitter. Followed.",
            "title_similarity": "0.64144886",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9oce8g",
            "score": 1,
            "text": "Don't they know who tf he is?\n\nI need an egg in these trying times.",
            "title_similarity": "0.3813092",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9odqu0",
            "score": 1,
            "text": "We all know Twitter is always right they know what they're doing.",
            "title_similarity": "0.14764486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9oe2h9",
            "score": 2,
            "text": "Fuck Twitter, fuck Nabisco. Viva DeVito!",
            "title_similarity": "0.6324067",
            "sentiment_compound": -0.807
        },
        {
            "id": "h9oe4u6",
            "score": 2,
            "text": "I nearly dropped my phone seeing something about Danny on r/news. You stay healthy and safe now Danny.",
            "title_similarity": "0.39608827",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h9oegpa",
            "score": 1,
            "text": "Oh no i lost my Twitter verification........\n\nAnyway......",
            "title_similarity": "0.6561536",
            "sentiment_compound": -0.0613
        },
        {
            "id": "h9oep5y",
            "score": 1,
            "text": "Fuck Twitter, Idk why anyone still uses that trash",
            "title_similarity": "0.68350255",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h9ofomm",
            "score": 2,
            "text": "Twitter is a private corporation. They have the right to do whatever they want.",
            "title_similarity": "0.26021308",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h9ohcsz",
            "score": 2,
            "text": "We said this would happen\n\n-all libertarians",
            "title_similarity": "0.25416884",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9ohpel",
            "score": 3,
            "text": "You keep your fucking hands off The Devito!",
            "title_similarity": "0.43298382",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9oi8rn",
            "score": 5,
            "text": "Oligarchs stick together.",
            "title_similarity": "0.034638047",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9oj0in",
            "score": 2,
            "text": "But the Taliban remain active",
            "title_similarity": "0.113721736",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h9ojh9w",
            "score": 2,
            "text": "Once upon a time, Twitter verification was used to symbolise that it's the \"real\" you. Now it's used as a blackmailing tool to discourage twitter users from sharing the wrong opinions.\n\nGlad I'm not on that platform any more.",
            "title_similarity": "0.68171656",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h9oka26",
            "score": 1,
            "text": "Twitter is cancer, every opinion has their own movements on twitter. Tho i dislike downvote system as it allows for an easier controll of opinions and amplifies circlejerking. Atleast here i can sort my comments to not read about flat earth, fake elections and racist crap. Also on topic, good for them to strike.",
            "title_similarity": "0.68488324",
            "sentiment_compound": -0.91
        },
        {
            "id": "h9oky7z",
            "score": 2,
            "text": "Is Nabisco and Mondelez the same company?\n(Here in Canada Oreos are labeled from the \"Mondelez\" company)",
            "title_similarity": "0.35076186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9ol58x",
            "score": 1,
            "text": "Devil's Advocate for the moment: maybe they think his Tweeter was hacked.",
            "title_similarity": "0.6678109",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h9olcrb",
            "score": 1,
            "text": "Dear twitter youre fuckibg dead to me. I never used you but now youre on the internet shit list",
            "title_similarity": "0.7191806",
            "sentiment_compound": -0.775
        },
        {
            "id": "h9olk8e",
            "score": 1,
            "text": "Is he no longer is Danny DeVito? I guess we'll never know...",
            "title_similarity": "0.47177833",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9om5qu",
            "score": 2,
            "text": "I have a twitter and god is the site just a clusterfuck of degenerates, and wackos Give Devito back his checkmark Twitter this is absolutely pathetic",
            "title_similarity": "0.72342706",
            "sentiment_compound": -0.4391
        },
        {
            "id": "h9oncs3",
            "score": 2,
            "text": "It's a nonstop disco, bet ya it's Nabisco, bet ya didn't know, who who....",
            "title_similarity": "0.50477886",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9oonip",
            "score": 3,
            "text": "2021 and news headlines are about “celebrities” losing a god damn internet checkmark",
            "title_similarity": "0.74670255",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h9oqc18",
            "score": 2,
            "text": "I dont think they know what \"verified\" means. Its supposed to just mean \"yes this guy is the danny devito\" by taking away his verification its like theyre saying \"NOOO THIS CANT BE. THE REAL DANNY WOULD NEVER SAY SOMETHING LIKE THAT HE MUST BE A FAKE\" they turned it into some weird political bs",
            "title_similarity": "0.6660938",
            "sentiment_compound": -0.4562
        },
        {
            "id": "h9oqukz",
            "score": 2,
            "text": "Twitter is a cesspool",
            "title_similarity": "0.53523594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9otj9f",
            "score": 4,
            "text": "Removing verification as a slap on the wrist for dissent...ridiculous. What is the point of a verification process? Verify the person or thought policing?",
            "title_similarity": "0.6310897",
            "sentiment_compound": 0.2406
        },
        {
            "id": "h9ovujt",
            "score": 2,
            "text": "It was discovered that whom we thought was Danny Devito was actually his look alike cousin Manny Devito",
            "title_similarity": "0.41474348",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9owuei",
            "score": 4,
            "text": "We should offer him an egg in these trying times.",
            "title_similarity": "0.31173474",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9oxjy0",
            "score": 2,
            "text": "Unions, it's a hot subject right now.",
            "title_similarity": "0.25537837",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9oy7hf",
            "score": 4,
            "text": "So… we are punishing people for expressing a differing opinion. That’s where we are now.",
            "title_similarity": "0.5004467",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9oz6xw",
            "score": 5,
            "text": "Danny Devito losing verification 80k upvote awards top story, taliban being allowed to use twitter basically nothing.",
            "title_similarity": "0.7257467",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9ozsp7",
            "score": 2,
            "text": "Jesus the way I saw him trending and the picture for this news I thought man’s died.",
            "title_similarity": "0.6621368",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h9p3cr0",
            "score": 4,
            "text": "Lol WHAT.\n\nFuck Twitter. Fuck Jack. Twitter is becoming a bastion of censorship. I don't care if Danny Devito said he likes telletubby porn, that in no way should have anything to do with his verification status.\n\nFuck Twitter, fuck big social media being gatekeepers.",
            "title_similarity": "0.7134934",
            "sentiment_compound": -0.9221
        },
        {
            "id": "h9p3vqu",
            "score": 1,
            "text": "I have a feeling this is more innocent/incompetence on Twitters part than malicious",
            "title_similarity": "0.37877485",
            "sentiment_compound": 0.128
        },
        {
            "id": "h9p85bm",
            "score": 4,
            "text": "Danny is the man. Nabisco probably owns alot of twitter stock or something. Just another day of corp corruption.",
            "title_similarity": "0.6867087",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9pbdwy",
            "score": 4,
            "text": "*to the tune of Battle Hymn of the Republic*\n\n🎶Soooolidarity Deviiiito🎶",
            "title_similarity": "0.36808056",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h9pdh40",
            "score": 2,
            "text": "He lost his verification? Like they’re thinking if he supports the Nabisco strike he must not really be Danny DeVito?",
            "title_similarity": "0.7601637",
            "sentiment_compound": 0.3736
        },
        {
            "id": "h9pdipw",
            "score": 1,
            "text": "So much for freedom of speech whenever we say something they do not like it’s taken down Yh freedom of speech  is just a dream I posted a video of taliban playing on bumper cars and for some reason it was taken down but they can keep replaying disturbing vids of allied civs failing of our planes Yh makes sense",
            "title_similarity": "0.63082856",
            "sentiment_compound": -0.6397
        },
        {
            "id": "h9pi6da",
            "score": 2,
            "text": "Waking up yet folks? Kill social media",
            "title_similarity": "0.6033559",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h9pjkpr",
            "score": 1,
            "text": "I just looked he’s still verified…",
            "title_similarity": "0.113236725",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9plno3",
            "score": 2,
            "text": "Looks like they own Sour Patch too. However, sour punch is owned by American Licorice company and is better IMO.\n\nFuck Nabisco and Fuck Nestle. Stay out of our Great Lakes.",
            "title_similarity": "0.6201725",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9pn1cv",
            "score": 3,
            "text": "Twitter and corporate America unite against the working poor.",
            "title_similarity": "0.5981996",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h9ppo88",
            "score": 1,
            "text": "Looks like he got it back.  Any response from Twitter?",
            "title_similarity": "0.423034",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9pqkya",
            "score": 1,
            "text": "Thank goodness...when I saw him on the popular page I feared the worst.",
            "title_similarity": "0.58252573",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h9pqqun",
            "score": 1,
            "text": "Oh man what a terrible thing. Because this is important let's get this trending. Celebrities are not  any more important than your next door neighbor.",
            "title_similarity": "0.56638163",
            "sentiment_compound": -0.4782
        },
        {
            "id": "h9psjsn",
            "score": 7,
            "text": "Twitter isn’t real. Only 23% of Americans ages 12 and older actually use Twitter daily out of the 88% that even know or care that it exists. Few entirely imaginary human constructs can claim to have wrought as much damage to mental health and the fabric of society in the actual real world as social media has accomplished in such a short span of history.\n\nHumanity *NEEDS* a global Carrington Event.",
            "title_similarity": "0.5699619",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9pzzna",
            "score": 1,
            "text": "So anyways he started blasting",
            "title_similarity": "0.2826782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9q0re2",
            "score": 1,
            "text": "Thank god. I always have a mini heart attack when I see generally loved celebrity's name trending.",
            "title_similarity": "0.47869894",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h9q0skl",
            "score": 1,
            "text": "How has this been the top story on my Reddit homepage for 24 hrs?!",
            "title_similarity": "0.38163793",
            "sentiment_compound": 0.2714
        },
        {
            "id": "h9q35v7",
            "score": 2,
            "text": "Tuck Fwitter, and fweeting.",
            "title_similarity": "0.2664013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9q4sv7",
            "score": 1,
            "text": "I thought this was some sort of air strike not a fucking union. That’s crap!",
            "title_similarity": "0.56861544",
            "sentiment_compound": -0.6058
        },
        {
            "id": "h9q7dvk",
            "score": 3,
            "text": "TIL that Danny DeVito is not a corporate robot. Love your work Danny. Solidarity Forever.\n\n[https://www.youtube.com/watch?v=TwF0xKpMuWM](https://www.youtube.com/watch?v=TwF0xKpMuWM)",
            "title_similarity": "0.4614696",
            "sentiment_compound": 0.7757
        },
        {
            "id": "h9q7nn5",
            "score": 1,
            "text": "Love how Twitter is trying to censor everybody",
            "title_similarity": "0.5966294",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9q90hv",
            "score": 1,
            "text": "So if you don’t match twitters views then you get penalised? Seems impartial",
            "title_similarity": "0.564224",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9qe3la",
            "score": 2,
            "text": "As George Carlin said, they got us by the balls, they control the media, they control what information you get to hear, and they control the internet, they know he’s got a lot of followers that see his material, if they remove authenticity they don’t have to worry as much about any extra flak so they can get their way.",
            "title_similarity": "0.49023935",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h9qeyb8",
            "score": 1,
            "text": "Thank god, when I saw Danny devito trending I thought he died! My heart sank",
            "title_similarity": "0.66952324",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h9qf7lj",
            "score": 1,
            "text": "My heart had never dropped so fast. Seeing Danny Devito trending here had me thinking he had died!",
            "title_similarity": "0.64066005",
            "sentiment_compound": 0.2244
        },
        {
            "id": "h9qgqb1",
            "score": 1,
            "text": "Everyone needs an egg in such a trying time.",
            "title_similarity": "0.28097916",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9qind6",
            "score": 1,
            "text": "Hydrox is better than oreo",
            "title_similarity": "0.18113925",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9qj831",
            "score": 1,
            "text": "So… Twitter wants to take the blue check mark away from those who aren’t in agreement with them? Okay.",
            "title_similarity": "0.6217203",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h9qksp0",
            "score": 1,
            "text": "They gave it back. They said it was because his accounts information was incomplete.",
            "title_similarity": "0.572377",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9qkv1q",
            "score": 2,
            "text": "I’m gonna go ahead and polish off these chocolate covered Oreos because I bought them before I heard about the union Twitter overlord thing.",
            "title_similarity": "0.49988577",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9qkwyw",
            "score": 1,
            "text": "Dude how isn't this about long shifts and getting better healthcare and such so why did they remove their verification",
            "title_similarity": "0.5451489",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h9ql6gw",
            "score": 2,
            "text": "Twitter is bought by the elite and bourgeoisie. These employees have to go in and make the product while corporate middle managers make twice their pay to send emails from bed. And then the executives keep most of the profit.",
            "title_similarity": "0.49284458",
            "sentiment_compound": 0.4144
        },
        {
            "id": "h9qncvk",
            "score": 1,
            "text": "Regardless of if what he did was good or bad that's no grounds to remove verification. Verification isnt based on being a good person, it's based in being famous",
            "title_similarity": "0.41170776",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h9qojqd",
            "score": 1,
            "text": "A Hercules live action remake would probably suck but if shirtless Danny DeVito with prosthetic goat legs played Pan I would see it regardless",
            "title_similarity": "0.544196",
            "sentiment_compound": 0.2846
        },
        {
            "id": "h9qouzc",
            "score": 1,
            "text": "Got to love the political line you have to toe to have verification.",
            "title_similarity": "0.2987534",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h9qr1o9",
            "score": 1,
            "text": "/u/holyfruits maybe consider deleting this or clarifying, since he hasn’t lost verification at all?",
            "title_similarity": "0.47528934",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h9qsklb",
            "score": 1,
            "text": "Twitter just needed an egg during a rough time",
            "title_similarity": "0.51304436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9qtyz2",
            "score": 2,
            "text": "Oh no the verified police. His followers will still be following him except he won’t have a blue tick lol.",
            "title_similarity": "0.5721189",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h9qxcrt",
            "score": 2,
            "text": "Saw this on popular and thought he’d died.\nInstead, he’s just supporting peoples’ livelihoods. Legend.",
            "title_similarity": "0.61302996",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h9qxsj8",
            "score": 2,
            "text": "If you don’t say what we like, you are banned. Twitter and Reddit can go to hell",
            "title_similarity": "0.7132218",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h9qy1cy",
            "score": 2,
            "text": "Shady shtuff like this is why I deleted Twitter.",
            "title_similarity": "0.7333634",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h9qyccx",
            "score": 2,
            "text": "Fuck you, twitter. Give the man what he deserves",
            "title_similarity": "0.5708326",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h9r079b",
            "score": 3,
            "text": "Thank god that’s all he’s trending for, I was scared he died.",
            "title_similarity": "0.62646186",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h9r0xku",
            "score": 1,
            "text": "Show biz is fucky but at least they’re organized.",
            "title_similarity": "0.3319298",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9r2ysm",
            "score": 1,
            "text": "Ooooooh somebody’s scared about folks unionizing and having actual power over their working lives\n\nBasically: You get the fuckin message devito? Good.",
            "title_similarity": "0.6208485",
            "sentiment_compound": 0.0679
        },
        {
            "id": "h9r35jr",
            "score": 2,
            "text": "It’s news worthy because it shows that Twitter is trying to discredit pro union opinions which when something as big and influential as Twitter starts actively suppressing the interest of the workers it’s very frightening. Something that’s original purpose was intended to allow anyone’s opinions and ideas be spread starts to censor ideas that don’t align with the companies is a super sketchy. When they kicked Trump off it was because he was spreading hate speech and misinformation that was killing people this is something entirely different and foreboding.",
            "title_similarity": "0.7145987",
            "sentiment_compound": 0.079
        },
        {
            "id": "h9r4dp5",
            "score": 2,
            "text": "Oh no! Not twatter? Fuck social media",
            "title_similarity": "0.5380843",
            "sentiment_compound": 0.484
        },
        {
            "id": "h9r52dr",
            "score": 2,
            "text": "Twitter, You dun fucked up.",
            "title_similarity": "0.54802275",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h9r77ao",
            "score": 1,
            "text": "“Checkmarks aren’t endorsements”",
            "title_similarity": "0.31468302",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9r7ita",
            "score": 1,
            "text": "So he’s not the real Danny Devito no more?",
            "title_similarity": "0.449943",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9r7mfk",
            "score": 1,
            "text": "SUPPORT THE STRIKERS!\n\nAlso, I assumed Devito was dead based on his trending. I'm happy he's not.",
            "title_similarity": "0.70791495",
            "sentiment_compound": 0.2003
        },
        {
            "id": "h9r8dua",
            "score": 1,
            "text": "Why? I thought the verification was meant so people didn't impersonate. Twitter is dumb af",
            "title_similarity": "0.6316145",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h9ri6w0",
            "score": 1,
            "text": "Ohhh noooo, what ever will he do? 🙄",
            "title_similarity": "0.36412176",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9rrazn",
            "score": 1,
            "text": "My question is...who in the flying FUCK cares about a blue check mark some website gives or doesn't give you? It's a social media website, not a security clearance. This shit is dumb as hell",
            "title_similarity": "0.601974",
            "sentiment_compound": -0.941
        },
        {
            "id": "h9rvn9d",
            "score": 1,
            "text": "Pathetic, shows what companies like Twitter really do with those marks",
            "title_similarity": "0.64165986",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9sfo0m",
            "score": 1,
            "text": "Wtaf that’s not what “verified” means. So what, now they’re saying that Danny Devito is not Danny devito? Then who the fuck is he?",
            "title_similarity": "0.5120853",
            "sentiment_compound": -0.594
        },
        {
            "id": "h9swnh2",
            "score": 5,
            "text": "Unrelated, but is anyone else’s front page not updating? For the past 24 hours this has been the top post for me, and every other post after it has also remained unchanging and in the exact same order.",
            "title_similarity": "0.36573064",
            "sentiment_compound": 0.296
        },
        {
            "id": "h9syuhp",
            "score": 1,
            "text": "So only \"appropriate\" protest will be allowed. Fuck Twitter and its twit censorship.",
            "title_similarity": "0.6926784",
            "sentiment_compound": -0.6969
        },
        {
            "id": "h9u0fjf",
            "score": 1,
            "text": "I stand with Danny. \n\nDidn’t buy any Nabisco at the store today.",
            "title_similarity": "0.6127518",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9u1jiw",
            "score": 6,
            "text": "Why has this been on the top of my popular for over a full day?",
            "title_similarity": "0.31515306",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h9ucxze",
            "score": 2,
            "text": "Didn’t he get it back already?",
            "title_similarity": "0.24056503",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9uem0g",
            "score": 1,
            "text": "I got a call one day from a number I didn't recognize so I let it go to voicemail. My voice to text read the message \"Hi this is Danny Devito...\"\n\nI played the message and it was actually a recorded message of Danny Devito calling on behalf of the teamsters union asking me to vote in the upcoming teamster election. Weird day.",
            "title_similarity": "0.72378296",
            "sentiment_compound": 0.25
        },
        {
            "id": "h9v45xf",
            "score": 6,
            "text": "Why is this like pinned to the top of popular lol I seen this shit like 50 times already smh",
            "title_similarity": "0.29932678",
            "sentiment_compound": 0.6399
        },
        {
            "id": "h9vbfex",
            "score": 1,
            "text": "I was so confused, I thought \"strike\" meant \"air-strike\" and I mis-read \"nabisco\" and thought maybe it was somewhere in Afghanistan. I am very dumb.",
            "title_similarity": "0.6376623",
            "sentiment_compound": -0.7955
        },
        {
            "id": "h9vdkga",
            "score": 1,
            "text": "Honestly it f anyone speaks up anymore everyone tries to cancel them. Found close that he said his peace y’all can let it be.",
            "title_similarity": "0.5619277",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h9vr3xh",
            "score": 1,
            "text": "https://www.reddit.com/r/popular/?geo\\_filter=GLOBAL",
            "title_similarity": "0.31904036",
            "sentiment_compound": 0.0
        },
        {
            "id": "h9vx8ue",
            "score": 2,
            "text": "God damn. Reddit is pretty steamed over this story.",
            "title_similarity": "0.4888712",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h9xc215",
            "score": 1,
            "text": "Legends need no verification.",
            "title_similarity": "0.3365116",
            "sentiment_compound": -0.296
        },
        {
            "id": "h9xjr76",
            "score": 1,
            "text": "I feel like the news should revolve more around what is happening about the strike?",
            "title_similarity": "0.51518124",
            "sentiment_compound": 0.25
        },
        {
            "id": "h9xq8oy",
            "score": 1,
            "text": "\"You've done well by your people, Danny\" -The Keebler Elves",
            "title_similarity": "0.18339485",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h9znbm6",
            "score": 1,
            "text": "Are there any high tech companies that have welcomed any Union into their shops?",
            "title_similarity": "0.39855605",
            "sentiment_compound": 0.34
        },
        {
            "id": "ha8eqdv",
            "score": 1,
            "text": "soo tired of tech censoring.",
            "title_similarity": "0.47770256",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hbt7qpy",
            "score": 1,
            "text": "“It’s okay everybody! NBC - who definitely does not receive advertising dollars from Nabisco - just published an article explaining everything. It was just a misunderstanding!” /s\n\nhttps://www.nbcnews.com/news/us-news/danny-devito-briefly-lost-his-twitter-verification-it-wasn-t-n1277255",
            "title_similarity": "0.7626972",
            "sentiment_compound": 0.6351
        }
    ]
}