{
    "Woman in video seen coughing on customers loses her job\n": [
        {
            "id": "hc7o0wi",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.23859353"
        },
        {
            "id": "hc7qxnu",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.23859353"
        },
        {
            "id": "hc7eliz",
            "score": -49,
            "text": "[removed]",
            "title_similarity": "0.23859353"
        },
        {
            "id": "hc87rkx",
            "score": -28,
            "text": "I’m right down the middle. Not right. Not left.  This lady is an asshole.",
            "title_similarity": "0.49428603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7bu9a",
            "score": 58,
            "text": "Charge her with using a biological weapon and ship her off to some secret black site prison….",
            "title_similarity": "0.39433652",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc7u3pn",
            "score": 16,
            "text": "This day and age that’s attempting murder.",
            "title_similarity": "0.37601537",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hc7mj6a",
            "score": -32,
            "text": "[removed]",
            "title_similarity": "0.23859355"
        },
        {
            "id": "hc7w6su",
            "score": -25,
            "text": "[deleted]",
            "title_similarity": "0.29731172"
        },
        {
            "id": "hc7tlvi",
            "score": -159,
            "text": "Her behavior is absolutely deplorable. My dad is currently in the ICU with Covid on a ventilator fighting for his life and I can’t express how much anger reading this post made me feel.\n\nOn another note, I think it’s really scary that social media essentially has enough power these days that your actions outside of work can affect your employment",
            "title_similarity": "0.53126395",
            "sentiment_compound": -0.8655
        },
        {
            "id": "hc7gorl",
            "score": 38,
            "text": "Okay but I'm gonna need some context here. Maybe her job was to cough on customers. If so, this is *bullshit*!",
            "title_similarity": "0.57636404",
            "sentiment_compound": -0.722
        },
        {
            "id": "hc7fb60",
            "score": 66,
            "text": "I think we are at a point where we deny healthcare for COVID-19 to any adult who is unvaccinated when no medical condition prevented them from getting the vaccine.\n\nYes it's harsh and horrific but hospitals are now having to limit or postpone care to people with other conditions (heart attack, stroke, needed surgeries that require intensive care afterwards etc) because the ICUs are filling up with people who refused to get the vaccine when no medical condition prevented them from taking it. Leave the ICUs for people who were not able to get the vaccine due to medical conditions, under 18 and parents didn't allow it, & children under 12 who are not able to be vaccinated.\n\nWe're punishing people who aren't medically able to get the vaccine, or are vaccinated & then face a health crisis or need surgery for people who do not give a f*ck about the rest of us and whose actions are putting ALL of us at further & further risk.",
            "title_similarity": "0.48660964",
            "sentiment_compound": -0.9442
        },
        {
            "id": "hc7hj8a",
            "score": 3,
            "text": "I assumed this video was from last year when this crap started. I did t know people were still doing it.",
            "title_similarity": "0.32482392",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hc8hlot",
            "score": -10,
            "text": "Oh no cancel culture got her. Anyway.",
            "title_similarity": "0.36682338",
            "sentiment_compound": 0.1877
        },
        {
            "id": "hc85kgh",
            "score": -6,
            "text": "In the latest update, the police say that the internet initially misidentified and harassed an innocent woman who has made a complaint to police…\n\nWhat it doesn’t clarify is if the woman who was fired in an earlier update is the actual horrible person or the one who was misidentified.  Does anyone have a clarification?",
            "title_similarity": "0.65692663",
            "sentiment_compound": -0.886
        },
        {
            "id": "hc8smnm",
            "score": 8,
            "text": "Hello Ma'am, please note you have been coughing on me in three separate instances of escalation where I have been clear to leave my space and me and my family alone.  My lawyer has advised me that you are now considered to be endangering the life of me and my direct family.  *pop pop pop*",
            "title_similarity": "0.6570756",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hc8y075",
            "score": 4,
            "text": "All these people on the twitter thread complaining about SAP taking a day to fire her, clearly have never worked in a corporation before despite their claims otherwise. If I was employed I'd like to know that the company took longer than a day to investigate the issue and get my side of the story before firing me. \n\nAll these people seem to forget that it could happen to them too.",
            "title_similarity": "0.628644",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hc7s2i8",
            "score": 9,
            "text": "Let me guess- it's the Democrats' fault?",
            "title_similarity": "0.40844083",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hc8ogv7",
            "score": -7,
            "text": "At least she still has her big, giant tits for seedy strip club openings. They WANT you to breathe on them!",
            "title_similarity": "0.40276992",
            "sentiment_compound": 0.1091
        },
        {
            "id": "hc803iz",
            "score": -55,
            "text": "I get it. She definitely deserves the hate. However I can't help that one day this will end wrong. I mean this woman seems unstable enough to murder-suicide her kids because she lost her job.\n\nShe is a cunt though.",
            "title_similarity": "0.7322724",
            "sentiment_compound": -0.924
        },
        {
            "id": "hc7t5wy",
            "score": -1,
            "text": "I thought it was allergies",
            "title_similarity": "0.2872523",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7z0hl",
            "score": -27,
            "text": "Is this another egregious failure of our corrupt government allowing capitalism to make the rules?  Should not our governments (at whatever level) deal with public health issues, and restrict the actions of dangerous individuals, rather than relying on the corporations to determine the laws and enforcement thereof?",
            "title_similarity": "0.37922055",
            "sentiment_compound": -0.8541
        },
        {
            "id": "hc8q9cs",
            "score": 1,
            "text": "Nobody working for $AP is paid chump change, the company's logo stands for Send Another Payment.",
            "title_similarity": "0.4217431",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7norh",
            "score": 11,
            "text": "Intentionally cough on me and I intentionally crush your trachea. Treat that shit as bioterrorism, especially during a pandemic.",
            "title_similarity": "0.5728232",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hc7tzpy",
            "score": 15,
            "text": "I would've knocked her the fuck out in self defense.",
            "title_similarity": "0.4650386",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hc8djdp",
            "score": -7,
            "text": "Choo choo here comes that /r/persecutionfetish train!",
            "title_similarity": "0.3455251",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8h01s",
            "score": -8,
            "text": "EXCLUSIVE!!!!!\nMAGA HQ assessment brief on this video …\n\nBOOBS: Outstanding. Base will love them. Wish MTGreene had these hooters. \nVOICE: Annoying. Work on lowering register. The Sarah Palin lesson again; fingernails/chalkboard — big miss!\nHAIR: Mousy. Needs pro coloring and cut. MTGreene and Dog the Bounty Hunter show it's been done and no one likes it. \nWARDROBE: Boobs need all attention, favor deep necklines; upper arms flabby; avoid sleeveless. \nLANGUAGE: Lazy, uninformed, easy target for media; needs schooling on stupid rhetoric. \nPROSPECTS: Could be mayor of dip shit town, perhaps state rep in GA, FLA, MS, AL, SC. \nthreats: Prone to unwanted pregnancy by dude with hottest Mustang in town. Careful about relocation. (i.e. too many hot guys and hot cars is a bad mix for her. She'll chase dick and horsepower.)\nRECOMMENDATION: Sign her. We'll find a place to make her matter. Those BOOBS! MAGA loves boobs.",
            "title_similarity": "0.44561836",
            "sentiment_compound": -0.8039
        },
        {
            "id": "hc97cgb",
            "score": 3,
            "text": "What did she do? What was she fired from?",
            "title_similarity": "0.5434484",
            "sentiment_compound": -0.6072
        },
        {
            "id": "hcacnqd",
            "score": 2,
            "text": "\nThis is the funniest thing I’ve read all night!!!",
            "title_similarity": "0.20739788",
            "sentiment_compound": 0.6679
        },
        {
            "id": "hc7of5y",
            "score": -133,
            "text": "Honest question. (Yes I think she is an asshole and WTF was she thinking) Did she deserve to lose her job?  What if she was actually nice to her coworkers and good at her job?  Does SAP have grounds for termination? It’s not like she was out shopping with an SAP shirt on - people did some sleuthing to figure out she worked.",
            "title_similarity": "0.68877983",
            "sentiment_compound": 0.4399
        },
        {
            "id": "hc7z0qm",
            "score": 20,
            "text": "Her tRump induced power-trip came to a proper conclusion.",
            "title_similarity": "0.2202584",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7w5se",
            "score": 14,
            "text": "Lucky she was not arrested as well.",
            "title_similarity": "0.32548207",
            "sentiment_compound": 0.5484
        },
        {
            "id": "hc7d346",
            "score": 25,
            "text": "And she'll never hold a job again ... as soon as anyone Googles her as a perspective employee she's done.",
            "title_similarity": "0.61237586",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7w8c6",
            "score": -64,
            "text": "We live in a wild timeline where corporations are the \"parents\" and social media users run to the corporations to discipline the misbehaving children. \n\nI feel like she should have been shamed, which she was. I feel she should have been banned from the store, which I can only hope happened (or is happening). Fired though? It's a firm reminder that being an employee lasts far past your timesheets!",
            "title_similarity": "0.64606726",
            "sentiment_compound": -0.8313
        },
        {
            "id": "hc7fdoj",
            "score": 2,
            "text": "But she looks so happy…",
            "title_similarity": "0.10684726",
            "sentiment_compound": 0.0
        },
        {
            "id": "hca0tvd",
            "score": 0,
            "text": "Let me think…. Her name is probably Karen isn’t it?",
            "title_similarity": "0.20640033",
            "sentiment_compound": 0.0
        },
        {
            "id": "hccv6un",
            "score": 0,
            "text": "Fucking ridiculous cunt",
            "title_similarity": "0.31016493",
            "sentiment_compound": -0.7408
        },
        {
            "id": "hc7tlfa",
            "score": 9,
            "text": "Now get her with attempted murder. Let her rot in a cell with the rest of the criminals.",
            "title_similarity": "0.5262153",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hc7t77e",
            "score": 17,
            "text": "Lucky how she ONLY lost her job. Cranky bitch did a whole felony there.",
            "title_similarity": "0.7444873",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hc7wd7e",
            "score": 16,
            "text": "r/iamatotalpieceofshit\n\nespecially in the second part of the video.",
            "title_similarity": "0.22014603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc88rci",
            "score": -17,
            "text": "She didn’t lose her job, she owned the libs.",
            "title_similarity": "0.28979436",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hc7rvpk",
            "score": -42,
            "text": "[deleted]",
            "title_similarity": "0.29731172"
        },
        {
            "id": "hc81x5p",
            "score": -37,
            "text": "While this lady is a grade A certified idiot, I don't think losing her job is appropriate. but I guess it's their decision to fire her. Employers are not baby sitters or the jury. Especially off the clock. I do not think we really want to establish that precedent. \n\nThis dam store should kicked her out with law enforcement on the way if she didn't leave her cart in place and walk out. \n\nThe people filming should have noped out of there too. Instead of entertaining crazy Karen. They should press charges and let her be punished properly.",
            "title_similarity": "0.599345",
            "sentiment_compound": -0.815
        },
        {
            "id": "hc7qm98",
            "score": -45,
            "text": "Great advice from the BeforeFore times: \n\n“...hate doesn’t beat hate. It’s never f***ing beaten hate. It just makes more hate. Now this just might be the most hippie thing that ever comes out of my mouth. But it’s true. The only thing that can beat hate is love. Now, love doesn’t always beat hate. It doesn’t always beat hate. But it does do something. And that is this: Eventually, everyone will see them as the a**hole. Don’t be the a**hole\"\n- comedian Jim Jefferies",
            "title_similarity": "0.34160456",
            "sentiment_compound": 0.6018
        },
        {
            "id": "hc81wdr",
            "score": 5,
            "text": "She should be in jail",
            "title_similarity": "0.28719252",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7z7e4",
            "score": 18,
            "text": "I think we have found our next RNC keynote speaker!",
            "title_similarity": "0.17460275",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7ssvy",
            "score": 11,
            "text": "r/byebyejob material here",
            "title_similarity": "-0.040743038",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7uoal",
            "score": -26,
            "text": "Why are people so obsessed with this?",
            "title_similarity": "0.15488996",
            "sentiment_compound": -0.3052
        },
        {
            "id": "hc7xwy4",
            "score": -59,
            "text": "This mob justice fetish is sickening.\n\nEDIT: So is the glee and joy with which people engage in these witch hunts.",
            "title_similarity": "0.48645893",
            "sentiment_compound": 0.8467
        },
        {
            "id": "hc7iq5c",
            "score": -103,
            "text": "How about we stop “canceling” these idiots or celebrating them losing their jobs and instead see them charged with assault instead? This is simply digital lynching and I can’t believe every comment here seems to celebrate it with a sharpened pitchfork, completely oblivious which century we’re supposedly in.",
            "title_similarity": "0.5405246",
            "sentiment_compound": -0.25
        },
        {
            "id": "hc7ttlj",
            "score": 14,
            "text": "The brain rot of these antivaxx, usually far right idiots, is incomprehensible. I cannot understand how you get this absurdly repulsive. Glad she faced some actual consequences for her disgusting behavior.",
            "title_similarity": "0.5347011",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hc7gm3u",
            "score": 6,
            "text": "Hope she’s still got that winning smile!",
            "title_similarity": "0.19867983",
            "sentiment_compound": 0.8439
        },
        {
            "id": "hcaz9pz",
            "score": 6,
            "text": "Can I admit something?\n\nAt the beginning of the Covid, February 2020, I was driving for Uber in Los Angeles to pick some much needed extra cash up.. it was a thankless job that I liked at first, but eventually, it wore so heavily on me.. not the actual work.. but the people. The people are so… dehumanizing… youre just a prop to them. Someone there to facilitate a service, a cheap service, and that’s it.\n\nAfter a thousand rides, I almost lost faith in humanity. And I really like people, and that was just working that job. People think they own you because they are paying you two dollars to drive them somewhere. \n\nBut my entire life was falling apart. My relationship tanked, my mental health dove, my roomies were drug addicted assholes who sold cocaine out of their room and fucked loudly every day. I was alone and miserable .\n\nI was dying.\n\nEnter Covid.. and by god here we are in September 2021 and STILL half this country thinks it’s fake. \n\nBut I never did. My friends are Italian. I was just in Italy, I KNEW what was coming. And I told everyone. I told them literally this:\n\nThis thing is coming, it’s going to shut down the world for over a year and then there will be forced vaccines (great) at some point. And a lot of people will die.\n\nThat’s literally what I understood immediately.\n\nThen… it happened. \n\nI fucking snapped. My roommate and his girlfriend had a huge fight and she stormed off only to show up a week later with friends and “clients” strangers who hair she was cutting in my place like it was a fucking barber shop.. i  went nuts. Like nothing had happened. With a key. To my place. With strangers. In a pandemic. I literally lost it.\n\nI freaked out on my friends girl and said everything I ever wanted to… not pretty shit. Packed all my shut, lost everything, bought a motorcycle and rode around the USA for four months. \n\nHere was the point of this post…\n\nMy mental health was not okay… and people kept pushing and pushing me…\n\nI turned off my passenger pick up and decided that I’d only be doing food delivers now.. people needed them and I didn’t have to run the risk of getting Covid..\n\nThe last run I had saw me at Chick-fill-A picking up someone’s sandwich… well.. someone tried to fight me and guys… I was in such a horrible state that I didn’t even move when he swung at me. My hand was on my pocket knife the entire time and I thought, he has no\nIdea who I am and what I’m going through. And I was serious that if I actually felt threatened by him I would have no probably stabbed him. That’s where I was. \n\nHe connected with my head and I didn’t even flinch. I looked at him right in the eye and told him that I would kill him if he didn’t move. I was surprised I even held it together that well. \n\nHe believed me.\n\nNow here’s the point of the post:\n\nWe never know what’s going on with anyone. This guys wings at my face not knowing I was seconds away from putting a knife into him. \n\nMy last last Uber eats call ever was to Starbucks to pick up someone’s 4 dollar ice tea. \n\nThe delivery line was wrapped around the block and they wouldn’t let me in to just grab the drink\n\nI had just spent literally two months telling everyone that a pandemic was coming and no one believed me. People would laugh at me.\nAnd now people are panicking and buying toilet paper and waiting for two hours in line to get a fucking Starbucks.\n\nI wasn’t going to wait. I was probably going to get paid one dollar for this trip. \n\nRemember the video of the Uber driver crying after he only got a dollar tip?\n\nThat’s driving Uber. And Thats IF We get tips.\n\nSo I go to the window and ask the guy: please can you just hand me the already paid for drink\nSo I don’t have to wait an hour to make a dollar…\n\nAnd what does the Starbucks employee do??\n\n\nHe laughs at me. In my face. And told me to\nStop being selfish and wait in line.\n\nI saw red. I had to\nPhysically stop myself from\nHurling my metal cup through their window.\n\nBut what did I do? \n\nI coughed at him. Like in his direction and loudly and honestly… it was a not even conscious.. it was a fucking reflex that chose the least violent but most disturbing response to him.\n\nBecause again this was pre March 2020.. meaning.. basically no Americans even thought this was anything..\n\nSo he didn’t even flinch. He was more confused.\n\nI always always always think about this… and think.. man… I’m not proud of anything I did then during my episode but I also don’t blame myself for having a mental health crisis.. but truly… and most importantly.. I’m glad there’s no video of that to be online and have a bunch of trolls destroy me a second time and then try to take my life from me again after I’ve rebuilt it by telling me who I am and whatever. \n\nA mental health episode is obviously not the same thing as a woman willfully and selfishly walking around acting like an entitled asshat.\nThis is beyond disgusting behavior but I just had to share this story of vulnerability because truly.. nothing is black and white and we have zero conception of what anyone is going through at any point in time.",
            "title_similarity": "0.41547197",
            "sentiment_compound": -0.9958
        },
        {
            "id": "hc8c03o",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.23859353"
        },
        {
            "id": "hc7tqi5",
            "score": 1,
            "text": "I could only hope this lady was the lead programmer for their business expense app and now will need to be replaced. Thus bringing in someone to create an app that isn't complete trash like this lady.",
            "title_similarity": "0.43571836",
            "sentiment_compound": 0.4386
        },
        {
            "id": "hc7u8wz",
            "score": -1,
            "text": "They were strangers, it sounds like she was employed at the store. She was a customer as well.",
            "title_similarity": "0.41962287",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hc81nv1",
            "score": 1,
            "text": "She was also arrested.",
            "title_similarity": "0.3933175",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hc8a11v",
            "score": 1,
            "text": "I wonder if she will ever get the psychological help she is so in need of. It feels good to hear there was some negative consequences for her horrendous behavior, but she's just going to get worse if there isn't some sort of help given to her.",
            "title_similarity": "0.47702885",
            "sentiment_compound": -0.4569
        },
        {
            "id": "hc8e3gp",
            "score": 1,
            "text": "I didn’t realize this was r/justiceserved",
            "title_similarity": "0.12609",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8mui0",
            "score": 1,
            "text": "This is the exact reason we need covid.",
            "title_similarity": "0.022357926",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8ng6s",
            "score": 1,
            "text": "Loses job? Please tell me she has black eyes & likely concussion. (Deserved)",
            "title_similarity": "0.65646607",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8qfum",
            "score": 1,
            "text": "I’m on the other side of this spectrum, but please do not do this. I even find that fucked up",
            "title_similarity": "0.26629978",
            "sentiment_compound": -0.631
        },
        {
            "id": "hc8rgvg",
            "score": 1,
            "text": "Someone upload a reaction video of her being canned to pornhub.",
            "title_similarity": "0.5544528",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8yx9k",
            "score": 1,
            "text": "Why the yummy ones gotta be crazy, clueless and insensitive. I welcome them down votes.",
            "title_similarity": "0.4012033",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hca13wh",
            "score": 1,
            "text": "FYI coughing has nothing to do with allergies.",
            "title_similarity": "0.27847946",
            "sentiment_compound": 0.368
        },
        {
            "id": "hcavpn7",
            "score": -1,
            "text": "She's kinda cute.  She can cough on me all day if she wants....",
            "title_similarity": "0.43027702",
            "sentiment_compound": 0.4033
        },
        {
            "id": "hccv5iz",
            "score": -1,
            "text": "So none of the 'victims' or harassed in the video pressed charges or complained to police?",
            "title_similarity": "0.25647682",
            "sentiment_compound": -0.746
        },
        {
            "id": "hc7sjso",
            "score": 8,
            "text": "bUt Mah FrEeDoM oF SpeEch!",
            "title_similarity": "-0.023858856",
            "sentiment_compound": 0.7959
        },
        {
            "id": "hc80enb",
            "score": 9,
            "text": "This literally fits the definition of bioterrorism.",
            "title_similarity": "0.056432452",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8g4ap",
            "score": -5,
            "text": "this has over three thousand comments and the video of a woman wearing a gorilla mask throwing an egg at a black man running for office then assaulting someone who tried to stop her has 8 comments ? whats wrong with you people? you make more than 8 comments when a golden retriever farts on camera.",
            "title_similarity": "0.5081859",
            "sentiment_compound": -0.8385
        },
        {
            "id": "hc8ghqx",
            "score": -9,
            "text": "She has some solid points",
            "title_similarity": "0.072348356",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hc8v7cd",
            "score": -8,
            "text": "Ah yes, social credit coming soon.",
            "title_similarity": "0.021425502",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hc7fado",
            "score": 15,
            "text": "Some incidents make me wonder if outlawing public beatings was too hasty",
            "title_similarity": "0.3428577",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7xloj",
            "score": -25,
            "text": "[deleted]",
            "title_similarity": "0.29731172"
        },
        {
            "id": "hc7tt6s",
            "score": 9,
            "text": "She'll be hailed as some kind of Republican hero by the end of tomorrow.",
            "title_similarity": "0.21681184",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hc8amtl",
            "score": -7,
            "text": "Joy Behar was fired from The View?\n\nNo way!",
            "title_similarity": "0.52291703",
            "sentiment_compound": -0.3164
        },
        {
            "id": "hc7twgs",
            "score": 2,
            "text": "Of course it’s some Karen-looking bitch.",
            "title_similarity": "0.4285321",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hc7xm2u",
            "score": 2,
            "text": "Like I stated before “what a huge cunt”. Now she needs her house egged….",
            "title_similarity": "0.415267",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hc83zb4",
            "score": -2,
            "text": "Doesn't even matter, people like that can walk into anywhere and be hired.",
            "title_similarity": "0.115321815",
            "sentiment_compound": 0.3455
        },
        {
            "id": "hc840oc",
            "score": 2,
            "text": "Ayy I'm working on a partner project with SAP right now.  Good on them 😁",
            "title_similarity": "0.16292623",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hc84csn",
            "score": 2,
            "text": "i would've backhanded that bitch in the face. She assaulted first.",
            "title_similarity": "0.55731297",
            "sentiment_compound": -0.802
        },
        {
            "id": "hc8cd9p",
            "score": 2,
            "text": "Some hot Karen-on-Karen action there....",
            "title_similarity": "0.1306656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8dbx9",
            "score": 2,
            "text": "Good!\n\nThose losers are never going to listen or appeal to basic human decency, science, etc. Only option is to hit them in their bank account.",
            "title_similarity": "0.42847124",
            "sentiment_compound": -0.2003
        },
        {
            "id": "hc8g14l",
            "score": 2,
            "text": "Can’t wait to see her on Fox News playing the victim and bitching about how she was cancelled by the deep state",
            "title_similarity": "0.66695344",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hc8n8gu",
            "score": -2,
            "text": "What was her profession?",
            "title_similarity": "0.23452128",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8pazz",
            "score": 2,
            "text": "Farting in public out of anger (or joy) isn't protected by the 1st Amendment either.",
            "title_similarity": "0.34141785",
            "sentiment_compound": -0.3195
        },
        {
            "id": "hc9239q",
            "score": 2,
            "text": "And just think if we were in a country with stronger workers’ rights, even these people probably wouldn’t be able to be fired so quickly. \n\nToo bad for them (who often don’t support these rights) that we aren’t, so they can just be fired at will by their employer for whatever.",
            "title_similarity": "0.45228723",
            "sentiment_compound": -0.7693
        },
        {
            "id": "hc9cxxq",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.29731172"
        },
        {
            "id": "hc9himd",
            "score": -2,
            "text": "Knock, knock. \nWho der?\nDeez. \nDeez who?\nDEEZ NUTZ!\nGOT IHM!",
            "title_similarity": "0.16948003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9on0o",
            "score": 2,
            "text": "I know this woman is not mentally in the right place, but despite the pandemic going on, if you coughed on someone in 2017, you can expect to be punched. Im not sure how this women didn’t realize this but she’s probably too blinded by her ego.",
            "title_similarity": "0.63697857",
            "sentiment_compound": -0.3491
        },
        {
            "id": "hcb1700",
            "score": -2,
            "text": "Oh no?! 😱\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDid I leave the stove on? 🤔",
            "title_similarity": "0.34246907",
            "sentiment_compound": -0.7685
        },
        {
            "id": "hcb25sy",
            "score": -2,
            "text": "Oh great, another victim of cancel culture from the left 🙄\n\n/s",
            "title_similarity": "0.40809363",
            "sentiment_compound": 0.25
        },
        {
            "id": "hcb3252",
            "score": -2,
            "text": "I welcome the experience. It strengthens my immune system.",
            "title_similarity": "0.08654364",
            "sentiment_compound": 0.802
        },
        {
            "id": "hcd2c1w",
            "score": 2,
            "text": "Fuck her, any COVID denier and fuck any conservative too.",
            "title_similarity": "0.5369683",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hc7yyqh",
            "score": -25,
            "text": "Losing her job, not just getting a warning? The only reason she is sacked is because the video went viral.\n\nWas it shitty behaviour? No doubt, but that was all it was, shitty behaviour. But getting sacked for something completely unrelated to her job in is a witch hunt.",
            "title_similarity": "0.70271075",
            "sentiment_compound": -0.9145
        },
        {
            "id": "hc87a0v",
            "score": -18,
            "text": "One day Reddit is crying about doxxing people other days they’re celebrating it lol.",
            "title_similarity": "0.6720382",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hc88ja7",
            "score": -18,
            "text": "Remember cancel culture doesn't exist.\n\nTerminating people's methods of paying their bills culture is also not a thing.\n\n\"Consequences for not being like me\"? Yea that's more politically correct. Eventually, enough consequences will force people to behave more like you and that will make life a lot more interesting and safe. If we can just keep incentivizing people to change who they are by vehemently enforcing these \"consequences\" maybe one day we will never have to worry about diseases.\n\nRemember, people don't like you because they wish they were you. They disagree with you because they're not as smart as you. For as long as you remember you're always right, there's nothing you can do that will make you lose sleep!\n\nNow get out there my fellow Social Justice Warriors, and lead us towards a safer, smarter utopia.",
            "title_similarity": "0.39778867",
            "sentiment_compound": 0.895
        },
        {
            "id": "hc7vtqv",
            "score": -10,
            "text": "When the cancel culture comes after your high pay job, LOL!\n\nClarifying what I meant to say, this bish probably salty as fuck knowing the very groups of people she likely can’t stand got her sacked! Definitely pro vax here.",
            "title_similarity": "0.6887106",
            "sentiment_compound": 0.2304
        },
        {
            "id": "hc7f22f",
            "score": -22,
            "text": "So at the beginning of covid in a broadcast school board meeting the school board were all coughing and suggested going and giving all the voters who opposed the latest levy ask of a 43% increase a great big kiss.  Only 2 of the 5 jerks resigned.",
            "title_similarity": "0.54573923",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hc7zbsq",
            "score": -24,
            "text": "I’m one who chooses not to get vaccinated. In saying this, I respect social distancing, washing hands, and limiting my exposure or exposure to others. I will say that I also do not wear a mask but respect those that choose too. I’m also a first responder prehospital that respond to Covid positive patients. When I’m at work, I wear mask gloves and decontaminate. Myself and equipment. This woman deserves what ever comes her way for imposing her wants and needs on others. Respectful of others is what the world needs more of…..",
            "title_similarity": "0.44288704",
            "sentiment_compound": 0.9382
        },
        {
            "id": "hc8i0fr",
            "score": -20,
            "text": "Cancel culture is so gross.",
            "title_similarity": "0.4083972",
            "sentiment_compound": -0.7177
        },
        {
            "id": "hc7moep",
            "score": -32,
            "text": "Did she get fired in result of this OR did she leave the company wayy prior to this and was a former employee?",
            "title_similarity": "0.61513996",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hc7irny",
            "score": 3,
            "text": "play stupid games, win stupid prizes.  simple",
            "title_similarity": "0.26689416",
            "sentiment_compound": 0.34
        },
        {
            "id": "hc7o3la",
            "score": 3,
            "text": "she has kraken lady face",
            "title_similarity": "0.29251337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7p7xs",
            "score": 3,
            "text": "Put her in gitmo this is a biological terrorist.",
            "title_similarity": "0.33780968",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hc7qn9r",
            "score": 3,
            "text": "Did she actually lose her job because of this though? The tweets just say the confirmed they no longer worked there. So was she fired because of this or left the company previously?",
            "title_similarity": "0.7661553",
            "sentiment_compound": -0.8452
        },
        {
            "id": "hc7u8ap",
            "score": 4,
            "text": "Fucked around, found out",
            "title_similarity": "0.30103815",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc7yogu",
            "score": 4,
            "text": "She should be fined a large amount or get an assault charge.",
            "title_similarity": "0.37267447",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hc7yu97",
            "score": 3,
            "text": "And now works for DeSantis 😏",
            "title_similarity": "0.11750384",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc846vd",
            "score": 4,
            "text": "How does this woman not get big ol' meaty slap to the face the moment she coughs on someone?",
            "title_similarity": "0.6815605",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hc855lu",
            "score": -3,
            "text": "Did she get fired because of this, or are they confirming she doesn’t work there? It could be 2 different things. Maybe she worked there up until a few months ago before all this?",
            "title_similarity": "0.5572413",
            "sentiment_compound": -0.6072
        },
        {
            "id": "hc8dqld",
            "score": 3,
            "text": "Trump would hire her as his Secretary of Defense or some stupid shit",
            "title_similarity": "0.35023844",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hc8nahx",
            "score": 4,
            "text": "Quick. Someone forward this to her states unemployment agency so she can’t claim UI.",
            "title_similarity": "0.4476598",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hc93dj8",
            "score": 3,
            "text": "Legit question: is it acceptable to fire someone for their behavior outside of the work place? She was **obviously** a horrible person and deserves all the shit coming at her (possibly legally), but, assuming she wasn't behaving like this at work, why would a company have to intervene? I understand it might be a problem on the corporate image, but why is there any link between her and the company when she's not working? I don't think that would be enough to fire someone in Europe.",
            "title_similarity": "0.63084686",
            "sentiment_compound": -0.8575
        },
        {
            "id": "hc94q6n",
            "score": -5,
            "text": "Well I’m just glad my employer can’t fire me because of social media. Signed an agreement specifically stating that.",
            "title_similarity": "0.41808933",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hcaalnl",
            "score": 4,
            "text": "I will never agree for people to lose their jobs because of their stupidity outside work. However, I think assholes like her should spend some time in prison, to learn how to behave in society. And the company can fire her, if she doesn't show up for work. 🤭",
            "title_similarity": "0.60601604",
            "sentiment_compound": -0.8888
        },
        {
            "id": "hc7wm6a",
            "score": 11,
            "text": "Doxing really is the only legal tool against these morons.",
            "title_similarity": "0.20948057",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hc7xbs6",
            "score": -12,
            "text": "How can a person take a cough that has happened before and try to blame the customer?\n\nYou all want to be fair and not have someone like this fired?",
            "title_similarity": "0.52510834",
            "sentiment_compound": -0.7594
        },
        {
            "id": "hc87kej",
            "score": -13,
            "text": "She is ignorant, and her behavior is unacceptable, but man I just dont like it when companies fire people for things on social media, some disciplinary action, days off with out pay…idk taking someones livelihood for a stupid decision is a bit much. I dont know, but on the other hand i simple cannot stand people like her that do that shit. People make mistakes, but play stupid games win stupid prizes.",
            "title_similarity": "0.6062284",
            "sentiment_compound": -0.9341
        },
        {
            "id": "hc7tikt",
            "score": 2,
            "text": "Iirc, she set up a GoFundme Page to explain how she was misunderstood and victimized. What did she honestly think would happen?",
            "title_similarity": "0.6052649",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc7twch",
            "score": 4,
            "text": "> \"I have allergies which make me cough!\"\n\n> --This lady's likely defense during her employer's internal investigation\n\nThis must've been an interesting conversation.  \n\n\"Oh, so you happen to smile when spitefully coughing on people after being confronted about not wearing a mask in a grocery store...because of your allergies?\"",
            "title_similarity": "0.66925675",
            "sentiment_compound": 0.2244
        },
        {
            "id": "hc7u1ac",
            "score": 4,
            "text": "If the gun-toting couple in St Louis taught us anything, the Nebraska GOP is going to make this woman a Congressional candidate within a week.",
            "title_similarity": "0.40508",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7uwvh",
            "score": 4,
            "text": "If some cunt coughs on me I'm punching her in the face.",
            "title_similarity": "0.6483433",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hc7vlhq",
            "score": 4,
            "text": "She should’ve lost her job even if this had happened back in 2019. That’s disgusting.",
            "title_similarity": "0.6375616",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hc7yt7w",
            "score": 5,
            "text": "I love seeing these people get theirs",
            "title_similarity": "0.05432317",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hc7yxx7",
            "score": 4,
            "text": "Good. That cunt also deserved a good slap in the face",
            "title_similarity": "0.3391218",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hc8913u",
            "score": -4,
            "text": "What’s Karen the Cougars @? I’m down to make a donation lol.",
            "title_similarity": "0.33178893",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hc8cwh8",
            "score": 5,
            "text": "Yeah SAP is way too big and has way too many hands in too many cookie jars for them to be seen as harboring someone like her. Hopefully she gets the book thrown at her on top of that. I've seen some people face bio-terrorism charges for knowingly coughing on people in these COVID times.",
            "title_similarity": "0.51552176",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hc8gy1u",
            "score": 5,
            "text": "I don’t get it. You wouldn’t do it before the pandemic why would you do it now?  Oh I have the flu, let me cough on you.",
            "title_similarity": "0.50725484",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hc8kbic",
            "score": 5,
            "text": "Omg with a face like that WHY ISNT SHE WEARING A MASK???!!!!!",
            "title_similarity": "0.32918802",
            "sentiment_compound": 0.6379
        },
        {
            "id": "hc8yh0b",
            "score": 3,
            "text": "Fuck that Republicunt",
            "title_similarity": "0.23011196",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hc7fsap",
            "score": 13,
            "text": "Now press assault charges ...",
            "title_similarity": "0.23303878",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hc82g3i",
            "score": -15,
            "text": "That lady is a cunt but fuck this culture of losing your job for shit you do in your personal life. There is a separation and if you come to work, excel, and do your fucking job that is all that should matter to an employer.\n\nAt what point does this stop? Do you know how many people are addicts at home but are functioning working adults that excel at work? \n\nThis culture is bullshit and if you aren't a public figure or in a very specific line of work where this may matter then fuck anyone that pushes for this.",
            "title_similarity": "0.6283699",
            "sentiment_compound": -0.9698
        },
        {
            "id": "hc7pw8n",
            "score": 15,
            "text": "“But her rights!!!!!!!!!!!”\n\n-some conservative asshole.\n\nI guarantee it.",
            "title_similarity": "0.25343207",
            "sentiment_compound": 0.4885
        },
        {
            "id": "hc7iq27",
            "score": 4,
            "text": "I'm going to go out on a limb and hypothesize that they were probably already looking to get rid of her.  Someone like that just doesn't turn off the crazy because they are at work.",
            "title_similarity": "0.49586922",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc7yogn",
            "score": 6,
            "text": "Pandemic or not. It will never be acceptable to just cough and spew bodily fluids over anyone.",
            "title_similarity": "0.44260922",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hc7z93l",
            "score": 5,
            "text": "Let’s say she legitimately has allergies that make her cough uncontrollably (she doesn’t), what happened to covering your mouth?  Coughing into your elbow?  Her behaviour is absolutely wild.",
            "title_similarity": "0.5807493",
            "sentiment_compound": -0.4329
        },
        {
            "id": "hc7zeri",
            "score": 6,
            "text": "Watch the GOP make her an honored guest at their next convention, just like the did with the MAGA lawyer who brandished an AR-15 at the BLM march that went by his house.",
            "title_similarity": "0.34534606",
            "sentiment_compound": 0.743
        },
        {
            "id": "hc8098s",
            "score": 5,
            "text": "Hi. Nebraskan here.\n\nHer losing her job isn't going to change the fact that super saver doesn't enforce their mask mandate.\n\nCan the internet PLEASE help me out here? I need some attention on this.  While I'm happy this vile woman has lost her job this could easily happen again.\n\nEdit: i don't mean upvotes. I mean just talk about in places where its relevant. Thanks.",
            "title_similarity": "0.52762866",
            "sentiment_compound": 0.8342
        },
        {
            "id": "hc80hm8",
            "score": -5,
            "text": "That will show her!! Reddit loves that shit!!",
            "title_similarity": "0.30876815",
            "sentiment_compound": 0.3111
        },
        {
            "id": "hc866ib",
            "score": -6,
            "text": "So… police say wrong woman was identified. Does that mean the wrong woman lost her job??\n\nI’m all for justice but internet vigilantism seems to more often hit the wrong target. \n\nThe lady is the video is gross and disgusting.",
            "title_similarity": "0.71565425",
            "sentiment_compound": -0.9502
        },
        {
            "id": "hc8a8yf",
            "score": -6,
            "text": "Was she at work when the video was made?",
            "title_similarity": "0.31253827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8debx",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.29731172"
        },
        {
            "id": "hc8jlt0",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.29731172"
        },
        {
            "id": "hcaww92",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.23859353"
        },
        {
            "id": "hc7annm",
            "score": 81,
            "text": "I guess she found out.",
            "title_similarity": "0.2401383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7xpby",
            "score": -19,
            "text": "Expect a Wrongful Termination Countersuit in 3… 2…\n\nEdit to say: to all the downvoters who don’t think a counter suit can happen - maybe I should have added /s to this - instead I guess I’ll say “kiss my shiny metal a%%!” 😝",
            "title_similarity": "0.5162085",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7ples",
            "score": 6,
            "text": "“How you get fired on your day off?!”\n\nLol fuck this stupid Karen. Have fun on welfare bitch😂😂",
            "title_similarity": "0.6389114",
            "sentiment_compound": -0.5707
        },
        {
            "id": "hc9agv2",
            "score": 7,
            "text": "Anti-Vaxxers are undeserving of employment, aid, and sympathy when they inevitably get sick and die.",
            "title_similarity": "0.66789836",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hc894e2",
            "score": -5,
            "text": "What would be the basis for firing her? I'm curious if she can sue SAP for this.\nTo clarify - her behavior is bad, but can businesses in USA fire someone based on their conduct outside of work? What could be their justification?",
            "title_similarity": "0.6127883",
            "sentiment_compound": -0.7131
        },
        {
            "id": "hc9ib18",
            "score": -6,
            "text": "I'm with masks and vaccines, but cheering on someone losing their job, dying, being terminally ill, or whatever else because they are on the wrong side of the culture war is fucked up",
            "title_similarity": "0.68039155",
            "sentiment_compound": -0.965
        },
        {
            "id": "hc9tldg",
            "score": -6,
            "text": "There's a job crisis going on right now. She can get two more jobs. In a week she won't care that this happened. She learned nothing",
            "title_similarity": "0.46696925",
            "sentiment_compound": -0.7736
        },
        {
            "id": "hc7clvn",
            "score": 44,
            "text": "She worked for SAP in Nebraska?",
            "title_similarity": "0.252505",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7js0z",
            "score": 41,
            "text": "This new trend of holding people accountable for their actions via video is very entertaining to say the least.\n\nAct right or get what’s coming to you.",
            "title_similarity": "0.25073504",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hc7b4gr",
            "score": 97,
            "text": "Karen in line to pick up her unemployment cheque:\n\n“Cough cough… coming through… cough cough, cough cough”",
            "title_similarity": "0.5337775",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hc7alm4",
            "score": 59,
            "text": "STUPIDITY....creating jobs everywhere!! She got what she deserved.",
            "title_similarity": "0.47981942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7dt3h",
            "score": 9,
            "text": "She clearly wanted to lose her job, and you hate to see her get what she wants, but she can't keep the job, either.  She's basically unemployable.\n\nJust another eager victim.",
            "title_similarity": "0.68912137",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hc7is5o",
            "score": 8,
            "text": "I really wanna see one of these videos where trashbags like this woman are smacked in the face as self-defence against a serious assault.\n\nPro-plaguers deserve to meet the wall.",
            "title_similarity": "0.5868962",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hc7m2c9",
            "score": 8,
            "text": "Good. You want to act like an animal? You’re going to get treated like one. Since she won’t wear her mask, I say we throw a cone/muzzle on her.",
            "title_similarity": "0.41133592",
            "sentiment_compound": 0.802
        },
        {
            "id": "hc7u5ou",
            "score": 7,
            "text": "My cynical guess is that she'll probably run for office on the back of this to stand up for \"conservative rights\" like those losers who waved guns at protesters in St. Louis did. I'm glad she got fired but unfortunately these people are heroes to the GOP.",
            "title_similarity": "0.5668514",
            "sentiment_compound": -0.1655
        },
        {
            "id": "hc80s8j",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.29731172"
        },
        {
            "id": "hc81311",
            "score": -9,
            "text": "Yep I have absolutely zero social media accounts with the exception of this one because an entire federal agency is keeping tabs on me. I ain't getting fired by the internet.\n\nEdit: I gotta work on my phrasing. I'm definitely not defending her nor do i act like an asshole in public considering I'm a public servant and that would get me fired. I was just saying I don't take the chance in the event I have a bad day and I'm grumpy because eyes are watching me.",
            "title_similarity": "0.48275965",
            "sentiment_compound": 0.124
        },
        {
            "id": "hc8afaz",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.23859353"
        },
        {
            "id": "hc7gnhs",
            "score": 42,
            "text": "Even without a pandemic, coughing and/or spitting on people is deplorable.",
            "title_similarity": "0.51819044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc80t29",
            "score": 9,
            "text": "She’ll be on Fox News next week discussing cancel culture",
            "title_similarity": "0.40664384",
            "sentiment_compound": -0.25
        },
        {
            "id": "hc7ico9",
            "score": 30,
            "text": "Well my Thursday evening just got better. \n\nBitch got what she deserved.",
            "title_similarity": "0.37908274",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hc7lb7n",
            "score": -30,
            "text": "Oh good, I'm sure this will help her mental health",
            "title_similarity": "0.25962883",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hc7tlkt",
            "score": 13,
            "text": "This woman has a law degree and was somehow working as an account executive.  What a winner.",
            "title_similarity": "0.3851074",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hc81wt3",
            "score": 13,
            "text": "Why don’t all the people calling other people sheep realize that *they* are also a sheep, with a different flock?\n\nLike. I’m wearing a mask to protect myself and others. If it turns out to be bs, I won’t feel foolish because all it was was wearing a piece of cloth on my face (and I’ve not been sick since 2019). \n\nThe beliefs they have that are shaping their behaviour is just like what the other side is doing. \n\nWe are all sheep in this scenario. \n\nDon’t call yourself a wolf and act like you’re woke and “know better” and “think for yourself”. You’ve just regurgitated the beliefs you wanted to go along with, fed to you by someone else. You’re not thinking critically. You just took a different side!",
            "title_similarity": "0.29525173",
            "sentiment_compound": 0.8748
        },
        {
            "id": "hc7a0c2",
            "score": 272,
            "text": "r/byebyejob bids you welcome",
            "title_similarity": "0.04039452",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hc7fnme",
            "score": 64,
            "text": "And now she'll be a guest speaker at GQP conferences and rallies. She'll be asked to appear on conservative podcasts and the like.",
            "title_similarity": "0.32722995",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc7hvve",
            "score": 14,
            "text": "Ida slapped the shit out of her face she did this near me.",
            "title_similarity": "0.67307377",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hc7v1dv",
            "score": -14,
            "text": "She’s a psycho, but she still a milf",
            "title_similarity": "0.42503637",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7d8tv",
            "score": 13,
            "text": "But I have AAAAWEGIIIES!1! *cries in unemployable*",
            "title_similarity": "0.27425605",
            "sentiment_compound": -0.629
        },
        {
            "id": "hc7eie4",
            "score": 16,
            "text": "She would have caught a hand so damn fast.",
            "title_similarity": "0.21039617",
            "sentiment_compound": -0.075
        },
        {
            "id": "hc7g829",
            "score": 17,
            "text": "Not surprising, she's from [Scottsdale](https://www.phoenixnewtimes.com/news/scottsdale-woman-goes-viral-for-coughing-on-masked-shoppers-at-nebraska-grocery-store-11963643),  AZ's faux-LA shithole.",
            "title_similarity": "0.54783285",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hc85kux",
            "score": -15,
            "text": "This woman was trying to make a point but in the worst way. I believe her point was, people have made it shameful to so much as clear your throat in public anymore. The slightest cough can trigger some people into fear, and that’s laughable to others. Everyone just needs to chill. Relax. It’s all going to be a ok.",
            "title_similarity": "0.64831144",
            "sentiment_compound": -0.8076
        },
        {
            "id": "hc8lnuv",
            "score": -19,
            "text": "[deleted]",
            "title_similarity": "0.29731172"
        },
        {
            "id": "hc7euqb",
            "score": 49,
            "text": "I wouldn't want some unhinged loose cannon working for me either.",
            "title_similarity": "0.23703887",
            "sentiment_compound": -0.3658
        },
        {
            "id": "hc7ctsj",
            "score": 192,
            "text": "She is lucky she didn't get sat the fuck down in the process.",
            "title_similarity": "0.38880846",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hc7j34g",
            "score": 23,
            "text": "This is concerning behaviour and it’s up to store management to put protocols in place to ensure customers adhere to protocols prior to entering the store. I live in Sydney where we have a current mask mandate. In order to go into my local supermarket, I have to be wearing a mask, show an employee sitting at a desk I have checked in with a QR code (something which I’m sure that would make a Karen like this go mental), and they provide hand sanitizer and wipes for shopping trolley handles and surfaces. If you don’t comply then you can’t shop there, but are perfectly free to utilise online shopping if you don’t wish to do so. Coughing on people and calling them sheep for following the health requirements doesn’t make one a patriot, it makes them a cunt.",
            "title_similarity": "0.38503033",
            "sentiment_compound": 0.9413
        },
        {
            "id": "hc7qedc",
            "score": -28,
            "text": "Should she be banned from this store. Yes!  Should she face criminal charges?  Absolutely!  Should a company impose termination for something you did off the clock that has no bearing on her employment nor a representation of employment such as wearing a uniform with the company logo?  A resounding no.  Let her lose her job the correct way, because she is in jail and can’t come to work.",
            "title_similarity": "0.6579233",
            "sentiment_compound": -0.916
        },
        {
            "id": "hc7gei2",
            "score": 26,
            "text": "And if either of those two come down with Covid, i hope they sue the crap out of Typhoid Karen here.",
            "title_similarity": "0.5894124",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hc7tj93",
            "score": 30,
            "text": "What an absolutely miserable cunt",
            "title_similarity": "0.39468718",
            "sentiment_compound": -0.7889
        },
        {
            "id": "hc7edq3",
            "score": 460,
            "text": "Unfortunately, she will probably learn nothing from losing her job and will continue to be an awful person.",
            "title_similarity": "0.63357043",
            "sentiment_compound": -0.4966
        },
        {
            "id": "hc7kw5e",
            "score": 51,
            "text": "WTAF  \n\n\nYa know... people might take the anti-maskers more seriously if they didn't insist on the name calling and assault.  If they just did their thing from a SOCIAL DISTANCE of 6 feet... I wouldn't give a rat's arse.  I'd think they were stupid.. but that's their call to make.    \n\n\nBut they don't.  It's always bitching, name calling, physical and mental invasion of my space... why?  Because I choose to wear a mask?  How does that hurt them?   \n\n\nI'm so sick of this bullshit.",
            "title_similarity": "0.48435855",
            "sentiment_compound": -0.9686
        },
        {
            "id": "hc7hbtu",
            "score": 137,
            "text": "“You guys are so cute.”  Yes, we are. And we also have jobs.",
            "title_similarity": "0.04083788",
            "sentiment_compound": 0.4549
        },
        {
            "id": "hc7dfz1",
            "score": 2146,
            "text": "She should be charged with assault and spend a few months behind bars. She probably never ever had to experience any criminal issues and a few months for her privledged ass will teach her a lesson.",
            "title_similarity": "0.40922764",
            "sentiment_compound": -0.91
        },
        {
            "id": "hc7a0l6",
            "score": 772,
            "text": "Well done, she sure showed all these sheeple a thing or two. \n\nlike how to lose your job.",
            "title_similarity": "0.6516985",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hc7czhx",
            "score": 4075,
            "text": "Ruining your career to own the libs.",
            "title_similarity": "0.5562539",
            "sentiment_compound": -0.25
        },
        {
            "id": "hc79w37",
            "score": 5132,
            "text": "Good, regardless of how you feel about the vaccine, masks or the virus her behavior was unacceptable.",
            "title_similarity": "0.4389499",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hc7gfaf",
            "score": 109,
            "text": "It’s really hard to feel bad for someone who behaves like this. Makes me wonder if SAP is relieved they finally had a good reason to fire her since I imagine her shitty behavior isn’t restricted to the grocery store.",
            "title_similarity": "0.5372684",
            "sentiment_compound": -0.6997
        },
        {
            "id": "hc7iqq8",
            "score": 291,
            "text": "[deleted]",
            "title_similarity": "0.29731172"
        },
        {
            "id": "hc7hk0t",
            "score": 1345,
            "text": "Legit question.  \n\nIf a person does this on purpose and I punch him/her in the face , will I get arrested? Or can I claims self defense due to covid or other illnesses (not counting the mental illness of said person)",
            "title_similarity": "0.49645507",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hc7c9qh",
            "score": 2801,
            "text": "Ah, so not only did she get out of control about not wearing a mask, she actually initiated the entire thing by berating random people for wearing masks. \n\nProbably makes fun of the \"sheep\" for not thinking sheep medication is the cure for Covid.",
            "title_similarity": "0.5658314",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hc7c72e",
            "score": 14959,
            "text": "Whether or not there is a pandemic, coughing on someone is so disrespectful, glad she lost her job.",
            "title_similarity": "0.7559973",
            "sentiment_compound": 0.2449
        },
        {
            "id": "hc7hyea",
            "score": 193,
            "text": "First I see the asshole that was bothering the women at the beach lost his job now this lovely lady. It is a good day. One wonders if either one regrets what they did or do they both feel like the victims now.",
            "title_similarity": "0.6888945",
            "sentiment_compound": 0.296
        },
        {
            "id": "hc81h7l",
            "score": 200,
            "text": "My mother in law is a manager at a sports shop. This woman came in refusing to wear a mask and was told she needed to put one on. She refused and was then told that no one would ring her up without one. She responded by dropping all her shopping and coughing in an employee’s face on her way out the door. Disgusting. They got her on CCTV and put up her picture to make sure they kick her out if she ever comes back. She had the exact same smirk on her face in the photo. Pandemic or not, can you imagine treating someone like that and believing you’re somehow in the right???",
            "title_similarity": "0.7740453",
            "sentiment_compound": -0.7383
        },
        {
            "id": "hc7cm05",
            "score": 12337,
            "text": "Wonder if she is a still smirking and thinking this is all a joke.",
            "title_similarity": "0.36526555",
            "sentiment_compound": 0.296
        },
        {
            "id": "hc7kdas",
            "score": 339,
            "text": "It wasn't even people instigating her first for not wearing a mask. She was the one bothering people for wearing a mask. Wtf.",
            "title_similarity": "0.43072462",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hc7uvjp",
            "score": 1605,
            "text": "Moving beyond how disrespectful this was— I am continually amazed that people are still stupid enough to do shit like this full well knowing that it’s 2021 and there is like a 99% chance that you *will* be dox’d and your personal life/career will bear the consequences",
            "title_similarity": "0.42304695",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hc7cpki",
            "score": 12,
            "text": "Dummy acts like a dummy in public and gets fired",
            "title_similarity": "0.63577986",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc7faq3",
            "score": 27,
            "text": "lol, the feel good story we all need in these times.",
            "title_similarity": "0.056582227",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hc7fe3m",
            "score": 2,
            "text": "she looks like she has had too much plastic surgery on her face",
            "title_similarity": "0.46261305",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc7floa",
            "score": 3,
            "text": "Tots, pears and good riddance.",
            "title_similarity": "0.14138623",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc7ftlx",
            "score": 28,
            "text": "Good for SAP, they lost an obvious liability.   Or, to be blunt? Act like an asshole, get treated like one.",
            "title_similarity": "0.447771",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hc7g7m7",
            "score": 2,
            "text": "I live right by this store, shop there, and it has been a wild ride watching this become viral. Anything famous about Nebraska is usually pretty embarrassing but we have a TON of people here that are like this, so I was never remotely surprised.",
            "title_similarity": "0.29071832",
            "sentiment_compound": 0.3718
        },
        {
            "id": "hc7gccb",
            "score": 20,
            "text": "I'm glad I wasn't the one being coughed on. \n\nI don't need assault charges and my patience for covid denial thing is negative.",
            "title_similarity": "0.23866189",
            "sentiment_compound": 0.4915
        },
        {
            "id": "hc7ghzw",
            "score": 49,
            "text": "Bet that wipes that shitty smile off her face.",
            "title_similarity": "0.480867",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc7gijp",
            "score": 12,
            "text": "Now that’s the kind of news I love to hear! I’m guessing her coworkers are probably also happy about this!",
            "title_similarity": "0.2819202",
            "sentiment_compound": 0.8585
        },
        {
            "id": "hc7h2sq",
            "score": 3,
            "text": "This pandemic has brought all of the stupid and toxic people out of the woodwork.",
            "title_similarity": "0.6706562",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hc7hdz5",
            "score": 5,
            "text": "Public ass-whippings need to make a come back.",
            "title_similarity": "0.31194407",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7hlm3",
            "score": 45,
            "text": "First strike was intentionally ignoring basic health and safety policies.  If you're ignoring the laws in public, why would we assume you follow them at work?  \n\nSecond strike was endangering and harassing people by trying to cough on them.  \n\nThird strike was that she followed them around the store spouting bullshit to convince them of her stance.  Why would any company risk letting someone like that represent them?  \n\nShe earned her termination for any of these three things.  She earned a solid punch in the face for the second and third, but it doesn't sound like she ever received it.",
            "title_similarity": "0.63193995",
            "sentiment_compound": -0.8034
        },
        {
            "id": "hc7hy05",
            "score": 3,
            "text": "Attempted murder charges are in order.",
            "title_similarity": "0.20691773",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hc7ia4k",
            "score": 2,
            "text": "I really don’t understand how these function, do they think using their asses? Even if you don’t believe in science it’s just very annoying behavior.",
            "title_similarity": "0.35830867",
            "sentiment_compound": -0.4576
        },
        {
            "id": "hc7iumv",
            "score": 3,
            "text": "Well deserved. Asshole.",
            "title_similarity": "0.15556875",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hc7iwne",
            "score": 2,
            "text": "Ok serious question since I’m not a cop or a lawyer but I thought that was considered assault? Would one be justified in knocking her out if she purposely coughed on them?",
            "title_similarity": "0.46085572",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hc7iyvu",
            "score": 3,
            "text": "Lucky she didn't lose her teeth as an added bonus.",
            "title_similarity": "0.289427",
            "sentiment_compound": 0.8205
        },
        {
            "id": "hc7iz8r",
            "score": 3,
            "text": "Ah, a small amount of my faith in humanity is restored. People like this should be publicly caned and pilloried.",
            "title_similarity": "0.43370157",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hc7jpyv",
            "score": 1,
            "text": "Good fucking riddance, I love seeing people pay for the consequences of their idiocy.",
            "title_similarity": "0.44043595",
            "sentiment_compound": 0.7884
        },
        {
            "id": "hc7k97v",
            "score": 2,
            "text": "What the fuck is with all these old farts commiting bioterrorism since covid started? I've heard more than one storing about an old man, an old lady, or even a 30-40 something purposely coughing on individuals.",
            "title_similarity": "0.57833886",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hc7kbox",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.23859353"
        },
        {
            "id": "hc7kfbp",
            "score": 2,
            "text": "How'd they figure out her identity?",
            "title_similarity": "0.14369968",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7kfe2",
            "score": 5,
            "text": "Wonder if she still has that shit eating grin on her face now :)",
            "title_similarity": "0.36200756",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc7knul",
            "score": 2,
            "text": "That is absolutely disgusting and honestly she should be charged for this",
            "title_similarity": "0.49109602",
            "sentiment_compound": -0.3025
        },
        {
            "id": "hc7kola",
            "score": 2,
            "text": "I feel like the intense “stand your ground” rules should be used against people like this.",
            "title_similarity": "0.27232432",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hc7kpzl",
            "score": 2,
            "text": "She was very successful in bring attention to herself and earning her KARMA.",
            "title_similarity": "0.40912992",
            "sentiment_compound": 0.624
        },
        {
            "id": "hc7ll93",
            "score": 1,
            "text": "When are these anti-social idiots going to learn that actions have consequences?\n\nOh yeah. they worship Trump, who hardly ever gets the deserved consequences for his sociopathic actions.",
            "title_similarity": "0.4171937",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hc7lnkc",
            "score": 2,
            "text": "Play stupid games, win stupid prizes. Congrats, moron.",
            "title_similarity": "0.35080552",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hc7lopu",
            "score": 7,
            "text": "I’d put money on the fact that HR already had issues with her but nothing they could fire her for, and this was a blessing in disguise.",
            "title_similarity": "0.44067526",
            "sentiment_compound": 0.6546
        },
        {
            "id": "hc7lp8g",
            "score": 4,
            "text": "That's assault and I would've retaliated. Would've made '80's Tyson proud. Easily convince 1 of 12 on a jury I \"feared for my life\".",
            "title_similarity": "0.35365143",
            "sentiment_compound": -0.128
        },
        {
            "id": "hc7lsgu",
            "score": 3,
            "text": "I bet if someone punched her in the throat for that they would of been facing jail time.",
            "title_similarity": "0.53574485",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7lvoj",
            "score": 1,
            "text": "Hahahahahahahahahaha well deserved",
            "title_similarity": "-0.012618149",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hc7lwhn",
            "score": 4,
            "text": "what an arrogant idiot! she should get banned from that store",
            "title_similarity": "0.5961666",
            "sentiment_compound": -0.8687
        },
        {
            "id": "hc7m3xc",
            "score": 3,
            "text": "Well well well if it isnt the consequences of your own actions.",
            "title_similarity": "0.08652431",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hc7m4zj",
            "score": 3,
            "text": "So, uh, is that job open or…? How much we talking?",
            "title_similarity": "0.055196293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7m56e",
            "score": 2,
            "text": "She is going to have a very hard time finding a new job. She probably thought she was not expandable at SAP",
            "title_similarity": "0.5108794",
            "sentiment_compound": -0.1761
        },
        {
            "id": "hc7m59a",
            "score": 14,
            "text": "I would slap that bitch so hard they'd have to surgically remove my hand from her face.",
            "title_similarity": "0.60628855",
            "sentiment_compound": -0.2183
        },
        {
            "id": "hc7mck9",
            "score": 3,
            "text": "Imagine the next job interview for her:\n\n“Why did you leave your last job?  Oh wait, You’re that Shithead from the video!!” \n\nHopefully She will be unemployed for a long time",
            "title_similarity": "0.67510545",
            "sentiment_compound": -0.4912
        },
        {
            "id": "hc7md2o",
            "score": 3,
            "text": "Justice Served in a silver platter",
            "title_similarity": "0.004767956",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hc7mwt7",
            "score": 5,
            "text": "Hmm I googled what exactly this crime is because I know it's something:\n\n&#x200B;\n\nWhen you do this to a Police officer it's very clear.\n\nAssault by Bodily Fluid, would be a 2nd-degree felony if a person intentionally or knowingly causes a law enforcement officer to come into contact with blood, seminal fluid, saliva, urine or feces, by tossing, throwing, spitting or expelling such fluid. This charge would carry a maximum penalty of 10 years imprisonment and a $25,000 fine.\r  \n\r  \nAssault by Bodily Fluid with Communicable Disease makes is a felony of the first degree for a person to intentionally or knowingly cause a law enforcement officer to come into contact with blood, seminal fluid, saliva, urine, or feces by throwing, tossing, spitting, or expelling such fluid when the person knew they had HIV or another communicable disease. A felony of the first degree carries a maximum penalty of 20 years imprisonment, and a $25,000 fine.\n\n&#x200B;\n\nAnyone know what the charges / punishment would be against a non police officer?",
            "title_similarity": "0.41900295",
            "sentiment_compound": -0.9867
        },
        {
            "id": "hc7n2kr",
            "score": 2,
            "text": "I’m sorry about the direct and predictable consequences of your own actions",
            "title_similarity": "0.31791157",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hc7n2wz",
            "score": 1,
            "text": "I would have loved to be the person firing her.",
            "title_similarity": "0.42296237",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc7n5fv",
            "score": 7,
            "text": "This country is rife with disturbed people.",
            "title_similarity": "0.3191808",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hc7n70e",
            "score": 3,
            "text": "I'm sorry but I would have tried to knock her out",
            "title_similarity": "0.49249804",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hc7n9dq",
            "score": 3,
            "text": "I would think that this rude woman is not laughing now that she has been exposed and fired from her job.  How could any person think this is the right way to behave?  I guess just a karen would.  I bet this karen thinks that somehow, she is the victim.",
            "title_similarity": "0.71909547",
            "sentiment_compound": -0.9028
        },
        {
            "id": "hc7ncvz",
            "score": 2,
            "text": "She has the eyes. They all have the eyes.",
            "title_similarity": "0.10799712",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7ner2",
            "score": 1,
            "text": "Totally worth it, right Karen?",
            "title_similarity": "0.044298917",
            "sentiment_compound": 0.2944
        },
        {
            "id": "hc7nnle",
            "score": 1,
            "text": "In the eyes of the law is there a difference between coughing and spitting on someone?",
            "title_similarity": "0.45931584",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7npjp",
            "score": 2,
            "text": "Okay, now charge her with assault. This woman is just going to get hired on at a senior level somewhere else.",
            "title_similarity": "0.5628729",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hc7nqmm",
            "score": 3,
            "text": "Seems she was having fun at the time at least.\n\n*coughcough giggle cough giggle*",
            "title_similarity": "0.31092602",
            "sentiment_compound": 0.836
        },
        {
            "id": "hc7oaf3",
            "score": 8,
            "text": "I love how responses to her original tweet were \"why didn't the employees do anything?\"  Lmao, yeah like people getting paid near minimum wage are going to police this issue when you have ACTUAL police who refuse to enforce mandates.",
            "title_similarity": "0.4933502",
            "sentiment_compound": 0.9169
        },
        {
            "id": "hc7offb",
            "score": 18,
            "text": "People like this think they're clever, but they're just terrible humans . . . and unemployed.",
            "title_similarity": "0.46217573",
            "sentiment_compound": -0.34
        },
        {
            "id": "hc7og7d",
            "score": 6,
            "text": "This can actually be a crime here, so is spitting on a person in certain situations. They are bodily fluids and they are considered a bio-waste. If I remember correctly the qualifier on it being a crime is if it was done with intent. \n\nKaren intended.",
            "title_similarity": "0.45136848",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hc7oh0z",
            "score": 3,
            "text": "r/byebyejob \n\nGotta love it. \n\nPandemic or not, you do that to me and I’m going to jail. Sweep the legs!",
            "title_similarity": "0.4696123",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hc7okqc",
            "score": 1,
            "text": "Could be charged with a crime.",
            "title_similarity": "0.09971544",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hc7omg1",
            "score": 2,
            "text": "I really wish we could see her reaction",
            "title_similarity": "0.35015768",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hc7ooe7",
            "score": 3,
            "text": "now for those criminal charges?",
            "title_similarity": "0.11669519",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hc7p5kj",
            "score": 10,
            "text": "Lol I bet that smile fell right off her smug face",
            "title_similarity": "0.4843334",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hc7p6mp",
            "score": 2,
            "text": "Good it's not the time to be doing stupid shit",
            "title_similarity": "0.13230237",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hc7p6vk",
            "score": 4,
            "text": "Allright everybody, say it with me: Play stupid games win stupid prizes.",
            "title_similarity": "0.44054437",
            "sentiment_compound": 0.34
        },
        {
            "id": "hc7pe5o",
            "score": 20,
            "text": "I know its wrong, but youre getting punched if you do that to me. I really don't think I would be able to restrain myself. This shit is so childish. I commend those people in the video for keeping their cool.",
            "title_similarity": "0.5017114",
            "sentiment_compound": -0.6084
        },
        {
            "id": "hc7pfoi",
            "score": 2,
            "text": "How about a few years in prison for good measure",
            "title_similarity": "0.17236651",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hc7piyc",
            "score": 3,
            "text": "What is wrong with human beings in 2021?",
            "title_similarity": "0.18444675",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hc7plgb",
            "score": 42,
            "text": "[Link to the original post with source/sauce video](https://reddit.com/r/PublicFreakout/comments/pjtgh0/karen_the_plague_rat_harasses_people_that_try_to/) for those out of the loop.",
            "title_similarity": "0.5470388",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hc7pm4n",
            "score": 2,
            "text": "She will most likely go to jail for this. Hope she enjoys the fame!",
            "title_similarity": "0.46669644",
            "sentiment_compound": 0.871
        },
        {
            "id": "hc7pobb",
            "score": 4,
            "text": "Haha. Fuck her. People like this need to experience consequences.",
            "title_similarity": "0.3851112",
            "sentiment_compound": 0.25
        },
        {
            "id": "hc7ppfg",
            "score": 3,
            "text": "Good. Even better than the Defcon 1 bitchslap she should have gotten right then and there.",
            "title_similarity": "0.34395003",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hc7px9q",
            "score": 20,
            "text": "Lol she was probably disliked at her job too",
            "title_similarity": "0.61892956",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc7qb1j",
            "score": 2,
            "text": "I would want to punch her in the face, but wouldn't want to get in trouble.\n\nI'd just steal her cart and then keep taking items from her cart as she tries to shop.\n\nYou want to be a disgusting human being? Fine, but you about to meet the pettiest bitch you've ever seen.",
            "title_similarity": "0.5796535",
            "sentiment_compound": -0.9644
        },
        {
            "id": "hc7qbys",
            "score": 1,
            "text": "This is justice porn of the highest quality",
            "title_similarity": "0.05656232",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hc7qdkb",
            "score": 19,
            "text": "She will of course lament cancel culture; confusing consequences and personal responsibilities for an attack by the 'left'.",
            "title_similarity": "0.5887662",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hc7qdyt",
            "score": 2,
            "text": "Cool. Now lock her ass up",
            "title_similarity": "0.25441742",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc7qh3f",
            "score": 3,
            "text": "One reaps what they sow. Wonder if she’s grinning like a fool now.",
            "title_similarity": "0.4338472",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hc7qhyk",
            "score": 1,
            "text": "She needs to get arrested as well.",
            "title_similarity": "0.36605185",
            "sentiment_compound": -0.25
        },
        {
            "id": "hc7qj81",
            "score": 5,
            "text": "People always have their freedoms but they do not have freedom from consequence.",
            "title_similarity": "0.10849625",
            "sentiment_compound": -0.6062
        },
        {
            "id": "hc7qlbj",
            "score": 2,
            "text": "Now she will just go into politics.",
            "title_similarity": "0.31519806",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7qpx5",
            "score": 3,
            "text": "Oddest thing, these ppl seem to instantly forget their lives, identities and responsibilities outside of the store/locale when they behave like this. If she was stalking these ppl in the store, it was most likely because she was feeling uncomfortable being the only one walking around maskless and thought she'd put in a pre-emptive strike bef she got tagged for it. #antimaskjackassesinthewild",
            "title_similarity": "0.6349647",
            "sentiment_compound": -0.25
        },
        {
            "id": "hc7r1kp",
            "score": 4,
            "text": "Welp. One less donor to SToP tHe sTeAL. 🤷🏻‍♂️",
            "title_similarity": "0.34459698",
            "sentiment_compound": -0.6293
        },
        {
            "id": "hc7rc0b",
            "score": 64,
            "text": "It’s the sanctimonious smirk she has that gets me. Deliberately reveling in terrifying someone else. You want to be an asshole & not wear a mask I can’t stop you. But chasing someone down and getting in their face to harass them because it pleases you? She needs the shit smacked out of her.",
            "title_similarity": "0.5452394",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hc7rcsr",
            "score": 2,
            "text": "She’s lucky they don’t press charges",
            "title_similarity": "0.2719985",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hc7rhzt",
            "score": 3,
            "text": "That was fast, that shit was posted last NIGHT",
            "title_similarity": "0.29856542",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hc7rizm",
            "score": 3,
            "text": "Let this be a message to all the fuckheads out there",
            "title_similarity": "0.3177073",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7rkle",
            "score": 1,
            "text": "Fuck with me, I take out your knee. Have a nice day 🤟",
            "title_similarity": "0.3955934",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hc7rt2h",
            "score": 4,
            "text": "I guess she just fake coughed away her health insurance.",
            "title_similarity": "0.62722296",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hc7rtqy",
            "score": 3,
            "text": "Her smugness in the video makes the end result so much sweeter.",
            "title_similarity": "0.2998989",
            "sentiment_compound": -0.34
        },
        {
            "id": "hc7rwor",
            "score": 4,
            "text": "A Punch in her face would've cleared up those allergies quick fast and in a hurry",
            "title_similarity": "0.36465865",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hc7rz99",
            "score": 2,
            "text": "that creepy ass smile deserve this\nhowever i doubt the authenticity of this news website",
            "title_similarity": "0.3831107",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hc7s2v3",
            "score": 4,
            "text": "I believe the headline should be “Woman in video seen coughing on customers loses all future jobs.”",
            "title_similarity": "0.863264",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hc7s46a",
            "score": 3,
            "text": "You dumb bitch.\n\nGot what she deserved. Good luck finding a job in this crazy market. Everybody and their mama trying to find a new job and nobody trying to hire a reputation liability like her.",
            "title_similarity": "0.551816",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hc7s7as",
            "score": 3,
            "text": "i love seeing these follow-up stories",
            "title_similarity": "0.061163247",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hc7sapv",
            "score": 2,
            "text": "Only lost her job? Why is she not in jail?",
            "title_similarity": "0.617836",
            "sentiment_compound": -0.3939
        },
        {
            "id": "hc7scu1",
            "score": 1,
            "text": "Why isn't there ever video of them getting fired? I love to see the face of someone completely used to skirting consequences finally get a sack of them right upside their damn head.",
            "title_similarity": "0.50310546",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc7sczs",
            "score": 3,
            "text": "Why is it so hard to just repext other people in public? I usually don't support hate mobs \"canceling\" people but JFC this is like spitting on people. Wtf is wrong with people?",
            "title_similarity": "0.5219958",
            "sentiment_compound": -0.8188
        },
        {
            "id": "hc7sj6a",
            "score": 2,
            "text": "Someone get her Ivermectin STAT!",
            "title_similarity": "0.169263",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7sla2",
            "score": 3,
            "text": "You’d have gotten fired for that pre-pandemic if your manager had half a brain. You have to be a special kind of dumbass to pull that shit during a pandemic",
            "title_similarity": "0.5322647",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hc7sly2",
            "score": 1,
            "text": "Have assault charges been filed yet?",
            "title_similarity": "0.12167696",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hc7spp5",
            "score": 3,
            "text": "The part that irks me about all this: the guy and his daughter were wearing masks, and the woman decided she needed to antagonize them over it.\n\nWhat business of hers is it whether they wore a mask? It's their choice. I don't go berating people for wearing/not wearing masks. It's not my business to know, and frankly, I'm okay with that.\n\nHope she thought antagonizing them was worth it. The minds she'll change...",
            "title_similarity": "0.5418723",
            "sentiment_compound": -0.25
        },
        {
            "id": "hc7spwj",
            "score": 1,
            "text": "Good . Now arrest her",
            "title_similarity": "0.29764065",
            "sentiment_compound": 0.128
        },
        {
            "id": "hc7sr77",
            "score": 2,
            "text": "Serious inquiry. If someone she coughed on punched her or shoved her away, would it be considered self defence or assault?",
            "title_similarity": "0.5768292",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hc7sx81",
            "score": 6,
            "text": "How will she pay for her fillers now",
            "title_similarity": "0.34607857",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hc7sxyp",
            "score": 2,
            "text": "Cough…. That is how your get fired … cough …",
            "title_similarity": "0.5376871",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hc7t0oi",
            "score": 5,
            "text": "They all have that same smile -- that somewhat bewildered, righteous, fake kindness.",
            "title_similarity": "0.09628931",
            "sentiment_compound": 0.3947
        },
        {
            "id": "hc7t0z6",
            "score": 5,
            "text": "\"What's this? The consequences of my own actions?\"",
            "title_similarity": "0.19215722",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7t154",
            "score": 3,
            "text": "Karma, karma, karma... Karma Chameleon.",
            "title_similarity": "0.26798618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7t5au",
            "score": 3,
            "text": "Look at how happy she is being hateful. This is not a good person.\n\nOne of the few good (but sad) things about this pandemic is how it peeled the veneer of politeness back to expose some extraordinarily awful people. We know who they are and we need never associate with them again.",
            "title_similarity": "0.6096088",
            "sentiment_compound": -0.8609
        },
        {
            "id": "hc7t78o",
            "score": 5,
            "text": "I genuinely wonder what happens in these peoples lives to get to this point. How does someone become so awful? How do they fall into these ridiculous conspiracy rabbit holes?",
            "title_similarity": "0.46195552",
            "sentiment_compound": -0.8786
        },
        {
            "id": "hc7tfrn",
            "score": 2,
            "text": "Is not it the \"right\" that's always whining about the loss of public civility?",
            "title_similarity": "0.47389835",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hc7tggf",
            "score": 6,
            "text": "Although I hate that this behavior is happening, I'm really loving the quick turn around on losing their jobs. Not wasting a lot of time ousting these people to their employers. Love to see it.",
            "title_similarity": "0.47659558",
            "sentiment_compound": 0.6543
        },
        {
            "id": "hc7thri",
            "score": 5,
            "text": "I would straight up punch that cunt in the face if she did this to me, let alone a kid in my care.",
            "title_similarity": "0.55815476",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hc7tlwt",
            "score": 2,
            "text": "Kicked out of the Garbage Pail Kids?",
            "title_similarity": "0.45505884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7tq8f",
            "score": 5,
            "text": "Enjoy unemployment you dumbass",
            "title_similarity": "0.42000854",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hc7tqxv",
            "score": 3,
            "text": "Déjà vu.  Didn't this happen early in the pandemic.  I looked at the dates, but I'm still skeptical.",
            "title_similarity": "0.28303805",
            "sentiment_compound": -0.4497
        },
        {
            "id": "hc7ts5l",
            "score": 12,
            "text": "Had she coughed on me that way I'd have throat punched her",
            "title_similarity": "0.57780206",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7tsa6",
            "score": 5,
            "text": "It's really shocking to see how many people are willing to stick up for the crazy lady harassing and assaulting a family.",
            "title_similarity": "0.6586027",
            "sentiment_compound": -0.9041
        },
        {
            "id": "hc7tvbb",
            "score": 4,
            "text": "Fired...she was straight up fired.. losing job makes it sound more not her fault, she acted like a fucking idiot and thankfully her employer isn't as stupid as she is",
            "title_similarity": "0.70090127",
            "sentiment_compound": 0.2426
        },
        {
            "id": "hc7u0uu",
            "score": 2,
            "text": "Plenty of fast food jobs available right now, enjoy",
            "title_similarity": "0.12234491",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hc7u33o",
            "score": 3,
            "text": "Wow! Ya if you purposely cough on me, man or woman, you'll get knocked the fuck out!",
            "title_similarity": "0.6434083",
            "sentiment_compound": 0.2225
        },
        {
            "id": "hc7u4rc",
            "score": 3,
            "text": "How stupid does someone have to be to cough on people?? I’d smack anyone who walked up and coughed in my face",
            "title_similarity": "0.59118766",
            "sentiment_compound": -0.5803
        },
        {
            "id": "hc7u4xb",
            "score": 3,
            "text": "But did she own the libs?  Was it worth it?",
            "title_similarity": "0.22596473",
            "sentiment_compound": 0.4039
        },
        {
            "id": "hc7ucxc",
            "score": 3,
            "text": "Makin' yourself live off government socialist benefits to Own the Libs",
            "title_similarity": "0.22237179",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hc7ue18",
            "score": 3,
            "text": "I was wishing the whole time someone would just smack her across her mouth..",
            "title_similarity": "0.5355912",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hc7uebq",
            "score": 3,
            "text": "And, sadly, there are a bunch of people out there defending her actions. SMH.",
            "title_similarity": "0.47995472",
            "sentiment_compound": -0.7034
        },
        {
            "id": "hc7ufyx",
            "score": 3,
            "text": "Honest question- by her coughing on them, what what happened if one of the victims ended up punching/pushing her? \n\nWould it be considered self defense at that point?",
            "title_similarity": "0.6441933",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hc7ug4b",
            "score": 2,
            "text": "It's what she deserves.",
            "title_similarity": "0.13243386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7ugdg",
            "score": 27,
            "text": "Well well well….\n\nIf it isn’t the consequences of my own actions",
            "title_similarity": "0.112174585",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hc7ulau",
            "score": 2,
            "text": "Theeeuuuyyyy tookkkkkkk heerrrrrr jroooobbbb",
            "title_similarity": "0.10552366",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7un1t",
            "score": 1,
            "text": "Sick Bitch in the head",
            "title_similarity": "0.6141072",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hc7unun",
            "score": 2,
            "text": "She should be arrested too",
            "title_similarity": "0.37087688",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hc7upav",
            "score": 2,
            "text": "Morale and social compass are so far off by her display I found her and folks like to be reprehensible.",
            "title_similarity": "0.5543418",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc7usj2",
            "score": 1,
            "text": "For those of you curious what her job was, it doesn't get specific but...\n\n>The woman was identified as an employee working in Arizona for the business software company SAP. On Wednesday, the company said that (after an investigation) the woman no longer works for the company.",
            "title_similarity": "0.617337",
            "sentiment_compound": -0.2846
        },
        {
            "id": "hc7uwbc",
            "score": 2,
            "text": "I thought this was considered terroristic threatening",
            "title_similarity": "0.29965866",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hc7ux6k",
            "score": 1,
            "text": "Good. She was so smarmy. She deserved it.",
            "title_similarity": "0.3851457",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc7uyib",
            "score": 1,
            "text": "Mmmm... Public shaming... (Actually surprised she's not facing assault, but at least she faced consequences.)",
            "title_similarity": "0.41323185",
            "sentiment_compound": 0.3582
        },
        {
            "id": "hc7uz7d",
            "score": 3,
            "text": "This behaviour is a result of a lifetime of entitlement and shielding form consequences. People like her never got punched in the face for running their mouth or assaulting people unprovoked.",
            "title_similarity": "0.43185008",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hc7v0k3",
            "score": 2,
            "text": "Oh man...didn't realize she went out of her way to harass those poor people (for wearing masks). WTF is wrong with people?",
            "title_similarity": "0.5135771",
            "sentiment_compound": -0.9317
        },
        {
            "id": "hc7v0tn",
            "score": 2,
            "text": "The maturity level of some people is just astonishing",
            "title_similarity": "-0.0056705736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7v16q",
            "score": 1,
            "text": "Even if someone did that outside of a pandemic I hope they’d be fired, what a lunatic lol",
            "title_similarity": "0.5111593",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc7v1zp",
            "score": 2,
            "text": "She should lose her teeth.",
            "title_similarity": "0.48798954",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hc7v4so",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.23859353"
        },
        {
            "id": "hc7v508",
            "score": 3,
            "text": "She's lucky she only lost her job and not half her teeth.  There are a lot of people that will beat the ever-loving shit out of you for doing that, rightfully so.",
            "title_similarity": "0.6140813",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hc7v6jx",
            "score": 2,
            "text": "Who even does this without a pandemic? Eugh…🤢",
            "title_similarity": "0.20972942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7v8qw",
            "score": 1,
            "text": "She contaminated everything around her.   When she coughed,spit particles landed everywhere!  Then to top it off she had that smug attitude. \nIt would have been *very* tempting to smack that smirk off her face!",
            "title_similarity": "0.6270545",
            "sentiment_compound": 0.4912
        },
        {
            "id": "hc7vbid",
            "score": 1,
            "text": "should go to jail tbh, that's assault..",
            "title_similarity": "0.3542883",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hc7vbjd",
            "score": 2,
            "text": "She should be arrested for assault.",
            "title_similarity": "0.39070487",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hc7vd81",
            "score": 1,
            "text": "When I saw the video I assumed they had asked her to put on a mask or something and that set her off. In that case she’d still be crazy but I could understand how her Qaren brain would cause her to react in that way.\n\nIf she really sought out someone to have an argument about a mask with…in a place with a mask mandate, that’s just over-the-top insanity.",
            "title_similarity": "0.54358166",
            "sentiment_compound": -0.875
        },
        {
            "id": "hc7vhm2",
            "score": 2,
            "text": "She had nothing to gain from coughing on people\n\nWhy do people want to be the bad guy/girl",
            "title_similarity": "0.61827785",
            "sentiment_compound": -0.7163
        },
        {
            "id": "hc7vhmw",
            "score": 6,
            "text": "Remember when Trump got the virus and then he came out in a press conference and was seen trying his best to hold in his coughing? I swear we’re living in an onion skit.",
            "title_similarity": "0.5075933",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hc7viff",
            "score": 3,
            "text": "How to fuck up your life in less than a week.\n\nAmazing isn't it?",
            "title_similarity": "0.3146844",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hc7vipu",
            "score": 2,
            "text": "Libs owned I guess. Dumbass.",
            "title_similarity": "0.3337878",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hc7vnob",
            "score": 3,
            "text": "Honestly she’s dumb. She had a good job at SAP but I don’t see how she’s not asking to get fired w that type of behavior",
            "title_similarity": "0.51158655",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hc7vnr2",
            "score": 3,
            "text": "I am actually surprised she had a job. With that entitlement she seemed like someone out of touch with real world and that psycho fcking smirk- gaahh.\nEDIT: a word",
            "title_similarity": "0.5505605",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hc7vo29",
            "score": 3,
            "text": "Well maybe just mind your own fucking business and don't harass people!",
            "title_similarity": "0.23420599",
            "sentiment_compound": 0.6149
        },
        {
            "id": "hc7vq02",
            "score": 6,
            "text": "She played a very stupid game and won the stupid prize.",
            "title_similarity": "0.537336",
            "sentiment_compound": 0.3197
        },
        {
            "id": "hc7vw4e",
            "score": 3,
            "text": "I'm not the violent type, but if anybody were to cough on me, they'd find themselves on the other side of a pimp slap",
            "title_similarity": "0.3718928",
            "sentiment_compound": 0.4539
        },
        {
            "id": "hc7w1em",
            "score": 5,
            "text": "So if someone intentionally coughs on a person during a pandemic can they punch them in the face in self-defense? Asking for a friend.",
            "title_similarity": "0.55472016",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hc7w3i1",
            "score": 5,
            "text": "Wonder if she still has a smug smile on that punchable face.",
            "title_similarity": "0.28206712",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hc7w4oq",
            "score": 3,
            "text": "How are there so many of these people who have literally no capacity to think about the consequences of their actions?  It's like an epidemic...",
            "title_similarity": "0.50630057",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hc7w8y0",
            "score": 3,
            "text": "Just down right a mentally sick person who has no sense of being a good citizen or neighbor. She needs to be ostracized from society for her actions. Loss of her job is her own doing. Her spouse and children, if any, should not be penalized for her actions.",
            "title_similarity": "0.6329257",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hc7w9ug",
            "score": 6,
            "text": "Surprised she’s not being charged",
            "title_similarity": "0.21015625",
            "sentiment_compound": 0.3595
        },
        {
            "id": "hc7wgil",
            "score": 2,
            "text": "Is this really done by a person that is seen as a professional in a high pay job?\n\nThe higher up you are, the more your outside of work action can have an impact on your career, how can she *not* know that?\n\nI hope nobody employs her after this either.",
            "title_similarity": "0.42610276",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hc7wifs",
            "score": 3,
            "text": "children learn about consequences at an early age.  What is this woman's problem?",
            "title_similarity": "0.3869465",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hc7wjbm",
            "score": 4,
            "text": "These news stories remind of that Daniel Tosh bit about how he doesn’t understand how most people have jobs, they are just barely smart enough to not show who they really are at work I guess.",
            "title_similarity": "0.43778476",
            "sentiment_compound": 0.3415
        },
        {
            "id": "hc7wnog",
            "score": 4,
            "text": "Her friggin smiling and dead eyes while doing it terrifies me",
            "title_similarity": "0.5256436",
            "sentiment_compound": -0.7069
        },
        {
            "id": "hc7wsec",
            "score": 3,
            "text": "Coughing on someone it pretty much assault. If you spit on someone it’s assault. Coughing is the same shit.",
            "title_similarity": "0.5129583",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hc7wst1",
            "score": 3,
            "text": "I would have loved to see her face when she got fired.",
            "title_similarity": "0.5299542",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hc7wv5d",
            "score": 2,
            "text": "I hate when people cough without covering their mouth. Was she vaccinated?",
            "title_similarity": "0.6009839",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hc7x0gy",
            "score": 3,
            "text": "Omg this makes me so happy, I saw that clip the other day",
            "title_similarity": "0.16819377",
            "sentiment_compound": 0.6948
        },
        {
            "id": "hc7x3fl",
            "score": 3,
            "text": "where are the criminal charges? this is assault",
            "title_similarity": "0.18200648",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hc7x5nv",
            "score": 3,
            "text": "The fact she has a law degree is insane to me. Maybe she didn't pass the bar anyway, but if she did I hope she gets disbarred.",
            "title_similarity": "0.46285403",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hc7x66k",
            "score": 2,
            "text": "Oh, she works at SAP? Well, I feel coughed on by them all the time.",
            "title_similarity": "0.6319742",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hc7x6iq",
            "score": 8,
            "text": "At this point in the pandemic, an open hand slap is completely acceptable for someone coughing in your face. It’s the bare minimum really.",
            "title_similarity": "0.34779382",
            "sentiment_compound": 0.7501
        },
        {
            "id": "hc7x6l6",
            "score": 1,
            "text": "How did she get away with it?",
            "title_similarity": "0.28056008",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7x6ss",
            "score": 2,
            "text": "I'm curious what she worked in.",
            "title_similarity": "0.21612562",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hc7x7f7",
            "score": 2,
            "text": "She’s so cute, losing her job and being twitter famous!",
            "title_similarity": "0.62048674",
            "sentiment_compound": 0.1795
        },
        {
            "id": "hc7x82l",
            "score": 3,
            "text": "Ironically, she too is unemployed because of COVID.",
            "title_similarity": "0.5926949",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7xboj",
            "score": 4,
            "text": "Let me guess, she blames cancel culture and cries that it only happened on the worst day of her life and is totally not like her.",
            "title_similarity": "0.7377959",
            "sentiment_compound": -0.9167
        },
        {
            "id": "hc7xdal",
            "score": 2,
            "text": "Kinda looks like a female version of Kenneth Copeland… coughing that “Covid” away. /s",
            "title_similarity": "0.59460366",
            "sentiment_compound": 0.3008
        },
        {
            "id": "hc7xdlr",
            "score": 4,
            "text": "I would pay good money to see the reaction video of her being fired.",
            "title_similarity": "0.45259362",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc7xg5x",
            "score": 8,
            "text": "I feel like if someone is chasing you down coughing on you during a pandemic you should be able to physically defend yourself. So tired of these fucking idiots getting away with literally anything.",
            "title_similarity": "0.58871657",
            "sentiment_compound": -0.3052
        },
        {
            "id": "hc7xi88",
            "score": 6,
            "text": "Man. Some people are just used to living their lives without consequences. \n\nIf she tried that in Buffalo she would have been dragggggged out.",
            "title_similarity": "0.30034578",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7xkwg",
            "score": 4,
            "text": "Definitely would have punched her if she did that to me.",
            "title_similarity": "0.47160858",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hc7xlhz",
            "score": 2,
            "text": "Why do they all look like this?   There is some genetic defect in all of these folks.",
            "title_similarity": "0.27661282",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc7xplq",
            "score": 3,
            "text": "Good for SAP, hopefully she won’t complain when she remains unemployed in the future",
            "title_similarity": "0.4658491",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hc7xr2a",
            "score": 5,
            "text": "One terrible thing that this pandemic has taught us, is that more than likely, after facing all the consequences that are coming her way, she will probably double down on her crazy ideas and attitude. \n\nThink about it: For the next year or so, the ONLY people on earth that are going to show her any kind of sympathy, are MAGA anti-vaxxers.",
            "title_similarity": "0.6293117",
            "sentiment_compound": -0.5095
        },
        {
            "id": "hc7xrqd",
            "score": 5,
            "text": "Sure looked like assault to me.",
            "title_similarity": "0.19829985",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7xsjp",
            "score": 2,
            "text": "She can always apply for a job at the <engage baby whine> Wawa </whine>",
            "title_similarity": "0.31047785",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hc7xslg",
            "score": 3,
            "text": "Charge her, this is insane that she is getting away with this. This child needs to be charged and prosecuted with a hefty fine, maybe weekend jail time.",
            "title_similarity": "0.45328236",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hc7xt11",
            "score": 5,
            "text": "I started wearing a mask again because I had a cold/allergies.  Now I just wear it because it does not hurt one bit.  What a rude bitch.",
            "title_similarity": "0.48736668",
            "sentiment_compound": -0.6154
        },
        {
            "id": "hc7xvtn",
            "score": 3,
            "text": "Its fine, im sure she can get a job at McDonald's. Actually, I dont think McDonald's hires trash like this. Good luck lady!",
            "title_similarity": "0.41113985",
            "sentiment_compound": 0.9056
        },
        {
            "id": "hc7xwf9",
            "score": 4,
            "text": "Ahhaaahahaha a hahahaha ahahahaha! Karma.",
            "title_similarity": "0.10680002",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7y2q1",
            "score": 7,
            "text": "This is Janene Hoskovec.  I hope she is proud of herself.",
            "title_similarity": "0.27742326",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hc7y3e4",
            "score": 4,
            "text": "Imagine being posted all over Reddit and having your story make it to front page multiple times because you were behaving like a complete jackass. Lol good for her, she earned this.",
            "title_similarity": "0.5239173",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hc7y6n5",
            "score": 3,
            "text": "This upper middle class white lady is generally so entitled, it’s appalling",
            "title_similarity": "0.32873535",
            "sentiment_compound": -0.0058
        },
        {
            "id": "hc7y8gi",
            "score": 9,
            "text": "A few weeks ago a man deliberately coughed on me multiple times while I was riding the subway and proclaimed “there is no cure.” Masks are required on public transportation in my city and both he and his young son were not wearing them. \n\nIt was such a frustrating experience to be literally sitting, minding my own business and have one of these crazies get up in my personal space.",
            "title_similarity": "0.59773713",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hc7y9rp",
            "score": 3,
            "text": "Beautiful.\nMay she spend days and weeks seeing herself in articles.",
            "title_similarity": "0.39371568",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hc7yb2z",
            "score": 2,
            "text": "What does she gain by coughing on people? Not a fucking thing. Except unemployment.\n\nWhat does she lose if she didn't cough on them? Not a fucking thing. Except for maybe her ego wasn't satiated. \n\nSome people really don't think their behaviors through before doing stupid things. Every battle isn't worth fighting, every battle isn't a war. Sometimes think in your head, is my reaction necessary? It may keep you from doing stupid shit like her.",
            "title_similarity": "0.56308347",
            "sentiment_compound": -0.9102
        },
        {
            "id": "hc7yd45",
            "score": 3,
            "text": "She now has a GoFundMe page and says she was misunderstood.",
            "title_similarity": "0.5350039",
            "sentiment_compound": -0.34
        },
        {
            "id": "hc7yd6e",
            "score": 2,
            "text": "Wish i was there when she got the news that her actions got her fired.. Oh F*** she likely said to herself.. I'm sorry",
            "title_similarity": "0.7178037",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc7ydqa",
            "score": 2,
            "text": "The lady said “cock” at :16 hahahahaha",
            "title_similarity": "0.28447324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7yeb6",
            "score": 3,
            "text": "'The woman seen in a viral video'",
            "title_similarity": "0.43730843",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7ygyw",
            "score": 6,
            "text": "You follow me and my daughter around a store and I might just bop you with a can O corn.",
            "title_similarity": "0.35358918",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7ym1c",
            "score": 5,
            "text": "If this woman represented my company and behaved like this, she is gone. For all of you ‘she doesn’t deserve to lose her job’ people. Would you hire this woman? Does she seem like a person you would want representing your company’s values?",
            "title_similarity": "0.5249026",
            "sentiment_compound": 0.6868
        },
        {
            "id": "hc7yn0s",
            "score": 2,
            "text": "Interviewer: \"So, why were you let go at your last job?\"\n\n\"I coughed on people.\"\n\nRIP your employment opportunities you dumb fucker.",
            "title_similarity": "0.7328034",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hc7yo8x",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.29731178"
        },
        {
            "id": "hc7yo9v",
            "score": 3,
            "text": "Good. If you’re willing to do that while being filmed, god knows what you’re doing when you’re not.",
            "title_similarity": "0.09852724",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hc7yolq",
            "score": 2,
            "text": "At SAP we terminate assholes in 10 hours or less, guaranteed",
            "title_similarity": "0.44915986",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hc7yrkp",
            "score": 3,
            "text": "Wasn’t worth it, was it Karen??",
            "title_similarity": "0.3150062",
            "sentiment_compound": 0.3094
        },
        {
            "id": "hc7yt5x",
            "score": 2,
            "text": "Do people really think everyone is supposed to put up with their jokes? Like they actually get offended that people “can’t take a joke” regardless of how funny or not funny it is?\n\nI think that’s the biggest takeaway here. Sorry lady, you’re not funny and this isn’t a TV prank show. You’re just fucking stupid.",
            "title_similarity": "0.51888114",
            "sentiment_compound": -0.581
        },
        {
            "id": "hc7z4hk",
            "score": 4,
            "text": "Bet she's coughing a bit less and crying a bit more. Good luck with the next job when the recruiter googles her name.",
            "title_similarity": "0.6233178",
            "sentiment_compound": 0.5646
        },
        {
            "id": "hc7z8lk",
            "score": 5,
            "text": "This makes my heart happy! Karma",
            "title_similarity": "0.16483286",
            "sentiment_compound": 0.8478
        },
        {
            "id": "hc7z8qu",
            "score": 5,
            "text": "Damn, I really wondered what she thought would happen if she coughed on two people filming  her during a global pandemic...",
            "title_similarity": "0.6753613",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hc7z8r4",
            "score": 3,
            "text": "I’m not defending her actions. She is horrible and there is no justifying what she did. But I am Damned curious what her view is. What was it that she thought she was doing? Why did she approach this woman and her daughter? What was she hoping would happen and what did she wish to accomplish? \n\nThe whole thing is so weird. I want to understand the compulsion to do this.",
            "title_similarity": "0.56032676",
            "sentiment_compound": 0.8005
        },
        {
            "id": "hc7zabu",
            "score": 4,
            "text": "No shock at all cougher is from Coronazona.",
            "title_similarity": "0.058453545",
            "sentiment_compound": 0.2924
        },
        {
            "id": "hc7ziho",
            "score": 3,
            "text": "Cough on me, get an ass whoopin!",
            "title_similarity": "0.45999414",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hc7zj49",
            "score": 2,
            "text": "Looks like discount MTG",
            "title_similarity": "0.06711229",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc7zle7",
            "score": 2,
            "text": "‘KerMa’ is a bitch",
            "title_similarity": "0.47941422",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hc7zn45",
            "score": 2,
            "text": "One more fry cook needed at McDonald's.",
            "title_similarity": "0.23033631",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7znzt",
            "score": 4,
            "text": "Still waiting on that Victoria’s Secret attacker to lose her job.",
            "title_similarity": "0.6096406",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hc7zotk",
            "score": 7,
            "text": "Looks like she was allergic to gainful employment",
            "title_similarity": "0.60472393",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hc7zvep",
            "score": 6,
            "text": "Lol, what a dumb, passive aggressive bitch — this made my day",
            "title_similarity": "0.57826877",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hc7zz8a",
            "score": 5,
            "text": "Another casualty of Qnon",
            "title_similarity": "0.20537767",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hc801lq",
            "score": 3,
            "text": "Why do we even let people like this continue to walk the earth?",
            "title_similarity": "0.13748845",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc801nz",
            "score": 5,
            "text": "“Oowww mask Karen is ownin’ the libs!”",
            "title_similarity": "0.29186288",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc802ts",
            "score": 3,
            "text": "Good riddance. I can’t wait to meet her in hell. Hope she saves a spot for me down there!",
            "title_similarity": "0.4834054",
            "sentiment_compound": 0.126
        },
        {
            "id": "hc80akq",
            "score": 4,
            "text": "I wonder how she tried to explain her public behavior to her boss?",
            "title_similarity": "0.5152525",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc80f8y",
            "score": 9,
            "text": "Now arrest her for assault because that’s exactly what this is.",
            "title_similarity": "0.40921104",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hc80hcm",
            "score": 14,
            "text": "She was a highly educated person on paper..with an MBA and a JD. Guess all that never translated into basic decency.\n\nWhat a waste of education.",
            "title_similarity": "0.39340734",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hc80ing",
            "score": 5,
            "text": "Where’s her husband you ask?\n\nWhy, he’s in Washington DC storming the Capital.",
            "title_similarity": "0.43497628",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc80miv",
            "score": 5,
            "text": "We need a page dedicated for fired Karens… “ByeByeKaren”",
            "title_similarity": "0.41073728",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hc80nor",
            "score": 2,
            "text": "Couldn’t have happened to a better person.",
            "title_similarity": "0.14152057",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc80s1d",
            "score": 3,
            "text": "I lost my parents to Fox News. I fully expect to see them in one of these videos in the near future :/",
            "title_similarity": "0.45920175",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hc80s4t",
            "score": 3,
            "text": "People can hate the internet all they want but these sort of things make all the negative aspects worth it.",
            "title_similarity": "0.5081158",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hc80ui1",
            "score": 2,
            "text": "I dont know if I could have hold my temper. She would certainly risk a very long attendance in the hospital if she would have coughed on me....",
            "title_similarity": "0.5447048",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hc80wzn",
            "score": 3,
            "text": "“Maybe I have a MEDICAL, I don’t need to wear a mask.”",
            "title_similarity": "0.11073251",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc80y7h",
            "score": 5,
            "text": "I miss when people like this got punched in the face",
            "title_similarity": "0.5975128",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hc80yjn",
            "score": 4,
            "text": "Regardless of race and political orientation, what goes through these people's minds to make it okay to do stuff like this?",
            "title_similarity": "0.046613015",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hc81051",
            "score": 2,
            "text": "Ken Copeland after a sex change",
            "title_similarity": "0.36236888",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc81124",
            "score": 2,
            "text": "What an entitled cunt",
            "title_similarity": "0.15909195",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc812s7",
            "score": 2,
            "text": "Wondering if she puts out a statement saying “this isn’t who she is” when we all know yes it fucking is.",
            "title_similarity": "0.37184852",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hc81jl3",
            "score": 2,
            "text": "This Does Put A Smile On My Face",
            "title_similarity": "0.05755751",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc81p6z",
            "score": 2,
            "text": "For crimes of this nature they should send the person to Afghanistan in exchange for a progressive Afghan who wants to life a better life",
            "title_similarity": "0.23933771",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc81q5x",
            "score": 3,
            "text": "What an ignoramus... Becomes Karen internet famous and gets fired from her job but at least she got a chance to own those mask wearing Libs.",
            "title_similarity": "0.75907373",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hc81snf",
            "score": 2,
            "text": "Thank fuck, I hope she's home crying about it and her family is just like, you deserved this for your actions.",
            "title_similarity": "0.6197407",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hc828is",
            "score": 3,
            "text": "Good luck trying to find a new job with all this 'positive' coverage.",
            "title_similarity": "0.11159085",
            "sentiment_compound": 0.8793
        },
        {
            "id": "hc82a1t",
            "score": 3,
            "text": "I wonder if she has allergies from unemployment.",
            "title_similarity": "0.48554754",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hc82c8d",
            "score": 2,
            "text": "She’s lucky someone didn’t knock her ass out! I’d take anyone intentionally coughing on me as an assault.",
            "title_similarity": "0.5266651",
            "sentiment_compound": -0.6996
        },
        {
            "id": "hc82fy2",
            "score": 3,
            "text": "Ya know, when I was a child, I saw glimpses here and there of adults saying and doing petty, stupid things; but I didn’t realize until I became an adult how little people mature once they’ve hit the age of sexual maturity. Just an entire planet of 13-16 year olds running, governing and deciding the fate of our world. It’s terrifying.",
            "title_similarity": "0.5001413",
            "sentiment_compound": -0.6561
        },
        {
            "id": "hc82g4p",
            "score": 4,
            "text": "Thank GOD. I saw this bitch yesterday and was angry then, but when I read that the person recording was WITH HER CHILD and this grown ass woman was behaving like this, I saw red. \n\nWhat in the fuck has happened to common decency in this country?",
            "title_similarity": "0.6781487",
            "sentiment_compound": -0.8585
        },
        {
            "id": "hc82gmi",
            "score": 4,
            "text": "Why isn't she getting arrested or serving jail time? Isn't it a felony to spit in someone's face? I don't see how this is any different, if not worse.",
            "title_similarity": "0.42114455",
            "sentiment_compound": 0.8083
        },
        {
            "id": "hc82gy0",
            "score": 2,
            "text": "Wow, I didn't even realize she was the one who initiated the conversation. Dumb cunt went out of her way to talk down to people wearing a mask and when she got told, she started coughing on them. What the fuck is wrong with these morons. Glad she got fired.",
            "title_similarity": "0.7479322",
            "sentiment_compound": -0.9042
        },
        {
            "id": "hc82h29",
            "score": 1,
            "text": "This should be in /r/wholesomenews",
            "title_similarity": "-0.0018834029",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc82hzi",
            "score": 2,
            "text": "She’s lucky she didn’t get a full scholarship to “These Hands” University",
            "title_similarity": "0.4071285",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hc82ifh",
            "score": 3,
            "text": "I wanna see charges against her for assault. This shit is not okay",
            "title_similarity": "0.43221587",
            "sentiment_compound": -0.896
        },
        {
            "id": "hc82jxt",
            "score": 3,
            "text": "Same as a spitting on someone. Someone’s card is going to get pulled sooner or later pulling a stunt like this.",
            "title_similarity": "0.35448533",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc82k8f",
            "score": 3,
            "text": "This pig would have been slapped if she did that near my kid. What a twat.",
            "title_similarity": "0.5716362",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc82nhi",
            "score": 1,
            "text": "What an idiot lmfaooo. \n\nYou can be like anti lockdown etc, but To go around in public, on video and cough on people…\n\nHow did she think this would turn out?",
            "title_similarity": "0.5661323",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hc82pbt",
            "score": 3,
            "text": "Well, well, well...if it isn't the consequences of my own actions...",
            "title_similarity": "0.08894592",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hc82q7x",
            "score": 3,
            "text": "So this might just be me being enraged A/F but when she “coughs” she usually leans forward while putting her arms down basically presenting her stupid face for incoming force, also if spitting on people allows a response then coughing in this manner should also.",
            "title_similarity": "0.65057874",
            "sentiment_compound": -0.7543
        },
        {
            "id": "hc82rua",
            "score": 3,
            "text": "This is more r/upliftingnews than anything on that sub.",
            "title_similarity": "0.080933474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc82tfm",
            "score": 1,
            "text": "Customers should still sue",
            "title_similarity": "0.30232713",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc82v9v",
            "score": 2,
            "text": "This is r/leopardsatemyface material",
            "title_similarity": "0.08299109",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc82zgx",
            "score": 2,
            "text": "God, what a trashy pig 🐷💦",
            "title_similarity": "0.46108466",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hc8301a",
            "score": 2,
            "text": "Cool, I hope we never have to read about this awful person ever again.",
            "title_similarity": "0.4414103",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hc8306i",
            "score": 2,
            "text": "Omg, please don’t run for a government office. This is just the type to do so.",
            "title_similarity": "0.30142766",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hc8331e",
            "score": 4,
            "text": "She was quite obviously just being a piece of trash in those videos.  It's easy to say something like \"if someone does that to me or my kid i'll go nuts on em\" but when you're IN that situation and just want some freaking groceries to get home and relax, and some nutjob won't leave you alone, it's stressful as can be.  That said, each and every one of us needs to decide, for themselves and WAY before a nutjob obsesses over you, what they're going to do if someone acts like this.  In the moment, stress and fear can become overpowering and it very well can cost you your health and safety and that of your kids.",
            "title_similarity": "0.49759567",
            "sentiment_compound": -0.2331
        },
        {
            "id": "hc836dn",
            "score": 3,
            "text": "Good, fuck this evil bitch.",
            "title_similarity": "0.4958477",
            "sentiment_compound": -0.8689
        },
        {
            "id": "hc836gm",
            "score": 3,
            "text": "This pandemic really brings out the people that love to feel smart but have no way of proving it",
            "title_similarity": "0.38149595",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hc838uh",
            "score": 2,
            "text": "As a liberal, she owns me now.",
            "title_similarity": "0.21418118",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc83a9g",
            "score": 2,
            "text": "I hope her allergies get better.",
            "title_similarity": "0.32455748",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hc83bqb",
            "score": 3,
            "text": "i like it when they lose their jobs because they deserve it.",
            "title_similarity": "0.3897567",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hc83d1b",
            "score": 7,
            "text": "If the woman, her child, or any family member contracts Covid within the next week I would sue that lady for the medical bills and any harm that came to me or my family.\n\n\nThis is a pandemic, crazies.  It's killing and injuring.  Stop breathing on people and being crazy.",
            "title_similarity": "0.6864188",
            "sentiment_compound": -0.91
        },
        {
            "id": "hc83nok",
            "score": 1,
            "text": "Good thing she had all of the plastic surgeries already.",
            "title_similarity": "0.2355327",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc83rx9",
            "score": 3,
            "text": "This news made me day immeasurably better. Thank you.",
            "title_similarity": "0.14505616",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hc83t8v",
            "score": 2,
            "text": "Another one for onlyfans",
            "title_similarity": "0.023389865",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc83tza",
            "score": 5,
            "text": "> She then says to the woman and her daughter, “Look at you guys, you’re so cute. … You’re such sheep.”\n\nSheep with jobs I guess.",
            "title_similarity": "0.34475365",
            "sentiment_compound": 0.5949
        },
        {
            "id": "hc83u8t",
            "score": 6,
            "text": "If you lose your job this quick, it’s pretty safe to assume you weren’t very well liked in the work place to begin with.",
            "title_similarity": "0.5275565",
            "sentiment_compound": 0.8347
        },
        {
            "id": "hc842f0",
            "score": 2,
            "text": "I’m having trouble trying to figure out which state has the biggest idiots. It’s a tough call.",
            "title_similarity": "0.25136593",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hc846l1",
            "score": 1,
            "text": "Harley: if you cough without covering your mouth, you die!",
            "title_similarity": "0.61551607",
            "sentiment_compound": -0.636
        },
        {
            "id": "hc847u9",
            "score": 2,
            "text": "She should lose her job for being a bitch to customers regardless of wether it was Covid related or not.",
            "title_similarity": "0.72238433",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hc84g25",
            "score": 3,
            "text": "It’s great to see these updates!",
            "title_similarity": "0.015520012",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hc84k04",
            "score": 2,
            "text": "My thoughts have remained the same since seeing this on TikTok:\n\nWhat a dumb bitch.",
            "title_similarity": "0.4281308",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hc84n8k",
            "score": 2,
            "text": "Flood her social media calling her what she is and that's a terrorist",
            "title_similarity": "0.56718063",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hc84qbc",
            "score": 2,
            "text": "Is this assault? I know the article says no charges have been filed by the person she did this too, but I always wondered - can you punch someone who does this to you?",
            "title_similarity": "0.47319466",
            "sentiment_compound": -0.3298
        },
        {
            "id": "hc84qot",
            "score": 2,
            "text": "People like Janene Hoskovec - you cut 1 down, 2 more grows in her place.",
            "title_similarity": "0.3643993",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hc84rav",
            "score": 1,
            "text": "[oh no. ](https://m.youtube.com/watch?v=tr3HwA9B0o4)",
            "title_similarity": "0.25332487",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc84s1a",
            "score": 1,
            "text": "This is a case of play stupid games win stupid prices.  \n\nTop it off now that her name is public no one is going to want to hire her.",
            "title_similarity": "0.54564804",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hc84ukx",
            "score": 2,
            "text": "Thanks you internet, for some hope.",
            "title_similarity": "0.17714673",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hc84wi4",
            "score": 3,
            "text": "Man, white people are the worst. \n\nSource: I have been white for most of my life.",
            "title_similarity": "0.30873227",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hc84wl2",
            "score": 3,
            "text": "SAP is a good gig. What a dummy",
            "title_similarity": "0.21397336",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc84x2c",
            "score": 1,
            "text": "GoFundMe account being setup in 3....2....1....",
            "title_similarity": "0.096658245",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc84xdt",
            "score": 3,
            "text": "I would punch her in the tit. Fuck anyone who does this shit.",
            "title_similarity": "0.5761158",
            "sentiment_compound": -0.8294
        },
        {
            "id": "hc84yrz",
            "score": 4,
            "text": "I hope she gets a case of ass lobsters and has to quarantine at gitmo for 30 years. \n\nWhat a piece of shit.\nNo matter your stance on politics this behavior is unacceptable,  against the law, and it most cases acting like this will get you punched straight in the face.",
            "title_similarity": "0.61508477",
            "sentiment_compound": -0.5589
        },
        {
            "id": "hc853j0",
            "score": 1,
            "text": "Good; she was horrible.",
            "title_similarity": "0.3996935",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hc8571l",
            "score": 1,
            "text": "I'm waiting for dem crocodile tears.",
            "title_similarity": "0.32703882",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hc857bs",
            "score": 2,
            "text": "SAP is a tech company with a LOT of huge corporate clients. Some of those clients were some of the first to do everything they could to protect their customers and employees from Covid right from the start. SAP does not want to suddenly become distanced from said corporate clients by being viewed as sympathetic to the idiot ideals of anti-maskers.",
            "title_similarity": "0.36952987",
            "sentiment_compound": 0.6681
        },
        {
            "id": "hc858iq",
            "score": 2,
            "text": "Good luck finding another job.",
            "title_similarity": "0.079364926",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hc85c1e",
            "score": 1,
            "text": "This is the origin story for a villain lol",
            "title_similarity": "0.18094558",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hc85gg7",
            "score": 4,
            "text": "Were so close to justice, now the only thing left is for her to get arrested and charged with assault.",
            "title_similarity": "0.38708776",
            "sentiment_compound": -0.617
        },
        {
            "id": "hc85h8r",
            "score": 4,
            "text": "I love how this pandemic has put a spotlight on the jerks of this country and companies are quick to distance themselves from them now\n\nno doubt she was a jerk to many coworkers throughout the years and the company never did anything about it",
            "title_similarity": "0.6520302",
            "sentiment_compound": 0.4234
        },
        {
            "id": "hc85oje",
            "score": 5,
            "text": "Give it 2 weeks. We'll see her in the news again saying she's on a ventilator and asking everyone to get vaccinated and weak their masks...",
            "title_similarity": "0.5050529",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hc85qhq",
            "score": 3,
            "text": "Those idiots never learn.",
            "title_similarity": "0.37943998",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc85rj5",
            "score": 3,
            "text": "Justice served.  I love it.",
            "title_similarity": "0.019385196",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hc85tz0",
            "score": 1,
            "text": "Good. But I bet she still thinks it was all bullshit",
            "title_similarity": "0.39652193",
            "sentiment_compound": -0.6428
        },
        {
            "id": "hc85vhe",
            "score": 1,
            "text": "But she gains mayrterdom witch entitles her to 40 virgins in the afterlife.",
            "title_similarity": "0.5106535",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hc85x82",
            "score": 4,
            "text": "I can’t be sure some guy didn’t purposefully cough on me at a Wendy’s recently. I was masked and walking with my food to a table. Dude-man-bro with a pony tail definitely did a *aheh aheh* in my direction. Didn’t really hit me until later. This is in a fairly conservative area, so I wouldn’t be shocked. \n\nAnyways, I’m congested and waiting for PCR results, so fuck that guy.",
            "title_similarity": "0.36366",
            "sentiment_compound": -0.4198
        },
        {
            "id": "hc85y2l",
            "score": 3,
            "text": "I'm not gonna lie, if she did this to me I would have warned her one single time that I viewed that behaviour as a threat to my person and if she did it again I would have to resolve that threat immediately.",
            "title_similarity": "0.36426347",
            "sentiment_compound": -0.743
        },
        {
            "id": "hc860dg",
            "score": 3,
            "text": "I wish there was a subreddit that followed the lives of those who lost their jobs to see where they will land next.",
            "title_similarity": "0.50173",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hc863da",
            "score": 1,
            "text": "She’ll be a martyr for the ignorant before the end of the week.",
            "title_similarity": "0.6088265",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc86cah",
            "score": 3,
            "text": "Justice is served. Thank you technology.",
            "title_similarity": "0.055279277",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hc86dcb",
            "score": 3,
            "text": "What a shame. \n\nCough cough.",
            "title_similarity": "0.39333513",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hc86frm",
            "score": 2,
            "text": "She needs to be charged with assault.",
            "title_similarity": "0.33581263",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hc86g0d",
            "score": 3,
            "text": "They better people than me fr I mighta just started swinging",
            "title_similarity": "0.110018685",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc86iqu",
            "score": 4,
            "text": "Same people who say young people now days have no manners. Things were better back then.",
            "title_similarity": "0.27314967",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hc86rfp",
            "score": 2,
            "text": "If someone did this to me and my son/daughter in the store and it was caught on video, the police would definitely see it. I would be inclined to file a complaint, including testifying against her.",
            "title_similarity": "0.4837335",
            "sentiment_compound": 0.128
        },
        {
            "id": "hc86sk9",
            "score": 5,
            "text": "This woman has a psychiatric disorder. She is not just a jerk. She is incapable of being in public without supervision. People like this need to be dealt with not just on the criminal level, but on the psychiatric level.\n\n She has proven she will harass a complete stranger, and continue to do so until forced to stop. For right now she should be under house arrest and not allowed bail.",
            "title_similarity": "0.503597",
            "sentiment_compound": -0.9539
        },
        {
            "id": "hc86v4e",
            "score": 3,
            "text": "I'm surprised that nutcase HAD a job.",
            "title_similarity": "0.2189328",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hc871xo",
            "score": 5,
            "text": "I will never get tired of these idiots being fired for being stupid.",
            "title_similarity": "0.46601924",
            "sentiment_compound": -0.6802
        },
        {
            "id": "hc87248",
            "score": 5,
            "text": "Losing your career to own the libs 🥴🤣🤣🤣",
            "title_similarity": "0.5602327",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hc87a6b",
            "score": 2,
            "text": "This make me feel good inside.. Fk this lady",
            "title_similarity": "0.20923692",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc87d4m",
            "score": 2,
            "text": "Coughs and sneezes are the new gun shots lol",
            "title_similarity": "0.34911788",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hc87ecz",
            "score": 3,
            "text": "Oh MAN this is a true delight!",
            "title_similarity": "-0.067665845",
            "sentiment_compound": 0.7901
        },
        {
            "id": "hc87hmo",
            "score": 1,
            "text": "Does this sub allow video links?? Anyway here is the video https://youtu.be/a_Q3heS41HI",
            "title_similarity": "0.116313174",
            "sentiment_compound": 0.3094
        },
        {
            "id": "hc87hxh",
            "score": 5,
            "text": "Good. These assholes need to be held accountable",
            "title_similarity": "0.14871375",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hc87jbb",
            "score": 3,
            "text": "Fucked around. Guess she had to find out",
            "title_similarity": "0.37926215",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc87lbw",
            "score": 2,
            "text": "shows lack of character, seriously",
            "title_similarity": "0.25505605",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hc87o7t",
            "score": 3,
            "text": "Waiting for the follow up where she contracts COVID but can't pay the hospital bills because she lost her medical insurance when she got fired.",
            "title_similarity": "0.7259942",
            "sentiment_compound": -0.8129
        },
        {
            "id": "hc87qxs",
            "score": 1,
            "text": "Whatever that is, isn’t ageing well",
            "title_similarity": "0.12493055",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hc87ulg",
            "score": 5,
            "text": "Good.   These people need to understand their are consequences to being a crazy idiot.",
            "title_similarity": "0.33331412",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hc87x1y",
            "score": 5,
            "text": "Good news. It would be great news if she was convicted and spent time in jail for assault.",
            "title_similarity": "0.35213175",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hc885jx",
            "score": 2,
            "text": "The crazy part is that even if she just had allergies, cover your fucking mouth when you cough. That’s basic manners. It’s literally like when Michael Scott sneezes in Pam’s tea and says “don’t worry, it’s just allergies”",
            "title_similarity": "0.55243427",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hc888wu",
            "score": 2,
            "text": "That look on her face. She's just so pleased with herself while ruining everyone else's day.",
            "title_similarity": "0.50651526",
            "sentiment_compound": 0.4101
        },
        {
            "id": "hc889m4",
            "score": 2,
            "text": "Point and laugh everyone. Point and laugh.",
            "title_similarity": "0.14985552",
            "sentiment_compound": 0.802
        },
        {
            "id": "hc889z0",
            "score": 4,
            "text": "Hahahaha get fucked also all the defenders or the idiots claiming we shouldn’t be shunning and denouncing idiots perpetuating stupidity and the pandemic need to fuck off with them.  \n\nNot shunning nor denouncing these people gave us 4 years of cultists and traitors who attempted to take the country for themselves when they lost the election.",
            "title_similarity": "0.5756648",
            "sentiment_compound": -0.9153
        },
        {
            "id": "hc88e5e",
            "score": 3,
            "text": "Mmmm.. Consequences. Delicious.",
            "title_similarity": "0.029781587",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hc88ett",
            "score": 1,
            "text": "No worries. Yallqueda will come to her rescue. 😂😂😂😂😂",
            "title_similarity": "0.21444294",
            "sentiment_compound": 0.9592
        },
        {
            "id": "hc88i20",
            "score": 2,
            "text": "Dumb childish bitch. How fucking obnoxious. Oh but let me guess, she’s a ‘victim’ 🙄",
            "title_similarity": "0.5935506",
            "sentiment_compound": -0.7428
        },
        {
            "id": "hc88ioa",
            "score": 3,
            "text": "She already lost her mind. Might as well lose her job also.",
            "title_similarity": "0.6684445",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hc88jhy",
            "score": 8,
            "text": "Wait just one minute now… are you telling me that my actions may have actual consequences?!",
            "title_similarity": "0.13087639",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc88m6p",
            "score": 4,
            "text": "She learned something about freedom today.",
            "title_similarity": "0.13014407",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hc88p1a",
            "score": 1,
            "text": "Looks like another fun moment in the middle-American benzo crisis.",
            "title_similarity": "0.23315",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hc88pfl",
            "score": 2,
            "text": "Good! This video was on my fyp on tiktok the other day! I’m glad these people are being held accountable!",
            "title_similarity": "0.3115574",
            "sentiment_compound": 0.7767
        },
        {
            "id": "hc88pty",
            "score": 2,
            "text": "Was she fired? Or was she already a former employee?  SAP’s language is a little ambiguous.",
            "title_similarity": "0.55795634",
            "sentiment_compound": -0.6072
        },
        {
            "id": "hc88rer",
            "score": 3,
            "text": "What a vile human being.\n\nImagine going the rest of your life being known as \"That lady in the video seen by millions who aggressively coughed on a random mother and child in a grocery store\". \n\nCovid Karen.",
            "title_similarity": "0.7669249",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hc88ucw",
            "score": 4,
            "text": "The party who claims they work hard sure sounds like they’re becoming the party looking for jobs lol",
            "title_similarity": "0.37020877",
            "sentiment_compound": 0.891
        },
        {
            "id": "hc88urr",
            "score": 3,
            "text": "[Buh-bye Janene](https://heavy.com/news/janene-hoskovec/).",
            "title_similarity": "0.22080474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc893us",
            "score": 3,
            "text": "Where did they find this troll-woman? Ugly mug",
            "title_similarity": "0.5901444",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hc89bfb",
            "score": 1,
            "text": "This looks a bit like a harps. While I was driving back home to the ozarks (the only place Ive seen Harps is mid/southern) the same places with a harps are the same place you got multiple stares at gas stations for being one of the few with a mask.",
            "title_similarity": "0.31496146",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc89cus",
            "score": 6,
            "text": "She thinks she is so funny…and now she is so unemployed. 😷",
            "title_similarity": "0.5438348",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc89igq",
            "score": 5,
            "text": "Where’s this lady’s shitty Twitter apology about how’s she’s learned things?",
            "title_similarity": "0.6501224",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hc89j19",
            "score": 6,
            "text": "You can tell the lady in question has not run up against any physical conflict in her life. Not at all condoning violence, but if she had done that to some of the locals around here she would have received a swift jab or two to the nose. You don't get up in peoples' business like that, you just don't. Let alone when we're dealing with a contagious disease in our communities. I don't want the world to be a violent place, but seeing people like this lady I start to understand why it is. People like this won't stop until they're stopped.",
            "title_similarity": "0.46026832",
            "sentiment_compound": 0.0152
        },
        {
            "id": "hc89k1s",
            "score": 5,
            "text": "Shouldn't she have been arrested?",
            "title_similarity": "0.31443098",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hc89obm",
            "score": 3,
            "text": "Is there legal precedent for knocking her out? \n\nLike I have a history of lung problems, is this not assault? If I broke her nose and dropped hey on the floor, would I expect charges?",
            "title_similarity": "0.5652545",
            "sentiment_compound": -0.2658
        },
        {
            "id": "hc89qay",
            "score": 6,
            "text": "karma train goes toot toot",
            "title_similarity": "0.3339466",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8a1tc",
            "score": 5,
            "text": "Imagine knowing that almost 35,000 people on one post are glad you got fired.",
            "title_similarity": "0.51170766",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hc8a1ws",
            "score": 5,
            "text": "Woof, that's a tough one, I was always told never to hit a woman, but she sure seems like she wants a lesson in consequences for her actions.",
            "title_similarity": "0.38245055",
            "sentiment_compound": 0.714
        },
        {
            "id": "hc8a33r",
            "score": 2,
            "text": "Just a matter of time before she is hosting something on FOX News.",
            "title_similarity": "0.21763171",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc8a7u2",
            "score": 3,
            "text": "Found around and fucked up.",
            "title_similarity": "0.26759154",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc8aa41",
            "score": 2,
            "text": "Just look at her fucking face. Its says it all lmaoo",
            "title_similarity": "0.35814857",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8add6",
            "score": 3,
            "text": "I would be expecting a punch if I was coughing in peoples faces. People are nuts",
            "title_similarity": "0.49181166",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hc8aghl",
            "score": 3,
            "text": "Foolish, foolish asshole, out of control.  This kind of trash deserves to be tossed into an active volcano.",
            "title_similarity": "0.47461942",
            "sentiment_compound": -0.128
        },
        {
            "id": "hc8ahcr",
            "score": 1,
            "text": "\\*gets arrested for attempted murder. I'm sure this is what the headline said, right?",
            "title_similarity": "0.42542428",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hc8ahdf",
            "score": 2,
            "text": "She’ll be working for the GOP pretty soon",
            "title_similarity": "0.2747308",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hc8alc6",
            "score": 3,
            "text": "“What a bunch of idiots they dont want to get sick and die 🙄🙄🙄”",
            "title_similarity": "0.5166753",
            "sentiment_compound": -0.8137
        },
        {
            "id": "hc8amuk",
            "score": 5,
            "text": "Good. \nPlay stupid games, win stupid prizes.",
            "title_similarity": "0.2653024",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hc8an7e",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.29731172"
        },
        {
            "id": "hc8as4y",
            "score": 3,
            "text": "Get ready to see her at the next rnc.",
            "title_similarity": "0.28469306",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc8axjo",
            "score": 6,
            "text": "Someone should create a fund to help her on GoFuckYourself.com. Someone should also create GoFuckYourself.com.",
            "title_similarity": "0.37332854",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hc8ayvh",
            "score": 8,
            "text": "Her employer previously praised her as a USAF veteran but starting to look like maybe not true. And the law school she attended lost its accreditation so I doubt she passed the bar. \nThis loser is just a bully and maybe a liar.",
            "title_similarity": "0.6187215",
            "sentiment_compound": -0.9662
        },
        {
            "id": "hc8azm3",
            "score": 3,
            "text": "I’m guessing her job has been just waiting for some reason to get rid of this loon.",
            "title_similarity": "0.4596312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8b0pm",
            "score": 2,
            "text": "Smashing through the boundaries, lunacy has found me, what this is, is battery.",
            "title_similarity": "0.3476621",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8b1i7",
            "score": 2,
            "text": "I hate cancel culture but this seems fair. It’s the same as punching someone. Cough on me and go get fucked",
            "title_similarity": "0.53535926",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hc8b1ip",
            "score": 4,
            "text": "So you’re saying there’s an opening at SAP?",
            "title_similarity": "0.089987144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8b966",
            "score": 5,
            "text": "Too bad her employer can’t make her get vaccinated—-because she is now unemployed.",
            "title_similarity": "0.6349969",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hc8bcf7",
            "score": 2,
            "text": "Look like the breath stealing gremlin from cats eye.",
            "title_similarity": "0.4431559",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc8bf7f",
            "score": 4,
            "text": "Coughing on people, stalking others, esp mother and child, is fucking disgusting regardless if it's in a pandemic.",
            "title_similarity": "0.6553544",
            "sentiment_compound": -0.5709
        },
        {
            "id": "hc8bfwl",
            "score": 4,
            "text": "This is probably the first time in her life she's ever faced any kind of consequence for her actions hence why she thought she could get away with such shitty behavior in public in the first place.",
            "title_similarity": "0.43420705",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hc8bink",
            "score": 3,
            "text": "Yeah back before mask you still didn't cough or sneeze on people you would use your hand or shoulder to cover your mouth.",
            "title_similarity": "0.25026762",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hc8bl4n",
            "score": 3,
            "text": "It is really becoming the norm that I just refuse to believe that people actually behave like this. I literally can't comprehend it. There has to be some kind of medical study that explains it, imo it has to be some way of mental illness. It's more than just being assholes or annoying people.  \n\nI honestly think they have some kind of condition that leads to this behaviour. So far only explained with being a \"Karen\". My brain won't process that this is who these people actually are and want to be.",
            "title_similarity": "0.42697048",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hc8bqbt",
            "score": 3,
            "text": "Bitch needs her ass whooped.",
            "title_similarity": "0.5779071",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hc8chlt",
            "score": 3,
            "text": "Better get a new haircut, put glasses on and move into another country because that video is going to stick with that bitch for a long while....and she’ll spend quite some time fearing someone will find out at her new job - if someone ever hires that bitch again...\n\nAnonymity is à gone concept. You can’t do things like this anymore without paying the price for it. And the remnants of your stunt will stay on YT servers forever...",
            "title_similarity": "0.5450367",
            "sentiment_compound": -0.8
        },
        {
            "id": "hc8clsy",
            "score": 2,
            "text": "Woman fucks around. Promptly finds out.",
            "title_similarity": "0.57943773",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hc8ctau",
            "score": 3,
            "text": "She coughed on the produce.",
            "title_similarity": "0.5831914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8cuip",
            "score": 4,
            "text": "Doing stupid things on the internet can lead to real-world consequences. Also, doing stupid things in the real-world can lead to the internet, which then can lead to real-world consequences.",
            "title_similarity": "0.36382765",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hc8cvz5",
            "score": 1,
            "text": "Why doesn’t the store take action for her coughing on the produce?",
            "title_similarity": "0.6100931",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8d0c9",
            "score": 4,
            "text": "Bitch shoulda lost some teeth as well.",
            "title_similarity": "0.5364612",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hc8d5hc",
            "score": 5,
            "text": "That's nasty. You don't cough on people period, if there's a pandemic or not. Getting in my face coughing that rank ass breath on me would get this woman a broken nose.",
            "title_similarity": "0.5980158",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hc8d6ge",
            "score": 3,
            "text": "Just saw that video yesterday. Wish there was a video of her getting fired.",
            "title_similarity": "0.5428097",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hc8da45",
            "score": 3,
            "text": "Better get that unemployment money now Karen",
            "title_similarity": "0.33626258",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8do59",
            "score": 2,
            "text": "Watch this scumbag die of covid soon...",
            "title_similarity": "0.5204044",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hc8dq4i",
            "score": 2,
            "text": "You've got to wonder what goes through these psychopaths heads. Do they think they're being heroic or something, acting in a way that'd earn them the \"disgusting asshole\" title at the best of times, let alone during pandemic?\n\nWhat a hill to die on - going out of your way to be a dick to others.",
            "title_similarity": "0.49341184",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hc8dtis",
            "score": 5,
            "text": "Lady worked at SAP too.\n\nLost a primo job and it’s completely deserved.",
            "title_similarity": "0.70758903",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hc8dv9v",
            "score": 2,
            "text": "Oh good. She honestly deserves a face of pepper spray.",
            "title_similarity": "0.31553662",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hc8dwdj",
            "score": 3,
            "text": "I wish I never watched that video. I'm angry and upset over someone who will never directly affect me because I just can't believe someone could be such a dick with a smile on her face and feel like nothing's wrong.",
            "title_similarity": "0.50644004",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hc8dxvn",
            "score": 1,
            "text": "Collectively this last year and a half has made us so stupid. I hate myself for even wasting 30 seconds watching that ridiculous video. So many other important issues going on and we’re still fighting about this shit. It’s beyond embarrassing at this point. It’s fucking cringe.",
            "title_similarity": "0.59729123",
            "sentiment_compound": -0.9646
        },
        {
            "id": "hc8dyrv",
            "score": 3,
            "text": "Man I wait for the day one of these mutants does this to me.",
            "title_similarity": "0.2238784",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8e26q",
            "score": 3,
            "text": "Goodbye 👋🏼 loser…you’re a shame to humanity",
            "title_similarity": "0.5247026",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc8e2bc",
            "score": 2,
            "text": "I’m sure she can apply for one of those ‘essential’ jobs at a fast food place.",
            "title_similarity": "0.29339784",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hc8e3xz",
            "score": 3,
            "text": "Can you punch people that do this?",
            "title_similarity": "0.35158402",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8e6xe",
            "score": 3,
            "text": "Was waiting for this. Thanks whoever posted it. Appreciated.",
            "title_similarity": "0.12278431",
            "sentiment_compound": 0.7701
        },
        {
            "id": "hc8e7d6",
            "score": 3,
            "text": "Love it. Hopefully someone breaks her fucking jaw next time.",
            "title_similarity": "0.45080894",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hc8ehgb",
            "score": 2,
            "text": "This looks like Monica from Shameless (US)",
            "title_similarity": "0.31489003",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc8ejc0",
            "score": 5,
            "text": "I fear once she’s putting my kid in danger any conflict resolution skills I have might be forgotten.",
            "title_similarity": "0.43944037",
            "sentiment_compound": -0.8689
        },
        {
            "id": "hc8elvw",
            "score": 6,
            "text": "As someone from Arizona I'm starting to hear \"Arizona man\" and it's so sad. They crazy over here.",
            "title_similarity": "0.43076485",
            "sentiment_compound": -0.7687
        },
        {
            "id": "hc8emn7",
            "score": 4,
            "text": "Why don’t people like this get their ass beaten? In the middle of a pandemic that’s basically a form of assault I’d have to imagine.",
            "title_similarity": "0.50781184",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hc8er7v",
            "score": 6,
            "text": "The police are investigating the incident now, too.  \nEnjoy that!",
            "title_similarity": "0.26482773",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hc8f2dq",
            "score": 2,
            "text": "Nooo she’s from Arizona. Dammit. We’re like western Florida at this point.",
            "title_similarity": "0.21745071",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc8f5h4",
            "score": 3,
            "text": "Cool. She should’ve lost her teeth",
            "title_similarity": "0.4542467",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8f6vw",
            "score": 2,
            "text": "If someone intentionally coughed on me I would reply with a nice chunky loogie to the face",
            "title_similarity": "0.39485008",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hc8fa1u",
            "score": 2,
            "text": "When I was a boy I remember thinking that adults had it all figured out and knew what was going on.  If I had any inkling of just how stupid some people are I never would have left my room.  What an imbecile!",
            "title_similarity": "0.39801142",
            "sentiment_compound": -0.784
        },
        {
            "id": "hc8fa8g",
            "score": 3,
            "text": "Losing your job to own the libs! 😆😆",
            "title_similarity": "0.6329346",
            "sentiment_compound": 0.4003
        },
        {
            "id": "hc8fc6z",
            "score": 2,
            "text": "Good. Fuck that bitch. She literally made my blood boil and tbh, I would've slapped the ever living shit outta that woman had she done that to my mom or little sister.",
            "title_similarity": "0.7020916",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hc8fh85",
            "score": 1,
            "text": "she not only acts like a cunt, she looks like on too.",
            "title_similarity": "0.3136406",
            "sentiment_compound": -0.4234
        },
        {
            "id": "hc8fikc",
            "score": 2,
            "text": "The story is nuts. She randomly picked a woman and her daughter and started harassing them. Wtf??",
            "title_similarity": "0.70034486",
            "sentiment_compound": -0.8738
        },
        {
            "id": "hc8flp4",
            "score": 3,
            "text": "I swear midwesterners got some weird activism",
            "title_similarity": "0.27534184",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hc8fn7o",
            "score": 1,
            "text": "Great now she has more time to cough on people.",
            "title_similarity": "0.40012655",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hc8fnuf",
            "score": 2,
            "text": "Couldn’t happen to a nicer person. Fully deserved.",
            "title_similarity": "0.21765722",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc8fory",
            "score": 2,
            "text": "Rough, getting a job at SAP is not easy.  That's like a dream job usually.  Too bad she threw it away on something so stupid",
            "title_similarity": "0.57918227",
            "sentiment_compound": -0.8855
        },
        {
            "id": "hc8fwet",
            "score": 3,
            "text": "Someone coughs in my face on purpose like this, I'm taking a swing.  Before or after covid, this is like someone spitting on you.",
            "title_similarity": "0.61408603",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hc8fz5v",
            "score": 3,
            "text": "Imagine acting like a child to push some disgusting agenda- I hate people like this, they are the reason that we are still battling COVID-19 in 2021. Please use this as a reminder to get vaccinated!! Sadly, I can’t be vaccinated due to a medical issue, but if you can please do so! Because you never know when you will run into an idiot like this.",
            "title_similarity": "0.4952988",
            "sentiment_compound": -0.4545
        },
        {
            "id": "hc8g5rm",
            "score": 3,
            "text": "Ok, now charge her with assault.",
            "title_similarity": "0.36731988",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hc8gb8t",
            "score": 6,
            "text": "The entitlement of these anti-mask/vax people never ceases to amaze me.",
            "title_similarity": "0.28465456",
            "sentiment_compound": -0.431
        },
        {
            "id": "hc8gbgq",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.29731172"
        },
        {
            "id": "hc8gjyd",
            "score": 1,
            "text": "Shes working with SAP.. that why shes insane lol",
            "title_similarity": "0.5228586",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc8gqck",
            "score": 5,
            "text": "Good. Fuck people like her. They are the reason we are in this mess and deserve the full blame!!!",
            "title_similarity": "0.526098",
            "sentiment_compound": -0.6429
        },
        {
            "id": "hc8gthf",
            "score": 8,
            "text": "Quite honestly, it's getting hard for me, a super-empathetic person, to feel bad for people like this. Even when they get sick.",
            "title_similarity": "0.52087396",
            "sentiment_compound": -0.3415
        },
        {
            "id": "hc8gu7p",
            "score": 7,
            "text": "Press charges on this mega cunt",
            "title_similarity": "0.32223892",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hc8gxx3",
            "score": 6,
            "text": "Ughh people like this just make things worse for people with real medical issues.\n\nMy 8Yo son has Tourette’s and one of his tics is coughing. He was already self conscious enough even more so now with everyone giving dirty looks when we go out. Breaks my heart.\n\nTLDR: fuck this bitch.",
            "title_similarity": "0.65277237",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hc8h2am",
            "score": 8,
            "text": "She is a shitty person. Pandemic has nothing to do with it.",
            "title_similarity": "0.5297606",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hc8h71n",
            "score": 6,
            "text": "Why do they all look the same?",
            "title_similarity": "-0.11204097",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8ha1d",
            "score": 4,
            "text": "She won’t have a problem getting another job. Some Trump lover out there will see this video and hire her because of the way she acted.",
            "title_similarity": "0.40756452",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hc8hj0u",
            "score": 3,
            "text": "I wish someone sprayed fart spray in her mouth as she was coughing all over everyone. That would have been delicious to watch.",
            "title_similarity": "0.563584",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hc8hmpo",
            "score": 2,
            "text": "You’re firrrrredddd - SAP",
            "title_similarity": "0.23845771",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8hnja",
            "score": 5,
            "text": "She stalked them in order to cough on them. Imagine having enough time to stalk a family.",
            "title_similarity": "0.58426046",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8hnlj",
            "score": 3,
            "text": "Everytime I see videos like this (not just Covid related, but people being obviously inappropriate and rude and refusing to back down) I always get the same feeling as being back in 2nd grade and seeing the one kid that knows he's wrong but is too embarrassed to stop so they go all in and just mock others to maintain a sense of superiority. The maturity level of these types of people makes me wonder how they even get along in daily life.",
            "title_similarity": "0.48833632",
            "sentiment_compound": -0.9505
        },
        {
            "id": "hc8hssl",
            "score": 7,
            "text": "Even if covid never happened, coughing on people is rude. We teach little kids to cough into their sleeves or at least their hands, and have done so long before covid came around. She was acting more immature than a 3 year old.",
            "title_similarity": "0.5759707",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hc8hxc6",
            "score": 4,
            "text": "Imagine it’s your grandmother that did this? Lmao I hope her family takes the time to educate her ignorant ass.",
            "title_similarity": "0.5598352",
            "sentiment_compound": 0.4451
        },
        {
            "id": "hc8i1kv",
            "score": 12,
            "text": "I don't really care what she thinks of herself & her behavior. I'm just glad she lost her job & that the majority of folks who saw the video agreed she's trash.",
            "title_similarity": "0.72301584",
            "sentiment_compound": -0.0116
        },
        {
            "id": "hc8ih55",
            "score": 8,
            "text": "Man. If this bitch did this to my daughter I’d lay her the fuck out. Even before the pandemic, purposefully projecting bodily fluids on to someone was considered assault. This bitch is fucking daffy af.",
            "title_similarity": "0.6405473",
            "sentiment_compound": -0.9538
        },
        {
            "id": "hc8ihco",
            "score": 4,
            "text": "Hope she has some savings, it's going to be difficult to keep up with her cosmetic injections and surgeries on unemployment.",
            "title_similarity": "0.48740262",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hc8iumr",
            "score": 6,
            "text": "What a stupid bitch, lol.  I don't care what she's done in her life.. I hope this is her legacy.",
            "title_similarity": "0.5876778",
            "sentiment_compound": -0.6283
        },
        {
            "id": "hc8iv8n",
            "score": 4,
            "text": "OAN rushing to get an exclusive interview. Announcement incoming that she’s running for Congress to defend your freedoms",
            "title_similarity": "0.37390125",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hc8j1uq",
            "score": 7,
            "text": "God I love the internet. It’s amazing to me how people still don’t understand that we will drag you kicking and screaming if you’re caught on tape. Internet justice served 🕺🏻",
            "title_similarity": "0.42874062",
            "sentiment_compound": 0.875
        },
        {
            "id": "hc8jmm7",
            "score": 3,
            "text": "She would’ve got a two piece and a biscuit if she would’ve coughed on me 👊🏾👊🏾",
            "title_similarity": "0.4317158",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8jndi",
            "score": 3,
            "text": "I couldn't get my android to play the video from the article.   \n\nWatch \"Maskless 'Karen' who coughed all over grocery store customers in Viral Video loses her Cushy IT Job.\" on YouTube \n\nhttps://youtu.be/79H0ctbVxd0",
            "title_similarity": "0.6672275",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc8jo89",
            "score": 1,
            "text": "Maybe it will knock sense to her",
            "title_similarity": "0.2441739",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8js84",
            "score": 3,
            "text": "Just wait we will soon be seeing a video or read a quote of how “sorry” she is for her actions. “That’s not who I am.”",
            "title_similarity": "0.56344646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8jshz",
            "score": 2,
            "text": "Hopefully soon to be charged criminally and sued civilly for assault.",
            "title_similarity": "0.2757206",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hc8jxlf",
            "score": 4,
            "text": "I wonder if a year from now, as she looks over the remains of a life shattered by the backlash earned through this public act of stupid bravado, if she'll think it was worth it.",
            "title_similarity": "0.6743485",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hc8k3k5",
            "score": 4,
            "text": "They need to be charged and arrested, and face the consequences of their crimes.",
            "title_similarity": "0.32030088",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hc8kbtv",
            "score": 4,
            "text": "hahah another karen get's fucked again :D",
            "title_similarity": "0.4942351",
            "sentiment_compound": -0.0943
        },
        {
            "id": "hc8kgm1",
            "score": 4,
            "text": "SAP is a powerful company, a strong response is appropriate.",
            "title_similarity": "0.0859585",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hc8klt3",
            "score": 3,
            "text": "Take her to court so there’s a permanent stain on her record. Red flags for background checks.",
            "title_similarity": "0.5028906",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8klw7",
            "score": 5,
            "text": "She’ll be in Congress before you know it",
            "title_similarity": "0.30159557",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8kmah",
            "score": 3,
            "text": "She should have lost consciousness too.",
            "title_similarity": "0.41432872",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hc8knmv",
            "score": 3,
            "text": "Glad she lost her job.. what an idiot",
            "title_similarity": "0.73290914",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hc8knqs",
            "score": 8,
            "text": "She is already lined up as a guest speaker at the next RNC, right after Herman Cain's ghost.",
            "title_similarity": "0.3561835",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hc8kove",
            "score": 3,
            "text": "How can you live your whole life and still be this stupid?",
            "title_similarity": "0.3268543",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hc8kwxy",
            "score": 5,
            "text": "I do like that coughing on people during a pandemic is considered assault in my country. Meaning, if she coughed on me I could knock her dumbass out.",
            "title_similarity": "0.55236423",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hc8kx9g",
            "score": 5,
            "text": "F’ed around, found out.",
            "title_similarity": "0.045880646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8l5hf",
            "score": 1,
            "text": "Where does Karen work?",
            "title_similarity": "0.20099221",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8l648",
            "score": 4,
            "text": "Best news I have heard all day",
            "title_similarity": "0.10933328",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hc8l9h5",
            "score": 3,
            "text": "She was just being a complete jerk. An aggressive asshole. I mean who does that? You know you are brain washed to  a certain toxic politics when you act that way.",
            "title_similarity": "0.56671023",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hc8ledb",
            "score": 2,
            "text": "You’d think this woman would have heard of all the other assholes losing their job over the same shit. Do they think it won’t happen to them? Do they think everyone is on their side? What’s going on in their minds?",
            "title_similarity": "0.6426083",
            "sentiment_compound": -0.8895
        },
        {
            "id": "hc8lpf9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.23859353"
        },
        {
            "id": "hc8lvsq",
            "score": 3,
            "text": "Sit the fuck down, Karen",
            "title_similarity": "0.2902713",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hc8m3fo",
            "score": 3,
            "text": "I sincerely hope it was a great well paid job she lost.",
            "title_similarity": "0.41911906",
            "sentiment_compound": 0.872
        },
        {
            "id": "hc8mca7",
            "score": 1,
            "text": "Wait, what? Muh freedom!  In America we are free from consequences, right?  RIGHT?!",
            "title_similarity": "0.008185182",
            "sentiment_compound": 0.8633
        },
        {
            "id": "hc8moff",
            "score": 1,
            "text": "Good. Ugh. \nNext thought: I wonder how far past the goal her gofundme is\n(Didn't even read it, just assumed)",
            "title_similarity": "0.34789723",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc8n4nh",
            "score": 4,
            "text": "SAP is a huge company, too\n\nGood on them.",
            "title_similarity": "0.10181515",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hc8ndh9",
            "score": 3,
            "text": "Why do these people always look like they have dead bodies in a basement....",
            "title_similarity": "0.51035917",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hc8nfaq",
            "score": 4,
            "text": "Wow, I pegged her as a stay at home mother of three angry Chihuahuas with a husband who runs his own HVAC & Plumbing company.",
            "title_similarity": "0.54205775",
            "sentiment_compound": 0.128
        },
        {
            "id": "hc8ns4e",
            "score": 5,
            "text": "She fucked around. \n\nShe found out.",
            "title_similarity": "0.43956667",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc8o913",
            "score": 2,
            "text": "Was really hoping to see this after seeing the video the other day. Thank goodness",
            "title_similarity": "0.2266642",
            "sentiment_compound": 0.8221
        },
        {
            "id": "hc8obv7",
            "score": 1,
            "text": "What I don't get is why she had to go ask someone why they are wearing a mask? If people is not asking you why, under a mask mandate, you are maskless, why you have to ask them why they are wearing one?!!!! She was looking for trouble and going viral. I hope she goes very viral alright.",
            "title_similarity": "0.5053377",
            "sentiment_compound": 0.6132
        },
        {
            "id": "hc8ol1t",
            "score": 1,
            "text": "Now she will probably get a gofundme account for being a freedumb martyr/oppressed victim.",
            "title_similarity": "0.48392498",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc8on0r",
            "score": 2,
            "text": "Know your place, trash",
            "title_similarity": "0.0975261",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8owi0",
            "score": 1,
            "text": "oh my god i got it!   its because she looks like Stephanie Lazarus!!!",
            "title_similarity": "0.24454468",
            "sentiment_compound": 0.6973
        },
        {
            "id": "hc8oyg4",
            "score": 1,
            "text": "Losing her job is at least something. Not nearly as fun as 2,000,000 scoville units of bear spray would have been.  I'd happily see her screaming in pain but since she is likely a rethuglican there's a decent  chance she has a concealed carry which she would attempt to employ even though she couldn't see straight after the bear spray.",
            "title_similarity": "0.54194355",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hc8p0qg",
            "score": 2,
            "text": "When will people understand that, while you have rights, others also have the right to NOT be exposed to your germs.",
            "title_similarity": "0.1523166",
            "sentiment_compound": 0.0572
        },
        {
            "id": "hc8p1ug",
            "score": 3,
            "text": "You’ve got to be loosing your mind if you’re out there coughing on people (pandemic or not) and thinking that’s just fine and dandy",
            "title_similarity": "0.54270697",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hc8p4kd",
            "score": 3,
            "text": "So she either goes on Fox to claim she's the real victim or launches a go fund me\n\nWhich is first?",
            "title_similarity": "0.40837196",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc8p7oe",
            "score": 2,
            "text": "But she had a medical!",
            "title_similarity": "0.18252258",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8paer",
            "score": 2,
            "text": "The amount of material I can use to my students regarding freedom of expression isn't freedom from consequences is growing by the day.",
            "title_similarity": "0.18273878",
            "sentiment_compound": 0.3678
        },
        {
            "id": "hc8pfkw",
            "score": 1,
            "text": "Shitty it’s gotta come to this.",
            "title_similarity": "0.25948378",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hc8pfyq",
            "score": 4,
            "text": "The beach guy yelling at the swimsuit girls got fired too. Guess its a good day to feel the consequences of your shitty behavior.",
            "title_similarity": "0.6329503",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hc8piob",
            "score": 5,
            "text": "This woman will be representing Nebraska in Congress by 2024.",
            "title_similarity": "0.20369439",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8pqea",
            "score": 4,
            "text": "I bet she’ll be asked to speak at the Republican National Convention",
            "title_similarity": "0.30349654",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8pttc",
            "score": 1,
            "text": "Play stupid games, win stupid prizes.",
            "title_similarity": "0.35303858",
            "sentiment_compound": 0.34
        },
        {
            "id": "hc8pwbo",
            "score": 2,
            "text": "What a pathetic loser.  That’s most likely someone’s mom, yikes!",
            "title_similarity": "0.6644209",
            "sentiment_compound": -0.8122
        },
        {
            "id": "hc8pwmu",
            "score": 1,
            "text": "I would likely have punched her for that.  I wonder if that would get me in more trouble.  My wife has lung issues and covid would likely cause her real problems, so this kind of behavior isn't something I'd take lightly.",
            "title_similarity": "0.50806993",
            "sentiment_compound": -0.6901
        },
        {
            "id": "hc8px75",
            "score": 3,
            "text": "Thank goodness, i was waiting for this one",
            "title_similarity": "0.040111132",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hc8pz3m",
            "score": 2,
            "text": "She’s lucky the title doesn’t read “loses her fuckin teeth.”",
            "title_similarity": "0.63843465",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hc8q09i",
            "score": 3,
            "text": "I am delighted by this news",
            "title_similarity": "0.011512192",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hc8q6s7",
            "score": 2,
            "text": "Communicable Disease Laws in my state are pretty cut and dry.\n\nMy friend worked at a 7-11 and absolutely decked a guy for doing something like this, and the cops sided with him.",
            "title_similarity": "0.54620457",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hc8q87c",
            "score": 1,
            "text": "My biggest problem is if you want to be like her why be asshole to others. Just don’t wear a mask and be on your way that’s it",
            "title_similarity": "0.46558797",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc8qkqp",
            "score": 2,
            "text": "She's lucky she didn't get knocked out AND fired.",
            "title_similarity": "0.3815676",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hc8qlxs",
            "score": 1,
            "text": "Totally expected this shit if someone intentionally coughed on you even before Covid it wasn’t cool.",
            "title_similarity": "0.47003365",
            "sentiment_compound": -0.5073
        },
        {
            "id": "hc8qpiv",
            "score": 2,
            "text": "i was hoping she'd get jail time, but fired is a nice start",
            "title_similarity": "0.45879063",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hc8qq14",
            "score": 1,
            "text": "You messed up now Susie Q, made it to the nightly news",
            "title_similarity": "0.4688318",
            "sentiment_compound": -0.34
        },
        {
            "id": "hc8qq3h",
            "score": 7,
            "text": "Pandemic or not if a stranger is purposefully coughing on me, we are definitely having a confrontation.",
            "title_similarity": "0.5507548",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hc8r6od",
            "score": 6,
            "text": "A man got thirty days in jail for licking a tub of ice cream and a woman was facing possibly 20 years in prison for doing something similar.\n\nThis was before the pandemic.  Losing your job when you choose to go up and cough in someone's face for shits and giggles during a pandemic seems relatively minor in comparison.",
            "title_similarity": "0.59244066",
            "sentiment_compound": -0.802
        },
        {
            "id": "hc8r90q",
            "score": 1,
            "text": "I hope she goes back to Arizona. I don’t want this fucking bitch in my town.",
            "title_similarity": "0.5049887",
            "sentiment_compound": -0.2247
        },
        {
            "id": "hc8rb7d",
            "score": 2,
            "text": "Legally speaking, in most places thats considered assault.  Regardless of covid.    \n  \nPress charges. Even if someone throws water at you, you can call the police and press charges.",
            "title_similarity": "0.3039431",
            "sentiment_compound": -0.765
        },
        {
            "id": "hc8rd59",
            "score": 1,
            "text": "I remember a guy at Costco who got fired for spitting on the floor.   Yes... inside!",
            "title_similarity": "0.6328752",
            "sentiment_compound": -0.2942
        },
        {
            "id": "hc8rhk2",
            "score": 3,
            "text": "I actually think the most surprising thing i. this story is that Lincoln Nebraska has a mask mandate in Sept 2021",
            "title_similarity": "0.17571455",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hc8rjfc",
            "score": 3,
            "text": "Not good enough. Arrest and charge with the crime.",
            "title_similarity": "0.3109238",
            "sentiment_compound": -0.5954
        },
        {
            "id": "hc8rw13",
            "score": 3,
            "text": "What a total fucking piece of shit. Glad she lost her job, the victim should bring it to the police. This is legit assault.",
            "title_similarity": "0.6792836",
            "sentiment_compound": -0.8428
        },
        {
            "id": "hc8s3ag",
            "score": 1,
            "text": "I can't believe leopards ate *my* face!",
            "title_similarity": "0.42885268",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8scla",
            "score": 2,
            "text": "This is grounds for using the “stand you ground” law, because this women is potentially putting people’s lives in danger. I’m surprised no one punched her in the throat, because they would have been totally justified in doing so.",
            "title_similarity": "0.374614",
            "sentiment_compound": -0.1796
        },
        {
            "id": "hc8sj3d",
            "score": 4,
            "text": "She should be arrested, that’s felony assault",
            "title_similarity": "0.37420458",
            "sentiment_compound": -0.886
        },
        {
            "id": "hc8sli8",
            "score": 4,
            "text": "The lifelong humiliation is real.",
            "title_similarity": "0.32801044",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hc8ss14",
            "score": 2,
            "text": "\"I'm not sick and neither are you\" I can yell cuz the chicken entrails this morning told me so. Wiccan is real, girls.",
            "title_similarity": "0.23535642",
            "sentiment_compound": 0.4023
        },
        {
            "id": "hc8stgg",
            "score": 3,
            "text": "If she was still employed she’d have to be vaccinated now.",
            "title_similarity": "0.31647545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8tsew",
            "score": 3,
            "text": "Whenever I see videos like this I always have a sick feeling in my stomach that it might be somebody from Nebraska, it turns out this time it is or maybe we can blame it on Arizona. \n\nCome on Midwesterners, your better than that.",
            "title_similarity": "0.4179337",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hc8uryn",
            "score": 3,
            "text": "Fired from SAP, she was probably making great money, what a moron.",
            "title_similarity": "0.5348835",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hc8uvvg",
            "score": 6,
            "text": "Thank god ! Watched this on TikTok last night . She deserves to be banned from grocery stores . Can you imagine if she’s positive , she’s coughing on the foods that will be touched all day long .",
            "title_similarity": "0.71411645",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hc8v3ro",
            "score": 4,
            "text": "Question: if someone comes up to you like this and is purposely trying to cough in your face.\n\nWhat would be the ramifications of punching them in the jaw?",
            "title_similarity": "0.46281207",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc8v47u",
            "score": 2,
            "text": "Fuck that C* NT! And fuck all u unvaccinated C* NTS!",
            "title_similarity": "0.3324085",
            "sentiment_compound": -0.8217
        },
        {
            "id": "hc8vf3u",
            "score": 1,
            "text": "Pimp slap her and say it’s because of your dystonia",
            "title_similarity": "0.68833756",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hc8vo1i",
            "score": 4,
            "text": "She should be charged with assault as well",
            "title_similarity": "0.31946957",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hc8vv23",
            "score": 3,
            "text": "Good. She deserved it for being such an awful person.",
            "title_similarity": "0.47523335",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hc8w1u8",
            "score": 2,
            "text": "Next stop for her OAN or Fox News where she can be celebrated for the freedumb loving idiot she is.",
            "title_similarity": "0.542562",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hc8w5is",
            "score": 3,
            "text": "These people must want to be fired.",
            "title_similarity": "0.4460274",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hc8w97e",
            "score": 3,
            "text": "u/Jessabird please file a complaint with the police so criminal charges can get filed on her.",
            "title_similarity": "0.37639612",
            "sentiment_compound": -0.768
        },
        {
            "id": "hc8w9r4",
            "score": 2,
            "text": "This woman is a turd of a human being.",
            "title_similarity": "0.3827446",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8wgrb",
            "score": 3,
            "text": "She looks like a woman in her fifties. Sadly older women in general find it hard to find new employment. Even older women who have, for example, been redundant through no fault of their own and have spectacular work experience can struggle to win at interviews. I have a feeling this woman may be about to experience more karma that she’s expecting. Sucks to be her.",
            "title_similarity": "0.64270735",
            "sentiment_compound": 0.2635
        },
        {
            "id": "hc8wkic",
            "score": 5,
            "text": "So she's ok with a needle full of face filler but not the vaccine.. classy.",
            "title_similarity": "0.40679157",
            "sentiment_compound": -0.3334
        },
        {
            "id": "hc8ws2q",
            "score": 4,
            "text": "One of my best friends works in Ft Lauderdale as a civil engineer at a private firm.  Her boss as well as the president of the company think covid is a joke and have repeatedly held company wide meetings in person for the first time (never did so before covid), have forced employees into work everyday, have made jokes about people wearing masks, have had after work “covid parties” as a wake to laugh about the whole thing.\n\n\n3 weeks ago her boss was feeling slightly under the weather so he was going around coughing on people and then joking by saying “haha now you’ve got covid too”.  Gradually got worse to him going to the doctor and getting checked. What do you know? Tested positive for covid after coughing on everyone in the office.\n\n\nNo repercussions. He’s back at work. Thinks the whole thing is funny.\n\n\nMy friend is in the process of interviewing elsewhere but has to suck it up for the time being. \n\n\nIt’s just insane to me what people do.  Absolutely insane how rude anyone can be.",
            "title_similarity": "0.5776583",
            "sentiment_compound": -0.7773
        },
        {
            "id": "hc8x08m",
            "score": 3,
            "text": "Serves her right! Ridiculous!",
            "title_similarity": "0.2544204",
            "sentiment_compound": -0.4738
        },
        {
            "id": "hc8x4hr",
            "score": 2,
            "text": "Sure she won't be laughing like that this Christmas when she can't afford to buy gifts because she has no job.",
            "title_similarity": "0.52091885",
            "sentiment_compound": -0.5629
        },
        {
            "id": "hc8x596",
            "score": 3,
            "text": "Ya lady, because it’s THEY who are the sheep. You’re coughing on some lady and her little child, and risking your and their life, but they are the sheep. 🤦🏻‍♂️ These people have really gone off the deep end. I wonder if she was telling a r/onejoke, complaining about Robert E. Lee statues being torn down, and coughing at them all at the same time. Maybe she’s a porn star, and this is some sort of weird right wing fantasy she’s acting out. A “sticking it to the libs,” GILF sort of thing, for all the right wingers, who are all about “family values!”",
            "title_similarity": "0.64634156",
            "sentiment_compound": -0.7905
        },
        {
            "id": "hc8xbhv",
            "score": 5,
            "text": "I’m betting nobody who works with her is surprised.",
            "title_similarity": "0.31549793",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hc8xeit",
            "score": 2,
            "text": "When will the Karens of the world gain that valuable self awareness and/or good sense that keeps them employed.",
            "title_similarity": "0.10605694",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hc8xov9",
            "score": 7,
            "text": "Under Trump, the Justice Department released guidance for prosecuting purposefully transmitting covid as bioterrorism. \n\nI'm not saying this woman should be charged with bioterrorism, but lots of these people fucking around have the potential to find out hard.",
            "title_similarity": "0.3601792",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hc8y0ly",
            "score": 3,
            "text": "Why do they all look the same?",
            "title_similarity": "-0.11204097",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8y516",
            "score": 1,
            "text": "They terrkk errr jerrrbs",
            "title_similarity": "0.16489008",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8y7e3",
            "score": 2,
            "text": "That's Nebraska for ya",
            "title_similarity": "-0.040096276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8yamb",
            "score": 1,
            "text": "This is the top post on r/news today. A woman coughing on someone.",
            "title_similarity": "0.6910491",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hc8ycim",
            "score": 1,
            "text": "Yeah it’s get easy to tell why someone is not taking a vaccine.  Their reasoning follows the talking points of Fox News and other  conservative outlets. \n\nWhy else would someone take a horse dewormer before a vaccine developed for HUMANS",
            "title_similarity": "0.24411102",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hc8ycmh",
            "score": 3,
            "text": "Good, this kind of behavior would be totally unacceptable even if we WEREN'T in the midst of  a deadly pandemic that's claimed half a million lives.",
            "title_similarity": "0.48022375",
            "sentiment_compound": -0.101
        },
        {
            "id": "hc8yijy",
            "score": 1,
            "text": "That’s not your average job she was fired from. SAP pays incredibly well.",
            "title_similarity": "0.41104674",
            "sentiment_compound": -0.2975
        },
        {
            "id": "hc8yiyh",
            "score": 5,
            "text": "Coughing on customers…what a twatwaffle",
            "title_similarity": "0.6559458",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8yq99",
            "score": 4,
            "text": "My wife would have leveled that woman.  You mess with her babies you will feel her wrath.",
            "title_similarity": "0.6846305",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hc8yvto",
            "score": 2,
            "text": "Meet the next Rightstream media darling victim hero.",
            "title_similarity": "0.3019185",
            "sentiment_compound": 0.743
        },
        {
            "id": "hc8z2st",
            "score": 5,
            "text": "If that happened to me I'd give a warning that I'm going to defend myself, but if she coughed on me again, I'd clock her. The question is whether I might get arrested or not. There's a pandemic going on so that intentional coughing on someone certainly looks like an assault, and you can defend yourself against an assault. But I'm a guy so if I hit that woman I might get arrested no matter the circumstances.",
            "title_similarity": "0.44796824",
            "sentiment_compound": -0.9447
        },
        {
            "id": "hc8z4b3",
            "score": 3,
            "text": "Ah yes using a disease as a passive aggressive attack. Ucheuche coming tru. Yeah, so is your final paycheck\n\nNEEEXXTTT",
            "title_similarity": "0.40947288",
            "sentiment_compound": 0.25
        },
        {
            "id": "hc8zavy",
            "score": 5,
            "text": "What a jackass. People like this always bitch about respecting THEIR choice, but they never respect other people’s choices.",
            "title_similarity": "0.47435945",
            "sentiment_compound": -0.5833
        },
        {
            "id": "hc8zd0c",
            "score": 2,
            "text": "No video? Just gives me a picture.",
            "title_similarity": "0.17041264",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc8zdm1",
            "score": 2,
            "text": "Aw. Was looking forward to the headline ending with “jaw”",
            "title_similarity": "0.2429737",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8zlte",
            "score": 1,
            "text": "I love how trump is still living rent free in all these commenters heads. The woman is a tool - doesn’t matter what her political affiliations are. Pretending liberals don’t do equally insane crap is a major case of denial.",
            "title_similarity": "0.33996004",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hc90nlq",
            "score": 6,
            "text": "At the top of the article is now an update that the police can't press charges because no one has stepped forward to complain.\n\nThat's absolutely absurd. She is, clear as day, on video committing a crime.  So it's not a fucking crime if someone doesn't complain even though there is irrefutable evidence??!  What an absolutely backwards legal system.",
            "title_similarity": "0.40553093",
            "sentiment_compound": 0.6022
        },
        {
            "id": "hc90v36",
            "score": 4,
            "text": "Jason Hargrove, may he rest in peace. DJ and bus driver, coughed on by a passenger on a bus in Detroit and passed away from Covid-19 days later.",
            "title_similarity": "0.530083",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hc90yz0",
            "score": 6,
            "text": "Wtf is that video? \"2 years ago, before covid, you didn't care about wearing masks\" ... uhh yeah? What kind of an own is that lmao. \n\n\"Before things changed, you didn't want to do anything to fix the change that hadn't happened yet\"",
            "title_similarity": "0.3170854",
            "sentiment_compound": -0.2287
        },
        {
            "id": "hc90znd",
            "score": 3,
            "text": "Lol. This was posted to r/byebyejob a few days ago!",
            "title_similarity": "0.1824976",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hc912o7",
            "score": 7,
            "text": "I’m not a violent person by nature, but damn does that lady have an intensely punchable face.",
            "title_similarity": "0.26820695",
            "sentiment_compound": -0.3563
        },
        {
            "id": "hc917f5",
            "score": 6,
            "text": "Found this on her LinkedIn profile \n\n“I tolerate your hate so I can capture the identities of those who threaten harm. Welcome to the modern social media viper pit. You all should be ashamed. You do not know the whole story and have not seen the videos in their entirety. I now know how our men in blue feel when they are wrongly convicted by the court of social media and antifa. May God bless and heal our country.   The ship is safest when it's in port, but that's not what ships were built for. - Paulo Coelho “",
            "title_similarity": "0.5169329",
            "sentiment_compound": -0.2846
        },
        {
            "id": "hc91ffh",
            "score": 1,
            "text": "What's Carol Beer going to do now?",
            "title_similarity": "0.14982438",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc91g28",
            "score": 5,
            "text": "Good. When I saw this I was like wtf you’re a grown woman. Act your age!",
            "title_similarity": "0.2653275",
            "sentiment_compound": 0.2244
        },
        {
            "id": "hc91idm",
            "score": 2,
            "text": "Unless she’s just the janitor or something, I have to guess that working SAP is a pretty well paying gig in Nebraska. And the benefits are likely pretty decent.\n\nHealth insurance just went bye bye. Better consider masking up. Oh and get vaxxed too while she’s at it.",
            "title_similarity": "0.41321284",
            "sentiment_compound": 0.9186
        },
        {
            "id": "hc91mbr",
            "score": 4,
            "text": "Even without a mask, cover your mouth when coughing in front of people or cough away from them not ON them. geez.",
            "title_similarity": "0.4510492",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc91ntn",
            "score": 3,
            "text": "public display of mental illness",
            "title_similarity": "0.34933776",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hc91xda",
            "score": 5,
            "text": "Good. She should've been arrested.",
            "title_similarity": "0.3127225",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hc92b34",
            "score": 4,
            "text": "what a foul piece of trash",
            "title_similarity": "0.32095143",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc92ebo",
            "score": 3,
            "text": "There is so much misery happening in this world already. Can people just not willingly be assholes to others, just because they think they are allowed to be?",
            "title_similarity": "0.45630383",
            "sentiment_compound": -0.2279
        },
        {
            "id": "hc92er9",
            "score": 3,
            "text": "To quote Silky Johnson: \"I hope all the bad things in life happen to you and only you\"",
            "title_similarity": "0.4613372",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hc92foa",
            "score": 4,
            "text": "As a +200lb middle aged gun owning white male from the south, I have to ask, do you want punched in the face? Cause you do this to me or my family, you gonna get punched In the face....",
            "title_similarity": "0.41069484",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc92g0t",
            "score": 9,
            "text": "Fired? She should have been arrested.",
            "title_similarity": "0.46723932",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hc92jj0",
            "score": 4,
            "text": "“I got cancelled because I owned the libz”",
            "title_similarity": "0.39309245",
            "sentiment_compound": -0.25
        },
        {
            "id": "hc92k9o",
            "score": 7,
            "text": "Why isn’t she in prison? That should be considered bio terrorism in the midst of a pandemic.",
            "title_similarity": "0.44748187",
            "sentiment_compound": -0.836
        },
        {
            "id": "hc933d6",
            "score": 7,
            "text": "Pandemic or not...  A stranger coughing on me is quickest way of getting to orbit. A seamless backhand, adorned with all that pimp slap flair. 100% totally justified.",
            "title_similarity": "0.29989135",
            "sentiment_compound": 0.659
        },
        {
            "id": "hc936zw",
            "score": 5,
            "text": "Hi Karen. \n\nBye Karen.",
            "title_similarity": "0.18674654",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc93egq",
            "score": 10,
            "text": "I bet her co-workers are celebrating that she got fired.",
            "title_similarity": "0.6710996",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc93i59",
            "score": 2,
            "text": "So this is what the guy from the 1st purge has been up too.",
            "title_similarity": "0.06886003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc93lx6",
            "score": 3,
            "text": "She looks deranged. I don't think she's all right in the head",
            "title_similarity": "0.45408028",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc93n4n",
            "score": 6,
            "text": "Not sure why you'd ever think that coughing on someone is a good use of time, honestly.",
            "title_similarity": "0.32312495",
            "sentiment_compound": 0.6044
        },
        {
            "id": "hc93tci",
            "score": 4,
            "text": "\\>The woman seen in a viral video coughing on a mother and her daughter in a Lincoln grocery store was identified as an employee working in Arizona for the business software company SAP.\n\nI have no idea if SAP was the first link on a google search for \"sap\" before, but they are now.",
            "title_similarity": "0.6145176",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hc93v5a",
            "score": 4,
            "text": "What an unmitigated battery by a complete asshole.\n\nI wonder if she'll still have that smug look on her face at the unemployment office?",
            "title_similarity": "0.63174975",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc93zy6",
            "score": 3,
            "text": "Thats a great way to catch an ass whoopin.",
            "title_similarity": "0.17448299",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hc9474u",
            "score": 7,
            "text": "r/conservative gearing up to support her 2022 congressional run in 3....2....1",
            "title_similarity": "0.23738657",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hc95slx",
            "score": 1,
            "text": "As of today she probably would’ve been mandated to get vaccinated and may have been fired regardless. But this is very fitting",
            "title_similarity": "0.40682673",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hc963sm",
            "score": 3,
            "text": "She’s lucky she was able to walk away from the altercation unharmed. Some people are not quite so forgiving.",
            "title_similarity": "0.44955873",
            "sentiment_compound": 0.7839
        },
        {
            "id": "hc96j89",
            "score": 2,
            "text": "Will she be charged with assault?",
            "title_similarity": "0.33380288",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hc974zx",
            "score": 2,
            "text": "If anyone ever asks for the definition of a \"shit-eating grin\" they should be shown that photo.",
            "title_similarity": "0.20750353",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hc9761b",
            "score": 1,
            "text": "Disrespectful and disgusting",
            "title_similarity": "0.33785665",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hc97iit",
            "score": 1,
            "text": "More freedumb for her",
            "title_similarity": "0.17458211",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc97lym",
            "score": 1,
            "text": "Good. \n\nNow, fire the old lady who harass the girl in the church bathroom\n\nAnd the guy harassing the girls at the lake beach about their bathing suits",
            "title_similarity": "0.7034167",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hc989ik",
            "score": 1,
            "text": "Surprised Karen didn't get doxxed sooner.",
            "title_similarity": "0.21456847",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hc98alw",
            "score": 4,
            "text": "Satisfying conclusion to this ridiculous story. Heart warming.",
            "title_similarity": "0.1401401",
            "sentiment_compound": 0.7118
        },
        {
            "id": "hc98dic",
            "score": 5,
            "text": "This is amazing fast development, plus the guy who harassed two girls\nOn beach got fired too, this is amazing shit.",
            "title_similarity": "0.5748501",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hc98nc3",
            "score": 3,
            "text": "YEAHHHH WOOOO! I watched this video the other day, I’m not sure why but it was one of those that made me super angry, usually I’m like “how stupid” and move on. But I’m so happy to know that she has to suffer consequences for her actions and hopefully will never do something so arrogant again!",
            "title_similarity": "0.5956025",
            "sentiment_compound": 0.6112
        },
        {
            "id": "hc98tno",
            "score": 3,
            "text": "Crocodile tears incoming in 3... 2...",
            "title_similarity": "0.3313423",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hc99910",
            "score": 2,
            "text": "I hope the lady being coughed on contacts the police and files charges.",
            "title_similarity": "0.5809776",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hc9aatk",
            "score": 3,
            "text": "Per her linked in, she is considering becoming an attorney to go after people making terrible and bad comments on the internet. She hasn’t learning a fucking thing.",
            "title_similarity": "0.6259339",
            "sentiment_compound": -0.765
        },
        {
            "id": "hc9ag3s",
            "score": 1,
            "text": "I swear if this shit ever happens to me I’m probably going to jail.",
            "title_similarity": "0.38804632",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hc9b7ts",
            "score": 2,
            "text": "It’s funny because she was trying to have a Fox debate in the grocery store. “No one said anything before, you weren’t talking about this before Covid.” That’s like trying to take nail clippers on a plane right after 9/11. The game has changed.",
            "title_similarity": "0.4429947",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hc9b94o",
            "score": 1,
            "text": "“It’s not a criminal case because no one filed a complaint” I mean murder victims can’t file a complaint and yet their killers get arrested.",
            "title_similarity": "0.3233715",
            "sentiment_compound": -0.9435
        },
        {
            "id": "hc9d8de",
            "score": 1,
            "text": "What ever happened to shutting your mouth and minding your own fucking business?",
            "title_similarity": "0.4098544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9dhef",
            "score": 2,
            "text": "Added her on linked in. Needed email for request to fin through. Guessed her email address. Awaiting response. Will probably not report back.",
            "title_similarity": "0.39172912",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9e1nb",
            "score": 3,
            "text": "I bet you SAP has booking looking for an excuse to fire her ass. A hole like that tends to be an A hole 24/7…. I’m pretty sure her coworkers are happy she’s gone…..also the company wouldn’t have fired her just like that unless she has a history of being difficult…",
            "title_similarity": "0.6586449",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hc9e26i",
            "score": 1,
            "text": "What an entitled cunt! Maybe it's her shit law degree maybe she's just a cunt 🤔",
            "title_similarity": "0.4253046",
            "sentiment_compound": -0.8478
        },
        {
            "id": "hc9elm0",
            "score": 3,
            "text": "I'm surprised she didn't get punched.",
            "title_similarity": "0.26031256",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hc9exom",
            "score": 2,
            "text": "Pandemic or not, if someone goes out of their way to cough on me, I’m giving them a reason to cough. Fuck this dumb bitch.",
            "title_similarity": "0.6430549",
            "sentiment_compound": -0.8682
        },
        {
            "id": "hc9f1j3",
            "score": 2,
            "text": "Some asshole somewhere is falling over themselves to gift her a job she may be unqualified for because they think anti vax/maskers are the victims of cancel culture.  Fox News is probably already looking to book her appearance.",
            "title_similarity": "0.5939488",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hc9fxix",
            "score": 3,
            "text": "There’s probably some other idiot who saw this and offered her a new job on the spot.",
            "title_similarity": "0.48985612",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hc9g5jz",
            "score": 3,
            "text": "Unbelievable that someone could be that rude and ignorant.  Show her face on every newscast for the next month so everyone will know her and can ostracize her.  Any anti-vaxers out there who can see how sick this is?",
            "title_similarity": "0.6327909",
            "sentiment_compound": -0.765
        },
        {
            "id": "hc9g8qv",
            "score": 3,
            "text": "What a nightmare of a human.",
            "title_similarity": "0.36809176",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9g93t",
            "score": 4,
            "text": "United States of America used to have WE mentality, unfortunately this in the past decade has turned more into ME mentality and we against them... \nPlenty of these crazy Karens around",
            "title_similarity": "0.41160148",
            "sentiment_compound": -0.25
        },
        {
            "id": "hc9gfkv",
            "score": 1,
            "text": "This lady should have coughed on customers in south Memphis. The title would be completely different. In this day and age I would feel like you were jeopardizing my families lives.",
            "title_similarity": "0.668098",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc9gjw9",
            "score": 1,
            "text": "I (thankfully) missed this, how did they find out that she worked at SAP to get her fired?",
            "title_similarity": "0.6772023",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hc9gvfm",
            "score": 4,
            "text": "When your access to health care (especially during a pandemic) is through your employer, you’d think not doing shit that gets you fired would be paramount.",
            "title_similarity": "0.44962075",
            "sentiment_compound": 0.3662
        },
        {
            "id": "hc9h1mo",
            "score": 1,
            "text": "Meh, she's look's close enough to retire anyway.",
            "title_similarity": "0.30349708",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hc9ixka",
            "score": 3,
            "text": "Seems to me she got what she asked for. She made a fool of herself. And most likely she doesn't have sense enough to see it. The only sense they have is their sense of self-entitlement/ importance.  Everything is all about them and what they want. That's one of the biggest reasons I feel Trump appeals to them.\n\nHe has that same narcissistic self-absorbed, self-entitlement way about him. And just like Trump, they don't give a damn about anyone else but themselves. To them, it's all about what they think is best. Instead of what is best for the whole. And even though they don't realize it, how they think is literally killing them. How they think and do is the main reason this virus has become a republican virus. It's running through republicans like chit through a goose.\n\nAnd a final thought. In 2016 74 million voted republican. At thie rate, things are going in 3 years if they don't come out of their stupid phase, there will not be enough republicans left to vote. And just like Trump, they did it all to themselves.[https://www.project-syndicate.org/commentary/vaccination-reduced-mortality-evidence-republicans-by-jeffrey-frankel-2021-07](https://www.project-syndicate.org/commentary/vaccination-reduced-mortality-evidence-republicans-by-jeffrey-frankel-2021-07)",
            "title_similarity": "0.34486777",
            "sentiment_compound": 0.8667
        },
        {
            "id": "hc9j5gd",
            "score": 1,
            "text": "https://youtu.be/H5d42w4ZcY4",
            "title_similarity": "0.0044536777",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9j6i5",
            "score": 3,
            "text": "They probably wanted to do that long time before this video, but noe they have an excuse",
            "title_similarity": "0.19345886",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hc9jdw2",
            "score": 2,
            "text": "Hmm... mouthy entitled diva wannabe, What're the odds they were looking for a reason before the video came out?",
            "title_similarity": "0.40824723",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hc9jgvh",
            "score": 4,
            "text": "The cunt got what she deserves, accept the knuckle sandwich , that she was desperately asking for.",
            "title_similarity": "0.36988747",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hc9k5sy",
            "score": 1,
            "text": "On Fox News in 5…4..3z",
            "title_similarity": "0.12321096",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9l5tg",
            "score": 2,
            "text": "I have never hit a person in my life , that aside I would’ve knocked someone out for doing this prepandemic",
            "title_similarity": "0.32320672",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9lzl8",
            "score": 1,
            "text": "I think they have like 50,000 employees. Doing it in a day is a minor miracle.",
            "title_similarity": "0.25716853",
            "sentiment_compound": 0.743
        },
        {
            "id": "hc9m97e",
            "score": 2,
            "text": "Honestly, what the fuck goes on in ones mind to think this childish, dumb fuckary is entertaining or funny? Act like a fucking grown person",
            "title_similarity": "0.33557892",
            "sentiment_compound": 0.25
        },
        {
            "id": "hc9mjyw",
            "score": 1,
            "text": "Man, they all have they same look. You just want to punch em.",
            "title_similarity": "0.19930774",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hc9mq2t",
            "score": 1,
            "text": "I would of knocked her out if she did that near my child.",
            "title_similarity": "0.5021088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9no18",
            "score": 6,
            "text": "Fuck this underdeveloped bitch... Also FUCK anybody like her....  Calls us sheep...   They are the sheep. .. My wife and myself are fully vaccinated.... I still wear my mask to prevent my newborn niece and nephew from the risks of infection",
            "title_similarity": "0.5103608",
            "sentiment_compound": -0.9008
        },
        {
            "id": "hc9ok3n",
            "score": 3,
            "text": "It's 11:26 pm. This made my day.",
            "title_similarity": "0.08461814",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9pbsx",
            "score": 3,
            "text": "it costs zero dollars to not do this, why do people keep doing it?",
            "title_similarity": "0.21798202",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9pfex",
            "score": 1,
            "text": "Oh nosss, thoughts and prayers",
            "title_similarity": "0.21435645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9q23k",
            "score": 1,
            "text": "Good. She’s insufferable and coughing on people in this day and age is just asking for trouble. You’d think they get that you get filmed a lot.",
            "title_similarity": "0.6308433",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hc9q4lv",
            "score": 1,
            "text": "A lot of good news today.",
            "title_similarity": "-0.01303054",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc9qko4",
            "score": 3,
            "text": "What a bitch! Fuck! And I don’t curse.",
            "title_similarity": "0.2991441",
            "sentiment_compound": -0.9078
        },
        {
            "id": "hc9qx3r",
            "score": 4,
            "text": "The dumbest people are always the loudest.",
            "title_similarity": "0.33256724",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hc9rc7i",
            "score": 1,
            "text": "Should have hit her with a can of beans.",
            "title_similarity": "0.30846232",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9rpo3",
            "score": 5,
            "text": "And to top it off, she looks like MTG's uglier, grosser sister.",
            "title_similarity": "0.5498898",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hc9rx9m",
            "score": 1,
            "text": "this is the real life version of Barb Leahey.",
            "title_similarity": "0.17403841",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9s2be",
            "score": 3,
            "text": "Shes probably gonna be featured on Fox News and claim how she's the victim and how unfair society is being to her.",
            "title_similarity": "0.56796706",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hc9snb9",
            "score": 1,
            "text": "Good. She deserved it.",
            "title_similarity": "0.14122707",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc9so8y",
            "score": 6,
            "text": "Oh my god this is the most maddening thing to watch. My vision is like obscured by red and fire I am so fucking mad about this disgusting childish irresponsible bullshit. If some psychotic Karen ever smugly purposely coughed on me like this I would be unable not to go ape shit and probably punch her until her skull caved in. Especially if I'm like at my job and I can't even just go away from her? Like holy shit how do you not understand even if you aren't sick with anything that's fucking gross, disrespectful on the level of whole slapping someone. Where I grew up you'd get your ass beat to death in broad daylight for some shit like this. And I'd do it to, unless someone stopped me I would beat this woman to death and feel nothing if her response to being told to wear a mask was to cough on me. Anti-maskers are karmically bound for death, if it can ever been said that anyone has ever deserved anything, this bitch deserves covid.",
            "title_similarity": "0.6248721",
            "sentiment_compound": -0.9912
        },
        {
            "id": "hc9sxxz",
            "score": 5,
            "text": "She’s just going to go work for the Trump 2024 campaign",
            "title_similarity": "0.22089343",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9tnym",
            "score": 2,
            "text": "*Cue pathetic sob story blog post*",
            "title_similarity": "0.54561865",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hc9u3ig",
            "score": 3,
            "text": "Good. I was hoping this would happen to that crazy smug woman.",
            "title_similarity": "0.48745817",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hc9v62z",
            "score": 5,
            "text": "Still waiting for criminal charges against her.",
            "title_similarity": "0.2715425",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hc9v6ye",
            "score": 1,
            "text": "\"well I can't just go around *spitting* on people*",
            "title_similarity": "0.30284622",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hc9vbsq",
            "score": 3,
            "text": "The updates to her LinkedIn account are halarious lol",
            "title_similarity": "0.33804882",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hc9vslt",
            "score": 3,
            "text": "Idk if it's mentioned but the store actually told her several times to leave other customers alone and still continued.",
            "title_similarity": "0.5450119",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hc9w0sx",
            "score": 5,
            "text": "People acting like coughing on a stranger was fine before, someone needs to slap her in the act the only way she'll learn",
            "title_similarity": "0.6093191",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hc9w8wt",
            "score": 3,
            "text": "I somewhat gained some respect for SAP. I never thought in my life I would think that.",
            "title_similarity": "0.22668992",
            "sentiment_compound": 0.6302
        },
        {
            "id": "hc9y1bp",
            "score": 4,
            "text": "Good, more stops people listing their jobs.",
            "title_similarity": "0.38308838",
            "sentiment_compound": 0.2516
        },
        {
            "id": "hc9yo18",
            "score": 5,
            "text": "I’m still upset nobody intervened with a righteous uppercut the third time she coughed 😠",
            "title_similarity": "0.558846",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hc9zq08",
            "score": 2,
            "text": "This just made my day",
            "title_similarity": "0.12077251",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc9zr9y",
            "score": 3,
            "text": "I support more and more identifying and exposing these people, just because i red there was someone In that town who was mixed thought to be this person. So if you gonna be entitled bitch, lets make sure we have the right people for shaming and not have any innocent lookalike take the blame even by accident",
            "title_similarity": "0.42533475",
            "sentiment_compound": -0.7649
        },
        {
            "id": "hca39jv",
            "score": 2,
            "text": "She's lucky that's all she lost..",
            "title_similarity": "0.37438744",
            "sentiment_compound": 0.128
        },
        {
            "id": "hca4pn6",
            "score": 1,
            "text": "That sociopath should have been knocked upside the head as a bonus.",
            "title_similarity": "0.31856835",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hca4zhq",
            "score": 4,
            "text": "Doesn't take vaccine but injects botox into her face.",
            "title_similarity": "0.5158162",
            "sentiment_compound": 0.0
        },
        {
            "id": "hca59ei",
            "score": 3,
            "text": "She’s lucky her encounters were peaceful. I would’ve pepper sprayed her maskless ass",
            "title_similarity": "0.43429285",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hca6r0o",
            "score": 3,
            "text": "Pretty disrespectful to all those 500,000+ Americans and their families that died.  Whether you believe in the virus, believe in the vaccine, or believe in masking - one word - despicable.",
            "title_similarity": "0.5551181",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hca82zf",
            "score": 1,
            "text": "I'm surprised nobody pressed charges given the current atmosphere",
            "title_similarity": "0.24086586",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hca8ivm",
            "score": 2,
            "text": "The quote from SAP said she no longer works there. Does that mean she was fired or that she was a prior employee and was no longer employed there before this was videotaped?",
            "title_similarity": "0.6640682",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hcaa43i",
            "score": 6,
            "text": "#AAAAAAAAHAHAHAHAAAAAAAAAAAHAHAHAHAHAHAHAHAAAAAAAAAAAAA \n\nBye cunt",
            "title_similarity": "0.09543676",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hcaa4hu",
            "score": 1,
            "text": "Can you just call the cops immediately when this happens? What happens if you slap someone who is doing this? In self defense?",
            "title_similarity": "0.4546619",
            "sentiment_compound": 0.3899
        },
        {
            "id": "hcaa5q1",
            "score": 3,
            "text": "She'll likely be a guest speaker at some Republican convention within the next year.",
            "title_similarity": "0.26210248",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcaagwx",
            "score": 2,
            "text": "https://www.ibtimes.sg/janene-hoskovec-sap-employee-fired-after-intentionally-coughing-shoppers-nebraska-grocery-store-60123",
            "title_similarity": "0.613991",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcaahul",
            "score": 8,
            "text": "Under present circumstances, intentionally coughing on someone is at best a form of assault, at worst attempted murder.",
            "title_similarity": "0.4625417",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hcaazf8",
            "score": 4,
            "text": "And now she's going to make a fuss on social media about being oppressed",
            "title_similarity": "0.5234962",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hcab8d9",
            "score": 4,
            "text": "why do all these people have FAS face?",
            "title_similarity": "0.24832137",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcabtn9",
            "score": 5,
            "text": "She looks exactly like what I expected her to look like",
            "title_similarity": "0.07714163",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hcac87p",
            "score": 5,
            "text": "I'm glad she got the punishment she deserved. Even if it wasn't during the pandemic, her behavior was unacceptable.",
            "title_similarity": "0.4505043",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hcacvxw",
            "score": 4,
            "text": "My god, can you imagine having a brain that is as fucked as this woman’s? She actually should be in prison for this. I hope just a part of her looks back at this and goes “fuck, I look like such a fucking tool, what is wrong with me?” But it’s just too much to ask for, to have these people have any amount of self reflection…",
            "title_similarity": "0.47912636",
            "sentiment_compound": -0.4606
        },
        {
            "id": "hcadhdq",
            "score": 7,
            "text": "Fired? This lady needs her ass kicked.",
            "title_similarity": "0.64295125",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hcae25u",
            "score": 2,
            "text": "Good. When does she go to jail? That's assault.",
            "title_similarity": "0.426669",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hcaf808",
            "score": 3,
            "text": "What a fucking bitch. I wish someone would file charges against her for her obscene, disgusting behaviour. \n\nEdited to add: “I’m not sick and neither are you.” This dumb fucking bitch is so unaware.  People can be infected and be asymptomatic AND infectious. The idiocy in this world is stunning.",
            "title_similarity": "0.5894499",
            "sentiment_compound": -0.9606
        },
        {
            "id": "hcaidn2",
            "score": 3,
            "text": "Just another ultra low IQ Karen revealed. I feel bad for her relatives watching this video…",
            "title_similarity": "0.6814132",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hcaigwj",
            "score": 3,
            "text": "With a pandemic going around she shouldn't have just lost her job, she should have lost her freedom. That's fucking assault with a biological weapon, throw her ass in prison and strip this bitch if her right to vote.",
            "title_similarity": "0.5428412",
            "sentiment_compound": -0.9291
        },
        {
            "id": "hcaio6w",
            "score": 6,
            "text": "Can we just enjoy the happy fact that somebody as arrogant, entitled and down right nasty as this got their just desserts. No explanation needed, just bask in the pure joy of her fat ass being fired. O happy day.",
            "title_similarity": "0.5118898",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hcajtxb",
            "score": 2,
            "text": "This makes me sad. I always hate when people are fired from their jobs because generally nothing is learned or gained from it. It often feels like these teachable moments where we can reflect on society about the rights/wrongs, and how we can come together to correcting.\n\nBUT, COVID or NOT, coughing on someone is super despicable, ignorant, and can cause actual harm. This is border line physical assault and terrorism. She went out of her way to purposely cough on people to mock and scare them.\n\nTheres no redeeming qualities in that woman.",
            "title_similarity": "0.6768341",
            "sentiment_compound": -0.9828
        },
        {
            "id": "hcalydz",
            "score": 2,
            "text": "Justin case we get all the “she isn’t mentally right” excuses pouting in for her, you can bet she would have been mentally right if someone would have smashed a bottle over her head.",
            "title_similarity": "0.57789564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcan96h",
            "score": 3,
            "text": "Right wing Facebook memes warped this poor woman’s mind! Another victim of the Zuckerberg dystopia.",
            "title_similarity": "0.7233722",
            "sentiment_compound": -0.7199
        },
        {
            "id": "hcanvj6",
            "score": 2,
            "text": "Play stupid games, win stupid prizes. 🤷‍♀️",
            "title_similarity": "0.36838457",
            "sentiment_compound": 0.34
        },
        {
            "id": "hcanx0y",
            "score": 5,
            "text": "I wonder if she’s still smiling",
            "title_similarity": "0.15953708",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hcapebj",
            "score": 6,
            "text": "She changed her [LinkedIn and claims she's a hero.](https://imgur.com/a/vQZemh7)",
            "title_similarity": "0.34123334",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcaq7bw",
            "score": 5,
            "text": "Good.  Play stupid games, win stupid prizes.\nYou want to spread the virus knowingly? Yea there’s a special place in hell for you.\n\nYou don’t deserve to keep your job when you have such disregard for others",
            "title_similarity": "0.45368397",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hcaqads",
            "score": 1,
            "text": "If anyone’s interested, this new study out of Bangladesh attempted to control the variables that confounded some of the previous mask studies. And surprisingly (!) they found they work.  Particularly surgical masks. 350,000 people RCT: this article breaks it down but there is a link to the actual study. \n\nhttps://www.washingtonpost.com/outlook/2021/09/09/masks-randomized-study-bangladesh-covid/",
            "title_similarity": "0.35866547",
            "sentiment_compound": 0.4102
        },
        {
            "id": "hcat2bo",
            "score": 4,
            "text": "That right there is the slap in the face everyone wanted to giver her.",
            "title_similarity": "0.58040166",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hcat9fs",
            "score": 2,
            "text": "The thumbnail pic with that headline looks as if she’s laughing at her future self.",
            "title_similarity": "0.46769804",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hcatl9e",
            "score": 4,
            "text": "\"Woopsee I'm a total piece of shit.\"",
            "title_similarity": "0.3583606",
            "sentiment_compound": -0.5945
        },
        {
            "id": "hcatnes",
            "score": 2,
            "text": "Yeh, she probably was drunk. At least I hope so. If this is how she is sober, well...",
            "title_similarity": "0.44434708",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hcatowp",
            "score": 2,
            "text": "Dumb butch bitch needs a big old tittle twister",
            "title_similarity": "0.5889597",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hcatv00",
            "score": 5,
            "text": "You have to be a special person to harass someone in the days of doxxing. Leave people alone and mind your own business. Is it really that hard?",
            "title_similarity": "0.34579074",
            "sentiment_compound": -0.5233
        },
        {
            "id": "hcauzae",
            "score": 5,
            "text": "What’s the phrase?   \n\nPlay stupid games, win stupid prizes.\n\nThat smirk on her face really pisses me off.",
            "title_similarity": "0.5230902",
            "sentiment_compound": -0.0754
        },
        {
            "id": "hcax21q",
            "score": 2,
            "text": "She’s got a future this one… GOP rallies and conventions here she comes!",
            "title_similarity": "0.32751",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcaxjdn",
            "score": 2,
            "text": "Every video or picture I see, of these types of people or people with these views, look and act completely nuts.",
            "title_similarity": "0.40091112",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hcaxkq4",
            "score": 2,
            "text": "This in some likely affluent Lincoln suburb or wealthy part of town. I live in Atlanta. If she did that here being doxxed would likely be a secondary concern to the beating she might receive from a mother she did that to here.",
            "title_similarity": "0.49141902",
            "sentiment_compound": -0.128
        },
        {
            "id": "hcayg2p",
            "score": 1,
            "text": "Hahaha this is the best news I’ve heard all day!!!",
            "title_similarity": "0.10845718",
            "sentiment_compound": 0.865
        },
        {
            "id": "hcayu5d",
            "score": 1,
            "text": "Some people just need their ass kicked a couple times for this type of shit",
            "title_similarity": "0.40622073",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hcayy7m",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.29731172"
        },
        {
            "id": "hcazqmm",
            "score": 2,
            "text": "Easy way to lose your front teeth.",
            "title_similarity": "0.282218",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hcb0b5b",
            "score": 2,
            "text": "Good fucking riddance",
            "title_similarity": "0.112958685",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hcb3zcx",
            "score": 6,
            "text": "COVID or not, that’s just gross behavior. I’d have punched her right in  the mouth.",
            "title_similarity": "0.59138465",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hcb4f93",
            "score": 2,
            "text": "This woman should get a year in jail. PERIOD.\n\nTHAT would be real justice. But we don't have that in this country now do we?",
            "title_similarity": "0.44330692",
            "sentiment_compound": 0.296
        },
        {
            "id": "hcb5bcz",
            "score": 2,
            "text": "What’s disgusting waste of oxygen. It’s on sight if someone does this to me and I don’t have kids so I don’t have to think twice . So disrespectful!!",
            "title_similarity": "0.49197125",
            "sentiment_compound": -0.7772
        },
        {
            "id": "hcb5bos",
            "score": 5,
            "text": "Even if there weren’t a fucking plague on, that’s disgusting behavior.",
            "title_similarity": "0.35323107",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hcb5oyz",
            "score": 1,
            "text": "Amazing how anyone like this can actually hold a job.",
            "title_similarity": "0.05647551",
            "sentiment_compound": 0.743
        },
        {
            "id": "hcb5qlm",
            "score": 3,
            "text": "What a strange world we find ourselves in",
            "title_similarity": "0.098772794",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hcb61e3",
            "score": 4,
            "text": "well, well, well, if it isn't the consequences of one's actions.",
            "title_similarity": "0.04578967",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hcb6v9o",
            "score": 2,
            "text": "Why do they all have those sort of beady, inset eyes like wood louse spiders?\n\nIs this just a condition we can learn to spot and avoid?",
            "title_similarity": "0.38912672",
            "sentiment_compound": -0.3939
        },
        {
            "id": "hcb7bk0",
            "score": 2,
            "text": "Little bear spray would have cured her cough...",
            "title_similarity": "0.395199",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcb8jzh",
            "score": 3,
            "text": "people like that need to go to prison, coughing on someone is the same these days as sticking a knife into someone",
            "title_similarity": "0.46677846",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hcba7bc",
            "score": 2,
            "text": "So crazy she would do this in the first place. I've had some of my customers deliberately cough on me and one literally coughed spit/phlegm right in my face. It's terrifying. Knowing how that feels and that the virus can kill, I could never do that to another human being.",
            "title_similarity": "0.64724517",
            "sentiment_compound": -0.902
        },
        {
            "id": "hcbb8c2",
            "score": 2,
            "text": "did anyone read the article? \n\n>\tThe one complaint we have received is from an individual who was initially identified online as the offender.\n\nthe police only got involved because the offender (coughing karen) filed her own police report\n\nthis bitch left that scene and continued to truly believe she was in the right",
            "title_similarity": "0.56046474",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hcbbzel",
            "score": 13,
            "text": "Was at a store the other day and two no-maskers were making exaggerated coughing noises and joking with each other about how the rest of the people in the store were wearing masks.\n\nI guess that counts as a joke when you peak in elementary school.",
            "title_similarity": "0.5238069",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hcbc5ro",
            "score": 3,
            "text": "Step 1: wear one of those clown flower things that squirt water at people\nStep 2: get coughed on by an asshole\nStep 3: spray them (probably counts as self defense cause it’s basically the same thing as coughing)\nStep 4: hopefully she tries to punch you\nStep 5: now you can sock her cause it’s probably also self defense at this point\n\nThis is not legal advice. If you’re a lawyer or literally anyone more competent than me in understanding law, please correct me before I get someone arrested.",
            "title_similarity": "0.62200665",
            "sentiment_compound": 0.6277
        },
        {
            "id": "hcbew6d",
            "score": 3,
            "text": "Woman in video is lucky she didn’t lose her teeth.  I’m amazed the person she coughed on didn’t knock her out.",
            "title_similarity": "0.5854864",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hcbfvdt",
            "score": 3,
            "text": "This is such a weird hill to die on. How did she benefit by that display? I mean she Hass to be aware that when people film you doing crap like that it’s not going to end well. I kind of wanna figure out what the hell these people are thinking.",
            "title_similarity": "0.5231097",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hcbh9ot",
            "score": 1,
            "text": "Can she collect unemployment for this?",
            "title_similarity": "0.37371838",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hcbjqmr",
            "score": 6,
            "text": "Anyone started that shit on me I'd break their jaw. Covid or no covid, I don't want your germs on me.",
            "title_similarity": "0.40416896",
            "sentiment_compound": -0.7203
        },
        {
            "id": "hcbkytr",
            "score": 2,
            "text": "lol SAP, \"yeah uh just confirmed dat bitch don't work here\"",
            "title_similarity": "0.6057441",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hcbp354",
            "score": 3,
            "text": "I am so amazed at how juvenile people are these days. So this story says she lives in Scottsdale Arizona. https://www.phoenixnewtimes.com/news/scottsdale-woman-goes-viral-for-coughing-on-masked-shoppers-at-nebraska-grocery-store-11963643",
            "title_similarity": "0.55491805",
            "sentiment_compound": 0.6269
        },
        {
            "id": "hcbp6n1",
            "score": 2,
            "text": "What's the chance she has a gofundme and has already raised a ton of money?",
            "title_similarity": "0.26203606",
            "sentiment_compound": 0.25
        },
        {
            "id": "hcbsfpg",
            "score": 2,
            "text": "How will she afford her Botox now!?",
            "title_similarity": "0.42395318",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcc3qxo",
            "score": 2,
            "text": "I was really hoping the headline had included this...\"And all of her teeth\".",
            "title_similarity": "0.3087809",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hcci7h9",
            "score": 4,
            "text": "It's *so cute* that she lost her job.",
            "title_similarity": "0.6683611",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hccoby9",
            "score": 3,
            "text": "I don’t understand why the police aren’t picking up charges. She is a danger to the public. If my husband beat me (he doesn’t) and I said I don’t want to press charges the police will pickit up and charge him anyway. Why hasn’t she been arrested. They have the video from the posts and I’m sure the store has security cameras. There’s your proof that she not only assaulted these ladies but she stalked them through the store to the registers.",
            "title_similarity": "0.5519103",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hccptv2",
            "score": 2,
            "text": "Tip your doordashers, instacart people",
            "title_similarity": "0.32642132",
            "sentiment_compound": 0.0
        },
        {
            "id": "hccqd8n",
            "score": 1,
            "text": "Ahhh the sweet taste of schadenfreude",
            "title_similarity": "0.13386212",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hccr3wd",
            "score": 3,
            "text": "What a piece of garbage.  Your rights end at my face.  This lady in the video  should have received an ass beating right there on the spot. \nI bet she has been bully most of her life.  I was just saying how Americans have become the most selfish , and un caring group of people around.   Sick .",
            "title_similarity": "0.69189715",
            "sentiment_compound": -0.9216
        },
        {
            "id": "hcdcskk",
            "score": 2,
            "text": "In my state, this would warrant physically defending yourself, as this woman's actions could cause injury.",
            "title_similarity": "0.38831243",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hcdfeja",
            "score": 4,
            "text": "It's almost like actions have consequences.",
            "title_similarity": "0.062219124",
            "sentiment_compound": 0.2975
        },
        {
            "id": "hcdzq2f",
            "score": 2,
            "text": "Since there are people in my family who are high risk for COVID I would have considered this an assault and responded accordingly, woman or not.",
            "title_similarity": "0.47565278",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hcefqb6",
            "score": 2,
            "text": "This pleases me so, so much.",
            "title_similarity": "0.023193687",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hcf2r9r",
            "score": 2,
            "text": "Fuck that crazy dumb bitch. She lost her job, maybe she'll lose her home too. She should take other people's concern about catching a deadly disease more seriously.",
            "title_similarity": "0.7243656",
            "sentiment_compound": -0.9583
        },
        {
            "id": "hcy81qm",
            "score": 1,
            "text": "As much as I dislike violence, I think there should be something in the law that allows you to beat someone like that up with a shovel and claim self-defence. Because that, losing half the face and half the teeth and then being regarded as absolutely not the victim and at fault and deserving of it and thus not getting any recompense, is the only thing that would make people of this kind learn, they are counting on the society not being able to harm them due to such physical reactions being unlawful in order to abuse others. If you need to beat someone up in order to stop them from assaulting you, no questions and no exceptions, then I believe that doing so absolutely does count as self-defence as exposing yourself to continued assault from the same person should not be the only option.\n\nThat said, I'm glad the company had enough of a good approach to just fire her, and I hope she is known well enough now that she won't find a new job soon. Maybe that will teach her at least *something*, though I highly doubt that.",
            "title_similarity": "0.4160495",
            "sentiment_compound": -0.9648
        }
    ]
}