{
    "Fed to ban policymakers from owning individual stocks, restrict trading following controversy\n": [
        {
            "id": "hhj7uat",
            "score": 22,
            "text": "Pelosi is going to have a hard time making her 300 million every 6 years now. What a shame 😁",
            "title_similarity": "0.4635989",
            "sentiment_compound": -0.128
        },
        {
            "id": "hhivwrp",
            "score": 11,
            "text": "I'll take things that will never result in any change for \"$100\" Alex",
            "title_similarity": "0.502009",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjedgi",
            "score": 20,
            "text": "Will this restrict spouses or family members as well? \n\nIsn’t Pelosi and her husband making money through stocks?",
            "title_similarity": "0.6716669",
            "sentiment_compound": -0.2168
        },
        {
            "id": "hhjc5t7",
            "score": 26,
            "text": "It is literally too late.\n\n**NO I am not being a pessimist, I am being a realist.**\n\n**Look at the amount of money the wealthiest gained during the Pandemic and look at how the lower class continued to struggle.** \n\nPrinting all of that money doesn't hurt them-- it hurts us as we cry out for it to help us thru the struggles. It is rough now with the forecast being Doom n Gloom.\n\nEdit: If you’re familiar with Evergrande, Ping Na Bank and **financial contagion**, you’ll also look at this as a good excuse for politicians to pull out of the market prior to a collapse/massive correction.",
            "title_similarity": "0.56721044",
            "sentiment_compound": -0.7108
        },
        {
            "id": "hhjjwt1",
            "score": 6,
            "text": "I’d love to see how much stock these Congressmen and women (and other public officials) own in JnJ, Moderna(!) and Pfizer….and why those are constantly pushed as the only way out of the pandemic….all I see are vaccine PSAs….not ones for eating better, exercising, taking good supplements, etc…..btw I’m fully vaxxed and support it. I’m just curious why we aren’t like other countries which are supporting a more general health campaign. Oh yeah, probably bc people are getting hella rich off the vaccines.",
            "title_similarity": "0.49571264",
            "sentiment_compound": 0.9777
        },
        {
            "id": "hhjbiu0",
            "score": 2,
            "text": "“These tough new rules raise the bar high\"\n\nI spit on this fucking bar laying on the ground.  These people are pathetic and their personal standards are childlike.",
            "title_similarity": "0.50080895",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hhjdzfc",
            "score": -1,
            "text": "\"Controversy\" \n\nI wonder if there is a reason they don't want everyone to know they fucked up and you can profit from it right now. Controversy makes you not look.",
            "title_similarity": "0.66287726",
            "sentiment_compound": -0.4063
        },
        {
            "id": "hhjw3g5",
            "score": -1,
            "text": "Fucking yes please.\n\nThis just made the Biden presidency worth it for me. Aside from the trump shit because he is a monster. This is reform we’ve needed for decades.",
            "title_similarity": "0.46549842",
            "sentiment_compound": 0.4351
        },
        {
            "id": "hhizisy",
            "score": -16,
            "text": "Honestly, this feels like misplaced vitriol. The act of owning individual stocks isn't an issue, acting on insider info in order to trade those stocks is (and is something that members of congress have been able to get away with historically).\n\nInstead of dictating what they can own, restrict how they can trade them. Insiders in publicly traded companies have the option of filing [10b5-1 trading plans](https://www.law.cornell.edu/cfr/text/17/240.10b5-1) to avoid issues with this, and it works. Why not require our elected officials to do the same?\n\nEDIT: Downvote is not disagree, etc, etc. What I'm suggesting works for millions of Americans, but I guess the solution that requires more nuance than a snazzy headline is beyond most people here.",
            "title_similarity": "0.63755405",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hhj1c8w",
            "score": 42,
            "text": "Things they're still allowed to trade according to this article:\n\n- Mutual funds\n\n- Exchange traded funds\n\n- Commodities\n\n- Cryptocurrency\n\n- Regular currency \n\n- Futures\n\n- Hedge Funds\n\n\nThis changes very little.",
            "title_similarity": "0.30374742",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhj58tb",
            "score": 3,
            "text": "If I may ask why are people being banned from owning stocks",
            "title_similarity": "0.82531846",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hhj0uww",
            "score": -7,
            "text": "Is this constitutional?\n\nThey're restricting property rights as a precondition of holding a government job. I'm not sure that will survive court (or Court) scrutiny.\n\nFor people about to reply, \"People who don't like the rules don't have to take the job,\" would you approve of limitations on other constitutional rights as a precondition for holding a government job? Can they preclude you from expressing contrary opinions or require you to submit to random searches of your private property?",
            "title_similarity": "0.70055044",
            "sentiment_compound": -0.7361
        },
        {
            "id": "hhk0sx1",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.3625049"
        },
        {
            "id": "hhk2ic5",
            "score": 0,
            "text": "Ummm… yes .,,  not that hard.     Seriously!!!!???",
            "title_similarity": "0.021922186",
            "sentiment_compound": 0.7369
        },
        {
            "id": "hhlr5g5",
            "score": 0,
            "text": "Doesnt even matter cause people like Pelosi can have their confidante do the trading.",
            "title_similarity": "0.39962578",
            "sentiment_compound": 0.3455
        },
        {
            "id": "hhjfk8a",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.38083464"
        },
        {
            "id": "hhjf079",
            "score": 4,
            "text": "This reminds me of this post:\n\nFinally, [KenGriffinLies.com](https://KenGriffinLies.com) is released, time to dig in and read everything on [Kengriffinlies.com](https://Kengriffinlies.com)!  \n\n\nI can't wait to see more from [KenGriffinlies.com](https://KenGriffinlies.com) and the team behind it. This is for sure going to hit Kenny boy where it hurts, he won't like [KenGriffinlies.com](https://KenGriffinlies.com) at all.   \n\n\nMaybe [KenGriffinLies.com](https://KenGriffinLies.com) can do some articles on others too? If [KenGriffinlies.com](https://KenGriffinlies.com) does any articles on Robinhood that would be cool too. I'm going to tell everyone i know of that [KenGriffinLies.com](https://KenGriffinLies.com) is live. Hopefully a lot of people see [KenGriffinLies.com](https://KenGriffinLies.com) as a good source of information.   \n\n\nKeep it up, [KenGriffinlies.com](https://KenGriffinlies.com) ;)",
            "title_similarity": "0.4673844",
            "sentiment_compound": 0.7337
        },
        {
            "id": "hhj9yek",
            "score": 1,
            "text": "A little late after theyve already 10x their net worths while in office…",
            "title_similarity": "0.30458277",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjl7nb",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.3625049"
        },
        {
            "id": "hhjv71x",
            "score": -1,
            "text": "This isn't the answer. Private equity and arbitrarily determined valuations, great.",
            "title_similarity": "0.5144798",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hhk0ji0",
            "score": -1,
            "text": "Better yet, why not just make all their tradings public?",
            "title_similarity": "0.49625206",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhk41p8",
            "score": 1,
            "text": "Haha a lot of them already not seeking reelection must have heard this was coming. \n\nNo fun playing fair...gotta have that rigged system to play...trashcans.",
            "title_similarity": "0.6185334",
            "sentiment_compound": -0.4203
        },
        {
            "id": "hhka8u8",
            "score": 1,
            "text": "You mean mob boss pelosi can’t get away with insider trading anymore!? Should have been done long ago. Both house and Congress need strict watch.",
            "title_similarity": "0.6333565",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkweix",
            "score": -1,
            "text": "Sssoooo they will finally fo after Nancy Pill Poppin Pelosi?",
            "title_similarity": "0.36018753",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhj5az6",
            "score": 24,
            "text": "why the fuck is anyone in government allowed to trade at all? i always thought that was illegal until this topic came up recently and i had to look it up again. \n\nis it even possible to establish more of a conflict of interest than to have people who literally run the country be able to invest in companies they literally have influence over? i know im clearly ignorant of some things here but is there an explanation that will make sense of this?",
            "title_similarity": "0.6939709",
            "sentiment_compound": -0.5532
        },
        {
            "id": "hhixlib",
            "score": -9,
            "text": "Doesn’t this show that the central bank has far too much power over the market?",
            "title_similarity": "0.5300951",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhj3zk1",
            "score": 15,
            "text": "It's a club and we aren't in it. So they can't hold an individual stock, but JPOW can hold tons of corporate bonds then chose to bail out corporate bonds by buying them again. Er I mean having blackrock buy them with Fed funds. Give me a fucking break.",
            "title_similarity": "0.74329233",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjgo8v",
            "score": 2,
            "text": "I know diddly squat about the stock market.\nI am firmly on the left.\n\n\nPelosi is a POS in terms of this subject right?   \nWhen I was trying to learn how to invest I kept seeing so many people with tips on what to do by just following her lead because she was bringing in serious bank.",
            "title_similarity": "0.56619143",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hhjh0bf",
            "score": 2,
            "text": "You might think this is wild its only fairly recently that the fed has been taking actions that could affect the price if individual stocks, so it wasn't really necessary. Before the fed could influence the economy as a whole obviously but you can't really divest a person from the economy so why worry about it.",
            "title_similarity": "0.6368516",
            "sentiment_compound": -0.6448
        },
        {
            "id": "hhjhdsr",
            "score": 2,
            "text": "Should be policymakers and their immediate family.",
            "title_similarity": "0.20133413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjllfs",
            "score": -2,
            "text": "Nooooooo, now I’ll never get in on the record breaking Pelosi Fund!!!!!!!!!!",
            "title_similarity": "0.61528134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjpwfq",
            "score": -2,
            "text": "ITT: why nothing will ever get better.  \n\nNo praise for progress, just nothing but 'both sides are bad' garbage.  \n\nRepublicans thank all of you for your help.  They genuinely could not do it without you.",
            "title_similarity": "0.35998794",
            "sentiment_compound": 0.4475
        },
        {
            "id": "hhjq9s7",
            "score": 2,
            "text": "It's simple; You get elected anything more important than dog catcher, your assets go into a blind trust the day you take the oath.  When you lose or retire, then you get it back.  \n\nThis isn't a hard problem to solve.",
            "title_similarity": "0.36773926",
            "sentiment_compound": 0.6183
        },
        {
            "id": "hhju0oe",
            "score": -2,
            "text": "I’m gonna be honest, and I know I’m going to get flak for it, but it deserves to be a public-facing statement: I don’t want a law that bars the President from owning a business or individual stocks.",
            "title_similarity": "0.6338166",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hhjztvx",
            "score": 2,
            "text": "Does that include their family/trusts/etc…?",
            "title_similarity": "0.18595237",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhk0dmy",
            "score": 2,
            "text": "Give Congress a raise.\n\nStep two: Make it a felony for them to make ANY money whatsoever outside their taxpayer paid salary. No investments. No landlords. No donations. No lemonade stands. No garage sales. Nothing. STRICTLY scrutinize and enforce with an independent bureau.",
            "title_similarity": "0.6708051",
            "sentiment_compound": -0.5
        },
        {
            "id": "hhk2la4",
            "score": -2,
            "text": "Let's not change the subject...\n\nWHERES MY FUCKING HEALTHCARE?\n\nFuck ya damn stock bullshit. They'll find ways to get around it quickly so this is just more punting the ball.\n\nHealthcare is THE #1 issue crushing families. Not #9, #4,.. # fuckin ONE.",
            "title_similarity": "0.6305923",
            "sentiment_compound": -0.9257
        },
        {
            "id": "hhjozvk",
            "score": -4,
            "text": "But only if they're Rebublicans cuz we redditors don't like them.",
            "title_similarity": "0.6430724",
            "sentiment_compound": -0.395
        },
        {
            "id": "hhk4pgd",
            "score": 4,
            "text": "*Laughs in Nancy \"The Insider\" Pelosi*",
            "title_similarity": "0.11684728",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hhkdgzd",
            "score": 2,
            "text": "Don’t stop there.  The US government is so heavy with corruption, and so focused on serving special interests above common people, that it’s going to either collapse under its own weight or force a rebellion.",
            "title_similarity": "0.6072391",
            "sentiment_compound": 0.2883
        },
        {
            "id": "hhj32t9",
            "score": 12,
            "text": "Wait, this wasn't already illegal?\n\nJesus christ, it's insider trading!",
            "title_similarity": "0.45380884",
            "sentiment_compound": 0.4966
        },
        {
            "id": "hhj299f",
            "score": 3,
            "text": "But what about their wives/husbands?",
            "title_similarity": "0.33899367",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjlnk7",
            "score": 4,
            "text": "No one in public office should be allowed to own any stocks or investments period. It compromises them. Lobbyists also shouldn't be allowed to fucking pay them. Our elected officials need to only receive income from their salary and that's it. I'm sick and tired of everyone being bought, especially when it's as blatant as Manchin and Sinema.",
            "title_similarity": "0.7578099",
            "sentiment_compound": -0.8439
        },
        {
            "id": "hhjbwi6",
            "score": 5,
            "text": "Blah blah blah whatever. They will use other means to grow their wealth and power and skirt the rules like all the other times.",
            "title_similarity": "0.45240375",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hhjciq5",
            "score": 97,
            "text": "How to fix America in 2 steps:\n-\tBan lobbying\n-\tBan state and federal employees from owning individual stocks.\n\nThe rest would literally follow assuming we could enforce the rules.",
            "title_similarity": "0.7324087",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hhja21m",
            "score": 7,
            "text": "So where is the loophole? Can’t be that easy.",
            "title_similarity": "0.4507354",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhj9pjq",
            "score": 6,
            "text": "Oh cool, now they'll have to get their spouses and siblings to do it for them.",
            "title_similarity": "0.323609",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hhiwtj5",
            "score": 8,
            "text": "If there ever was one example next to the definition of “conflict of interest”, this would be it. Farcical this isn’t a thing already.",
            "title_similarity": "0.36503285",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjbmmg",
            "score": 10,
            "text": "I'll just transfer these to my wife, or business, or friend or family member, fuck I'll transfer them to my fucking dog. You guys think passing a fucking rule like this is going to stop anyone from actually owning stocks and being manipulated into making money for themselves or random people who agree to pay them a lot of money then you're out of your mind.",
            "title_similarity": "0.66904813",
            "sentiment_compound": -0.0571
        },
        {
            "id": "hhjk0ai",
            "score": 10,
            "text": "Meanwhile, Nancy Pelosi's net worth has ballooned to over 300 million dollars. I'm absolutely sure she cares about working people, though.",
            "title_similarity": "0.2178822",
            "sentiment_compound": 0.7755
        },
        {
            "id": "hhj5f2c",
            "score": 14,
            "text": "Extend this to Congress.",
            "title_similarity": "0.121285886",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hhiufkd",
            "score": 130,
            "text": "Policymakers... like Congress?",
            "title_similarity": "0.22858956",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hhjlqsg",
            "score": 53,
            "text": "Needs to extend onto family members. For example Nancy Pelosi's husband being somehow one of the greatest investors on the planet is suspicious as fuck.\n\nAt the very least make the family members disclose every single buy and sell they make on the stock exchanges, so that we all get the opportunity to copy them",
            "title_similarity": "0.5324384",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hhj9ozu",
            "score": 60,
            "text": "This needs to extend to congress.",
            "title_similarity": "0.19732782",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hhjd0ea",
            "score": 23,
            "text": "You mean after 243 years of existence, we finally are restricting something so unethical as trading stocks of companies that they have a vested interest in?",
            "title_similarity": "0.70987886",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hhitwyi",
            "score": 131,
            "text": "I wonder if they feel silly then they do a ban that certainly should have always been in place. Like if you were in Chuck E Cheese and then someone came out and made an announcement that punching kids in the face is now banned.",
            "title_similarity": "0.6350054",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hhix6p0",
            "score": 1432,
            "text": "By \"controversy\" you mean \"insider trading\", right?",
            "title_similarity": "0.5392268",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhium0m",
            "score": 872,
            "text": "OK great, but what loophole have those policymakers already found?",
            "title_similarity": "0.49019587",
            "sentiment_compound": 0.5448
        },
        {
            "id": "hhiur3e",
            "score": 531,
            "text": "Let’s go one step further and require recusal for any lawmaker who stands to profit.",
            "title_similarity": "0.46039522",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhj6cg7",
            "score": 1015,
            "text": "They shouldn’t be allowed to trade individual stocks. I’m in the financial industry and I’d be jailed and barred from the industry for doing what they do on a daily basis.",
            "title_similarity": "0.8072482",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hhiqg46",
            "score": 9669,
            "text": "[removed]",
            "title_similarity": "0.3625049"
        },
        {
            "id": "hhiqjlz",
            "score": 14542,
            "text": "Get this to congress next, ffs",
            "title_similarity": "0.21362656",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hhj39ah",
            "score": 14239,
            "text": "Cool.  Now do Congress.",
            "title_similarity": "0.08143443",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hhiziak",
            "score": 3,
            "text": "Better several decades late than never, I guess.",
            "title_similarity": "0.25701568",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhizn0h",
            "score": 3,
            "text": "This needs to be done for anyone affecting policy.",
            "title_similarity": "0.22576168",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhj0s9b",
            "score": 4,
            "text": "And this needs to be the standard for every single elected and policy making position throughout the country.",
            "title_similarity": "0.2221995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhj3kpa",
            "score": 3,
            "text": "Sounds like a good idea. Not enough, but a step in the right direction.",
            "title_similarity": "0.09100525",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hhj5sac",
            "score": 1,
            "text": "So I’m confused, do I buy or sell the stocks? Been holding but idk what’s next",
            "title_similarity": "0.60132515",
            "sentiment_compound": -0.3376
        },
        {
            "id": "hhj5z0f",
            "score": 1,
            "text": "One small step for government, one giant leap for morality.",
            "title_similarity": "0.2794344",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhj6h4d",
            "score": 3,
            "text": "Looks like we’re course correcting into the good timeline pals!",
            "title_similarity": "0.13042954",
            "sentiment_compound": 0.69
        },
        {
            "id": "hhj6n1f",
            "score": 4,
            "text": "Why was this ever allowed?",
            "title_similarity": "0.2656119",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhj7ng5",
            "score": 2,
            "text": "Why was this ever allowed?",
            "title_similarity": "0.2656119",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhj8q25",
            "score": 3,
            "text": "ok well that’ll take care of corruption.  believes no one.",
            "title_similarity": "0.45578033",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hhj928b",
            "score": 4,
            "text": "Seems a little fucking late",
            "title_similarity": "0.24555817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhj97hb",
            "score": 2,
            "text": "I have always said there should be major restrictions on law makers",
            "title_similarity": "0.41615254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhj9bqe",
            "score": 2,
            "text": "If it even does pass, you know for sure it'll be repealed by the time the next \"unforeseen economic catastrophe\" occurs.",
            "title_similarity": "0.55550754",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hhjakv1",
            "score": 3,
            "text": "So they'll just had their broker create a fund of two stocks",
            "title_similarity": "0.45258743",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hhjau9i",
            "score": 2,
            "text": "Guess who's spouse just bought a bunch of stock",
            "title_similarity": "0.43990636",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjavet",
            "score": 3,
            "text": "Phew glad obama signed the bill that allows congress to do insider trading.",
            "title_similarity": "0.35022962",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hhjb7de",
            "score": 2,
            "text": "We did it! America is fixed! Raise the flags! Praise the High Court of the Glorious! Let us all worship at the mention of their names and castrate ourselves in their honored presence! Surely, I say unto you grateful citizens, nothing else bad could ever happen to our great nation!\n\n(I’d say /s but I mean F.)",
            "title_similarity": "0.33637562",
            "sentiment_compound": 0.9381
        },
        {
            "id": "hhjbgpv",
            "score": 3,
            "text": "Well fuck... FINALLY? I mean like for the last 70 years these predatory cunts graduating from Yale and Harvard, etc. were not the problem?",
            "title_similarity": "0.31693068",
            "sentiment_compound": -0.4408
        },
        {
            "id": "hhjbr6o",
            "score": 3,
            "text": "I’ll believe this when I see it.",
            "title_similarity": "0.016406037",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjc22j",
            "score": 1,
            "text": "Same should be true for family members or family members must be audited by the IRS or independent 3rd party on a by yearly basis.",
            "title_similarity": "0.31100926",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hhjc9ju",
            "score": 2,
            "text": "Introducing an age old concept called ‘rat-holes’.",
            "title_similarity": "0.32002208",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjcaix",
            "score": 3,
            "text": "Yes ban it after you made the money smart",
            "title_similarity": "0.4143377",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hhjcbcg",
            "score": 6,
            "text": "So any elected members man that is good thing, now include their next of kin.",
            "title_similarity": "0.17885672",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhjccfy",
            "score": 2,
            "text": "Sounds awesome, but imagine there will be a stealth loophole for politicians built into this.",
            "title_similarity": "0.46279937",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hhjcsbr",
            "score": 2,
            "text": "This is great news, but also remember that they get paid from speaking at different events. usually not small sums of money. ranging from 10k to 50k for an hour of work.",
            "title_similarity": "0.21182275",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hhjcxqg",
            "score": 3,
            "text": "not going to happen not in my lifetime",
            "title_similarity": "0.35897726",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjdgug",
            "score": 9,
            "text": "They already did that.  It was called the STOCK act.  Obama passed it.\n\nYou have to enforce laws not just make laws.",
            "title_similarity": "0.45112443",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjdm00",
            "score": 3,
            "text": "It really gives away the game when they do it considering the Fed is almost all ex-bank people.",
            "title_similarity": "0.59543604",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjdolv",
            "score": 3,
            "text": "Does this apply to policymakers' spouses? Cause if not then couldn't they just have the spouse make all the investments they were already going to make?",
            "title_similarity": "0.45800084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjdqbh",
            "score": 5,
            "text": "Yea…how about making that rule for ALL policy makers including dare I say it…those in Washington?",
            "title_similarity": "0.3629703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjdr3d",
            "score": 2,
            "text": "ya keep dreaming.  fed TO VOTE ON banning this thing thats literally stuffing money in their pockets",
            "title_similarity": "0.6443462",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjdvea",
            "score": 3,
            "text": "Senators are fine though? Make it make sense.",
            "title_similarity": "0.09786147",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hhjdzc6",
            "score": 3,
            "text": "This should already have been a thing, same with Congress. I was banned from owning stocks when I worked for a Big 4 Firm and I didn't even see the financials of companies as I worked in cybersecurity.",
            "title_similarity": "0.666842",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hhjea9w",
            "score": 2,
            "text": "Shoutout to my boy unusualwhales for calling out policymaker trading for months now, finally getting attention on the corruption",
            "title_similarity": "0.53046614",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjeh0y",
            "score": 2,
            "text": "Good. Now let’s see this have actual teeth and get enforced",
            "title_similarity": "0.09261773",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhjeqtv",
            "score": 2,
            "text": "Cool. Now do congress",
            "title_similarity": "0.068121806",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hhjevbh",
            "score": 2,
            "text": "Which fucking controversy???? Theres just so many of them.. here write it down so I can avoid it",
            "title_similarity": "0.5687039",
            "sentiment_compound": -0.5305
        },
        {
            "id": "hhjexqq",
            "score": 2,
            "text": "Gotta start somewhere! Next, do all federally-elected policymakers.",
            "title_similarity": "0.31274813",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjf01h",
            "score": 2,
            "text": "Elected members of the house and senate should not be allowed to hold individual stocks either.",
            "title_similarity": "0.7203821",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjf3gp",
            "score": 3,
            "text": "No congressman or senator should own stock while in office.",
            "title_similarity": "0.6487436",
            "sentiment_compound": -0.296
        },
        {
            "id": "hhjf62g",
            "score": 3,
            "text": "This is unfair for the working poor billionaire class. It’s difficult enough to manage their numerous shell companies and off-shore accounts. How are they supposed to afford their third super yacht when they can’t even benefit from insider trading?",
            "title_similarity": "0.62392044",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hhjf8b6",
            "score": 1,
            "text": "Oh big deal. Stocks are going to be bought under their spouse or child.",
            "title_similarity": "0.39833236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjf8re",
            "score": 1,
            "text": "This wont work. They will just open a brokerage account in their spouse or close family member's name. And continue their corruption.",
            "title_similarity": "0.7550875",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjfit0",
            "score": 1,
            "text": "Is this why Pelosi and her gang are supposed to be stepping down?",
            "title_similarity": "0.6265289",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjfjt1",
            "score": 1,
            "text": "Now ban their family members also.",
            "title_similarity": "0.5942928",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hhjfouw",
            "score": 1,
            "text": "But not their husbands, wives, sons, daughters, siblings, parents, friends, colleagues, companies they own/ have a share in etc, or shifting to buying via foreign markets, tax havens, subsidiaries  etc?...\n\n So no loopholes at all then?\n\n'Yup... Self congratulatory pats on backs all round... We've done it....we've  solved corruption.... Yay.... And everybody clapped' ....",
            "title_similarity": "0.28666687",
            "sentiment_compound": 0.8875
        },
        {
            "id": "hhjfty6",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.38083464"
        },
        {
            "id": "hhjfuzg",
            "score": 1,
            "text": "It should go worldwide.",
            "title_similarity": "0.11374524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjfvak",
            "score": 1,
            "text": "Soooo how about jail time, and forfeit of those gains. Since a fine would simply be like robbing a bank and then paying a few thousand in fines to keep the rest of the loot.",
            "title_similarity": "0.6404847",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hhjfx8i",
            "score": 3,
            "text": "How was this even not already not banned? Decades of corrupt trading already, no doubt. Just give them all life in prison, there’s not an innocent one among them",
            "title_similarity": "0.5571303",
            "sentiment_compound": -0.651
        },
        {
            "id": "hhjfxl3",
            "score": 3,
            "text": "Are their spouses restricted?",
            "title_similarity": "0.4410187",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hhjg73h",
            "score": 2,
            "text": "What about spouses and immediate family....",
            "title_similarity": "0.1883029",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjg9vy",
            "score": 1,
            "text": "Like congress will agree to this. Or any part of the ruling",
            "title_similarity": "0.12838191",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hhjgbza",
            "score": 3,
            "text": "Funny how policymakers does not include the US Congress.",
            "title_similarity": "0.65102315",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhjgcdn",
            "score": 4,
            "text": "Nancy Pelosi in shambles...\n\nUntil her lawyers and accountants figure it out for her",
            "title_similarity": "0.54030347",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjgfkz",
            "score": 3,
            "text": "Now hold on if politicians can’t buy stocks in their best interests before passing laws then what’s the benefit of being a politician? Seriously why would anyone bother to be a politician if you can’t shakily manipulate the system to get rich? /s",
            "title_similarity": "0.65417075",
            "sentiment_compound": 0.8541
        },
        {
            "id": "hhjgkrn",
            "score": 3,
            "text": "Want to bet there's some loophole that allows them to do this anyway",
            "title_similarity": "0.32733774",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hhjgx0p",
            "score": 2,
            "text": "It's awful that they had to get caught insider trading for this to happen. This is way, WAY too late.",
            "title_similarity": "0.6498785",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hhjh47k",
            "score": 1,
            "text": "Policymakers include politicians? Or just Fed officials.",
            "title_similarity": "0.41904807",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjh8ou",
            "score": 4,
            "text": "the fact that policy makers and congress/senators/reps are allowed to have any income other than that which is paid by the government is disgusting and corrupt.",
            "title_similarity": "0.61369675",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hhjha6l",
            "score": 2,
            "text": "How can we ban congress?",
            "title_similarity": "0.66037893",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hhjhe6e",
            "score": 1,
            "text": "And they sent Martha Stewart to prison for the tiniest allegation of this. What about lobbyists and PAC money?",
            "title_similarity": "0.57611334",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hhjhiza",
            "score": 2,
            "text": "Let’s be honest they will just let their family (Son, wife, father, side part) do the trading so their hands are clean….. such bs",
            "title_similarity": "0.34150875",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hhjhmt1",
            "score": 2,
            "text": "That’s a fucked up way of letting those butthole sniffers off the hook for insider trading. It’s called insider trading. Fuck the Federal Reserve.",
            "title_similarity": "0.72645223",
            "sentiment_compound": -0.836
        },
        {
            "id": "hhjhnbk",
            "score": 2,
            "text": "Baby steps. First good news I’ve seen all day 👏",
            "title_similarity": "-0.0015113897",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhjhstg",
            "score": 14,
            "text": "Sure is interesting the government is forcing itself to be the 'good guys' now on the brink of a full market collapse and not during the largest bull market in the history of the stock market.\n\nTransparent bullshit.",
            "title_similarity": "0.69552124",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hhjhwel",
            "score": 1,
            "text": "This is already outlined in the constitution…. Which is the crazy part.. 🤷🏻‍♂️",
            "title_similarity": "0.3401937",
            "sentiment_compound": -0.34
        },
        {
            "id": "hhjhyn6",
            "score": 2,
            "text": "In other news, ShellCompaniesRus is projected to have its best year ever!",
            "title_similarity": "0.15140319",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hhji0n7",
            "score": 2,
            "text": "Now how about Congress?",
            "title_similarity": "0.15688848",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhji1hb",
            "score": 1,
            "text": "They’re about to impeach Janet Yellen",
            "title_similarity": "0.5240499",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhji202",
            "score": 3,
            "text": "That’s decades too late, but better late than never, I guess.",
            "title_similarity": "0.28534883",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hhji75i",
            "score": 3,
            "text": "Means nothing till the loopholes are crushed",
            "title_similarity": "0.43819475",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hhji7t3",
            "score": 3,
            "text": "About time they do this! Expect it will NEVER pass, because the policy makers would have to pass this policy which takes their money away.",
            "title_similarity": "0.7091787",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhji9k5",
            "score": 2,
            "text": "Watch them come out with 2-stock “funds”.",
            "title_similarity": "0.29673603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjifo5",
            "score": 2,
            "text": "I'll believe it when I see it.",
            "title_similarity": "0.011920313",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjimgk",
            "score": 2,
            "text": "Hopefully it applies to spouses/significant others as well.  Although I’m sure they’ll figure out a way to have other family members make the trades for them.",
            "title_similarity": "0.27177912",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hhjiq5y",
            "score": 2,
            "text": "LOL thinking policymakers will ever by barred from trading. There  will always be a way for them to trade, ways which the public will never know. Its cute that this gives people optimism though.",
            "title_similarity": "0.5580773",
            "sentiment_compound": 0.676
        },
        {
            "id": "hhjix1b",
            "score": 3,
            "text": "Cool. Can we apply it to the Senate and the House next?\n\nEveryone here knows that Senator Joe Manchin of West Virginia collected half a million dollars *just last year* [from a coal brokerage company he helped found](https://www.nytimes.com/2021/10/20/climate/climate-plan-newsletter.html) (NY Times) and he doesn't want the federal government to encourage utilities to start transitioning to renewable ASAP, right?\n\nAnd that his state is [poised for catastrophe due to its mountainous topography and increased flooding](https://www.nytimes.com/2021/10/17/climate/manchin-west-virginia-flooding.html) due to, you guessed it, climate change?\n\nY'all know that, right?\n\nSure is cool that someone making *half a million a year from a coal brokerage company* is allowed to torpedo the country's federal government encouraging us to start using renewable energy sources for most of our electricity generation needs.",
            "title_similarity": "0.5763061",
            "sentiment_compound": 0.9207
        },
        {
            "id": "hhjiz0w",
            "score": 2,
            "text": "The real money is in the kick backs and revolving door pseudo jobs from industry.",
            "title_similarity": "0.45551515",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hhjj0jo",
            "score": 2,
            "text": "Hey look!\n\nThe absolute rock-bottom, most obvious, common sense bare minimum implemented after the fact!\n\nI’d say “it must be ‘Murcan politics”, but this is actually good for us.",
            "title_similarity": "0.36285582",
            "sentiment_compound": 0.6634
        },
        {
            "id": "hhjj12t",
            "score": 1,
            "text": "Nice, but somehow I don't feel this will slow them down much. I'm sure they got their ducks in a row through backchannels somehow before this is final.",
            "title_similarity": "0.38874403",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hhjj873",
            "score": 2,
            "text": "Jesus fucking christ- any elected rep. Period.",
            "title_similarity": "0.24393891",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjjf6v",
            "score": 1,
            "text": "Lmao stand by for more loopholes. Good god, every person on the hill who has held office for the last forty years that has a net worth in the near hundreds of millions should be investigated and forced to retire.",
            "title_similarity": "0.5453235",
            "sentiment_compound": 0.8096
        },
        {
            "id": "hhjjkfu",
            "score": 1,
            "text": "It's about time they actually did something about this",
            "title_similarity": "0.0894364",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjjs3n",
            "score": 1,
            "text": "Now they can buy crypto instead!",
            "title_similarity": "0.31754977",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjjs6b",
            "score": 1,
            "text": "Powell sold a million bucks of an index fund.  Doesn't seem like this is going far enough.",
            "title_similarity": "0.4435747",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hhjjtsf",
            "score": 1,
            "text": "Take all their assets and throw them in prison too.",
            "title_similarity": "0.43593115",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hhjjua7",
            "score": 1,
            "text": "Elected and appointed govt officials should have to put everything they own beyond their main residence into a blind trust. They shouldn't be allowed any other paid or unpaid employment during their time in office. Pro Bono medical and lawyer work would be allowed. They shouldn't be allowed to own residential property with in 250 miles of DC. Except for the purposes of establishing residence for their seat. No new investments while in office. Elected and appointed officials can live in government owned quarters equal to what an e1 in the military would get. \n\nThe spouses and family members of elected and appointed officials will be heavily restricted as well. No foreign money while their family member is in office.",
            "title_similarity": "0.6051313",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hhjjvli",
            "score": 1,
            "text": "I'm sure policymakers will find a way around that.\n\nWhat's to stop them from operating through other people not connected to them?",
            "title_similarity": "0.46324974",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hhjjxsy",
            "score": 1,
            "text": "That's not where most legislators and former legislators make their contributions.  \n\nThere's a steady lobbying trade in getting regulations renewed beyond their sunset dates.",
            "title_similarity": "0.43283582",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hhjk0cq",
            "score": 1,
            "text": "Fuckin polosi’s building an empire",
            "title_similarity": "0.36523998",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjk0vk",
            "score": 1,
            "text": "This has a snowflakes chance in the Bahamas of ever becoming a rule. These thieves look at their “salary” is homage paid to them by the dirt covered masses. The corporate overlords pull ALL their strings.",
            "title_similarity": "0.43946934",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hhjk9q1",
            "score": 1,
            "text": "As It slums be. Can you say conflict of interest",
            "title_similarity": "0.46066123",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hhjktlt",
            "score": 1,
            "text": "Can you imagine the type of person that opposes this?",
            "title_similarity": "0.47324282",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjkv5z",
            "score": 1,
            "text": "I mean they're fucking nobodies, anyway. Why should they get anything cool like a senator gets?",
            "title_similarity": "0.59388053",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hhjl2tq",
            "score": 2,
            "text": "great!... but i can't help but wonder how easy it must be to get around this by using some sort of proxy or trust or shell corporation or something?",
            "title_similarity": "0.23453385",
            "sentiment_compound": 0.8502
        },
        {
            "id": "hhjl47j",
            "score": 1,
            "text": "They will just trade ETFs and it still won't matter 😂",
            "title_similarity": "0.41011423",
            "sentiment_compound": 0.4265
        },
        {
            "id": "hhjl56h",
            "score": 1,
            "text": "Which will amount to nothing, they'll just put them in their spouses names.",
            "title_similarity": "0.45561075",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjlaao",
            "score": 1,
            "text": "Congress can fuck off too.",
            "title_similarity": "0.3959951",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hhjld2b",
            "score": 4,
            "text": "Bull-Fucking-Shit\n\nThere's a poophole loophole the size of /u/rickofspades asshole in this dumbass pandering headline.",
            "title_similarity": "0.5559963",
            "sentiment_compound": -0.6428
        },
        {
            "id": "hhjlgjx",
            "score": 2,
            "text": "And surely, Jerome Powell will return all the stocks he sold-off with insider trading knowledge.",
            "title_similarity": "0.40709665",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhjlju6",
            "score": 2,
            "text": "Took them long enough",
            "title_similarity": "0.062363725",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjlrux",
            "score": 3,
            "text": "Conflict of interest is a thing to remove before democracy can start to evolve properly.\n\nGood luck!",
            "title_similarity": "0.5087531",
            "sentiment_compound": 0.784
        },
        {
            "id": "hhjm31a",
            "score": 2,
            "text": "Well, it's a good start. \n\nNow do senators and congress officials",
            "title_similarity": "0.0622138",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hhjm3xe",
            "score": 1,
            "text": "Unless they reach back, let's say, 52 years and confiscate all the calculated wealth accrued in this way, this means nothing. All they're doing is pulling up a ladder and making it with a bunch of ill gotten gains.",
            "title_similarity": "0.58826494",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhjm60y",
            "score": 1,
            "text": "The fact this has 27,000 upvotes means people didn’t read the article.",
            "title_similarity": "0.5925568",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjmaq1",
            "score": 1,
            "text": "“Instead of an individual stock I’ll just invest in this list of several.”",
            "title_similarity": "0.40879652",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjmbdp",
            "score": 1,
            "text": "Do it or dont, dont fucking say you're \"set\" to do it \n\nFucking do it.",
            "title_similarity": "0.43048406",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjmdqn",
            "score": 1,
            "text": "> “The optics are bad,” Selgin said of the previous Fed rules. \n\nOptics are bad? No, the policy is bad. You don't think those people might not make the proper policy if it means they'll lose money? Optics? STFU.",
            "title_similarity": "0.7631781",
            "sentiment_compound": -0.8818
        },
        {
            "id": "hhjmr01",
            "score": 1,
            "text": "It’s about fucking time",
            "title_similarity": "0.07992494",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjmtgc",
            "score": 2,
            "text": "I got a feeling that a major change in crypto laws is coming soon so this is just their way of saying \"see we don't just go after blue collar workers\".",
            "title_similarity": "0.54841125",
            "sentiment_compound": 0.128
        },
        {
            "id": "hhjmx5p",
            "score": 1,
            "text": "Does the Fed or SEC have the authority to do this for congress?",
            "title_similarity": "0.41452426",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hhjmxig",
            "score": 1,
            "text": "Wouldn't that be easy to get around, though? Won't they just buy stocks under a different name or through a proxy or a shell complete or something? Doesn't this rule just make it inconvenient?",
            "title_similarity": "0.62060434",
            "sentiment_compound": -0.6537
        },
        {
            "id": "hhjmyde",
            "score": 1,
            "text": "This is a step in the right direction. We need to get money out of politics so people like Joe Manchin won’t be inclined to vote with his donors",
            "title_similarity": "0.6736765",
            "sentiment_compound": 0.4173
        },
        {
            "id": "hhjmyjy",
            "score": 1,
            "text": "Politicians deciding whether or not they should get illegally rich through insider trading.  Hmm.",
            "title_similarity": "0.63793206",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hhjmzi3",
            "score": 1,
            "text": "Following controversy? Why not before? They always sell their shit off before releasing bad news....",
            "title_similarity": "0.6580323",
            "sentiment_compound": -0.8156
        },
        {
            "id": "hhjn0b0",
            "score": 1,
            "text": "Moving stocks and equity to family in 3 ... 2 ......",
            "title_similarity": "0.3910007",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjn4mz",
            "score": 1,
            "text": "Jeebus.  Why wasn’t this policy already?",
            "title_similarity": "0.4077507",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjn75k",
            "score": 1,
            "text": "After they already got away with it.\n\nJpow got like 5 mil",
            "title_similarity": "0.26430967",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hhjn9tf",
            "score": 2,
            "text": "Can we now expand this to include EVERY federally elected official?",
            "title_similarity": "0.17187274",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hhjnem4",
            "score": 1,
            "text": "This is a step in the right direction, However the coverage around it has been horrible and misleading. My favourite part that was left out of the narrative is the fund Powell sold out of grew by like 20-30% in the months after he sold it.",
            "title_similarity": "0.41698372",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hhjnjw0",
            "score": 1,
            "text": "Lmao the fuckers are all rich by now, too little too late!",
            "title_similarity": "0.2291477",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hhjnm4z",
            "score": 1,
            "text": "They can't own individual stocks but they can own them in bulk.",
            "title_similarity": "0.5098362",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjno54",
            "score": 1,
            "text": "It would be almost impossible to implement effectively, they would just use a 3rd party to invest on their behalf",
            "title_similarity": "0.59426594",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hhjno9q",
            "score": 2,
            "text": "Anyone holding public office, or even government appointed positions should be restricted from buying and selling stocks or partaking in any private business dealings/transactions worth more then $100K. I don’t get how this has ever been allowed.\n\nI would be very much in favor of paying politicians $300-500k a year if it meant they would not be bought by others.",
            "title_similarity": "0.67234313",
            "sentiment_compound": 0.3102
        },
        {
            "id": "hhjnpv0",
            "score": 1,
            "text": "What’s the convenient loophole that will be found?",
            "title_similarity": "0.17011547",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjnsfy",
            "score": 2,
            "text": "Now make the same rolls for congress and their entire families and we may have some real policy changes.\n\nEdit spelling",
            "title_similarity": "0.29129046",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjnsys",
            "score": 2,
            "text": "Thanks Biden!  Now as others said do Congress next",
            "title_similarity": "0.22886477",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hhjo3lv",
            "score": 1,
            "text": "thats kinda sad, like you have to outlaw crime",
            "title_similarity": "0.6420684",
            "sentiment_compound": -0.6231
        },
        {
            "id": "hhjo5rx",
            "score": 1,
            "text": "Does the FED have this legal authority? I didn’t think securities exchanges fell under the umbrella of banking.\n\nEdit: Title is misleading, Fed officials are banned, they aren’t policymakers they’re regulators",
            "title_similarity": "0.7724719",
            "sentiment_compound": -0.3767
        },
        {
            "id": "hhjo6lt",
            "score": 1,
            "text": "The top is in. These guys who have been taken advantage of insider trading for decades can now all sell collectively as the market is near ATH without any repercussions. A market can crash and all is well because these same people did not dump their shares from insider knowledge but because they were forced to. Perfect alibi.",
            "title_similarity": "0.43062952",
            "sentiment_compound": 0.4211
        },
        {
            "id": "hhjo7s7",
            "score": 1,
            "text": "Can their family members still own stock?",
            "title_similarity": "0.31956524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjoasc",
            "score": 2,
            "text": "Sure what about spouses?",
            "title_similarity": "0.19023636",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hhjoayb",
            "score": 1,
            "text": "No one will want that job now. ;)",
            "title_similarity": "0.5680423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjoe3b",
            "score": 1,
            "text": "So lobbyists will not be allowed to trade stock anymore?",
            "title_similarity": "0.7962581",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjooa4",
            "score": 1,
            "text": "I am sure there is no possible loophole or way to work around this!",
            "title_similarity": "0.398165",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hhjoopn",
            "score": 1,
            "text": "Cool. They can just transfer it to their spouse",
            "title_similarity": "0.16256154",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hhjoyrw",
            "score": 4,
            "text": "I know this is political, but please don’t get divided over it apes. We know it’s all corrupt now anyhow",
            "title_similarity": "0.58446115",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hhjpaui",
            "score": 2,
            "text": "Everyone saying \"This needs to apply to Congress too\" should understand that only Congress can do that. They'd need to pass a law limiting themselves.",
            "title_similarity": "0.4706089",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjpdkz",
            "score": 2,
            "text": "Still doesn’t fix SHIT. U.S. Markets are completely fucked",
            "title_similarity": "0.65865576",
            "sentiment_compound": -0.8758
        },
        {
            "id": "hhjpewn",
            "score": 3,
            "text": "Good, becoming a politician to be rich should be extremely frowned upon. Lobbying to. If you care enough about your country to be a lawmaker, it shouldn't be about money, it should be about the people and the people only! Worst thing that ever happened to the free world was political parties IMO.  It's just a way to divide us. We're all in this together. I'd like to think my representative has everyone's benefit in mind over making fucking money.",
            "title_similarity": "0.66929996",
            "sentiment_compound": 0.9416
        },
        {
            "id": "hhjpiku",
            "score": 1,
            "text": "Can we forever them to hold their positions for the next 5 years first? They are just cashing out before the crash.",
            "title_similarity": "0.38381758",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hhjplpu",
            "score": 5,
            "text": "This should have been done decades ago.\n\nNext: TERM LIMITS.",
            "title_similarity": "0.35863152",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjpp8j",
            "score": 2,
            "text": "Can’t wait until the title of this article says.\n\n‘Fed did it.’",
            "title_similarity": "0.32630748",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjpt7d",
            "score": 2,
            "text": "Should have already been done. This is too little too late.\n\nHow about we put some people in jail? YEah!?!?",
            "title_similarity": "0.35255015",
            "sentiment_compound": 0.5145
        },
        {
            "id": "hhjqakd",
            "score": 4,
            "text": "This is a good step, but should have always been in place. And we need similar rules for Congress.",
            "title_similarity": "0.27977598",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hhjqfvj",
            "score": 2,
            "text": "Give congresspeople the ability to transition from individual stocks to mutual funds/ETFs tax free upon election. Make it mandatory. Easy. \n\nHard part is how to restrict their proxies (kids, spouses, etc)",
            "title_similarity": "0.5025419",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hhjqhbb",
            "score": 2,
            "text": "Gotta love the fools in here blaming one side or the other as if BOTH PARTIES aren’t doing it all the time. Y’all need to wake the eff up. Our government doesn’t represent us. Doesn’t matter what side you’re on. And, if you think they do you need to do some reading.",
            "title_similarity": "0.58088756",
            "sentiment_compound": 0.3254
        },
        {
            "id": "hhjqibq",
            "score": 4,
            "text": "Can we also ban lawmakers from retiring and being hired for the corporations they were being bribed by? Thanks.",
            "title_similarity": "0.7322683",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hhjqkug",
            "score": 4,
            "text": "Even if let's say by some miracle this became a law, no one in Congress would ever be found guilty nor ever face any serious legal consequences.  Mark my words...laws are not for the rich and powerful to obey!",
            "title_similarity": "0.56078434",
            "sentiment_compound": -0.1068
        },
        {
            "id": "hhjqo8u",
            "score": 3,
            "text": "Ban policy maker but not their family. Good times.",
            "title_similarity": "0.54136235",
            "sentiment_compound": -0.6607
        },
        {
            "id": "hhjqrw3",
            "score": 1,
            "text": "Why not already done smh 🤦‍♀️",
            "title_similarity": "0.2206235",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hhjr17u",
            "score": 1,
            "text": "for some reason though, Nancy Pelosi is exempt? WTF?",
            "title_similarity": "0.4808761",
            "sentiment_compound": -0.6697
        },
        {
            "id": "hhjrl31",
            "score": 2,
            "text": "What is this? Like the 5 millionth time they’ve been caught with their hand in the cookie jar? Nothings going to happen, again, because they are corrupt.",
            "title_similarity": "0.5901969",
            "sentiment_compound": 0.7532
        },
        {
            "id": "hhjrrvh",
            "score": 2,
            "text": "Good. They need to make it where no one gets rich by serving in government. That would get rid of a lot of dead wood.",
            "title_similarity": "0.6498421",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjrvft",
            "score": 2,
            "text": "Let’s force this into reality people!",
            "title_similarity": "0.23078768",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjryg3",
            "score": 2,
            "text": "What about family members? Significant others ?",
            "title_similarity": "0.22946665",
            "sentiment_compound": 0.2869
        },
        {
            "id": "hhjryjl",
            "score": 2,
            "text": "On the one hand I’m glad it’s finally moving to Congress for a vote and on the other hand I can’t believe it’s only just now coming to a vote.",
            "title_similarity": "0.2381703",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hhjs00o",
            "score": 1,
            "text": "It only matters if this is applied to Congress",
            "title_similarity": "0.27077076",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hhjs7hu",
            "score": 1,
            "text": "I for real read this as a ban on 'individual socks' for a minute and was really confused.",
            "title_similarity": "0.5109522",
            "sentiment_compound": -0.7346
        },
        {
            "id": "hhjs83t",
            "score": 1,
            "text": "Wtf this was not done sooner",
            "title_similarity": "0.3010043",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hhjs86y",
            "score": 1,
            "text": "Fucking finally\n\nThought this meant congress as well- them next!",
            "title_similarity": "0.20321089",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hhjs8s9",
            "score": 1,
            "text": "Such a no fucking brainer",
            "title_similarity": "0.38647848",
            "sentiment_compound": -0.296
        },
        {
            "id": "hhjse2i",
            "score": 1,
            "text": "Will this also restrict spouses or direct relatives? I can see this being used as a loophole. I haven't gotten a chance to read the article yet so apologies if it mentions it already",
            "title_similarity": "0.65444326",
            "sentiment_compound": -0.5171
        },
        {
            "id": "hhjsl6w",
            "score": 2,
            "text": "Lol, this is just becoming a rule in 2021. We still have a long way to go….",
            "title_similarity": "0.33177215",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hhjsrfe",
            "score": 1,
            "text": "Pff, just the people working in the Reserve",
            "title_similarity": "0.23289157",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjssev",
            "score": 1,
            "text": "This is the same as banning drugs. \n\nThe people that want to do the thing that’s banned will still do the thing.",
            "title_similarity": "0.42130345",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hhjssm2",
            "score": 1,
            "text": "Best fucking news I have heard in the last 10 years or so",
            "title_similarity": "0.11458622",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hhjswmo",
            "score": 2,
            "text": "Nice but what about their spouses? That’s next.",
            "title_similarity": "0.1793724",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hhjt29b",
            "score": 2,
            "text": "so same rules to congress when?",
            "title_similarity": "0.14131926",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjt3uq",
            "score": 1,
            "text": "When I saw policy makers I thought congress. Sadly I was wrong.",
            "title_similarity": "0.59325343",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hhjt9ef",
            "score": 1,
            "text": "Yea their partners or financial officers still can however.",
            "title_similarity": "0.12998557",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjtftp",
            "score": 2,
            "text": "They will find a loophole that allows them to get away with it.",
            "title_similarity": "0.31450504",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjthwk",
            "score": 1,
            "text": "What about the fucking sentaros and and congress, defuq is this 99 cent store band aid shiet..?",
            "title_similarity": "0.28150633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjtjy5",
            "score": 2,
            "text": "What about their spouses?",
            "title_similarity": "0.25212654",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjtnuq",
            "score": 3,
            "text": "If this doesn't also apply to their spouse then it means nothing",
            "title_similarity": "0.43430337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjtutx",
            "score": 2,
            "text": "Spouses and immediate families? They’ll find a loophole in five minutes otherwise.",
            "title_similarity": "0.39952165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjtvlj",
            "score": 2,
            "text": "Cool, now do congress.",
            "title_similarity": "0.08798358",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hhjtxzs",
            "score": 1,
            "text": "Let’s do the same with all lawmakers and any role where policy/law decisions are made. Even Supreme Court.",
            "title_similarity": "0.12251599",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hhju1h5",
            "score": 2,
            "text": "Just wait for all the loopholes.",
            "title_similarity": "0.27469063",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhju3sj",
            "score": 1,
            "text": "Yeah sure, they’ll just let their kid do it for them...",
            "title_similarity": "0.16273043",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hhju69j",
            "score": 1,
            "text": "Good news but I'm afraid a whole new black market is being born here.",
            "title_similarity": "0.4440632",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hhjuc20",
            "score": 3,
            "text": "Personally I advocate for ANY one holding an elected position from trading.",
            "title_similarity": "0.33242953",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjud71",
            "score": 1,
            "text": "Politicians should live in public housing and take a oath of poverty,  that would clear out all the shit",
            "title_similarity": "0.54888856",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hhjuhc9",
            "score": 1,
            "text": "NOOOOOO how am i gonna know which stocks to buy and sell off if I can't copy these terrible people?",
            "title_similarity": "0.7277632",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hhjupij",
            "score": 1,
            "text": "And here I am, jist making ends meet and I'm not allowed to use Robinhood due to my wife's employer. She does something with retirement account management software support.",
            "title_similarity": "0.687208",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hhjuulz",
            "score": 1,
            "text": "wow!. im sure theyll find another way, but still, this feels like a huge forward step!",
            "title_similarity": "0.21333015",
            "sentiment_compound": 0.87
        },
        {
            "id": "hhjv6fs",
            "score": 7,
            "text": "Cool, now do congress.",
            "title_similarity": "0.08798358",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hhjv6y4",
            "score": 1,
            "text": "And this is old news. We never prosecute the law breakers. Period. The way you would prosecute an individual for breaking the same law. Let's fucking get real in this world. The biggest welfare recipients are getting away with fraud. Trump is one of them and Mitch and Rudy need to give the IRS their papers.",
            "title_similarity": "0.6676564",
            "sentiment_compound": -0.6419
        },
        {
            "id": "hhjvxr9",
            "score": 1,
            "text": "File this under 'about damn time'",
            "title_similarity": "0.17809753",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hhjvyqn",
            "score": 3,
            "text": "Cannot wait for this to fail and also to not happen to congress.\n\nPeople act just because there is a law, politicians cannot still get rich by telling their significant others to buy and sell.\n\nPoliticians go into politics to get rich. That simple.",
            "title_similarity": "0.66114414",
            "sentiment_compound": -0.2556
        },
        {
            "id": "hhjvz0a",
            "score": 1,
            "text": "Lmao .... just a pre-text to allow them to sell before the crash",
            "title_similarity": "0.5049893",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hhjw5c6",
            "score": 4,
            "text": "Why this isn't already done is mind boggling.",
            "title_similarity": "0.37823832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjwe6y",
            "score": 2,
            "text": "ITT : people who think anything will actually change.",
            "title_similarity": "0.3574801",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjwf90",
            "score": 1,
            "text": "Why on earth would someone in congress write a bill to limit what they can do?",
            "title_similarity": "0.60749686",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjwhkr",
            "score": 1,
            "text": "They should be arrested for insider trading",
            "title_similarity": "0.5837747",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hhjwz6z",
            "score": 5,
            "text": "Notice how silent the bots are on this?\n\nIt's impossible to form even an irrational argument against this. \n\nOh who am I kidding, just wait a few days until FOX shits out their marching orders.",
            "title_similarity": "0.5560909",
            "sentiment_compound": -0.765
        },
        {
            "id": "hhjx8zf",
            "score": 1,
            "text": "You would’ve thought this was already the law… but you would’ve thought wrong…",
            "title_similarity": "0.5038569",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjx9cv",
            "score": 3,
            "text": "Good. Now make the same rule for our elected representatives.",
            "title_similarity": "0.10820767",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhjxc3y",
            "score": 2,
            "text": "What's keeping them from investing via a holding company by another family member?",
            "title_similarity": "0.6742761",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjxj1s",
            "score": 1,
            "text": "They will find a workaround",
            "title_similarity": "0.06421648",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjxqs5",
            "score": 1,
            "text": "Cool, now do Congress",
            "title_similarity": "0.07582347",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hhjxsp8",
            "score": 1,
            "text": "Finally a step in the right direction.",
            "title_similarity": "0.0020651426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjy3dy",
            "score": 1,
            "text": "Try \"Vienna\" by the same artist... Billy Joel",
            "title_similarity": "0.22298077",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjydg7",
            "score": 2,
            "text": "They should only be able to buy mutual funds and ETF no individual stocks",
            "title_similarity": "0.55629474",
            "sentiment_compound": -0.296
        },
        {
            "id": "hhjyi0g",
            "score": 1,
            "text": "Fed and sec are impotent. Nobody does anything about things like this. Not news.",
            "title_similarity": "0.62034804",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hhjyjkf",
            "score": 1,
            "text": "Oh man, I thought it meant _policymakers_ in general, not just its own leadership. Damn.",
            "title_similarity": "0.45999092",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hhjykrm",
            "score": 3,
            "text": "Next up, ban campaign donations from all corporations.",
            "title_similarity": "0.7858603",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hhjypm1",
            "score": 1,
            "text": "Congress of course but also judges. 131 judges have used knowledge in their courts to profit. A husband and wife team had 36 corp. cases before \\[his\\] court and made out like bandits.\n\nWhat people refuse to understand is that capitalism is the birth place of modern corruption and it will never stop. If the west can surely have wars for profit, they will need to have this flexibility in their portfolio.",
            "title_similarity": "0.5414444",
            "sentiment_compound": 0.9195
        },
        {
            "id": "hhjypui",
            "score": 2,
            "text": "Only after people got wise to it and started modeling their trades after above mentioned policy makers",
            "title_similarity": "0.33555874",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hhjyu5v",
            "score": 1,
            "text": "Finally. How many republicans do y’all think will just quit or drop off? Any takers?",
            "title_similarity": "0.48985416",
            "sentiment_compound": -0.3527
        },
        {
            "id": "hhjyykd",
            "score": 3,
            "text": "Guess who’s spouses will just start doubling the amount of shares they own",
            "title_similarity": "0.24500537",
            "sentiment_compound": 0.296
        },
        {
            "id": "hhjzbwf",
            "score": 1,
            "text": "So based i actually can't believe it's true.",
            "title_similarity": "0.34208536",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hhjzfz1",
            "score": 1,
            "text": "Took them long enough.",
            "title_similarity": "0.06973456",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjzl1k",
            "score": 2,
            "text": "Does this include options because that's where they make all their money",
            "title_similarity": "0.21651548",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhjzvlh",
            "score": 2,
            "text": "So what are the individual stocks they aren't allowed to hold? Cause they're still allowed to own and trade stocks, just with some easily circumvented restrictions. Can't trade a stock without 45 days notice? What's to stop an option being placed, at the same time as the notice to buy/sell in 45 days?\n\nAKA - Fed's introduce a response to quell criticism, without changing anything.",
            "title_similarity": "0.55765593",
            "sentiment_compound": -0.5007
        },
        {
            "id": "hhk016i",
            "score": 12,
            "text": "Martha went to prison for insider trading... so should the entire (hoping there are exceptions, but doubtful) US Congress.",
            "title_similarity": "0.63769144",
            "sentiment_compound": -0.5187
        },
        {
            "id": "hhk0c88",
            "score": 1,
            "text": "wont they just sell their inside info to other people",
            "title_similarity": "0.54304594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhk0pqg",
            "score": 2,
            "text": "Hopefully this actually passes and doesnt have a billion loopholes in it so insider trading based off the people literally shaping the laws that influence stock prices cant fucking make illegal deals behind the scenes.",
            "title_similarity": "0.6096496",
            "sentiment_compound": 0.7031
        },
        {
            "id": "hhk0qoi",
            "score": 4,
            "text": "So make it illegal for US congressmen and women to own them too. Such a joke they are allowed to.",
            "title_similarity": "0.60363734",
            "sentiment_compound": -0.3947
        },
        {
            "id": "hhk0szk",
            "score": 3,
            "text": "I’d be OK with politicians and what not having individual trading portfolios under the following conditions:\n\n* Completely transparent and open to the public. Like…published daily in the WSJ. \n\n* Restricted trading windows each fiscal half.  I had to do this when working in the finance world with impactful non-public data. Seems like a fair fix to front running info. \n\n* No short selling. Period. You work for the US Government? You are a perma-bull while serving the American public. Think a recession is coming? Uncle Sam has some t-bills for you or go get some commodities. No profiteering on others’ suffering.",
            "title_similarity": "0.53566605",
            "sentiment_compound": -0.4372
        },
        {
            "id": "hhk11pz",
            "score": 5,
            "text": "Don't forget cryptocurrency",
            "title_similarity": "0.2360717",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hhk1g2k",
            "score": 3,
            "text": "About 50 years to late , no ?",
            "title_similarity": "0.18727222",
            "sentiment_compound": -0.296
        },
        {
            "id": "hhk1vbi",
            "score": 3,
            "text": "I wish this applied to all politicians.",
            "title_similarity": "0.24872454",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hhk1vo9",
            "score": 5,
            "text": "“Follow controversy” \n\nOh you mean that controversy regarding them inside trading since like 1974? Yeah…or like since 1920? Oh yeah.",
            "title_similarity": "0.49332327",
            "sentiment_compound": 0.7622
        },
        {
            "id": "hhk20uq",
            "score": 1,
            "text": "Horses and barns. How are they going to cheat going forward?",
            "title_similarity": "0.5203269",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hhk2ap5",
            "score": 1,
            "text": "Congress isn’t policy makers?",
            "title_similarity": "0.48936623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhk2idt",
            "score": 3,
            "text": "“Controversy”? There was no controversy. Everybody knows this is cheating the system\n\nIf the Fed employees did not know this then they have no business being part of the Fed.\n\nEither you knew this was cheating or were too stupid to know this was cheating. Either way, you have no business being employed by the Fed.",
            "title_similarity": "0.6531123",
            "sentiment_compound": -0.9628
        },
        {
            "id": "hhk2iw1",
            "score": 3,
            "text": "And possibly maybe prosecute members of government that break these kind of laws? \nYa know. If ya want.",
            "title_similarity": "0.61625814",
            "sentiment_compound": -0.34
        },
        {
            "id": "hhk2lws",
            "score": 3,
            "text": "Well, it’s a good start atleast",
            "title_similarity": "-0.05981008",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hhk2p8q",
            "score": 2,
            "text": "Wow,  no shit, its a bad idea for policy makers to own stocks.  Who would have thought.",
            "title_similarity": "0.79132354",
            "sentiment_compound": 0.498
        },
        {
            "id": "hhk31ez",
            "score": 3,
            "text": "This should absolutely extend to Congress and the Executive branch",
            "title_similarity": "0.10041052",
            "sentiment_compound": 0.2484
        },
        {
            "id": "hhk33c7",
            "score": 2,
            "text": "This does nothing, they will just have family do the insider trading. Delegating corruption to family is already standard procedure in Washington; these rules leave obvious loopholes wide open.\n\nPure optics from a system built on corruption and corporate influence. Don’t fall for it.",
            "title_similarity": "0.5702522",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hhk3aar",
            "score": 2,
            "text": "It'd crazy. These people's salaries are meant to deter this sort of behavior, and it's still no enough.\nI believe we've reached a technological point where we no longer need the senate or congress in their current forms.",
            "title_similarity": "0.6714996",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hhk49op",
            "score": 6,
            "text": "To people that have no clue, the fed is in reference to the federal reserve. As in the bank. Not as in employees at the federal government....",
            "title_similarity": "0.64423084",
            "sentiment_compound": -0.296
        },
        {
            "id": "hhk4ack",
            "score": 5,
            "text": "I’ll take “Things that should have been done a long time ago” for 800 Levar!",
            "title_similarity": "0.28331265",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhk4buz",
            "score": 4,
            "text": "Now move on to members one congress and the executive branch being FUCKING BARRED FROM OWNING ANY STOCKS!",
            "title_similarity": "0.76539",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhk4z8w",
            "score": 3,
            "text": "Ever wonder why congressmen seem to outperform the stock market so consistently?  Are they all just very lucky or could it be something else...",
            "title_similarity": "0.45857102",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hhk54y6",
            "score": 9,
            "text": "A lot of people commenting don't seem to realize the Federal Reserve is not Congress...",
            "title_similarity": "0.58792186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhk6uzn",
            "score": 4,
            "text": "Great, do congress next, also term limits, also banning lobbying wouldnt hurt. This \"controversy\" is a small pebble compared the multitudes of quasi criminal behavior that you and I would get a life sentence for.",
            "title_similarity": "0.5487127",
            "sentiment_compound": 0.5386
        },
        {
            "id": "hhk6zff",
            "score": 4,
            "text": "What's the point of ANOTHER law if we aren't going to enforce the ones we already have???",
            "title_similarity": "0.5444486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhk7i55",
            "score": 1,
            "text": "Time to buy some calls on ETFs",
            "title_similarity": "0.21368392",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhk7mz9",
            "score": 2,
            "text": "And their immediate family members will be exempt because, of course.",
            "title_similarity": "0.32761204",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hhk7tdq",
            "score": 2,
            "text": "Does this apply to their wives too",
            "title_similarity": "0.286958",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhk8e7f",
            "score": 2,
            "text": "Imagine trying to get Congress to pass a law that bans them from this as well lmao",
            "title_similarity": "0.65130323",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hhk8hic",
            "score": 2,
            "text": "About fucking time. A lot less rich senators.",
            "title_similarity": "0.5170453",
            "sentiment_compound": 0.5118
        },
        {
            "id": "hhk8k0p",
            "score": 3,
            "text": "Here comes an era of one stock ETF’s.",
            "title_similarity": "0.2618175",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhk9dpn",
            "score": 3,
            "text": "This should have be done centuries ago.",
            "title_similarity": "0.2558471",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhk9izr",
            "score": 6,
            "text": "What about their Spouses?",
            "title_similarity": "0.25212654",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhk9nvi",
            "score": 4,
            "text": "These laws already exist. How about making the penalty $200,000 per occurrence instead of $200 and make sure the penalty sticks.",
            "title_similarity": "0.4005745",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hhkat8k",
            "score": 2,
            "text": "Good, no more insider trading .",
            "title_similarity": "0.42820746",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hhkbedw",
            "score": 1,
            "text": "Guess we won’t have anymore policy makers",
            "title_similarity": "0.5515946",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkbga3",
            "score": 2,
            "text": "Will the fed ever list everyone on the board?",
            "title_similarity": "0.42476285",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkbsv7",
            "score": 7,
            "text": "This should be all politicians regardless of country its called puplic service not self service",
            "title_similarity": "0.48703647",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkbyzw",
            "score": 2,
            "text": "Damn, now we can’t copy trades from the senators when they decide to launch another plandemic and invest in certain pharmacy shares.",
            "title_similarity": "0.82179",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hhkck5l",
            "score": 1,
            "text": "This will be the excuse for a massive stock selloff",
            "title_similarity": "0.50913286",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hhkcn0d",
            "score": 1,
            "text": "Would this stop politicians from just having their spouse \"own\" the stock while they just give them the insider info?",
            "title_similarity": "0.6789435",
            "sentiment_compound": -0.296
        },
        {
            "id": "hhkcrz7",
            "score": 1,
            "text": "This ban... In 2021....2021...!",
            "title_similarity": "0.3879394",
            "sentiment_compound": -0.5983
        },
        {
            "id": "hhkcrzh",
            "score": 3,
            "text": "\"The ban includes top policymakers such as those who sit on the Federal Open Market Committee, along with senior staff. Future investments will have to be confined to diversified assets such as mutual funds.\"\n\nCongress breaths a sigh of relief. It doesn't include them",
            "title_similarity": "0.68111783",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hhkd0ne",
            "score": 2,
            "text": "Great ......  Do congress and senate next.",
            "title_similarity": "0.14795282",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hhkd5hi",
            "score": 3,
            "text": "Even if they have to buy in to funds I don’t trust them to not be insider trade making pieces of shit. I absolutely believe their portfolios should be restricted in some way that prevents them from being able to profit from any privileged knowledge that they have.",
            "title_similarity": "0.75317943",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hhkdkdk",
            "score": 2,
            "text": "Now do any elected or appointed official.",
            "title_similarity": "0.03767469",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkecy7",
            "score": 1,
            "text": "You mean that poltiicians might not be above the law?\n\nNow, all that is needed is the prosecutors.",
            "title_similarity": "0.47708398",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkf02k",
            "score": 1,
            "text": "How is this not already thing across all government?",
            "title_similarity": "0.38458472",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkf2a3",
            "score": 1,
            "text": "How was this not a thing???",
            "title_similarity": "0.2986549",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkfwbg",
            "score": 2,
            "text": "Is this suppose to make us think they are limiting their greasy ness",
            "title_similarity": "0.52291965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkfxjx",
            "score": 3,
            "text": "Wait, that wasn't a rule already?",
            "title_similarity": "0.30476838",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkg0d7",
            "score": 2,
            "text": "They'll be loop holes.",
            "title_similarity": "0.30621916",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkgpbq",
            "score": 1,
            "text": "Well it’s a start I suppose",
            "title_similarity": "-0.03103229",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hhkhbti",
            "score": 2,
            "text": "About damn time.  Now if we can just apply this to our insider-trading legislators.",
            "title_similarity": "0.55160964",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hhkhkp3",
            "score": 1,
            "text": "Oh really? Oh... right. Fuck off.",
            "title_similarity": "0.2935331",
            "sentiment_compound": -0.5809
        },
        {
            "id": "hhkhsql",
            "score": 1,
            "text": "Embarrassingly overdue.",
            "title_similarity": "0.1820966",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hhki5wt",
            "score": 3,
            "text": "Now extend it to all politicians",
            "title_similarity": "0.1462881",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hhki9c5",
            "score": 3,
            "text": "Pelosi will find some other loophole",
            "title_similarity": "0.36535054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkiack",
            "score": 2,
            "text": "Fact is any of their family members can invest instead and it’s basically impossible for them to be charged for it. And it will always be that way. It’s a great idea, that law but that’s not gonna change.",
            "title_similarity": "0.31921637",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hhkigil",
            "score": 3,
            "text": "The feds a private bank, how do they make rules for us? Lol",
            "title_similarity": "0.5228896",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hhkitw5",
            "score": 1,
            "text": "Just stop PFOF and Dark Pools easy as that. But too bad the SEC which our taxes pay for their salary wont do shit about. We live to die and die to live.",
            "title_similarity": "0.6687509",
            "sentiment_compound": -0.9302
        },
        {
            "id": "hhkj581",
            "score": 1,
            "text": "no comment from gary gensler (SEC)",
            "title_similarity": "0.42830652",
            "sentiment_compound": -0.296
        },
        {
            "id": "hhkj5ob",
            "score": 2,
            "text": "Won’t they just have their spouses or family members buy them instead? I mean the people that are willing to take part in insider trading are probably the same people to find another way.",
            "title_similarity": "0.47221243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkjkxc",
            "score": 2,
            "text": "and all of their spouses will be investment advisors with blind trusts",
            "title_similarity": "0.3457728",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hhkk6sa",
            "score": 3,
            "text": "The wording is to confuse and appease the common folk. They think congress is included, which it doesn’t appear to be (?)",
            "title_similarity": "0.5932739",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hhkkvbi",
            "score": 2,
            "text": "Beggars belief that it's taken this long. Ban corporate 'political donations' next, along with greater legislation and transparency regarding lobbying",
            "title_similarity": "0.7298058",
            "sentiment_compound": -0.34
        },
        {
            "id": "hhkl15g",
            "score": 2,
            "text": "Doesn't say anything about stopping spouses or family members, so it essentially doesn't stop shit.",
            "title_similarity": "0.43421537",
            "sentiment_compound": 0.4959
        },
        {
            "id": "hhkl78r",
            "score": 1,
            "text": "Congress does it in the wide open too. Eg. \n\nReporter: \"Madam Speaker, can you tell us how it is ethical to buy $1mil worth or tesla stock 1 week before the president announces a push for EVs and make a $5mil profit?\"\n\nSpeaker: \"I don't know what you're talking about, that didn't happen\"\n\nStory ends.",
            "title_similarity": "0.5646922",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hhkl83e",
            "score": 1,
            "text": "None of that matters, they will just leak info to their friends like they do now and make billions like they do now.",
            "title_similarity": "0.55218637",
            "sentiment_compound": 0.6834
        },
        {
            "id": "hhkldmx",
            "score": 1,
            "text": "Criminal wolves in sheep's clothing",
            "title_similarity": "0.44867918",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hhkldu0",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.3625049"
        },
        {
            "id": "hhklngr",
            "score": 1,
            "text": "Well, I don’t think we’re ever gonna see a bull run like this again. Unless this gets secretly repealed in some big bill in a few years once the media looks away.",
            "title_similarity": "0.6947323",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hhkm1n5",
            "score": 1,
            "text": "Politicians be like but personal corruption is so profitable.\n\nRegular people be like yeah and that's the problem.",
            "title_similarity": "0.38985053",
            "sentiment_compound": 0.8542
        },
        {
            "id": "hhkm4dt",
            "score": 1,
            "text": "It’s 2021.  Took them 40 plus years to figure out this creates conflict of interest?  Whatever.",
            "title_similarity": "0.3926881",
            "sentiment_compound": 0.4723
        },
        {
            "id": "hhkm6rs",
            "score": 2,
            "text": "Can anyone explain why this isn't federal government-wide? What is the disconnect? Is this going to be seen as laughably corrupt by future generations?",
            "title_similarity": "0.6938919",
            "sentiment_compound": 0.4098
        },
        {
            "id": "hhkmw06",
            "score": 1,
            "text": "If you are a politician... At any level, you can only own government bonds. No stocks, no options, no businesses... #IfIHadAMonkeysPaw",
            "title_similarity": "0.5714767",
            "sentiment_compound": 0.1471
        },
        {
            "id": "hhknte8",
            "score": 3,
            "text": "We put Martha Stewart in prison. Loeffler, Purdue, and anyone else in that covid insider trading scandal should be in prison today. All of us would be if we were them",
            "title_similarity": "0.4596932",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hhkoz7b",
            "score": 3,
            "text": "They will just trade more through Family/Friends/Companies/Trusts/Holding Companies. \nNancy Pelosi's husband does her trades for her.\n\nDo you actually think this policy will stop them from making money on inside information?",
            "title_similarity": "0.6252581",
            "sentiment_compound": -0.296
        },
        {
            "id": "hhkpavc",
            "score": 3,
            "text": "Politicians should be next",
            "title_similarity": "0.19893447",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkpmkg",
            "score": 1,
            "text": "Oh they will still find a way to line their greedy pocketses",
            "title_similarity": "0.22682568",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hhkqx5i",
            "score": 1,
            "text": "It’s insane this isn’t already a thing.",
            "title_similarity": "0.32748225",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hhkrtz2",
            "score": 2,
            "text": "They got around it by just having their spouse by the stock",
            "title_similarity": "0.32351917",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkrwed",
            "score": 1,
            "text": "Are you fucking kidding me?  This wasn't a rule before?  WTF?!!?",
            "title_similarity": "0.42574757",
            "sentiment_compound": -0.7494
        },
        {
            "id": "hhkt173",
            "score": 1,
            "text": "Fuck yeah. But this isn't enough. No more insider trading for those fucks.",
            "title_similarity": "0.7145398",
            "sentiment_compound": -0.5374
        },
        {
            "id": "hhkunqj",
            "score": 1,
            "text": "Lol I read policymakers as congressmen and senators. How ridiculous of me to think that sitting american lawmakers shouldn't be able to inside trade on policy decisions they are working on...",
            "title_similarity": "0.65964305",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hhkusef",
            "score": 1,
            "text": "Ah yes casino rules: no in house employee gambling",
            "title_similarity": "0.59747803",
            "sentiment_compound": 0.128
        },
        {
            "id": "hhkx1he",
            "score": 1,
            "text": "Promises promises....\n\nThis country went from full capitalism to full democratic socialism + a crazy in-laws that are all either really rich or really poor Nazis in 20 years. \n\nIf the Dems don't understand that we would vote for any leader from Norway in a heart beat if we could,  over the best Dem candidate from the last 50 years;  they wont understand why they are losing their own base after fighting harder to win a majority than they have in those 50 years.",
            "title_similarity": "0.51438034",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hhkx9cp",
            "score": 1,
            "text": "I don't want rules, I want Laws with unpardonable mandatory minimum sentences for violators.",
            "title_similarity": "0.63971007",
            "sentiment_compound": -0.323
        },
        {
            "id": "hhkxivp",
            "score": 1,
            "text": "They will still find a loophole",
            "title_similarity": "0.06844932",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhkxw0o",
            "score": 1,
            "text": "Following “Controversy”?    Following the discovery they are racketeering through market manipulation of their making.",
            "title_similarity": "0.6145333",
            "sentiment_compound": -0.296
        },
        {
            "id": "hhkz4hy",
            "score": 3,
            "text": "This seems like a no brainer. Now do this with every branch of government.",
            "title_similarity": "0.3828075",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hhkzcf7",
            "score": 3,
            "text": "This is good but they only did it because the market is crashing soon",
            "title_similarity": "0.5336822",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hhl1faw",
            "score": 2,
            "text": ">Officials will be restricted primarily to owning mutual funds, which they will have to hold for a year and will need permission to buy or sell.\n\nBizarre that CNBC emphasizes mutual funds in the article. If you're an official with the fed going in on mutual funds you're probably not qualified to be there: ETFs have the same advantages with on average about half the fees,  which adds up bigly over the years, to say nothing of mutual funds' tax disadvantages.",
            "title_similarity": "0.57936656",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hhl1m12",
            "score": 7,
            "text": "Great, now do congress.",
            "title_similarity": "0.09464012",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hhl2pk0",
            "score": 3,
            "text": "the Fed got caught. No one will go to jail. At least they don’t control our money. Oh wait. \n\nFriendly reminder that the Fed is a private corporation that pretends to be public and has no actual reserves.",
            "title_similarity": "0.64336944",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hhl7olk",
            "score": 6,
            "text": "oh boy, another policy that has 70+% public approval that will never get through in congress.",
            "title_similarity": "0.5306568",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hhl81yl",
            "score": 2,
            "text": "Now is it enforceable? Who enforces it? What incentive is the enforcement? Is it another policymaker who could just be bribed to “leave watch” because they too are breaking the ban? \n\nAll that’s to say, I have zero faith these rules will have any power over these Uber wealthy fucks",
            "title_similarity": "0.733133",
            "sentiment_compound": 0.2674
        },
        {
            "id": "hhlcwvf",
            "score": 1,
            "text": "Not sure how I feel about the blackout rule as it could yield some very perverse incentives.",
            "title_similarity": "0.51986635",
            "sentiment_compound": -0.3563
        },
        {
            "id": "hhlday7",
            "score": 4,
            "text": "Does it also bar their spouses? If not, you’ve basically only ensured they stay married.",
            "title_similarity": "0.42797652",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhln3p2",
            "score": 2,
            "text": "What took them so dang long to enact such a ban?",
            "title_similarity": "0.51165783",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hhlolyq",
            "score": 3,
            "text": "A little late for that isn’t it",
            "title_similarity": "0.19783145",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhlsfdc",
            "score": 1,
            "text": "Lmfao, yeah. Cause that works!",
            "title_similarity": "-0.036153622",
            "sentiment_compound": 0.7177
        },
        {
            "id": "hhlt3td",
            "score": 1,
            "text": "In other news, policy makers open more new shell companies offshore.",
            "title_similarity": "0.36706716",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhluycc",
            "score": 2,
            "text": "And do it like lottery wins. Family associated with employees running a lottery, raffle, or contest cannot participate as well. We have to stop the easiest loophole of just having their spouse/children hold the shares in their name on behalf of the policymakers.",
            "title_similarity": "0.67453897",
            "sentiment_compound": 0.8012
        },
        {
            "id": "hhlvzoq",
            "score": 2,
            "text": "They tell their buds and get a kickback.  Nothing changes.",
            "title_similarity": "0.20073074",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhm2knm",
            "score": 1,
            "text": "As if this will have any real affect.",
            "title_similarity": "0.14516905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhm4kw3",
            "score": 1,
            "text": "The fact it took this long for this obvious of a policy to be implemented, and yet still not implemented across the whole of government, shows you how corrupt the whole thing really is. Fucking absurd",
            "title_similarity": "0.60183144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhm4z56",
            "score": 4,
            "text": "Still need to keep an eye on what their husbands and wives trade, like how Rand Paul's wife bought stock in the company that makes covid treatment medicine, which is probably why he, who is vaccinated, tells everyone not to get vaccinated",
            "title_similarity": "0.66529155",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hhm6thq",
            "score": 2,
            "text": "Oh noes, they're going to have to transfer their holding companies into trusts in order to freely trade individual stocks now.",
            "title_similarity": "0.6059272",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hhm7cnn",
            "score": 2,
            "text": "BRB, going to start hundreds of small ETFs which are 99% one stock.",
            "title_similarity": "0.20644689",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhm8nk1",
            "score": 4,
            "text": "Did they ban their spouses, children, trusts, and shell companies from these activities as well?\n\nOtherwise all they've done is add a bit of paperwork.",
            "title_similarity": "0.7688643",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hhmayvh",
            "score": 1,
            "text": "Nothing stopping them from owning crypto…",
            "title_similarity": "0.32861835",
            "sentiment_compound": 0.1139
        },
        {
            "id": "hhmca0h",
            "score": 3,
            "text": "How the fuck this was ever allowed is beyond amazing.",
            "title_similarity": "0.19549945",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hhmeqjn",
            "score": 3,
            "text": "They’ll just transfer them to a family member, or hide them like the Panama papers. The system is corrupt in so many ways now😔💯",
            "title_similarity": "0.6181271",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hhml3oq",
            "score": 1,
            "text": "I get that selecting individual stick is bad is stuff like blue chips, ETFs, etc  also a bad?",
            "title_similarity": "0.5586407",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hhmq83d",
            "score": 4,
            "text": "How’s about you go after lobbyists.",
            "title_similarity": "0.4116873",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhmwiqo",
            "score": 3,
            "text": "How the hell this still won’t extend to members of Congress baffles the mind.",
            "title_similarity": "0.6303358",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hhmzxjk",
            "score": 4,
            "text": "Anyone in government shouldn’t be allowed to trade stocks whatsoever",
            "title_similarity": "0.7564008",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhn10ot",
            "score": 2,
            "text": "It’s about fucking time!",
            "title_similarity": "0.070126295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhn8g4y",
            "score": 3,
            "text": "Some needs to look into Nancy Pelosi",
            "title_similarity": "0.33206618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhqz59r",
            "score": 2,
            "text": "They'll just slide it to family members.",
            "title_similarity": "0.27319282",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhvldac",
            "score": 1,
            "text": "there goes Nancy pelosi",
            "title_similarity": "0.12536113",
            "sentiment_compound": 0.0
        },
        {
            "id": "hinmh8g",
            "score": 1,
            "text": "Enabling thieves and lawbreakers to insider trading. It’s why that are all millionaires",
            "title_similarity": "0.4363178",
            "sentiment_compound": -0.5106
        }
    ]
}