{
    "The Florida Department of Health Medical Director has been put on leave for encouraging his own staff to get vaccinated.\n": [
        {
            "id": "ht969ez",
            "score": 1,
            "text": "\n**We encourage you to read our helpful resources on  COVID-19, vaccines and treatments:**\n\n[COVID Dashboard](https://covid19.who.int/)\n\n[Reddit's Vaccine FAQ](https://www.reddit.com/r/Coronavirus/wiki/faq#wiki_where_can_i_find_information_about_the_mechanism_and_progress_of_vaccines.3F)\n\n[Ivermectin FAQ](https://www.who.int/news-room/feature-stories/detail/who-advises-that-ivermectin-only-be-used-to-treat-covid-19-within-clinical-trials)\n\nA reminder that spreading misinformation regarding COVID-19, vaccines or other treatments can result in a post being removed and/or a ban. Advocating for or celebrating the death of anyone, or hoping someone gets COVID (or any disease) can also result in a ban. Please follow [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439) \n\n\nPlease use the report button and do not feed the trolls.\n\n\n[Reddit's Content Policy](https://www.redditinc.com/policies/content-policy) \n\n[Reddit's rules for health misinformation](https://www.reddithelp.com/hc/en-us/articles/360043513151)\n\n\n[/r/News' rules](https://www.reddit.com/r/news/wiki/rules/?utm_source=reddit&utm_medium=usertext&utm_name=news&utm_content=t5_2qh3l) \n\n------\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/news) if you have any questions or concerns.*",
            "title_similarity": "0.45595893",
            "sentiment_compound": 0.6662
        },
        {
            "id": "ht9ghh2",
            "score": 28,
            "text": "As a Canadian watching from the outskirts and fully aware that we have our own issues as does anybody. I sure hope that you americans realize that the rest of the world used to hate you because you thought you were better than us. Now the rest of the world jus thinks you’re idiots! \n\nPs i know its moslty the right (altho the left have their moments)",
            "title_similarity": "0.4382462",
            "sentiment_compound": 0.5707
        },
        {
            "id": "ht9mpf3",
            "score": 3,
            "text": "i'm okay with it. vaccines work, if you don't get it, i'm at the point where it's too bad if you get sick and die. i'd like to buy some real estate and look forward to less crowds.",
            "title_similarity": "0.5417942",
            "sentiment_compound": -0.8074
        },
        {
            "id": "ht9cwmc",
            "score": 14,
            "text": "What a Dumb State \nWhy they call it Floriduh",
            "title_similarity": "0.2737749",
            "sentiment_compound": -0.5106
        },
        {
            "id": "ht9kh56",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "ht9d8jj",
            "score": 40,
            "text": "Disgusting. You can’t change reality Florida. Vaccines work! Stop fighting science you hillbillies.",
            "title_similarity": "0.5941616",
            "sentiment_compound": -0.8122
        },
        {
            "id": "ht9ef2h",
            "score": 43,
            "text": "Can't wait to vote this fucker out\n\nDon't know if I'll be successful but fuck this childish administration",
            "title_similarity": "0.4355268",
            "sentiment_compound": -0.8645
        },
        {
            "id": "ht9m48q",
            "score": 13,
            "text": "Adjacently related: can we start normalizing alienating people from polite society whose willful ignorance is a danger to the public, please? Before they kill us all, of course.",
            "title_similarity": "0.48586938",
            "sentiment_compound": -0.8519
        },
        {
            "id": "ht9nvfi",
            "score": 17,
            "text": "Hey folks please remember as angry as you are right now...\n\nIt doesn't matter.\n\nThe people who enabled this as rigging the game so this wont touch them in elections. If anything, they will GAIN votes off this.\n\nThis is what systemic collapse looks like. People being punished for doing their jobs instead of toeing the party line.",
            "title_similarity": "0.51518357",
            "sentiment_compound": 0.2638
        },
        {
            "id": "ht9vucz",
            "score": -15,
            "text": "I'd sooner visit Afghanistan before Florida",
            "title_similarity": "0.3925475",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9djjr",
            "score": 22,
            "text": "Nice authoritarian move there, DeSatan",
            "title_similarity": "0.16566107",
            "sentiment_compound": 0.4215
        },
        {
            "id": "ht9c5ef",
            "score": 13,
            "text": "Can’t make up this shit.",
            "title_similarity": "0.10880491",
            "sentiment_compound": -0.6428
        },
        {
            "id": "ht9jy28",
            "score": 2,
            "text": "WTF. What the Florida?",
            "title_similarity": "0.28294402",
            "sentiment_compound": -0.6739
        },
        {
            "id": "ht9s5dy",
            "score": 2,
            "text": " Petition to rename America to Dumbcuntistan, all those in favour?",
            "title_similarity": "0.35081637",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht9f9o8",
            "score": 36,
            "text": "Florida is the dumbest fucking state in the union",
            "title_similarity": "0.41441578",
            "sentiment_compound": -0.5106
        },
        {
            "id": "ht9do6k",
            "score": 33,
            "text": "What a douche DeathSantis is...",
            "title_similarity": "0.16288847",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htbnwtw",
            "score": 1,
            "text": "A bit of a misleading headline, he wasn't encouraging, he was slamming his employees for their own choices and as a government official should not be applying pressure like that.  It's no different than a cop trying to trick you around the 5th amendment.",
            "title_similarity": "0.5057707",
            "sentiment_compound": -0.5405
        },
        {
            "id": "ht9lxti",
            "score": -5,
            "text": "Imagine living here, it’s actually a really nice place and believe it or not the locals are great here too. It’s all manufactured tribalism and the fact that a bunch of dumb people move here. People rag on Florida but Florida is really a giant reflection of the US. We got sooooo many transplants from other states. So remember not all Floridians are scum, we trying to save what we can here till we have to move ourselves.",
            "title_similarity": "0.5640047",
            "sentiment_compound": 0.7748
        },
        {
            "id": "ht99txb",
            "score": 41,
            "text": "The whole state of Florida is batshit crazy, Desantis is a piece of shit. He deserves to be arrested for voluntary manslaughter.",
            "title_similarity": "0.48614547",
            "sentiment_compound": -0.8442
        },
        {
            "id": "ht9atrw",
            "score": 18,
            "text": "Meanwhile the staff will get vaccinated and the leave is not permanent. Only for the Trump crowd's consumption.",
            "title_similarity": "0.68167055",
            "sentiment_compound": -0.0516
        },
        {
            "id": "htapd0q",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "ht9dx5f",
            "score": 13,
            "text": "That state is f\\*cked up",
            "title_similarity": "0.15944627",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9fh1i",
            "score": 20,
            "text": "Done with Desantis! Stop the Fascists!",
            "title_similarity": "0.38913333",
            "sentiment_compound": -0.555
        },
        {
            "id": "ht9norr",
            "score": 62,
            "text": "This article just seems like it is leaving out a lot of details.",
            "title_similarity": "0.23427138",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht9r74u",
            "score": 3,
            "text": "The article isn’t loading for me for some reason, is this title accurate? I really hope he threatened to fire somebody for not getting the shot or something like that because if not this is fucking insane\n\nEdit - why am I being downvoted for asking if the title is accurate.. jesus christ reddit",
            "title_similarity": "0.46686321",
            "sentiment_compound": -0.4522
        },
        {
            "id": "hta29ey",
            "score": 0,
            "text": "What is absolute madness about all of this, is the science behind vaccines is solid, it's not called into question at all, we KNOW it works.",
            "title_similarity": "0.30828467",
            "sentiment_compound": -0.3182
        },
        {
            "id": "htb71lw",
            "score": 0,
            "text": "Meanwhile in Massachusetts, we now have mandated proof of vaccine to enter certain establishments.",
            "title_similarity": "0.49643403",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htap4ny",
            "score": -2,
            "text": "This is awful. This is why cancel culture and banning people for having opinions is dangerous. It will always go both ways.",
            "title_similarity": "0.36288163",
            "sentiment_compound": -0.7964
        },
        {
            "id": "htb076k",
            "score": -1,
            "text": "Florida has had a pro-covid stance from the start. We never actually had any sort of lockdown - it was a voluntary stay at home suggestion - and nobody ever had to pay fines for breaking any local covid ordinances. This used to be a secret - people got mad at me when I told them the governor was actually trying to make everyone sick on purpose. Now they're just flat out admitting it.",
            "title_similarity": "0.6093403",
            "sentiment_compound": -0.7845
        },
        {
            "id": "htazzyd",
            "score": -6,
            "text": "I don't care anymore. I just don't. My own uncle was killed by covid a couple weeks ago. I don't have the capacity anymore. If these idiots want to play the slowest game of Russian roulette, then fuck 'em.\n\nThese GOP politicians are just killing off their voter base. Even with all the gerrymandering and voter suppression laws, the number of Republican voters that are killing themselves will probably be too high for them to win.\n\nIt's all so stupid.",
            "title_similarity": "0.5165765",
            "sentiment_compound": -0.9583
        },
        {
            "id": "htb8wv8",
            "score": -6,
            "text": "Misleading headline. He tried to shame them into getting vaxxed vs. saying “Just a reminder if you want to get vaxxed here is how.” While I don’t condone his dismissal his approach was coercive. I’d be pissed too and I fully support vaccination. You get more bees with honey.",
            "title_similarity": "0.5111733",
            "sentiment_compound": -0.7722
        },
        {
            "id": "ht9w01v",
            "score": -12,
            "text": "Wierd seeing all these comments about how bad Florida is but we have the highest amount of people moving here 😭 Wish you people would stay away",
            "title_similarity": "0.5608849",
            "sentiment_compound": -0.431
        },
        {
            "id": "ht9osbd",
            "score": -36,
            "text": "No he was put on leave to see if he broke the law against employers coercing employees to get vaccinated.",
            "title_similarity": "0.7837151",
            "sentiment_compound": -0.6369
        },
        {
            "id": "ht9k1t3",
            "score": -73,
            "text": "I'm wondering how many looked at the source. Based on the comments about zero. I seriously think I could post something from the Westboro Baptist Church that supported a liberal belief anymore and Reddit would support it since it was against their political enemies. \n\nSeriously, the source is an online black Church group. HELL, Rev Wright praised Louis Farrakhan in his church paper and the left dismissed it because it wasn't a real news source. But this shit is suddenly a reliable source?",
            "title_similarity": "0.53331834",
            "sentiment_compound": -0.8497
        },
        {
            "id": "htb51ew",
            "score": 2,
            "text": "Florida is a cesspool of racist morons.",
            "title_similarity": "0.3960275",
            "sentiment_compound": -0.743
        },
        {
            "id": "htbk5eo",
            "score": 1,
            "text": "As a physician who lives in Florida this makes me want to cry. This is why we have the highest rates of Covid in the WORLD. Ron DeSantis is killing people so that he can get re-elected and run for the presidency, essentially because like Trump he is a sociopath who cares more about political ambition than about the people he was elected to protect and serve and because republicans are stupid enough to buy their shit.",
            "title_similarity": "0.5827286",
            "sentiment_compound": -0.7964
        },
        {
            "id": "htaxrx7",
            "score": 0,
            "text": "I encourage him to go to a better state that isn't a complete anti-science shit show.",
            "title_similarity": "0.34065163",
            "sentiment_compound": 0.3818
        },
        {
            "id": "htb67fu",
            "score": 0,
            "text": "Good old Florida. Glad my parents don’t pay attention to that part of DeSantis’s platform.",
            "title_similarity": "0.6489577",
            "sentiment_compound": 0.6705
        },
        {
            "id": "htb2s2k",
            "score": 2,
            "text": "Why is Florida like this?",
            "title_similarity": "0.28482676",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htb62hn",
            "score": -4,
            "text": "This is a county official.  Orange County, not the state of Florida.  And his email to employees was somewhat inappropriate.  I would not call it encouraging.  This headline is misleading.",
            "title_similarity": "0.55914515",
            "sentiment_compound": -0.6679
        },
        {
            "id": "ht9uz7n",
            "score": -25,
            "text": "Misleading headline… his email was coercive and clearly against protocol",
            "title_similarity": "0.34387863",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9ljwi",
            "score": 2,
            "text": "“encouraging.” gotta be more to this story.",
            "title_similarity": "0.042875603",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbm6ft",
            "score": -4,
            "text": "Good. Politics and beliefs do not belong in the workplace.",
            "title_similarity": "0.3244475",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hta8fxp",
            "score": 1,
            "text": "We should just build a 40 foot tall wall around the Florida border and declare it a no fly zone, that should keep the rest of us safe for now.",
            "title_similarity": "0.48017085",
            "sentiment_compound": 0.1779
        },
        {
            "id": "htay7k5",
            "score": 1,
            "text": "Because Florida and the GOP are sensitive.  Wouldn't want that cancel culture.",
            "title_similarity": "0.4297825",
            "sentiment_compound": 0.1326
        },
        {
            "id": "htb11dv",
            "score": 1,
            "text": "Florida is going to be a very blue state by next election.",
            "title_similarity": "0.3735562",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb1cps",
            "score": 1,
            "text": "“Florida Man Suspended for Doing his Job”",
            "title_similarity": "0.6367847",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htb1pyr",
            "score": 1,
            "text": "*Really*, America? 🤦🏻‍♀️",
            "title_similarity": "0.10551467",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9bhlo",
            "score": 22,
            "text": "Uh....WHAT?\n\n&#x200B;\n\nThey have lost their damn minds down in Florida.",
            "title_similarity": "0.57789016",
            "sentiment_compound": -0.6124
        },
        {
            "id": "ht9h735",
            "score": 5,
            "text": "Can someone explain like I’m five why we didn’t let the South secede? I know there’s plenty of nice people down there, but come on. It’s just embarrassing.",
            "title_similarity": "0.49823952",
            "sentiment_compound": -0.1901
        },
        {
            "id": "ht9c4q9",
            "score": 21,
            "text": "They aren’t vaccinated yet? These vaccines came out almost a year ago",
            "title_similarity": "0.47750035",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9a1qo",
            "score": 44,
            "text": "[deleted]",
            "title_similarity": "0.18846297"
        },
        {
            "id": "htasovr",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "hta90g4",
            "score": 6,
            "text": "“Guy who *suggests* vaccination punished for disobeying magagrift laws against *mandating* vaccination.  \n\n Last week’s video of Florida’s ~~smugbastard~~  Surgeon General Joseph Lackeypo refusing to wear a mask to meet with a cancer patient makes this no surprise.  All these idiotic Griftocracy fuckwits don’t care who they destroy in their quest for MAGApproval.  DeSantis is lining up his principle-free loyalists against those of the burnt umber stumbler himself- trying to out-MAGA the MAGA golden calf.  American politics long ago fell below WWE standards. Hell: it’s been below Stampede Wrestling verité for decades.",
            "title_similarity": "0.7741442",
            "sentiment_compound": -0.9687
        },
        {
            "id": "hta88w9",
            "score": 2,
            "text": "This has got to be a new low for this country",
            "title_similarity": "0.23673618",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hta8b4n",
            "score": 4,
            "text": "If science was a culture, this would be cancel culture",
            "title_similarity": "0.29632676",
            "sentiment_compound": -0.25
        },
        {
            "id": "htacfqj",
            "score": 4,
            "text": "My state is utter trash. Florida Republicans can't do any thing positive. It's sickening.",
            "title_similarity": "0.45256078",
            "sentiment_compound": 0.0516
        },
        {
            "id": "htay2na",
            "score": 1,
            "text": "Just think of the stories our grandkids won't get to tell because of our moronic reversion towards anti-science.",
            "title_similarity": "0.527076",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htayysj",
            "score": 2,
            "text": "DeSantis is serious about prolonging this pandemic!",
            "title_similarity": "0.34193408",
            "sentiment_compound": -0.1511
        },
        {
            "id": "htb0j8z",
            "score": 3,
            "text": "The hell is going on down there? Wild",
            "title_similarity": "0.10756288",
            "sentiment_compound": -0.6808
        },
        {
            "id": "htb20dh",
            "score": 2,
            "text": "Who left the portal to bizarro world open again? .. how many times have we talked about this..\n\nFlorida DMV fires head for suggesting motorists wear seat belts stating \"How are people's bodies going to build up an immunity to car crashe trama if we keep preventing the trama?!?\"\n\nWe are legit living in an episode of Black Mirror..",
            "title_similarity": "0.6538086",
            "sentiment_compound": -0.234
        },
        {
            "id": "htb28bn",
            "score": 3,
            "text": "Florida: Because no one else, is allowed to be the worst at everything.",
            "title_similarity": "0.45204264",
            "sentiment_compound": -0.743
        },
        {
            "id": "htb2wrj",
            "score": 1,
            "text": "Floriduh being Floriduh. Never change please because we love the news stories..",
            "title_similarity": "0.26233304",
            "sentiment_compound": 0.5003
        },
        {
            "id": "htb6rqt",
            "score": 2,
            "text": "I’m pretty sure that even in Florida that’s illegal for them to do… they have a good case to sue the state if they have proof",
            "title_similarity": "0.5207124",
            "sentiment_compound": 0.5859
        },
        {
            "id": "htb8qif",
            "score": 1,
            "text": "the real pandemic is white privilige and racism",
            "title_similarity": "0.2703563",
            "sentiment_compound": -0.6249
        },
        {
            "id": "htbk16i",
            "score": 4,
            "text": "He's a state employee and the state of Florida is officially an anti-vaxx state. The governor wants to run for president, and he is pandering hard to the anti-vaxxers, so this is evidence as to how serious he is. If Dr. Pino had recommended that his staff NOT get vaxxed, he'd still be working. \n\nI live in Central Florida and watched Dr. Pino brief the region nearly every day during the pandemic, and he is a HERO. He deserves so much better than this.",
            "title_similarity": "0.7033328",
            "sentiment_compound": 0.823
        },
        {
            "id": "htbkf4b",
            "score": -3,
            "text": "Gotta love how the media is spinning a major HIPPA violation as being poltical nonsense.\n\nYour medical information is private, an employer looking up your medical information is a major NO NO.\n\nThe proper way to do this is to bribe the employees to voluntarily submit their vaccination records.\n\nThis guy should be fined, his employer (State of Florida) should be heavily fined for each record he pulled violating the Federal Statues, and this should never happen again.\n\n&#x200B;\n\n&#x200B;\n\n*\\[Please get vaccinated so you don't die.  Don't do it for politics or to make other people happy.\\]*",
            "title_similarity": "0.72313243",
            "sentiment_compound": -0.0244
        },
        {
            "id": "htc8wgl",
            "score": -2,
            "text": "He had a jab at his employees in the email too. Not justifying it, but it wasn’t a simply “you should wear a mask” it was a “how dare you call yourself a medical professional” which isn’t professional in itself",
            "title_similarity": "0.5916917",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9bs98",
            "score": 42,
            "text": " >“**the decision to get vaccinated is a personal choice** that should be free from coercion and mandates from employers.”\n\nThis is not like praying to Jesus, you numbnuts.  \n\n>Florida **DOH** says it’s even conducting an inquiry into whether any laws were broken by sending the email.\n\nIf ever there's a department in Florida that's aptly named.",
            "title_similarity": "0.7455994",
            "sentiment_compound": -0.4624
        },
        {
            "id": "ht9r44c",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "ht9h7aa",
            "score": 25,
            "text": "Florida and Texas et al are third world states.",
            "title_similarity": "0.24638608",
            "sentiment_compound": 0.0
        },
        {
            "id": "htaswq8",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "hta1lk9",
            "score": 3,
            "text": "IMO, this comes down to his wording. It probably comes off as coercion to some. Some Google searches can find you all kinds of Florida officials neutrally encouraging vaccination. Plenty of them do it in official press releases.",
            "title_similarity": "0.65808165",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htaabor",
            "score": 4,
            "text": "I would've liked more details. Perhaps the full text of the email. If it was only \"encouraging\" people to get vaccinated then it shouldnt've run afoul of FL's laws.",
            "title_similarity": "0.50650334",
            "sentiment_compound": 0.7351
        },
        {
            "id": "htb0ic5",
            "score": 3,
            "text": "Just when you think Florida can't get any more Florida-y, they do this.",
            "title_similarity": "0.48553228",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb4rgc",
            "score": 3,
            "text": "Welcome to Florida, where the weather is nice but a virus has more rights to your body then you do.",
            "title_similarity": "0.51632047",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htbfj1a",
            "score": -1,
            "text": "So he cant do that..? but no one bats an eye to the tyrant running France? We need french revolution once again",
            "title_similarity": "0.4362595",
            "sentiment_compound": -0.4871
        },
        {
            "id": "htbpkgw",
            "score": -5,
            "text": "Florida alot better than ny",
            "title_similarity": "0.2124418",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht9jnvh",
            "score": 7,
            "text": "Shut up buddy! We're trying to kill people ovah here in the nation's schlong.",
            "title_similarity": "0.45722222",
            "sentiment_compound": -0.7177
        },
        {
            "id": "htbekgh",
            "score": -6,
            "text": "I don't understand why smart, thinking and fair people are upset about this. The Department's policy clearly is \"the decision to get vaccinated is a personal choice that should be free from coercion and mandates from employers.\"\n\nIt seems blatantly obvious that when your boss sends you an email that he prefers you to do something which you have a right not to do, and that he's disappointed or upset that you aren't doing that thing, especially when it's from their official DOH account, that could certainly rise to the level of coersion. Particularly in a situation where your boss will now question your judgement and his perception of your ability to do your job. We've all experienced this on some level or another in our lives, be it a parent saying \"I'm disappointed in you\" or your boss saying \"I think you should be more of a team player,\" or any one of a million other examples.\n\nI was one of the first people to get vaccinated in my state and I support and encourage people to get the vaccine. Also, I ardently support people's right to choose and their right to be free from coersion and discrimination based on their personal choice. Both can be true at once.\n\nFin",
            "title_similarity": "0.6166057",
            "sentiment_compound": 0.9208
        },
        {
            "id": "ht96vly",
            "score": 70,
            "text": "Absolutely idiotic. Florida really does deserve its reputation…",
            "title_similarity": "0.3274973",
            "sentiment_compound": -0.5984
        },
        {
            "id": "ht9pg8t",
            "score": -22,
            "text": "Damn, Florida sounds insanely based!",
            "title_similarity": "0.25899532",
            "sentiment_compound": -0.4574
        },
        {
            "id": "htb40t5",
            "score": 0,
            "text": "It’s a bit hard to tell from the excerpt but the e-mail sounds like an opinion piece. Advising people to get the vaccine is not forcing them to get it, or that there will be punishments or restrictions for not getting it. He has a point, esp. in public health. But being fired for stating an opinion (which may or may not be solely their own) is over the top and nonsensical. \n\nPart of me wants to move to FL and part of me is kinda scared of the people, lol.",
            "title_similarity": "0.6152365",
            "sentiment_compound": -0.62
        },
        {
            "id": "htbgoxj",
            "score": 0,
            "text": "This is onion-level material right here.",
            "title_similarity": "0.022774937",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbgr0i",
            "score": 0,
            "text": "I know it sounds like a Onion headline but in Florida Republizzaro land. Umm yep!",
            "title_similarity": "0.4502214",
            "sentiment_compound": 0.5916
        },
        {
            "id": "htbldck",
            "score": -6,
            "text": "Well yeah, only your own personal doctor should be giving you medical advice.",
            "title_similarity": "0.6135117",
            "sentiment_compound": 0.6908
        },
        {
            "id": "htblezg",
            "score": -3,
            "text": "Good. He has no right use his position to push his beliefs on those who work for him.",
            "title_similarity": "0.39770746",
            "sentiment_compound": 0.1779
        },
        {
            "id": "htbtejz",
            "score": 0,
            "text": "It’s fascinating how much of Trumplandia is scared of the Trump vaccine.",
            "title_similarity": "0.45005998",
            "sentiment_compound": 0.1531
        },
        {
            "id": "htbtwzq",
            "score": 0,
            "text": "Florida is the personification of Florida Man. Which in and of itself is a personification. \n\nWhy anyone wants to live in the bug infested strip mall state I'll never know.",
            "title_similarity": "0.5553531",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbxlhf",
            "score": 0,
            "text": "Florida strikes again.",
            "title_similarity": "0.30789444",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htbxxah",
            "score": 0,
            "text": "That’s some state you got there",
            "title_similarity": "0.040826187",
            "sentiment_compound": 0.0
        },
        {
            "id": "htc0cxk",
            "score": 0,
            "text": "I hope there’s more to the story and the headline is misleading",
            "title_similarity": "0.21139291",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hwyrbct",
            "score": 0,
            "text": "GOOD. It Should say FIRED",
            "title_similarity": "0.14246619",
            "sentiment_compound": -0.1779
        },
        {
            "id": "ht9op4v",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "ht99vym",
            "score": -83,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "ht9shbo",
            "score": 5,
            "text": "Covid vaccines are the same with polio and flu vaccine right. Most Americans really are out of this legit world.",
            "title_similarity": "0.523715",
            "sentiment_compound": -0.3818
        },
        {
            "id": "htb2fm2",
            "score": 4,
            "text": "It astounds me that anyone can look at DeSantis and think, \"Yeah, that's how I want my shit run.\"",
            "title_similarity": "0.41488907",
            "sentiment_compound": 0.25
        },
        {
            "id": "htb44lb",
            "score": -4,
            "text": "Not being reported: he may have accessed potentially confidential worker health info \nhttps://twitter.com/marcacaputo/status/1483632549486280711?s=21",
            "title_similarity": "0.5303147",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb4vs5",
            "score": -5,
            "text": ">In an email to WMFE, the Florida Department of Health has confirmed Pino was put on leave because, “the decision to get vaccinated is a personal choice that should be free from coercion and mandates from employers.”\n\nTrying to shame or berate your subordinates into a voluntary medical procedure is coercion.",
            "title_similarity": "0.86902344",
            "sentiment_compound": -0.0
        },
        {
            "id": "ht9rdgu",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "hta8e5e",
            "score": 1,
            "text": "Too bad every job didn’t reward you like this for doing the actual job.",
            "title_similarity": "0.4241122",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hta9hju",
            "score": -1,
            "text": "This headline says Florida but Virginia is up next at this rate",
            "title_similarity": "0.32554978",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta9i0b",
            "score": 1,
            "text": "I dont understand anything anymore. Who’s going to do the job better?",
            "title_similarity": "0.229143",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hta9inq",
            "score": 1,
            "text": "This is that freedom folks are talking about, right?",
            "title_similarity": "0.17113096",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hta9jtd",
            "score": 1,
            "text": "Whomever fired him is guilty of terrorism and sedition.",
            "title_similarity": "0.29253763",
            "sentiment_compound": -0.93
        },
        {
            "id": "hta9m7z",
            "score": 1,
            "text": "Do not buy land in middle America. No one do that. I’m defy not trying to.",
            "title_similarity": "0.354205",
            "sentiment_compound": -0.296
        },
        {
            "id": "hta9r47",
            "score": 1,
            "text": "Nothing in his email coerced or mandated employees get vaccinated. Anyone that thinks it does simply does not understand language or coercion. Whoever put him on leave obviously failed English and does not deserve the position they have.",
            "title_similarity": "0.55558693",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hta9wvv",
            "score": 1,
            "text": "We should invade Florida because there are some very evil despots running the place and last time I checked they have oil and weapons of mass destruction",
            "title_similarity": "0.5180017",
            "sentiment_compound": -0.9061
        },
        {
            "id": "htabfx6",
            "score": 1,
            "text": "These Florida headlines give me deja vu",
            "title_similarity": "0.34092224",
            "sentiment_compound": 0.0
        },
        {
            "id": "htac27m",
            "score": 1,
            "text": "This is absolute insanity. And they’re saying this is because getting vaccinated against a highly infectious virus that’s killed close to a million Americans is a personal choice? Nah, a personal choice if a couple has unprotected sex and accidentally gets pregnant and they decide to keep it. Nah. Not choosing to vaccinated is like fucking your girl without a condom and you end up getting your you end up getting your neighbors pregnant.",
            "title_similarity": "0.62258136",
            "sentiment_compound": -0.9081
        },
        {
            "id": "htac4r2",
            "score": 1,
            "text": "Should be in r/nottheonion   Totally insane.",
            "title_similarity": "0.14626546",
            "sentiment_compound": -0.4576
        },
        {
            "id": "htaccrs",
            "score": 1,
            "text": "im really starting to think SOME of these malicious/malignant politicians want this pandemic to be prolonged.\n\nFor some reason. As if instability and suffering will help accomplish a goal of some sort. Madness.",
            "title_similarity": "0.3832841",
            "sentiment_compound": -0.0516
        },
        {
            "id": "htacmpi",
            "score": 1,
            "text": "What in the ever loving fuck is wrong with FL?!?!?!?!?!",
            "title_similarity": "0.26664954",
            "sentiment_compound": -0.703
        },
        {
            "id": "htacoch",
            "score": 1,
            "text": "BugsBunny_sawing_Florida_off_the_continent.avi",
            "title_similarity": "0.5132509",
            "sentiment_compound": 0.0
        },
        {
            "id": "htacsyn",
            "score": 1,
            "text": "We are in the darkest timeline where political agendas matter more than medical science.   \n\n\nWe must do everything we can to keep these people away from the control of the federal branches of government. Pseudoscience rots your brain and impairs critical thinking.  \n\n\nI say this as a Burkean-Kirkian conservative. These people are making decisions contrary to science and their decisions are harming and killing people.",
            "title_similarity": "0.50226593",
            "sentiment_compound": -0.9393
        },
        {
            "id": "htagwzf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "htau49z",
            "score": 1,
            "text": "It's unimagineable to me that de santis is doing this dumb anti vaxx campaign is **raising** his stock with floridians and his party. Apparently this makes him a viable candidate.... willing to let his own people suffer a preventable disease.",
            "title_similarity": "0.61075854",
            "sentiment_compound": -0.7891
        },
        {
            "id": "htavv1v",
            "score": 1,
            "text": "I hate living here, the worst state I have ever lived in.",
            "title_similarity": "0.3124056",
            "sentiment_compound": -0.8316
        },
        {
            "id": "htazqis",
            "score": 1,
            "text": "Weird how the state where this happens is also the state paying $5,000 a week for travel nurses in areas with a $500 a week cost of living.",
            "title_similarity": "0.37793046",
            "sentiment_compound": -0.1779
        },
        {
            "id": "htazxvj",
            "score": -1,
            "text": "Man, 2022 already on some fucked up Shit.",
            "title_similarity": "0.22722986",
            "sentiment_compound": -0.8402
        },
        {
            "id": "htb11w2",
            "score": 1,
            "text": "Florida man is governed by Florida man",
            "title_similarity": "0.4244265",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb4bz2",
            "score": 1,
            "text": "I tried to withhold judgement until I read the article, but yah, Florida is crazy fucking dumb.",
            "title_similarity": "0.57686186",
            "sentiment_compound": -0.8397
        },
        {
            "id": "htb4w5o",
            "score": 1,
            "text": "Yup, Florida's done.\n\nJust put a big fence at the bottom of Alabama and Georgia until Omicron passes.",
            "title_similarity": "0.5172814",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb5u46",
            "score": -1,
            "text": "Hahahahahaha horrible",
            "title_similarity": "0.054658394",
            "sentiment_compound": -0.5423
        },
        {
            "id": "htb5xeb",
            "score": 1,
            "text": "This is the worst fucking timeline. I never thought,before all of this shit, people would be so fucking adverse to saving lives.",
            "title_similarity": "0.41663522",
            "sentiment_compound": -0.9085
        },
        {
            "id": "htb6g45",
            "score": 1,
            "text": "Florida man = Florida politician = this\n\n\nWhat a crazy world we live in",
            "title_similarity": "0.45370278",
            "sentiment_compound": -0.34
        },
        {
            "id": "htb98im",
            "score": 1,
            "text": "And just one more reason I’ll never go to Florida again… ever.",
            "title_similarity": "0.43548435",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbah0l",
            "score": 1,
            "text": "We live in clown world, but how many people actually read the article? It's got no links and is very very short.\n\nThe statement doesn't even share the whole email and it seems that the reason for his leave is there's an investigation into if this counts as workplace coercion.\n\nLike it's insane this whole thing is politicized the way it is, and regardless of what was said (barring some extreme outliers) this guy shouldn't be on leave for an email. All that said, I can't help but feel places like this where so many of us comment and claim the world's ending without even clicking the link is almost as bad.",
            "title_similarity": "0.5437463",
            "sentiment_compound": -0.8584
        },
        {
            "id": "htbf6gy",
            "score": 1,
            "text": "I'm confused why anyone cares anymore. Florida, the shining beacon of a conservative run state, can reap what they sow. I don't give a flying fuck if Floridians are dropping like flies because of \"a bad cold\". Fuckem.",
            "title_similarity": "0.66046464",
            "sentiment_compound": -0.5859
        },
        {
            "id": "htbhr4s",
            "score": 1,
            "text": "Most fascist state in the US",
            "title_similarity": "0.24348095",
            "sentiment_compound": -0.5984
        },
        {
            "id": "htbjygw",
            "score": 1,
            "text": "The only Sensible thing to do and he gets throw under the bus",
            "title_similarity": "0.43569878",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbk210",
            "score": -1,
            "text": "It’s time to saw that entire state off, I think it has gangrene.",
            "title_similarity": "0.4517216",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbk8cs",
            "score": 1,
            "text": "There was nothing \"encouraging\" about the language he used in that email and that's why he was put on leave. For berating the staff about their own decisions.",
            "title_similarity": "0.6062221",
            "sentiment_compound": -0.4545
        },
        {
            "id": "htbk9t5",
            "score": -1,
            "text": "sheeeeeeeeeesh we are so fucked.",
            "title_similarity": "0.13881359",
            "sentiment_compound": -0.7661
        },
        {
            "id": "htbkkax",
            "score": 1,
            "text": "Another chilling reminder of DeSantis’ war against logic and reason.",
            "title_similarity": "0.32611376",
            "sentiment_compound": -0.6124
        },
        {
            "id": "htbmv6y",
            "score": 1,
            "text": "The GOP is actually willing to let their constituents die, all in order to make Biden look bad. How have the not figured out they are nothing but pawns in this deadly game?",
            "title_similarity": "0.4753851",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htbn07z",
            "score": 1,
            "text": "No one Floridas quite like Florida.",
            "title_similarity": "0.24976057",
            "sentiment_compound": 0.1513
        },
        {
            "id": "htbpxpq",
            "score": 1,
            "text": "Why is DeSantis actively trying his best to appeal to these wack jobs?",
            "title_similarity": "0.3322146",
            "sentiment_compound": 0.7579
        },
        {
            "id": "htbskwr",
            "score": 1,
            "text": "America is soooo fucked right now. The rest of the world is going to have to figure out how to diffuse the American bomb for them. Just can’t be trusted not to go full fascist psycho on the whole planet.",
            "title_similarity": "0.44421637",
            "sentiment_compound": -0.8442
        },
        {
            "id": "htbsxc4",
            "score": 1,
            "text": "Really felt like r/nottheonion",
            "title_similarity": "0.071317226",
            "sentiment_compound": 0.4173
        },
        {
            "id": "htbsxob",
            "score": 1,
            "text": "Wow.  Florida keeps it up, the US is gonna sell the whole thing to Disney.",
            "title_similarity": "0.49295795",
            "sentiment_compound": 0.5859
        },
        {
            "id": "htbx3w2",
            "score": 1,
            "text": "Florida is out of control",
            "title_similarity": "0.31688258",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbxg0d",
            "score": 1,
            "text": "This whole new vax/unvax culture is stupid af.",
            "title_similarity": "0.34731168",
            "sentiment_compound": -0.5267
        },
        {
            "id": "htbzy8p",
            "score": 1,
            "text": "What I don't get is why they've drawn such lines in the sand. I used to consider myself moderate, after voting straight Republican until 2008. Now I wouldn't vote for a Republican if they were running against a burning pile of dog shit.\n\nI'm being totally honest. I would literally vote for a burning pile of dog shit if the other choice is a Republican.",
            "title_similarity": "0.4544108",
            "sentiment_compound": -0.4033
        },
        {
            "id": "htc04ax",
            "score": 1,
            "text": "Republicans deserve this virus.",
            "title_similarity": "0.29110873",
            "sentiment_compound": 0.0
        },
        {
            "id": "htenhza",
            "score": 1,
            "text": "Put on leave for being pro-life and following the Hippocratic oath;  sounds like religious persecution to me",
            "title_similarity": "0.5887661",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ht9onkz",
            "score": -7,
            "text": "Encouraging is good. Mandating is bad. To far Florida, please reconsider. The vaccine is a good decision for many people, especially adults.",
            "title_similarity": "0.54794854",
            "sentiment_compound": 0.7906
        },
        {
            "id": "htbapf5",
            "score": -15,
            "text": "Fake news.  Free states don’t use threaten people like Democrats.",
            "title_similarity": "0.37924236",
            "sentiment_compound": 0.0258
        },
        {
            "id": "ht9wbip",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "ht9ozdm",
            "score": 15,
            "text": "Encouraging is not mandating",
            "title_similarity": "0.17045723",
            "sentiment_compound": 0.5267
        },
        {
            "id": "ht9kf9q",
            "score": 11,
            "text": "Just a reminder that 47.9% of Florida voters voted for Biden. So writing off the whole state as crazy or complicit isn’t fair. -signed, Ohio voter",
            "title_similarity": "0.6079829",
            "sentiment_compound": -0.0258
        },
        {
            "id": "ht9gsrb",
            "score": 2,
            "text": "What in the Bawitdaba da bang da bang diggy diggy diggy  \nShake the boogie said up jump the boogie  \nBawitdaba da bang da bang diggy diggy diggy  \nShake the boogie said up jump the boogie it's happening here. Florida the Kid Rock of the US.",
            "title_similarity": "0.32462782",
            "sentiment_compound": -0.34
        },
        {
            "id": "ht9puwr",
            "score": 2,
            "text": "My fellow Floridians, if you’re enraged vote the motherfucker out.",
            "title_similarity": "0.45919478",
            "sentiment_compound": -0.8074
        },
        {
            "id": "ht9tr9a",
            "score": 2,
            "text": "Florida, where up is down and down is also down.",
            "title_similarity": "0.32460994",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9ydsz",
            "score": 2,
            "text": "And Florida retakes the lead",
            "title_similarity": "0.23214525",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9yiqb",
            "score": 2,
            "text": "Imagine the damage that Desantis could wreck as President.",
            "title_similarity": "0.37369967",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hta5u0g",
            "score": 2,
            "text": "sensationalist news coverage that begets an argument between vaxxers and anti vaxxers, when the two sides shouldnt even exist in the first place. listen to science.",
            "title_similarity": "0.3430664",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hta8oq9",
            "score": 2,
            "text": "Once again DeSantis is showing us he doesn't care about people he wants to win points towards the party of corrupt and uncaring inhumans",
            "title_similarity": "0.4558488",
            "sentiment_compound": 0.5956
        },
        {
            "id": "hta8u90",
            "score": 2,
            "text": "Florida ladies and gentlemen!",
            "title_similarity": "0.33223456",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta8xna",
            "score": 2,
            "text": "Let Bugs Bunny give Florida to Cuba or South America.  I doubt either would want Florida lol.",
            "title_similarity": "0.44211525",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hta9ao9",
            "score": 2,
            "text": "Can’t have logical thinking public servants in Florida! What would everyone start to think?! They have a reputation to uphold!",
            "title_similarity": "0.54997766",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta9cg9",
            "score": 2,
            "text": "No vax no hospital. Eat crow.",
            "title_similarity": "0.35653293",
            "sentiment_compound": -0.0803
        },
        {
            "id": "hta9nwu",
            "score": 2,
            "text": "What kind of world are we living in, seriously!?",
            "title_similarity": "0.10138867",
            "sentiment_compound": -0.2481
        },
        {
            "id": "hta9v7x",
            "score": 2,
            "text": "We are living in the dumbest timeline. It’s infuriating",
            "title_similarity": "0.25808913",
            "sentiment_compound": -0.7717
        },
        {
            "id": "htaa45l",
            "score": 2,
            "text": "For the love of God, I just don't understand the level of hate and fear that Florida has toward vaccine and vaccination. Get the fuck over it.",
            "title_similarity": "0.6094023",
            "sentiment_compound": -0.6249
        },
        {
            "id": "htaa6ox",
            "score": 2,
            "text": "I will never understand; history will not look kindly on this time.",
            "title_similarity": "0.24573767",
            "sentiment_compound": -0.3875
        },
        {
            "id": "htaahg2",
            "score": 2,
            "text": "Can we still sell states like when we bought some in the Louisiana Purchase, if so maybe we can sell some to Trump so he can be President of his own little world.",
            "title_similarity": "0.48375785",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htaahjz",
            "score": 2,
            "text": "This is how the end starts. These actions sound relatively innocuous. But they’re not- this is a purge. You start here. Then maybe teachers who resist book burnings. Then doctors who provide care to immigrants. Then certain smallish swaths of society. LGBTQ in certain professions, a little here, a little there. They’re not right, but it’s not huge and it won’t affect you personally, st the moment at least, it seems. Better them than you after all. It doesn’t seem to follow any particular ideology or political theory.  You may protest, raise a ruckus, think of the hypocrisy, the stupidity of it all.  And pretty soon they’re rounding up all kinds of people as this becomes normalized. And because of our lack of imagination we can’t see that it’s simply to get power. Like, why would anyone want just power for its own sake?  Why not be happy with whatever you have now- esp if you’re rich?  What more is there?  \n\nAnd by the time we have discovered that we live in fascism it will be too late.",
            "title_similarity": "0.4855336",
            "sentiment_compound": 0.9209
        },
        {
            "id": "htaahna",
            "score": 2,
            "text": "To hell with Florida. Let the south secede.",
            "title_similarity": "0.46617782",
            "sentiment_compound": -0.6808
        },
        {
            "id": "htaal3l",
            "score": 2,
            "text": "What a dumpster fire!! It’s terribly sad how politicized this has become. Unreal. Florida is fucked.",
            "title_similarity": "0.4373467",
            "sentiment_compound": -0.9401
        },
        {
            "id": "htabslq",
            "score": 2,
            "text": "I always thought Florida had too many old idiots, glad that's about to change.",
            "title_similarity": "0.52067494",
            "sentiment_compound": 0.4588
        },
        {
            "id": "htac0c0",
            "score": 2,
            "text": "this is bizarro world",
            "title_similarity": "0.15657537",
            "sentiment_compound": 0.0
        },
        {
            "id": "htacwlr",
            "score": 2,
            "text": "This would also fit into /r/notheonion",
            "title_similarity": "0.0048355293",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htaesyy",
            "score": 2,
            "text": "I am staggered by the craziness our country displays in the last several years.",
            "title_similarity": "0.34580797",
            "sentiment_compound": -0.3818
        },
        {
            "id": "htaof9m",
            "score": 2,
            "text": "America seems like a really fucked country haha",
            "title_similarity": "0.2256279",
            "sentiment_compound": 0.0183
        },
        {
            "id": "htauimb",
            "score": 2,
            "text": "So these people are just pro covid now?",
            "title_similarity": "0.16400407",
            "sentiment_compound": 0.0
        },
        {
            "id": "htavaj8",
            "score": 2,
            "text": "can we just saw off florida and let it float away? like maybe to cuba? what a shithole of a state. they've edged out texas - not by much - for being the worst in the nation. greedy for all that tourist money so fuck y'all! come on down & get a case of covid while your here, no charge!",
            "title_similarity": "0.59963155",
            "sentiment_compound": -0.9106
        },
        {
            "id": "htaxuga",
            "score": 2,
            "text": "Person 1:\"You know, you really should get vaccinated\".\nPwrson 2: \"Leave me alone, I'm 'batin!\"",
            "title_similarity": "0.61081433",
            "sentiment_compound": -0.3595
        },
        {
            "id": "htb0rba",
            "score": 2,
            "text": "Volcanoes aren’t even real.  That one they say blew up was all CG and they’re not real. I’ve never seen one.  They died with the dinosaurs.",
            "title_similarity": "0.38761765",
            "sentiment_compound": -0.5574
        },
        {
            "id": "htb57jg",
            "score": 2,
            "text": "Americaaaaa\n\nYou can’t make this shit up. If not for the internet you’d all be back in the dark ages burning witches and sacrificing toddlers to gods.",
            "title_similarity": "0.43860137",
            "sentiment_compound": -0.6428
        },
        {
            "id": "htb5kma",
            "score": 2,
            "text": "Some days I don't believe Florida is real...",
            "title_similarity": "0.24677654",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb5pdz",
            "score": 2,
            "text": "The only reason the ocean hasn't swallowed Florida is because it knows how nasty it is.",
            "title_similarity": "0.43792835",
            "sentiment_compound": -0.5574
        },
        {
            "id": "htb5xfs",
            "score": 2,
            "text": "Florida really is a dystopian hell at this point.",
            "title_similarity": "0.33907372",
            "sentiment_compound": -0.6808
        },
        {
            "id": "htbhoa7",
            "score": 2,
            "text": "Remember like 7 years ago when anti-vaxxers were shit on and shunned by people on both sides?\n\nwtf happened to this country?",
            "title_similarity": "0.51611304",
            "sentiment_compound": -0.7399
        },
        {
            "id": "htbjww0",
            "score": 2,
            "text": "Why is Florida in such denial?",
            "title_similarity": "0.38029152",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbob85",
            "score": 2,
            "text": "So how is that different in so much as claiming it to be a violation of one’s rights? It’s okay to mandate against even talking about something but not mandating getting the thing? In crying ‘freedom’ they ostracize those who want the thing they don’t. How is this freedom? How is this any better than those who would mandate the vaccine? Seems like this persons first amendment right of free speech was taken. He wasn’t forcing anyone to do it was he?",
            "title_similarity": "0.5333236",
            "sentiment_compound": 0.9528
        },
        {
            "id": "htc6fp1",
            "score": 2,
            "text": "The article avoids the fact that the email he sent was a rant about how only 77 out of 568 employees under him had gotten the booster and that fewer than 50% had two jabs.\n\nCalling this “pathetic”, his email might have crossed the line into coercive behavior. Employers are not allowed to say anything they want to employees, even if one feels it’s in the employee’s best interest. In Florida, coercing employees to get vaccinated is one of the many things that employers are not permitted to do. \n\nPersonally, I don’t know if the email rose to the level of coercion under the law, but he was clearly trying to shame people into getting vaccinated. \n\nAs a government official, he doesn’t get to chose which laws and regulations he wants to follow. He should be held to a higher standard than the private sector.",
            "title_similarity": "0.6878218",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htcw8on",
            "score": 2,
            "text": "Just...wow...\n\nand I firmly support that vaccines should not be a mandate.\n\nWho exactly is running the asylum?",
            "title_similarity": "0.52877605",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ht9ah7g",
            "score": 8,
            "text": "Man punished for trying out empathy, more news at 6 on the worst timeline news station. Stay tuned.",
            "title_similarity": "0.5373925",
            "sentiment_compound": -0.7964
        },
        {
            "id": "ht9h2ki",
            "score": 11,
            "text": "Florida really is living in the dumbest timeline.",
            "title_similarity": "0.39824498",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htb44mo",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "ht9m20r",
            "score": 4,
            "text": "That makes sense. Just kidding.",
            "title_similarity": "0.011642106",
            "sentiment_compound": 0.1027
        },
        {
            "id": "ht9mimd",
            "score": 3,
            "text": "Jesus Christ, what is wrong with this country?",
            "title_similarity": "0.21144614",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ht9wrzb",
            "score": 3,
            "text": "Tomorrow Florida celebrates \"Robert E Lee Day\".  That's a state that deserves a pandemic.",
            "title_similarity": "0.52019256",
            "sentiment_compound": 0.5719
        },
        {
            "id": "ht9yg07",
            "score": 3,
            "text": "Can we push Florida into the ocean yet?",
            "title_similarity": "0.3873909",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta2lxy",
            "score": -2,
            "text": "You should be able to encourage people, but not force them.",
            "title_similarity": "0.26650056",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hta4zrm",
            "score": -3,
            "text": "See. We give the Florida government a lot of flak, and yet Florida has the same percentage of being fully vaccinated as Pennsylvania. Maybe this is reverse psychology.",
            "title_similarity": "0.68496084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta5e9f",
            "score": 3,
            "text": "\"the decision to get vaccinated is a personal choice\" ???? Actually, it's a medical choice and something that affects not only the person vaccinated, but all those around them. (r.disabled)",
            "title_similarity": "0.5991991",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta8dj3",
            "score": 3,
            "text": "Purge the intellectuals, scientists, doctors, teachers.\n\nhttps://en.m.wikipedia.org/wiki/Intelligenzaktion",
            "title_similarity": "0.47299796",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hta8zc7",
            "score": 2,
            "text": "US is a strange place, as seen from the other side of the pond.",
            "title_similarity": "0.22396119",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hta9kxe",
            "score": 4,
            "text": "Im sorry but USA has got to be a parody show for aliens or something. I thought i was reading an Onion article.",
            "title_similarity": "0.44170886",
            "sentiment_compound": -0.0387
        },
        {
            "id": "htaa6c7",
            "score": 2,
            "text": "“Florida”  what on imaginary land was god thinking",
            "title_similarity": "0.4615036",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htaaf37",
            "score": -3,
            "text": "ITs SaFe AnD eFfEcTiVe",
            "title_similarity": "-0.05840841",
            "sentiment_compound": 0.7184
        },
        {
            "id": "htaaiin",
            "score": 4,
            "text": "This guy is a disaster but they'll still vote for him.  Florida has one of the highest infection and death rates in the country since COVID began.  The state's been caught lying about their numbers, pay-for-play vaccine roll out initially, stripping municipalities of their authority to protect their own residents, and spreading COVID misinformation and vaccine skeptics.  But somehow he's just going to blame this all on Biden and Floridians will eat it up.",
            "title_similarity": "0.635571",
            "sentiment_compound": -0.946
        },
        {
            "id": "htaao23",
            "score": 3,
            "text": "Stupidest fucking shit I’ve read all year so far. Even worse, someone he sent the email to, working in the health department, complained about this to create an issue out of it.",
            "title_similarity": "0.66486204",
            "sentiment_compound": -0.9053
        },
        {
            "id": "htaarn9",
            "score": 5,
            "text": "I feel like the whole world has gone completely mad when I read something like this.",
            "title_similarity": "0.39461482",
            "sentiment_compound": 0.1298
        },
        {
            "id": "htabbcx",
            "score": 3,
            "text": "This is why America is the worlds Florida, and Florida is America’s Florida.",
            "title_similarity": "0.39595878",
            "sentiment_compound": 0.0
        },
        {
            "id": "htacmxk",
            "score": 3,
            "text": "It’s embarrassing when it’s just confined to a few southern states, but when the Republicans take over the House and Senate (and I don’t doubt they will because Americans are way beyond saving themselves), idiotic bullshit like this will be covered for at the federal level too.\n\nIf I was an American moderate or progressive I would have given up on the whole shitshow years ago. It should cause almost universal shock that such an incredibly dumb policy exists, instead it’s just another pWnInG tHe LiBs moment for about half of the electorate.🤮",
            "title_similarity": "0.5310042",
            "sentiment_compound": -0.9673
        },
        {
            "id": "htacxyv",
            "score": 3,
            "text": ">In an email to WMFE, the Florida Department of Health has confirmed Pino was put on leave because, “the decision to get vaccinated is a personal choice that should be free from coercion and mandates from employers.”\n\nSince when?",
            "title_similarity": "0.832503",
            "sentiment_compound": 0.4767
        },
        {
            "id": "htadt4c",
            "score": 4,
            "text": "On one hand, I have a few friends and know some people in Florida.\n\nOn the other hand... well, they say that when when we cross the threshold where huge chunks of landmasses are swallowed by the rising ocean, Florida is probably going to be one of the first places to have this occur.  I can't say I'd be sad about it...",
            "title_similarity": "0.50215375",
            "sentiment_compound": 0.8689
        },
        {
            "id": "htauvxz",
            "score": 3,
            "text": "I look forward to the day DeSantis's crimes are uncovered.  The way he's handled COVID indicates he's guilty of, at a minimum, manslaughter of thousands of people.",
            "title_similarity": "0.38870317",
            "sentiment_compound": -0.4215
        },
        {
            "id": "htaxen7",
            "score": 3,
            "text": "Jesus Florida… are you really vying for king idiot? I mean there is a dead tie w/ Texas, but good lord…",
            "title_similarity": "0.50884664",
            "sentiment_compound": 0.0129
        },
        {
            "id": "htb3322",
            "score": 4,
            "text": "Mental illness or insanity?",
            "title_similarity": "0.14473736",
            "sentiment_compound": -0.7506
        },
        {
            "id": "htb3bin",
            "score": 3,
            "text": "DeSantis is the #1 reason my family and I are leaving Florida as soon as I graduate college.",
            "title_similarity": "0.572699",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb4sjd",
            "score": 4,
            "text": "Cancel culture strikes again.",
            "title_similarity": "0.32386237",
            "sentiment_compound": -0.5423
        },
        {
            "id": "htb5fop",
            "score": 3,
            "text": "That's good old Republican facism for you. If you say something they don't like, you hurt their feelings and they get mad at you.",
            "title_similarity": "0.4419148",
            "sentiment_compound": 0.0941
        },
        {
            "id": "htb62ny",
            "score": 2,
            "text": "This is the culture of DeSantis and the Republican party.\n\nRemember this when DeSantis attempts to run against Trump in 2024 as the \"moderate\" \"rational\" Republican....",
            "title_similarity": "0.3714283",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htb9z4u",
            "score": 2,
            "text": "It's so hard for me to understand this aggressive stupidity.",
            "title_similarity": "0.11845336",
            "sentiment_compound": -0.6534
        },
        {
            "id": "htba090",
            "score": 3,
            "text": "They’re going to arrest him for having fucking integrity. Welcome to nazi Florida folks.",
            "title_similarity": "0.54533565",
            "sentiment_compound": 0.5819
        },
        {
            "id": "htbdyop",
            "score": 3,
            "text": "There's something in the air in Florida that makes people aggressively, ignorantly stupid. We need to treat the place like a Level 5 Hot Zone so it doesn't spread to the rest of the country: wall it off, roof it over, and send in teams in biohazard suits, study the natives, set up treatment centers, the whole nine yards.",
            "title_similarity": "0.62067145",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htbhy0a",
            "score": 2,
            "text": "DeSantis needs a very long stay in the phantom zone",
            "title_similarity": "0.3061301",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbljz5",
            "score": 3,
            "text": "Sounds about right for a trashy red state",
            "title_similarity": "0.091878414",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbn1s0",
            "score": 3,
            "text": "Florida is a twisted mess of insanity vis-a-vis COVID.  Loudly whining about federal mandates, the Governor of Florida enacted state mandates against the federal mandates.  The governor currently refuses to enforce a SC ruling on a mandate for all in medical professions, or supporting such, to get vaccinated.  Making himself one of the few governors to openly defy the highest court in our land.  We somehow, despite having a massive leap in infections in FL this past month, have an almost imperceptible number of deaths from COVID in the state.  The two different statistics cannot rationally coincide.  A medical Health Director put on leave for encouraging vaccinations?  Bottom of the list here pal, bottom of the list.",
            "title_similarity": "0.7085154",
            "sentiment_compound": -0.2449
        },
        {
            "id": "htbpkwx",
            "score": 4,
            "text": "This might be the most Florida thing I have read in a while. A medical professional encouraged his staff to follow appropriate medical preventative care and is being punished for it. \n\n\nThis is like someone being punished for encouraging safe sex practices.",
            "title_similarity": "0.7738125",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hta3bjg",
            "score": 25,
            "text": "Jesus fucking Christ. As a Canadian… wtf is even wrong with you, America?",
            "title_similarity": "0.32665998",
            "sentiment_compound": -0.7845
        },
        {
            "id": "ht9rqzu",
            "score": 69,
            "text": "And people wonder why covid will never go away. Its because the republican conspiracy theorist have won. They completely thrown out all reason and rather turn dark ages where drinking piss and using leeches is the cure all for everything.\n\nDoctors will be replaced with snake oil salesmen and hospitals demolished because by it existing will hurt an antivax feelings. This isn't a slippery slope, this is a chute straight to hell.",
            "title_similarity": "0.56317115",
            "sentiment_compound": -0.8591
        },
        {
            "id": "htavxjj",
            "score": -13,
            "text": "Clearly an unpopular opinion on Reddit but why not just let all of this run its course? People have and will die but it has not been worth throwing our economy and lives down the gutter. Government has used it as a chance to grow at alarming rates and to ensure that it has more control.\n\nMedia has been spreading mass hysteria. Small businesses have been permanently closed. Corporations have solidified more economic power than ever before. Inflation is at +6%, housing is insane, and the cost of living is exploding. \n\nOur politicians have been telling us they know how to fix it and they have the next solution. I dont believe or trust them.",
            "title_similarity": "0.5272964",
            "sentiment_compound": -0.8847
        },
        {
            "id": "ht9lxqv",
            "score": 4,
            "text": "Florida and Texas are in a competition to see who can be the dumbest state, and... we all lose.",
            "title_similarity": "0.5378873",
            "sentiment_compound": -0.7184
        },
        {
            "id": "ht9ok5v",
            "score": 3,
            "text": "Wtf kind of timeline are we living in here? Getting fired for encouraging people the do the right thing. FFS.",
            "title_similarity": "0.5331433",
            "sentiment_compound": -0.8602
        },
        {
            "id": "ht9ov3x",
            "score": 4,
            "text": "Let Darwinism take its course.",
            "title_similarity": "0.1606013",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9pvxo",
            "score": 3,
            "text": "So what’s he supposed to do promote horse medicine as a miracle cure?",
            "title_similarity": "0.4742997",
            "sentiment_compound": 0.7506
        },
        {
            "id": "ht9v54y",
            "score": 3,
            "text": "I told one of my workers that if he didn’t get the vaccine I would tell his children that he was still smoking, his kids were all in their 30s and had thought their pressuring of him had succeeded in getting him to quite but he had just gotten better at hiding it.\n\nIt worked, my guy got his vaccine. But I told his kids that he was still smoking anyway.",
            "title_similarity": "0.6076436",
            "sentiment_compound": 0.3071
        },
        {
            "id": "ht9xmpp",
            "score": 4,
            "text": "Let the ocean have Florida. There's nothing of value there.",
            "title_similarity": "0.4147019",
            "sentiment_compound": -0.2584
        },
        {
            "id": "ht9y2t3",
            "score": 4,
            "text": "What kind of a topsy-turvy world do we live in, where heroes are cast as villains?",
            "title_similarity": "0.2617653",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hta2e84",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "hta2gbh",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "htaag04",
            "score": 4,
            "text": "I think we might be witnessing the collapse of an empire.",
            "title_similarity": "0.367024",
            "sentiment_compound": -0.4939
        },
        {
            "id": "htaf16b",
            "score": 5,
            "text": "Florida is fucked and the Conservative party is **fuuuuuuucked**. Jesus Christ, dumbass mother fuckers.",
            "title_similarity": "0.5639452",
            "sentiment_compound": -0.8807
        },
        {
            "id": "htb5e2e",
            "score": 4,
            "text": "The Republican Death Cult strikes again.",
            "title_similarity": "0.3811352",
            "sentiment_compound": -0.7506
        },
        {
            "id": "htb6lgz",
            "score": 4,
            "text": "We live in a satirical timeline.",
            "title_similarity": "0.151005",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb9por",
            "score": 4,
            "text": "That is actually insane.",
            "title_similarity": "-0.013361029",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htbalya",
            "score": 4,
            "text": "As an epidemiologist, one might reasonably assume Dr Pino subscribes to the [Hippocratic Oath](https://en.wikipedia.org/wiki/Hippocratic_Oath#Text_of_the_oath).  *Mandates* are one thing, *Sound Advice* is quite another.  De Santis and all politicians should get & stay TF off the lawn.",
            "title_similarity": "0.6025795",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbng2m",
            "score": 4,
            "text": "It's Florida... a special place for ignorance and behavior certain to increase the spread of the disease",
            "title_similarity": "0.4725816",
            "sentiment_compound": 0.5574
        },
        {
            "id": "ht98gg4",
            "score": 493,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "ht97h80",
            "score": 217,
            "text": "I'm going to go to work after getting bad food poisoning or the flu or something. Then, I'm just gonna shit and vomit all over the place, and when they try to get me to leave I'm going to be like \"this is a personal medical decision!\"",
            "title_similarity": "0.6394223",
            "sentiment_compound": -0.9098
        },
        {
            "id": "ht9dog5",
            "score": 31,
            "text": "wait a minute... the state DoH said that choosing to get vaccinated is a *personal* *decision* and blames Pino for coercion. \n\nhey governor! isn't choosing to have a child (or not) a *personal decision?*",
            "title_similarity": "0.65264857",
            "sentiment_compound": -0.4574
        },
        {
            "id": "ht9fekd",
            "score": 15,
            "text": "The freedom to spread a virus that's killed 700k+ people and clog up the healthcare system is more important than the freedom to suggest you dont",
            "title_similarity": "0.49821764",
            "sentiment_compound": 0.7178
        },
        {
            "id": "ht9op5j",
            "score": 16,
            "text": "I don't understand how anyone can be a Republican anymore. How embarrassing. I remember when Jindal said they had to stop being the party of stupid. Now they are many magnitudes more stupid with an added topping of evil. And they are even killing their own supporters with all the false info they put out about the pandemic.",
            "title_similarity": "0.51135015",
            "sentiment_compound": -0.9441
        },
        {
            "id": "ht9nkvm",
            "score": 5,
            "text": "Seriously how in the fuck are we letting Florida just happen? How is there no legal recourse against the governor? How is it not a crime to let tens of thousands of your citizens die due to your own negligence? What the fucking banana republic shit is this?",
            "title_similarity": "0.6277463",
            "sentiment_compound": -0.9089
        },
        {
            "id": "ht9odul",
            "score": 5,
            "text": "Holy shit we live in a shitty reality.",
            "title_similarity": "0.19919716",
            "sentiment_compound": -0.802
        },
        {
            "id": "ht9s0ez",
            "score": 6,
            "text": "How the fuck is this even possible? Vaccines save lives. That's a scientific fact. \n\nThat moron is just opening up himself to so many lawsuits.",
            "title_similarity": "0.51139617",
            "sentiment_compound": -0.6573
        },
        {
            "id": "ht9sdo2",
            "score": 4,
            "text": "The only doctors I listen to is Jesus and tractor supply.",
            "title_similarity": "0.4196424",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9v21z",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "htaud8l",
            "score": 5,
            "text": "Why doesn’t anyone’s life have a value anymore? Why is the world turning upside down? Since when did we start getting punished for doing the right thing and rewarded for cheating? Oh, right, since fucking trump came along with his extremists. 🤮🤮🤮🤮🤮",
            "title_similarity": "0.48728812",
            "sentiment_compound": -0.3695
        },
        {
            "id": "htb36t3",
            "score": 5,
            "text": "BioTerrorist DeSantis at work",
            "title_similarity": "0.29055125",
            "sentiment_compound": 0.0
        },
        {
            "id": "htcv0jd",
            "score": -5,
            "text": "There is no compliance here, this is a Florida government office that has no requirement, that is why he is in trouble.",
            "title_similarity": "0.55873674",
            "sentiment_compound": -0.7269
        },
        {
            "id": "ht9ev71",
            "score": 137,
            "text": "Fuck the GOP and fuck anyone dumb enough to vote for this.",
            "title_similarity": "0.3883755",
            "sentiment_compound": -0.8834
        },
        {
            "id": "ht9vnuw",
            "score": 34,
            "text": "Can we pleeeeeeeease just let Texas and Florida be their own countries???",
            "title_similarity": "0.44745985",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9fyih",
            "score": 19,
            "text": "Florida Man runs the state.",
            "title_similarity": "0.43079904",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9gtrc",
            "score": 18,
            "text": "I'm always thankful that Florida didn't get to force their choices onto us in 2020. I don't even really like Biden but it was awesome to see Florida finally not get the President they wanted. Florida, you can keep your batshit ideas in your batshit state. Just leave the rest of us alone.",
            "title_similarity": "0.614853",
            "sentiment_compound": 0.6743
        },
        {
            "id": "ht9k2q4",
            "score": 5,
            "text": "Oh, THIS is the bad place!",
            "title_similarity": "0.13721302",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hta16js",
            "score": 6,
            "text": "A mad minority has an entire country on the brink of implosion. I guess like Jan 6, because they're white nothing can be done or said to correct course.  \n\n\nWhat a shithole country",
            "title_similarity": "0.46248674",
            "sentiment_compound": -0.1779
        },
        {
            "id": "htb3e6k",
            "score": 5,
            "text": "I swear if those eggs from Alien ever made it to Earth the GOP would insist that it’s not so bad getting one of those face huggers.",
            "title_similarity": "0.39511758",
            "sentiment_compound": 0.7338
        },
        {
            "id": "ht9qfqq",
            "score": -25,
            "text": "Come on team good guys! Let’s dunk on these antivaxxer scumbags!! This never gets old!!! Lololololol we’re so much smarter than all those idiots in Florida. Right guys?!? Ok, now let’s see who can make wittiest snarky comment.",
            "title_similarity": "0.35809815",
            "sentiment_compound": 0.8274
        },
        {
            "id": "ht9sgpi",
            "score": -25,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "ht9kr5b",
            "score": 252,
            "text": "This is how Republicans want to lead the country.\n\nIf you don't like this, register to vote and vote Democrats.\n\nIf they're not progressive enough for you, get involved and try to get more progressives to win in the primary.\n\nBut for the general election, vote blue, because lives and rights literally depend on it.\n\n(Yes the two part system sucks, but that's what we got, and way too many people who bitch about it don't get involved in primaries where the future of the party platform is actually determined).",
            "title_similarity": "0.4662618",
            "sentiment_compound": 0.4361
        },
        {
            "id": "ht9f0tl",
            "score": 7,
            "text": "Dumbsantis and all of his dickriders, putting the \"duh\" in Floriduh.",
            "title_similarity": "0.42190912",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9xtor",
            "score": 6,
            "text": "I had to read this headline three times to make sure I wasn’t having a stroke or something. The Director of the Department of Public Health was suspended for… encouraging the public’s health? Wow, Florida. You are sinking below Mississippi in my state rankings. (Love to all my MS people here, but you probably already know what I mean.)",
            "title_similarity": "0.7448665",
            "sentiment_compound": 0.7003
        },
        {
            "id": "htah1t3",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.18846291"
        },
        {
            "id": "htaw1ru",
            "score": 7,
            "text": "We need to fire all old politicians or people in power, not just in America but throughout the world.",
            "title_similarity": "0.41219926",
            "sentiment_compound": -0.1779
        },
        {
            "id": "htb9d9m",
            "score": 8,
            "text": "'sToP mAkInG iT pOlItIcAl!' - Republicans who have entirely and solely made the vaccine a political wedge issue.",
            "title_similarity": "0.5010106",
            "sentiment_compound": -0.3595
        },
        {
            "id": "ht9rj13",
            "score": 6,
            "text": "Florida is possibly the worst place on earth",
            "title_similarity": "0.3407445",
            "sentiment_compound": -0.6249
        },
        {
            "id": "htag7h9",
            "score": 10,
            "text": "Ron Desantis is a republican. To be a good republican you have to be anti-vaccine and against all protocols to stop the pandemic. No masks, no social distancing and no self isolation. This is what the right wing has become and nobody wants to say it out loud.",
            "title_similarity": "0.51714814",
            "sentiment_compound": 0.1144
        },
        {
            "id": "ht96jdz",
            "score": 646,
            "text": "Anyone who works in healthcare and doesn't believe in vaccines shouldn't work in fucking healthcare. Go sell crystals or some other homeopathic bullshit.",
            "title_similarity": "0.56927645",
            "sentiment_compound": -0.5859
        },
        {
            "id": "ht9d89i",
            "score": 70,
            "text": "Boy, this whole anti-intellectualism movement sure does make people look fucken dumb...",
            "title_similarity": "0.3532052",
            "sentiment_compound": -0.25
        },
        {
            "id": "ht9e6uz",
            "score": 26,
            "text": "See that's just scary Florida.  You can't put someone on leave for doing a job you hired them to do... is there anyone who can explain this reasoning to me?\n\nHe never said that everyone needs to get the vaccine.  He just said he doesn't understand how they can be in public health and not protect the public health.  It's a pretty simple concept that should be considered.",
            "title_similarity": "0.70087016",
            "sentiment_compound": -0.3365
        },
        {
            "id": "ht9q3tz",
            "score": 30,
            "text": "American conservatives are the dumbest people on the planet, and it's not even close",
            "title_similarity": "0.33334348",
            "sentiment_compound": -0.5106
        },
        {
            "id": "ht9qqxj",
            "score": -10,
            "text": "Encouraging or Coercing?",
            "title_similarity": "0.012233587",
            "sentiment_compound": 0.5267
        },
        {
            "id": "ht9ey72",
            "score": 12,
            "text": "Huh. Just yesterday, I was told that Florida's healthcare is second to none, actually producing incredible results in the fight against COVID; this claimed Florida resident was explaining to me that their stats totally aren't being faked, and their lowest per-capita COVID death rate in the nation (possibly the world) is totally genuine.\n\nNow this! I just don't know what to believe!",
            "title_similarity": "0.613909",
            "sentiment_compound": -0.8652
        },
        {
            "id": "htar1t2",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.16413805"
        },
        {
            "id": "htb8dr7",
            "score": -12,
            "text": "“Republican Governor Ron DeSantis has banned vaccine mandates in the workplace, and the state has seen a surge in Omicron cases.”\n\n…every state has seen a surge in Omicron cases. Y’all are all good with people being forced to put stuff in their bodies—until it’s something you don’t agree with. Then, oh, how quickly the narrative changes.",
            "title_similarity": "0.643644",
            "sentiment_compound": -0.1531
        },
        {
            "id": "ht96fjx",
            "score": 933,
            "text": "Absolutely fucked in the head. Shithole state.",
            "title_similarity": "0.20777184",
            "sentiment_compound": -0.6901
        },
        {
            "id": "ht9f697",
            "score": 279,
            "text": "It sounds like they took away his freedom of speech.",
            "title_similarity": "0.4788813",
            "sentiment_compound": 0.7717
        },
        {
            "id": "ht9n4gn",
            "score": -13,
            "text": "Maybe the doctors know something the politicians don’t? Dr. Joseph Ladapo has a phd in Health Policy, and was also against vaccine mandates according to the wiki. \n\nDon’t know how he’s an expert in anything related to Covid regardless.",
            "title_similarity": "0.60842913",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht98op8",
            "score": 227,
            "text": "Why won't Joe Biden stop the pandemic?? /s",
            "title_similarity": "0.5378982",
            "sentiment_compound": 0.3067
        },
        {
            "id": "ht9i2dm",
            "score": 12,
            "text": "Welcome to Florida where trying to save lives will cost you your job.",
            "title_similarity": "0.5975516",
            "sentiment_compound": 0.7351
        },
        {
            "id": "ht9kyhq",
            "score": -12,
            "text": "Der der der.\n\nConspiracy.  🤷🏻‍♂️",
            "title_similarity": "0.12975258",
            "sentiment_compound": -0.5267
        },
        {
            "id": "ht9qlok",
            "score": -14,
            "text": "And AOC went to Florida on vaca...Whaat?!!\n\nI dont get it; it's like she's not even concerned about not wearing a mask, but only in Florida. \n\nDoes the science change at the state line? I KNOW she's all about the science. She has said so MANY times.\n\nSMH",
            "title_similarity": "0.63133895",
            "sentiment_compound": -0.6848
        },
        {
            "id": "ht9rx3a",
            "score": 15,
            "text": "What actual cancel culture looks like.",
            "title_similarity": "0.20637012",
            "sentiment_compound": 0.128
        },
        {
            "id": "ht9dgbu",
            "score": 16,
            "text": "People who have the vaccine punishing those who encourage others to get it, GOP.",
            "title_similarity": "0.56965417",
            "sentiment_compound": -0.0772
        },
        {
            "id": "ht9hf5o",
            "score": 16,
            "text": "WTF? How is this state in the same country I live in?",
            "title_similarity": "0.1896075",
            "sentiment_compound": -0.7089
        },
        {
            "id": "ht9fiez",
            "score": 18,
            "text": "The dumbest of all timelines",
            "title_similarity": "0.1636732",
            "sentiment_compound": -0.5106
        },
        {
            "id": "ht9qytx",
            "score": 933,
            "text": "Florida pop., 21 million. COVID deaths, 63,455\n\nAustralia pop., 26 million. COVID deaths 2,773\n\nBeing a victim of a preventable disease is an option you vote for. Just like gun violence and climate change.",
            "title_similarity": "0.5402053",
            "sentiment_compound": -0.7269
        },
        {
            "id": "ht9vtxa",
            "score": -17,
            "text": "\"encouraging\", probably self-righteously coercing people.",
            "title_similarity": "0.18983361",
            "sentiment_compound": 0.5267
        },
        {
            "id": "ht9l09q",
            "score": 22,
            "text": "As a healthcare practitioner in FL, I am fucking over it. Why should I care when the state, including the department of health, are actively fighting us at every step. Currently looking for jobs in a blue state. Nowhere is perfect, but certainly better than here.",
            "title_similarity": "0.6294484",
            "sentiment_compound": 0.7876
        },
        {
            "id": "ht9c9b3",
            "score": 23,
            "text": "Is there a copy of the original email? I think it's crazy to put the DoH director on leave for endorsing getting vaccinated, I'd like to arm myself with all the details in this incident.",
            "title_similarity": "0.6560893",
            "sentiment_compound": 0.296
        },
        {
            "id": "ht9gjmx",
            "score": 25,
            "text": "Disposing of someone for \"encouraging\" people to get the vaccine?  Apparently, one either gets in lockstep with the other fascists or get booted out.",
            "title_similarity": "0.64729285",
            "sentiment_compound": 0.3818
        },
        {
            "id": "ht9m528",
            "score": -27,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "ht9qlml",
            "score": 20,
            "text": "Where the fuck is the federal government? Fight the fuck back against this rising authoritarianism and anti-intellectualism. \n\nAppeasement does not work and has never worked throughout history. The only way to end this madness is to fight these fuckers head on.",
            "title_similarity": "0.42536372",
            "sentiment_compound": -0.9611
        },
        {
            "id": "ht9w5nr",
            "score": -25,
            "text": "[removed]",
            "title_similarity": "0.16413811"
        },
        {
            "id": "ht9bcln",
            "score": 344,
            "text": "Florida, checks out. \n\nThis is not the onion material.",
            "title_similarity": "0.31861523",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht98pp8",
            "score": 5384,
            "text": "What a fucking death cult the GOP has become.",
            "title_similarity": "0.4066432",
            "sentiment_compound": -0.6361
        },
        {
            "id": "ht979cd",
            "score": 6422,
            "text": ">Orange County Medical Director Dr. Raul Pino wrote an email to staff on Jan. 4th encouraging them to get vaccinated and boosted for COVID-19.\n\n>In it he wrote, “I have a hard time understanding how we can be in public health and not practice it.”\n\n>In an email to WMFE, the Florida Department of Health has confirmed Pino was put on leave because, “the decision to get vaccinated is a personal choice that should be free from coercion and mandates from employers.”\n\n>Florida DOH says it’s even conducting an inquiry into whether any laws were broken by sending the email.\n\n>Republican Governor Ron DeSantis has banned vaccine mandates in the workplace, and the state has seen a surge in Omicron cases.\n\nAs a Floridian I'm not embarrassed by the \"Florida Man\" stories. Show me an article about Florida Man shaving his pubes while driving on the Turnpike with an alligator in the passenger seat, and I'm fine with it.\n\nBut this shit is beyond embarrassing. It's disgusting. \n\nRon DeSantis is a fucking cancer.",
            "title_similarity": "0.8448837",
            "sentiment_compound": -0.967
        },
        {
            "id": "ht9nklh",
            "score": 28,
            "text": "The GOP are a threat to national security.",
            "title_similarity": "0.28549996",
            "sentiment_compound": -0.25
        },
        {
            "id": "ht9b405",
            "score": 1751,
            "text": "I'm not a fan of this timeline. Let's try another?",
            "title_similarity": "0.2483674",
            "sentiment_compound": -0.2411
        },
        {
            "id": "ht9qqt2",
            "score": 35,
            "text": "*\"It's a personal choice\"*, said the Republicans, unless it's not the choice they want. *\"It's freedom of speech\"*, said the Republicans, unless it's not what they want to hear. *\"It's cancel culture!\"*, said the Republicans, unless it's them doing the canceling.....",
            "title_similarity": "0.42341533",
            "sentiment_compound": 0.5529
        },
        {
            "id": "ht9o6dc",
            "score": 101,
            "text": "This country is well on its way down the toilet thanks mostly to one partys absolute hate for common sense and the common man. Republicans want everyone dead. Kids, old folks, their own voters.  These people are fucking monsters.  Florida leads the way for the GOPs ignorant stoking of the apocalypse.  Fuck these people.",
            "title_similarity": "0.5563282",
            "sentiment_compound": -0.8519
        },
        {
            "id": "ht9azsh",
            "score": 498,
            "text": "Florida is beyond parody",
            "title_similarity": "0.28922433",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9ks7o",
            "score": 116,
            "text": "More people died in FL due to covid than the Vietnam war",
            "title_similarity": "0.43267632",
            "sentiment_compound": -0.8307
        },
        {
            "id": "ht9jl1e",
            "score": 4880,
            "text": "The year is 2030.\n\nDoctor to nurses drinking pepsi: you should drink water, it's healthier.\n\nAfterward, doctor was sent to jail for being too political.",
            "title_similarity": "0.64237785",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9j4io",
            "score": 57,
            "text": "Florida - Americas unprotected dick",
            "title_similarity": "0.38413662",
            "sentiment_compound": -0.7003
        },
        {
            "id": "ht9kxqs",
            "score": 139,
            "text": "DeSantis supporters claim he's not against vaccines, only mandates, but when you look at what he *does* instead of what he *says*, you'll see that he is very much against vaccines.",
            "title_similarity": "0.5332893",
            "sentiment_compound": 0.2382
        },
        {
            "id": "ht9reqd",
            "score": 240,
            "text": "This governor is unhinged",
            "title_similarity": "0.25167358",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9f68x",
            "score": 13094,
            "text": "Holy fucking shit, there it is. The stupidest fucking thing I've read in 2022.",
            "title_similarity": "0.31123915",
            "sentiment_compound": -0.807
        },
        {
            "id": "ht9laup",
            "score": 7797,
            "text": "In other news, a fireman was dismissed for telling people to get out of a burning building.",
            "title_similarity": "0.54567385",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9brl6",
            "score": 1775,
            "text": "It's almost like there is a specific subset of politicians who want people to get sick for their own professional gain.",
            "title_similarity": "0.5173508",
            "sentiment_compound": 0.3832
        },
        {
            "id": "ht98fba",
            "score": 18263,
            "text": "Getting in trouble for doing the thing you were hired to do in the first place.",
            "title_similarity": "0.40806085",
            "sentiment_compound": -0.4019
        },
        {
            "id": "ht9jd2s",
            "score": 3842,
            "text": "It’s strange because almost all these anti vaccine  politicians are vaccinated",
            "title_similarity": "0.5801941",
            "sentiment_compound": -0.4284
        },
        {
            "id": "ht9fr13",
            "score": 92,
            "text": "Florida’s taken a hard right turn into hell",
            "title_similarity": "0.36237553",
            "sentiment_compound": -0.7184
        },
        {
            "id": "htaf4tz",
            "score": 155,
            "text": "the new Florida surgeon general appointed by Desantis is going against medical consensus, has played down the importance of vaccines and says its a religion, has questioned the safety of vaccines, has intentionally kept quiet on his own vaccination status, has promoted unproven treatments, has associated with America's Frontline Doctors (a far-right group known for promoting falsehoods about the pandemic), lied about treating covid patients at a UCLA hospital, refused to wear a mask when meeting with cancer patient.               \n\nwhat a circus            \n\nthis is a guy with a Harvard degree, so it's not like he's genuinely dumb, it's that he recognizes that to climb the GOP ladder you have to play politics and be part of the groupthink.",
            "title_similarity": "0.7346008",
            "sentiment_compound": -0.2201
        },
        {
            "id": "ht9lnit",
            "score": 3474,
            "text": "Not even a requirement. A *recommendation*.",
            "title_similarity": "0.15743387",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9wa06",
            "score": 218,
            "text": "I have never seen a state so keen on killing itself. What the fuck is going on in that state.",
            "title_similarity": "0.3386997",
            "sentiment_compound": -0.7116
        },
        {
            "id": "ht9d3gl",
            "score": 3,
            "text": "Race to the bottom. Absolutely abhorrent",
            "title_similarity": "0.21448845",
            "sentiment_compound": -0.659
        },
        {
            "id": "ht9e5jh",
            "score": 1,
            "text": "The insanity manifest we are seeing because of this culture war of common sense masks/vaccines vs. mUh frEeDuMbs is so incredibly depressing.",
            "title_similarity": "0.41707945",
            "sentiment_compound": -0.895
        },
        {
            "id": "ht9gm06",
            "score": 5,
            "text": "Floriduh. What an embarrassment.",
            "title_similarity": "0.1465865",
            "sentiment_compound": -0.4404
        },
        {
            "id": "ht9guxe",
            "score": 11,
            "text": "Sounds like Florida should have some good real estate opening up soon eh?",
            "title_similarity": "0.26928937",
            "sentiment_compound": 0.6597
        },
        {
            "id": "ht9i61z",
            "score": 7,
            "text": "Can’t wait to get out of Flori-duh",
            "title_similarity": "0.17199835",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9i7r6",
            "score": 2,
            "text": "It’s just magical watching the GOP shred itself .. I just giggle now",
            "title_similarity": "0.20065746",
            "sentiment_compound": 0.4215
        },
        {
            "id": "ht9ifoo",
            "score": 2,
            "text": "It’s like we live in the upside down….",
            "title_similarity": "0.19443412",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht9ila1",
            "score": 2,
            "text": "Whoever put him on leave should be fired.",
            "title_similarity": "0.47682223",
            "sentiment_compound": -0.5859
        },
        {
            "id": "ht9iti9",
            "score": 1,
            "text": ">“I have a hard time understanding how we can be in public health and not practice it.”\n\nIt's not that hard to understand hypocrites:\n\n* \"you'll need cast for the shattered leg, and surgery\"\n* \"don't you coerce me\"",
            "title_similarity": "0.47357684",
            "sentiment_compound": -0.4946
        },
        {
            "id": "ht9j86x",
            "score": 2,
            "text": "Florida you are so fucked in the head",
            "title_similarity": "0.3964638",
            "sentiment_compound": -0.7661
        },
        {
            "id": "ht9ja4i",
            "score": 1,
            "text": "Sadly, another victim of Shemp's concern for his political aspirations at the cost of people's well-being.",
            "title_similarity": "0.47361606",
            "sentiment_compound": -0.5994
        },
        {
            "id": "ht9jg3q",
            "score": 1,
            "text": "I’m convinced that Florida politicians want that state to remain covered in COVID.",
            "title_similarity": "0.45313078",
            "sentiment_compound": 0.4588
        },
        {
            "id": "ht9jjpb",
            "score": 3,
            "text": "Can we somehow *jettison* Florida?...\n\nAsking for a friend.",
            "title_similarity": "0.49376577",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ht9jlps",
            "score": 1,
            "text": "It's the opposite world these days :/",
            "title_similarity": "0.15928732",
            "sentiment_compound": -0.34
        },
        {
            "id": "ht9k53p",
            "score": 1,
            "text": "bruh florida is in a state of idiocracy forreal forreal",
            "title_similarity": "0.37816694",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9k9vy",
            "score": 1,
            "text": "Florida is gonna Florida…",
            "title_similarity": "0.25527382",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9ki0w",
            "score": 1,
            "text": "You mean because he didn't encourage his employees to do the heartily thing right?..... Right?",
            "title_similarity": "0.43172362",
            "sentiment_compound": -0.47
        },
        {
            "id": "ht9kuwg",
            "score": 2,
            "text": "Florida is a messed up place",
            "title_similarity": "0.28471103",
            "sentiment_compound": -0.34
        },
        {
            "id": "ht9kvf2",
            "score": 3,
            "text": "Weird. Typically you want someone to do their job.",
            "title_similarity": "0.18641517",
            "sentiment_compound": -0.1027
        },
        {
            "id": "ht9kz9t",
            "score": 8,
            "text": "This state is a giant People of Walmart meme.\n\nSOURCE: 60-year-old lifetime Floridian ... sigh",
            "title_similarity": "0.356405",
            "sentiment_compound": 0.0258
        },
        {
            "id": "ht9l4g8",
            "score": 1,
            "text": "If you see a news headline that looks like some kind of sureal joke odds are the story comes out of Florida.",
            "title_similarity": "0.49204645",
            "sentiment_compound": 0.5719
        },
        {
            "id": "ht9l7us",
            "score": 2,
            "text": "This is straight up fucking lunacy. I feel like somewhere along the way, the worlds timeline split into two, and we just happen to be on the shitty one.",
            "title_similarity": "0.3441199",
            "sentiment_compound": -0.0516
        },
        {
            "id": "ht9lb19",
            "score": 2,
            "text": "Would another state please invade us and install a competent government? *Please!*",
            "title_similarity": "0.26411235",
            "sentiment_compound": 0.7345
        },
        {
            "id": "ht9ldd6",
            "score": 1,
            "text": "Now go to your room for making sense! \n\n-Taliban playbook",
            "title_similarity": "0.36168092",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9lf7q",
            "score": 1,
            "text": "Only the voters can fix Florida",
            "title_similarity": "0.50127757",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9lkmq",
            "score": 2,
            "text": "Another step closer to idiocracy.",
            "title_similarity": "0.13900106",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9lkpe",
            "score": 1,
            "text": "Trying to find the logic. Nope. None found.",
            "title_similarity": "0.19832326",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9lku4",
            "score": 6,
            "text": "Hang on, they are saying 'to get vaccinated is a personal choice and as such should be free from coercion' so a suggestion to do so is coercion?  \n\n\nDoes this mean all doctors recommendations are coercion? I'm not from the US but I'm sure there is a need to go to court over this decision as it would impact any doctor in their work should the decision stand.",
            "title_similarity": "0.6234752",
            "sentiment_compound": 0.6662
        },
        {
            "id": "ht9lmxf",
            "score": 2,
            "text": "Oh wow, Florida is thinning the herd more! Way to keep it going!",
            "title_similarity": "0.5229199",
            "sentiment_compound": 0.658
        },
        {
            "id": "ht9loms",
            "score": 1,
            "text": "Can't say I'm surprised.",
            "title_similarity": "0.059707236",
            "sentiment_compound": -0.1695
        },
        {
            "id": "ht9luxq",
            "score": 2,
            "text": "I went to Florida a couple of months ago. I was travelling from Illinois.\n\nTotally different. You would have never known we were in a pandemic in while visiting Florida.",
            "title_similarity": "0.57589936",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9lx76",
            "score": 1,
            "text": "I vote we auction off florida to the highest bidder",
            "title_similarity": "0.50373393",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9lx86",
            "score": 1,
            "text": "Florida is going fascist at 90mph",
            "title_similarity": "0.40545267",
            "sentiment_compound": -0.5574
        },
        {
            "id": "ht9lzgl",
            "score": 1,
            "text": "Florida should just succeed. I can do without oranges. Car imports can reroute through other cities besides Jacksonville",
            "title_similarity": "0.44529432",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ht9m2o0",
            "score": 1,
            "text": "Hope its paid leave. Seems pretty stupid that this is something Republican party are focused on. Would assume they might care about more important issues like increasing the size of middle class but then again they never cared about the US.",
            "title_similarity": "0.4638862",
            "sentiment_compound": 0.6034
        },
        {
            "id": "ht9m85o",
            "score": 1,
            "text": "Something Something....dystopian... Something Something",
            "title_similarity": "0.07691533",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9m923",
            "score": 2,
            "text": "Sounds about right…fucking Florida",
            "title_similarity": "0.24758004",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9mbyg",
            "score": 3,
            "text": "I guess “the right thing to do” is no longer relevant in today society.",
            "title_similarity": "0.3680229",
            "sentiment_compound": -0.296
        },
        {
            "id": "ht9mc6f",
            "score": 1,
            "text": "I wonder if someone who's better at math and statistics than I could determine how all these excess covid deaths will affect the next election.\n\nWe know Trump won Florida by only 3%.\nhttps://en.wikipedia.org/wiki/2020_United_States_presidential_election_in_Florida\n\nWe know roughly 90% of those who have died are over 50:\nhttps://www.cdph.ca.gov/Programs/CID/DCDC/Pages/COVID-19/COVID-19-Cases-by-Age-Group.aspx\n\nWe know that 6% more Republicans are over age 50 than democrats:\nhttps://www.pewresearch.org/fact-tank/2020/10/26/what-the-2020-electorate-looks-like-by-party-race-and-ethnicity-age-education-and-religion/\n\nAnd we know that over 63,455 people in Flordia have died of covid.\n\n90% of which would be 57,109 people over age 50.\n\nThis link suggests around 75% of those 50 and up can be expected to vote:\nhttp://www.electproject.org/home/voter-turnout/demographics\n\n75% of  57,109 is 42,831.\n\nOf couse we don't know how many of those were Republicans and how many were Democrats but one can assume the Democrats have mostly been vaccinated and the Republicans have mostly not been.\n\nHowever, it doesn't really matter becayse Trump won Florida by 327,686 votes. So I suppose we still have a ways to go before Republicans manage to kill off enough of their electorate to permanently flip Florida blue. If my math is even remotely correct.",
            "title_similarity": "0.5005742",
            "sentiment_compound": -0.5
        },
        {
            "id": "ht9mcgm",
            "score": 3,
            "text": "~~Ron Desantis~~ \n\nRun Desanitize",
            "title_similarity": "0.31450135",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9mghb",
            "score": 3,
            "text": "I wish Florida was dragged to the bottom of the ocean",
            "title_similarity": "0.48897043",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht9mktl",
            "score": 2,
            "text": "Florida, what the fuck is wrong with you?",
            "title_similarity": "0.31330076",
            "sentiment_compound": -0.765
        },
        {
            "id": "ht9mkx6",
            "score": 12,
            "text": "When standing up for what's right gets you in trouble....\n\nFucking America man. GET. YOUR. SHIT. TOGETHER.",
            "title_similarity": "0.3654834",
            "sentiment_compound": -0.7925
        },
        {
            "id": "ht9mqss",
            "score": 5,
            "text": "I wanted this to be The Onion so fucking bad.",
            "title_similarity": "0.34140223",
            "sentiment_compound": -0.6214
        },
        {
            "id": "ht9msqd",
            "score": 1,
            "text": "Man, Florida is bad for business",
            "title_similarity": "0.4551563",
            "sentiment_compound": -0.5423
        },
        {
            "id": "ht9mv4f",
            "score": 3,
            "text": "Florida needs to sink into the ocean",
            "title_similarity": "0.451111",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9mx0a",
            "score": 2,
            "text": "What. \n\nIn the actual.\n\nFuck…\n\n…is - and has been - going on in Florida?",
            "title_similarity": "0.37928843",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9mxkt",
            "score": 1,
            "text": "The professor was right \"i dont want to like in this planet anymore\"",
            "title_similarity": "0.32112557",
            "sentiment_compound": -0.3252
        },
        {
            "id": "ht9mxqn",
            "score": 2,
            "text": "But I thought Republicans were all about freedom? This sounds pretty authoritarian? No?",
            "title_similarity": "0.32898256",
            "sentiment_compound": 0.9125
        },
        {
            "id": "ht9myjn",
            "score": 1,
            "text": "Just Florida doing Florida things...",
            "title_similarity": "0.2792822",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9n3q7",
            "score": 1,
            "text": "Behold the authoritarian right.",
            "title_similarity": "0.035115868",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9nbop",
            "score": 1,
            "text": "Jfc, Florida. Next you're going make people stare at the sun during the mandated national anthems at sporting events, aren't you.",
            "title_similarity": "0.5702376",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9ndga",
            "score": 3,
            "text": "I mean you cant be more dumb than Floridas politicians right now.",
            "title_similarity": "0.39657408",
            "sentiment_compound": 0.4439
        },
        {
            "id": "ht9ne7s",
            "score": 1,
            "text": "Not where I thought that title was headed",
            "title_similarity": "0.15775585",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9nebt",
            "score": 5,
            "text": "WTF.\n\nFlorida is the upside down.",
            "title_similarity": "0.3588978",
            "sentiment_compound": -0.6739
        },
        {
            "id": "ht9ney0",
            "score": 6,
            "text": "Ron DeSantis is an authoritarian nightmare.",
            "title_similarity": "0.27876148",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9nhl4",
            "score": 13,
            "text": "You're doing the job we hired you to do too well. You're fired.",
            "title_similarity": "0.47728366",
            "sentiment_compound": -0.3612
        },
        {
            "id": "ht9nkcj",
            "score": 3,
            "text": "Lets seriously pull that old Looney Tunes bit and just cut Florida away from the country with a giant saw. \n\nFuck Florida, they are a disgrace. Forcibly eject them from the Union",
            "title_similarity": "0.5642271",
            "sentiment_compound": -0.8591
        },
        {
            "id": "ht9nmb4",
            "score": 1,
            "text": "I wish Florida was just an irrelevant former pop musician",
            "title_similarity": "0.46298915",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ht9nmqj",
            "score": 2,
            "text": "DeathSantis goal?  He wants the State all for himself.",
            "title_similarity": "0.39842582",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9nqvd",
            "score": 1,
            "text": "Encouraging staff to get vaccinated is hardly a mandate.",
            "title_similarity": "0.48612934",
            "sentiment_compound": 0.5267
        },
        {
            "id": "ht9nqyy",
            "score": 3,
            "text": "Honestly if USA wants to fix their major problems and join the modern world, they need to charge GOP for treason for the disinformation propaganda campaign and the state of politics today.",
            "title_similarity": "0.4392628",
            "sentiment_compound": -0.3462
        },
        {
            "id": "ht9nsle",
            "score": 1,
            "text": "This is the worst timeline",
            "title_similarity": "0.19922754",
            "sentiment_compound": -0.6249
        },
        {
            "id": "ht9nt5q",
            "score": 2,
            "text": "Why is Ron trying to kill Floridians?",
            "title_similarity": "0.3919525",
            "sentiment_compound": -0.6908
        },
        {
            "id": "ht9nvme",
            "score": 1,
            "text": "Lets just kick Florida out of the union.",
            "title_similarity": "0.5563913",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9nw23",
            "score": 1,
            "text": "The united states couldnt be more seperated.",
            "title_similarity": "0.21054888",
            "sentiment_compound": 0.4215
        },
        {
            "id": "ht9nzfr",
            "score": 1,
            "text": "DeSantis is the new Jim Jones.",
            "title_similarity": "0.17227519",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9o3bk",
            "score": 3,
            "text": "Im guessing here since beds once again are not available or nearing non availability, the best way to prevent more Severe COVID patients is......\n\n*reads*\n\nTo fire/suspend the guy whose job it is to stop or limit the spread through vaccinations.\n\nIm seeing the cracks in our society overall and I think it is going to happen sooner or later (the collapse I mean).",
            "title_similarity": "0.60766536",
            "sentiment_compound": -0.4576
        },
        {
            "id": "ht9o4b4",
            "score": 1,
            "text": "Sounds like they're not up to the job of protecting public health",
            "title_similarity": "0.38538444",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht9o4o7",
            "score": 29,
            "text": "You can't have doctors just going around providing medical advice.",
            "title_similarity": "0.4511399",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9o82k",
            "score": 1,
            "text": "This reads like it came from The Onion",
            "title_similarity": "0.16660939",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht9ooc3",
            "score": 1,
            "text": "This should be posted in /r/nottheonion.",
            "title_similarity": "0.10651372",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9osyu",
            "score": 2,
            "text": "The governor of Florida is a sorry piece of shit",
            "title_similarity": "0.4946401",
            "sentiment_compound": -0.5994
        },
        {
            "id": "ht9oxlc",
            "score": 2,
            "text": "DeathSantis cult saving lifes",
            "title_similarity": "0.35519797",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9oyn1",
            "score": 1,
            "text": "I feel like I'm taking crazy pills.",
            "title_similarity": "0.34482223",
            "sentiment_compound": 0.0258
        },
        {
            "id": "ht9oytf",
            "score": 2,
            "text": "Florida is just great at flushing themselves down the proverbial toilet. I can here it from here!",
            "title_similarity": "0.40236086",
            "sentiment_compound": 0.6588
        },
        {
            "id": "ht9p0uk",
            "score": 1,
            "text": "This is modern republicanism.",
            "title_similarity": "0.06603771",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9p13n",
            "score": 1,
            "text": "You just can’t get in the way of the greater good.",
            "title_similarity": "0.13379806",
            "sentiment_compound": 0.6597
        },
        {
            "id": "ht9p2tt",
            "score": 3,
            "text": "Is this the \"cancel culture\" that republicans love to talk about?",
            "title_similarity": "0.253094",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ht9p39v",
            "score": 3,
            "text": "That actually will look great on a resumé",
            "title_similarity": "0.003327882",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ht9p5e6",
            "score": 3,
            "text": "for arguments sake, can anyone who supports his leave of provide a few reasons why its a good decision?",
            "title_similarity": "0.34356967",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht9p5oe",
            "score": 1,
            "text": "Florida gonna Florida.",
            "title_similarity": "0.25640303",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9p76j",
            "score": 2,
            "text": "Seriously, Florida? \n\nWe already think you’re dumb, now you’re just showing off.",
            "title_similarity": "0.5105294",
            "sentiment_compound": -0.6124
        },
        {
            "id": "ht9pciv",
            "score": 3,
            "text": "Florida = Leper colony \n\nJust let it burn",
            "title_similarity": "0.55032957",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9pfsv",
            "score": 2,
            "text": "We're really fucked aren't we",
            "title_similarity": "0.119096264",
            "sentiment_compound": -0.6901
        },
        {
            "id": "ht9pirg",
            "score": 2,
            "text": "\"Vaccine mandates are double plus bad.\"\n\n- Governor Death Santos.",
            "title_similarity": "0.41591084",
            "sentiment_compound": -0.8126
        },
        {
            "id": "ht9plmz",
            "score": 1,
            "text": "i hate this place i hate this place i hate this place I HATE THIS PLACE *I FUCKING HATE THIS PLACE*",
            "title_similarity": "0.27499348",
            "sentiment_compound": -0.9719
        },
        {
            "id": "ht9plo7",
            "score": 1,
            "text": "It’s like the government of Florida wants the population to decrease significantly or something.",
            "title_similarity": "0.6418599",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht9pn8e",
            "score": 2,
            "text": "Well if that's not the biggest proof it's all a fucking game for the GOP these days, I don't know what is.  These fuckers are the rot at the heart of the country, and they need excised.  I wish the good Republicans would start getting elected.",
            "title_similarity": "0.45266718",
            "sentiment_compound": 0.7906
        },
        {
            "id": "ht9psb8",
            "score": 2,
            "text": "It’s interesting the Democratic Party leaders talk a big game when it comes to social Justice or taxing the rich or climate change, but they don’t mean any of it\n\nMeanwhile the gop will literally kill their own supporters to never have to admit they were lying.",
            "title_similarity": "0.47474527",
            "sentiment_compound": -0.6108
        },
        {
            "id": "ht9psg9",
            "score": 6,
            "text": "If that's actually the reason then that's just completely insane. Imagine being appointed a director for health and put on leave for actually directing health objectives.\n\nWhat's next, director for the department of justice put on leave for encouraging people not to commit to crime. Director for the department of education suspended for encouraging kids to stay in school?",
            "title_similarity": "0.7323852",
            "sentiment_compound": -0.1732
        },
        {
            "id": "ht9ptc7",
            "score": 2,
            "text": "Why do Republicans always bitch & moan about censorship or political silencing then in the same breathe allow shit like this?",
            "title_similarity": "0.42010313",
            "sentiment_compound": -0.7269
        },
        {
            "id": "ht9pxbx",
            "score": 1,
            "text": "You really couldn't make this shit up..., nobody would believe you.",
            "title_similarity": "0.22806391",
            "sentiment_compound": -0.6428
        },
        {
            "id": "ht9pzud",
            "score": 3,
            "text": "Just had an extremely frustrating conversation with my dad this morning about shit like this. He’s in Iowa and literally hopes that he keeps getting COVID so that his symptoms will lessen and he gets used to it, while having an immuno-suppressed wife, my mom",
            "title_similarity": "0.5920622",
            "sentiment_compound": -0.3597
        },
        {
            "id": "ht9pzwf",
            "score": 3,
            "text": "Your embarrassing your once kinda decent nation in the eyes all the whole world.... Sad.",
            "title_similarity": "0.42387888",
            "sentiment_compound": -0.6908
        },
        {
            "id": "ht9q536",
            "score": 1,
            "text": "This is the bad place!",
            "title_similarity": "0.13379085",
            "sentiment_compound": -0.5848
        },
        {
            "id": "ht9q5j0",
            "score": 1,
            "text": "Mass. State DECE board just took away all close contact and other resteictions at schoola.  Super blue MA.  Do the math.",
            "title_similarity": "0.54471517",
            "sentiment_compound": 0.5994
        },
        {
            "id": "ht9q7xp",
            "score": 1,
            "text": "Should be on r/nottheonion",
            "title_similarity": "0.06093024",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9q8e1",
            "score": 1,
            "text": "i guess they forgot to tell him it’s a figurehead position.",
            "title_similarity": "0.388542",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9q8ww",
            "score": 2,
            "text": "I foresee brain drains all in of these red states for years to come",
            "title_similarity": "0.35825545",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9qb21",
            "score": 2,
            "text": "Floridiots keeping it real……………….",
            "title_similarity": "0.11805539",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9qcbg",
            "score": 2,
            "text": "This headline is straight out of ducking Idiocracy",
            "title_similarity": "0.31983352",
            "sentiment_compound": 0.2263
        },
        {
            "id": "ht9qdis",
            "score": 4,
            "text": "Where people go to die, like an elephant graveyard.",
            "title_similarity": "0.40409726",
            "sentiment_compound": -0.5574
        },
        {
            "id": "ht9qigd",
            "score": 3,
            "text": "That’s a lot Mississippi energy coming out of Florida, but it’s been second since I’ve been in FL.",
            "title_similarity": "0.35574335",
            "sentiment_compound": 0.1406
        },
        {
            "id": "ht9qiqw",
            "score": 8,
            "text": "Also astonishing: Fewer than half the Florida Department of Health's staff has been vaccinated!\n\n\"In the email, Pino said 77 of 568 employees had been fully vaccinated,   \nincluding receiving a booster shot. Another 219 had received two shots.\"\n\nhttps://www.orlandosentinel.com/coronavirus/os-ne-raul-pino-administrative-leave-20220118-urh66o22kre2voe3kockmfoz3q-story.html",
            "title_similarity": "0.6567148",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9qkpx",
            "score": 4,
            "text": "Been there, done that. Fuck Florida.",
            "title_similarity": "0.37282985",
            "sentiment_compound": -0.5423
        },
        {
            "id": "ht9qlmy",
            "score": 8,
            "text": "DeSantis and his enablers are just people. They live in our communities as do their families. They are not untouchable.",
            "title_similarity": "0.32021546",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9qo76",
            "score": 1,
            "text": "The nerve of this doctor trying to practice medicine. Can you believe it?",
            "title_similarity": "0.49950618",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9qp8y",
            "score": 2,
            "text": "It’s like ethnic cleansing",
            "title_similarity": "0.14186358",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht9qry2",
            "score": 3,
            "text": "This is fucking insanity.",
            "title_similarity": "0.06842806",
            "sentiment_compound": -0.6115
        },
        {
            "id": "ht9qsf6",
            "score": 5,
            "text": "Florida is a shithole",
            "title_similarity": "0.3462388",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9qsix",
            "score": 11,
            "text": "> Florida DOH says it’s even conducting an inquiry into whether any laws were broken by sending the email. \n\nAn email sent by the DoH MEDICAL. DIRECTOR. He literally directed, medically. What the fuck is his job then. What a fucking backwards state. Christ.",
            "title_similarity": "0.79089457",
            "sentiment_compound": -0.765
        },
        {
            "id": "ht9qtc4",
            "score": 27,
            "text": "Drink plenty of water, it's good for you.\n\nFired.\n\nDrinking water is a personal choice.\n\nWhat a disgrace.",
            "title_similarity": "0.49052024",
            "sentiment_compound": -0.5994
        },
        {
            "id": "ht9qthr",
            "score": 2,
            "text": "It is incredible that this whole state kind of functions, when that man had the only brain, and they put him on leave...",
            "title_similarity": "0.47797802",
            "sentiment_compound": -0.0516
        },
        {
            "id": "ht9qw1w",
            "score": 2,
            "text": "Such a fucked up state. Up is down, down is up. Welcome to bizarro Florida",
            "title_similarity": "0.43684328",
            "sentiment_compound": -0.34
        },
        {
            "id": "ht9qxd0",
            "score": 2,
            "text": "If that isn’t just the most Florida shit…",
            "title_similarity": "0.25398895",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9qy2i",
            "score": 4,
            "text": "Can't we, like, saw Florida off and shove it towards Cuba?",
            "title_similarity": "0.469086",
            "sentiment_compound": -0.2755
        },
        {
            "id": "ht9r412",
            "score": 2,
            "text": "Living in Florida is really a challenge.",
            "title_similarity": "0.3230158",
            "sentiment_compound": 0.1477
        },
        {
            "id": "ht9r82b",
            "score": 2,
            "text": "Idiocracy has entered the chat.",
            "title_similarity": "0.21203616",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9rfj3",
            "score": 2,
            "text": "The alt right complains about cancel culture until you do something they don't like, then they love it",
            "title_similarity": "0.4421885",
            "sentiment_compound": -0.1306
        },
        {
            "id": "ht9rfmb",
            "score": 1,
            "text": "The Florida Inquisition continues.",
            "title_similarity": "0.358756",
            "sentiment_compound": -0.296
        },
        {
            "id": "ht9rkp7",
            "score": 3,
            "text": "Who would be mad about this?!",
            "title_similarity": "0.15048853",
            "sentiment_compound": -0.5411
        },
        {
            "id": "ht9rt2b",
            "score": 1,
            "text": "This world is Idiotic…….",
            "title_similarity": "0.10719593",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9rti4",
            "score": 3,
            "text": "I mean, Florida is the laughing stock of the world at this point. Did we really expect anything less from them?",
            "title_similarity": "0.461073",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ht9rtjw",
            "score": 2,
            "text": "Totally Normal and definitely the greatest nation on earth, right?",
            "title_similarity": "0.10106158",
            "sentiment_compound": 0.8
        },
        {
            "id": "ht9ru69",
            "score": 2,
            "text": "\\-Medical Director: encourages staff to act medically responsible\n\n\\-Government: \"Hey...we're not looking for medically responsible actions from our medical director.  Get outta here.\"",
            "title_similarity": "0.6673275",
            "sentiment_compound": 0.7579
        },
        {
            "id": "ht9rveo",
            "score": 2,
            "text": "So shit like this is why there are so many memes about people who have never gotten covid being the \"last stand\" of humanity.\n\nLess than 10% of the population in my country has gotten covid, so when I first saw those memes I didn't understand it because it made it look like almost everyone has gotten covid.",
            "title_similarity": "0.4405375",
            "sentiment_compound": 0.099
        },
        {
            "id": "ht9rvky",
            "score": 6,
            "text": "Politicising public health… wtf is wrong with these morons?",
            "title_similarity": "0.45827737",
            "sentiment_compound": -0.8481
        },
        {
            "id": "ht9s2xr",
            "score": 4,
            "text": "Starting to see the effects of all the lead in our drinking water as nearly half the country would agree with this move",
            "title_similarity": "0.5033808",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht9s3mb",
            "score": 6,
            "text": "Wow, you can’t even make this shit up anymore!",
            "title_similarity": "0.21194634",
            "sentiment_compound": -0.1882
        },
        {
            "id": "ht9s3px",
            "score": 5,
            "text": "This belongs on r/nottheonion",
            "title_similarity": "0.015201558",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9s7vd",
            "score": 1,
            "text": "Ahahaha you guys are so fucked!",
            "title_similarity": "0.13803938",
            "sentiment_compound": -0.785
        },
        {
            "id": "ht9se01",
            "score": 1,
            "text": "I’m so glad I don’t have to shake my head in sad disgust and roll my eyes in the OTHER TIMELINE!",
            "title_similarity": "0.28627485",
            "sentiment_compound": -0.6907
        },
        {
            "id": "ht9sgdf",
            "score": 1,
            "text": "I’m convinced this country is going to hell",
            "title_similarity": "0.22702648",
            "sentiment_compound": -0.4404
        },
        {
            "id": "ht9slqg",
            "score": 3,
            "text": "Anyone wondering if the GOP is going to go full authoritarian, here ya go.",
            "title_similarity": "0.35024494",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9so5w",
            "score": 2,
            "text": "Is this the r/MURICA greatest country in the world people keep talking about? Seems like a dump",
            "title_similarity": "0.34533426",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ht9soil",
            "score": 1,
            "text": "All we are missing is a politicized police force.",
            "title_similarity": "0.31263208",
            "sentiment_compound": -0.296
        },
        {
            "id": "ht9stan",
            "score": 2,
            "text": "Screw the \"Mexico wall\", build it across the Mason-Dixon",
            "title_similarity": "0.34748614",
            "sentiment_compound": -0.1027
        },
        {
            "id": "ht9stmp",
            "score": 2,
            "text": "This has to be one of the dumbest hills to die on.",
            "title_similarity": "0.22509846",
            "sentiment_compound": -0.802
        },
        {
            "id": "ht9sufb",
            "score": 1,
            "text": "Guy's mistake was echoing Trump after Trump called DeathSantis \"dull\".",
            "title_similarity": "0.4954949",
            "sentiment_compound": -0.6249
        },
        {
            "id": "ht9sv6y",
            "score": 1,
            "text": "And these people have the stones to blame the current admin for not doing more to end this bs.  When public officials are punished for suggesting people follow best public health practices you are in the upside down. Tell us you do not care about public health without yelling us.",
            "title_similarity": "0.63127553",
            "sentiment_compound": -0.4268
        },
        {
            "id": "ht9sw9a",
            "score": 3,
            "text": "GOP aren't pro-freedom or anti-mandate, they're straight up pro-virus.",
            "title_similarity": "0.41897166",
            "sentiment_compound": 0.2263
        },
        {
            "id": "ht9sx9b",
            "score": 2,
            "text": "Florida is a failed state",
            "title_similarity": "0.36478543",
            "sentiment_compound": -0.5106
        },
        {
            "id": "ht9szvd",
            "score": 2,
            "text": "From the state that produces America's favorite reality series, \"Florida Man\".",
            "title_similarity": "0.4279417",
            "sentiment_compound": 0.4588
        },
        {
            "id": "ht9t71t",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.18846291"
        },
        {
            "id": "ht9t7cf",
            "score": 6,
            "text": "GOP wants DeSantis to run for President in 2024? Why? You can't make up this level of stupidity.",
            "title_similarity": "0.36515307",
            "sentiment_compound": -0.504
        },
        {
            "id": "ht9tamw",
            "score": 2,
            "text": "Florida seems to be actively Pro-Virus at this stage.  I wish I had any sympathy left for the people that are most affected by this nonsense.",
            "title_similarity": "0.6174687",
            "sentiment_compound": 0.4417
        },
        {
            "id": "ht9tcdz",
            "score": 2,
            "text": "Florida gotta Florida…",
            "title_similarity": "0.29783857",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9toow",
            "score": 1,
            "text": "Wait, this ISN'T an onion article..? Holy shit!",
            "title_similarity": "0.12970477",
            "sentiment_compound": -0.5983
        },
        {
            "id": "ht9u2yq",
            "score": 2,
            "text": "What happened to all that “we’re not anti vax. We’re anti mandate” bullshit?",
            "title_similarity": "0.39306533",
            "sentiment_compound": -0.6295
        },
        {
            "id": "ht9u6mp",
            "score": 2,
            "text": "DeSantis is delusional. They should just put a big fence up on the Florida-Georgia state line.",
            "title_similarity": "0.5222013",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9uapu",
            "score": 2,
            "text": "No billshit I had to read that twice",
            "title_similarity": "0.32741818",
            "sentiment_compound": -0.296
        },
        {
            "id": "ht9ubmp",
            "score": 5,
            "text": "Florida. Not even once.",
            "title_similarity": "0.25807434",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9ud9w",
            "score": 5,
            "text": "I fucking despise Ron DeSantis.",
            "title_similarity": "0.31957835",
            "sentiment_compound": -0.4005
        },
        {
            "id": "ht9uhvs",
            "score": 6,
            "text": "All this dude did was send an email out encouraging getting vaxxed?! Sounds like a guy who is just concerned for the health and safety of his staff.\n\nStuff like this is just crazy to me. I work for a pretty big healthcare company and i know of some mid-tier execs who are now not allowed to come into work anymore (getting to work from home!! and acting like its some sort of punishment mind you) because they won't get the vax...like you work for a healthcare company!?!?! \n\nSay what you will about a mandates in general and whatnot but it just seems weird and backwards (to me) that some people that high up in a company that is obviously trying to get people vaccinated (because its a healthcare company!), who are like \"nah\"",
            "title_similarity": "0.72161233",
            "sentiment_compound": 0.8595
        },
        {
            "id": "ht9uim3",
            "score": 25,
            "text": "[deleted]",
            "title_similarity": "0.18846291"
        },
        {
            "id": "ht9ulcz",
            "score": 3,
            "text": "This country is collapsing under the weight of its own ignorance.",
            "title_similarity": "0.33371982",
            "sentiment_compound": -0.5719
        },
        {
            "id": "ht9umpd",
            "score": 2,
            "text": "I had a good hour of not feeling like screaming, and then I opened Reddit",
            "title_similarity": "0.38591808",
            "sentiment_compound": 0.3826
        },
        {
            "id": "ht9uojq",
            "score": 3,
            "text": "Can we just.... let them secede? Just cut them off? History books in 20-30 years will have a unit on COVID and this section will be all about how Florida did everything wrong in reaction to it.",
            "title_similarity": "0.6564114",
            "sentiment_compound": -0.6767
        },
        {
            "id": "ht9uphl",
            "score": 11,
            "text": "Republicans are fucked in the head.",
            "title_similarity": "0.28627837",
            "sentiment_compound": -0.6597
        },
        {
            "id": "ht9uqli",
            "score": 4,
            "text": "Desantis wants people to die.",
            "title_similarity": "0.37220812",
            "sentiment_compound": -0.5994
        },
        {
            "id": "ht9ureo",
            "score": 5,
            "text": "cops put on leave for asking people not to commit crimes. \n\nfiremen put on leave for preaching fire safety.\n\nflorida is a cesspit in the gene pool of idiocracy.",
            "title_similarity": "0.76101947",
            "sentiment_compound": -0.2235
        },
        {
            "id": "ht9v3u1",
            "score": 5,
            "text": "So he is getting in trouble for doing his job!? This is so fucking stupid.",
            "title_similarity": "0.32673657",
            "sentiment_compound": -0.7884
        },
        {
            "id": "ht9v79e",
            "score": 3,
            "text": "This shit, the people in power not handling the pandemic properly, is why we are still dealing with this 2 years later. It's not your unvaccinated neighbors, it's these fucks.",
            "title_similarity": "0.5900114",
            "sentiment_compound": -0.7717
        },
        {
            "id": "ht9v7j5",
            "score": 4,
            "text": "But republicans aren’t antivax, they’re just against mandates. S/",
            "title_similarity": "0.31898248",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9v8k7",
            "score": 2,
            "text": "What the fuck did I just read",
            "title_similarity": "0.2703156",
            "sentiment_compound": -0.5423
        },
        {
            "id": "ht9v932",
            "score": 3,
            "text": "I thought this was an Onion article at first.",
            "title_similarity": "0.29447478",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9vbwk",
            "score": 2,
            "text": "Effing florida... so glad I left that shithole of a state.",
            "title_similarity": "0.50379133",
            "sentiment_compound": 0.6365
        },
        {
            "id": "ht9vdeq",
            "score": 7,
            "text": "GOP is a hellish death cult, for real",
            "title_similarity": "0.32661366",
            "sentiment_compound": -0.8442
        },
        {
            "id": "ht9vhs5",
            "score": 12,
            "text": "So stupid. Even if you don’t believe in the vaccine mandates; there’s nothing wrong with encouraging people to get the vax.",
            "title_similarity": "0.47814375",
            "sentiment_compound": -0.6014
        },
        {
            "id": "ht9vr1s",
            "score": 4,
            "text": "I (angrily) get the whole bullshit about freedom of choice with getting the vaccine. It's a world ending narrow minded concept to cling to, but that's humanity for you, in how we most likely just lucked out with surviving as long as we have. I just love/hate the fact that this situation with Florida is basically communism. You can't even basically talk about getting a vaccine in Florida and many other red states without some form of government authorized punishment coming your way. I mean, Republicans/Conservatives are living up to and exceeding that red color implication they love so much, I guess.",
            "title_similarity": "0.6057658",
            "sentiment_compound": 0.8336
        },
        {
            "id": "ht9vs0q",
            "score": 3,
            "text": "America, land of the free. Until corporate overlords say otherwise.",
            "title_similarity": "0.49996927",
            "sentiment_compound": 0.5106
        },
        {
            "id": "ht9vtua",
            "score": 1,
            "text": "Cancel culture amirite",
            "title_similarity": "0.3010556",
            "sentiment_compound": -0.25
        },
        {
            "id": "ht9vx6e",
            "score": 4,
            "text": "I didn’t think a political pro COVID stance would work anywhere in the world and yet here’s Florida proving me wrong.",
            "title_similarity": "0.4501062",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ht9w61c",
            "score": 3,
            "text": "He should have them to drink their own urine.",
            "title_similarity": "0.4404584",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9w63v",
            "score": 2,
            "text": "It’s astounds me that they don’t see the hypocrisy when they actively ban business/local governments from adopting their own policies, while touting freedom from higher levels of government.",
            "title_similarity": "0.49037957",
            "sentiment_compound": 0.6486
        },
        {
            "id": "ht9wd00",
            "score": 5,
            "text": "Everyone is trying to out Trump the Donald.",
            "title_similarity": "0.32325917",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9wfup",
            "score": 3,
            "text": "America: *Abandon ship!*",
            "title_similarity": "0.40267128",
            "sentiment_compound": -0.4926
        },
        {
            "id": "ht9wmxg",
            "score": 3,
            "text": "The Florida hillbillies and senile geriatrics keep blindly voting in DeSantis who is one of the dumbest mother fuckers on the planet. If there was ever a person who deserves a punch in the nose or a kick in the nuts it's him.",
            "title_similarity": "0.5042181",
            "sentiment_compound": -0.8591
        },
        {
            "id": "ht9wnow",
            "score": 2,
            "text": "Just continuing the long tradition of ostracizing those in the profession who advocate hygiene.\n\nNext up for covid treatment in Florida:   bloodletting",
            "title_similarity": "0.6818229",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9wpo7",
            "score": 3,
            "text": "Deathsantis can go straight to hell.",
            "title_similarity": "0.2454401",
            "sentiment_compound": -0.5719
        },
        {
            "id": "ht9wpx6",
            "score": 2,
            "text": "How many more SUVs would we need to raise the sea level enough to erase most of Florida? Asking for a Billionaire friend.",
            "title_similarity": "0.5658817",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ht9wt6v",
            "score": 11,
            "text": "Florida is going full-on Opposite Land.",
            "title_similarity": "0.31679845",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9wtgp",
            "score": 3,
            "text": "He’s the Orlando director. The Florida surgeon general is a nut job DeSantis appointee.",
            "title_similarity": "0.695249",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9ww9o",
            "score": 2,
            "text": "Everyone knows you \"don't try your own supply\"",
            "title_similarity": "0.32828337",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9wzjj",
            "score": 14,
            "text": "Death cult party continues to do death cult shit.",
            "title_similarity": "0.37964845",
            "sentiment_compound": -0.8658
        },
        {
            "id": "ht9x12d",
            "score": 6,
            "text": "This seems like a good way to get your doctors to leave your state.",
            "title_similarity": "0.5588428",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ht9x791",
            "score": 3,
            "text": "Now it’s just a death cult at this point",
            "title_similarity": "0.36813995",
            "sentiment_compound": -0.5994
        },
        {
            "id": "ht9xb5b",
            "score": 4,
            "text": "Well it’s not like they were listening to him in the first place",
            "title_similarity": "0.28456467",
            "sentiment_compound": -0.0026
        },
        {
            "id": "ht9xbip",
            "score": 1,
            "text": "The doctors in that country should try telling people to *not* get vaccinated.\n\nThe lunatics will take exception to such unamerican advice, and lay siege to wherever it is that they sell this vaccine thing before the day is out, I wager.",
            "title_similarity": "0.66805243",
            "sentiment_compound": -0.3818
        },
        {
            "id": "ht9xesc",
            "score": 7,
            "text": "I feel like I’m taking crazy pills",
            "title_similarity": "0.3405257",
            "sentiment_compound": 0.0258
        },
        {
            "id": "ht9xvan",
            "score": 1,
            "text": "I thought I was on the nottheonion subreddit when I first read this.",
            "title_similarity": "0.33157018",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9xxar",
            "score": 3,
            "text": "Ahhhh. Look how far we've come. Damn that movie Don't Look Up scares me. How long before we have that as our literal leaders. This statement also implies that I'm still naive enough to believe we don't already.",
            "title_similarity": "0.42643905",
            "sentiment_compound": -0.4145
        },
        {
            "id": "ht9y03z",
            "score": 4,
            "text": "WTF - Welcome To Florida",
            "title_similarity": "0.36523056",
            "sentiment_compound": -0.368
        },
        {
            "id": "ht9y829",
            "score": 3,
            "text": "Imagine reading this article in April 2020",
            "title_similarity": "0.14971596",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9ye4o",
            "score": 18,
            "text": "America is so far gone.",
            "title_similarity": "0.24317428",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9ynqe",
            "score": 2,
            "text": "I don’t know why I’m still shocked by this crap.",
            "title_similarity": "0.1461905",
            "sentiment_compound": -0.5994
        },
        {
            "id": "ht9yo2q",
            "score": 2,
            "text": "Desantis trying to be the next Trump.",
            "title_similarity": "0.16444947",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9ypr6",
            "score": 1,
            "text": "this should be in r/nottheonion.  Normally one could only believe things like this happen in an imaginary universe, but Republicans are turning fiction into reality, for the worse.",
            "title_similarity": "0.32238668",
            "sentiment_compound": -0.5267
        },
        {
            "id": "ht9yqzq",
            "score": 1,
            "text": "Wtf… wait it is Florida…\n\nThat checks out",
            "title_similarity": "0.35443944",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9yr53",
            "score": 1,
            "text": "This is an Onion article….right?……right, guys?!!",
            "title_similarity": "0.22663231",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9ytvb",
            "score": 1,
            "text": "Florida is a gd red state nightmare. Everything here is made to sabotage logic and keep the people stupid.",
            "title_similarity": "0.47058183",
            "sentiment_compound": -0.7783
        },
        {
            "id": "ht9yu8e",
            "score": 4,
            "text": "I feel like I'm in The Twilight Zone",
            "title_similarity": "0.14637348",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht9yvct",
            "score": 1,
            "text": "Imagine if Florida guy was in charge of the country. Vaccine and mask would be on their way to be banned.",
            "title_similarity": "0.70372677",
            "sentiment_compound": -0.4588
        },
        {
            "id": "ht9yzlj",
            "score": 2,
            "text": "I hate this country, I hate politics, I hate propaganda.\n\nPlease make it stop.",
            "title_similarity": "0.371886",
            "sentiment_compound": -0.9186
        },
        {
            "id": "ht9z89h",
            "score": 2,
            "text": "Can't wait for the sea levels to rise and consume that shit hole of a state.",
            "title_similarity": "0.33118737",
            "sentiment_compound": -0.5574
        },
        {
            "id": "ht9zadp",
            "score": 1,
            "text": "Sounds very desantis like.\nI haven't been able to access my unemployment in almost half a year now. Have lost soo much of what i onced own. Over 8k in crypto which might not be much to most but had to pay ovr 500 in fees to fiat that shit. Still have a nest egg I won't touch. Have had to get rid of stuff I spent years collecting that is irreplaceable for the most part and recently lost my laptop only way I had left at making money. \n\nThis is the same dude that cut the extra fed unemployment off 3 or 4 months earlier and gave it to the cops. Nothing surprises with this asshole.\n\nI need to lawyer up asap . But its hard for me to get around because I've lost insursnce coverage and tag on my vehicle also so yea. \n\nThis dude is literally trying his hardest to be more extreme than trump. The unemployment website was built to fail from the start..even before I stopped getting it all together there would be 1 or 2 months due to their site me and millions of others would get nothing.\n\nI wouldnt pour gas on him if he was on fire. I'd let the slow burn eat this piece of trash. Imo he is literally the worst human alive at least the worst politician easily",
            "title_similarity": "0.5129348",
            "sentiment_compound": -0.9918
        },
        {
            "id": "ht9zaw2",
            "score": 2,
            "text": "We all agree that Florida is just the testing state for some of the more extreme Republican goals, right? To see how much will be tolerated and how far they can let certain things go?",
            "title_similarity": "0.5129055",
            "sentiment_compound": 0.6072
        },
        {
            "id": "ht9zd7z",
            "score": 2,
            "text": "Crazy governor. Wants them dead, hey? My way or the highway.",
            "title_similarity": "0.42092395",
            "sentiment_compound": -0.7717
        },
        {
            "id": "ht9ze4x",
            "score": 1,
            "text": "yeah, that sounds about Florida.",
            "title_similarity": "0.21264362",
            "sentiment_compound": 0.296
        },
        {
            "id": "ht9zgb2",
            "score": 1,
            "text": "Should be in r/nottheonion",
            "title_similarity": "0.05713126",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9zkyb",
            "score": 1,
            "text": "The sad part is he would have been promoted if he told them not to get vaccinated...",
            "title_similarity": "0.60615456",
            "sentiment_compound": -0.0772
        },
        {
            "id": "ht9zlwh",
            "score": 2,
            "text": "Oh man. Its hard not to read articles like that and think that we are ALL FUCKED.",
            "title_similarity": "0.31607234",
            "sentiment_compound": -0.6166
        },
        {
            "id": "ht9zrfs",
            "score": 1,
            "text": "I’m from Florida so your typical Florida man shit doesn’t really surprise me, but this is on a totally different level.",
            "title_similarity": "0.44077075",
            "sentiment_compound": -0.154
        },
        {
            "id": "ht9zslj",
            "score": 1,
            "text": "Someone told me they weren’t getting vaccinated because they’re former military and already had “classified injections” put into their body 🤷🏽‍♀️",
            "title_similarity": "0.6414591",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9ztik",
            "score": 2,
            "text": "Florida is the embodiment of \"what if idiocracy was a documentary\"",
            "title_similarity": "0.46789712",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9zu62",
            "score": 3,
            "text": "Florida man doing his job gets reprimanded.",
            "title_similarity": "0.62658024",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9zuyr",
            "score": 2,
            "text": "What in bizarro world ?!",
            "title_similarity": "0.13787158",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9zvpo",
            "score": 1,
            "text": "And there’s an inquiry to see if he broke any laws.  For encouraging getting the jab, not requiring it.\n\nSomething something small government, right guys? So let’s get a government inquiry going over a medical person who encouraged the vaccine???  And he still left it to choice.\n\nLike what in the absolute fuck, it’s a damn witch hunt.",
            "title_similarity": "0.67920446",
            "sentiment_compound": -0.6199
        },
        {
            "id": "ht9zy2v",
            "score": 2,
            "text": "Not even mandating it, simply just encouraging it.... can global warming speed up so it can sink Florida already?",
            "title_similarity": "0.56581134",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hta04vk",
            "score": 1,
            "text": "I wish someone put me on leave.",
            "title_similarity": "0.404884",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hta07wn",
            "score": 3,
            "text": "Ways to make your state look even more stupid for $800.",
            "title_similarity": "0.3575477",
            "sentiment_compound": -0.5709
        },
        {
            "id": "hta081u",
            "score": 2,
            "text": "And DeSantis is still around while not doing his job.",
            "title_similarity": "0.12722683",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta08b0",
            "score": 2,
            "text": "We need Dr.Strange to fix our timeline. Hell, even Tom Holland's Peter Parker could help.",
            "title_similarity": "0.3950796",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hta0du7",
            "score": 2,
            "text": "Is up down in Florida?",
            "title_similarity": "0.24852917",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta0f3d",
            "score": 2,
            "text": "Coming from the fuck your feelings crowd...",
            "title_similarity": "0.26845706",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hta0jxq",
            "score": 2,
            "text": "Wow is Florida backwards.",
            "title_similarity": "0.26430526",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hta0ndi",
            "score": 2,
            "text": "Just two competing realities, nothing to see here.",
            "title_similarity": "0.16394414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta0q8t",
            "score": 3,
            "text": "This is the bad place.",
            "title_similarity": "0.13862164",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hta0sri",
            "score": 5,
            "text": "This is like something you'd read about in an article about North Korea and go \"no way, they have to be exaggerating\".\n\nUnreal. Stay safe Americans.",
            "title_similarity": "0.34557673",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hta0uch",
            "score": 2,
            "text": "What do these morons think is going to happen after EVERYONE THAT SUPPORTS THEM is dead?",
            "title_similarity": "0.43952143",
            "sentiment_compound": -0.5215
        },
        {
            "id": "hta12mq",
            "score": 1,
            "text": "Welp, Florida voters get what they deserve.",
            "title_similarity": "0.36031353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta12vm",
            "score": 1,
            "text": "lmao just please shoot me in the head",
            "title_similarity": "0.26901263",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hta18mv",
            "score": 2,
            "text": "Site is down for me so I can't even read the article but how stupid is it to fire someone for promoting safety. Absolutely ridiculous.",
            "title_similarity": "0.47585514",
            "sentiment_compound": -0.664
        },
        {
            "id": "hta1995",
            "score": 4,
            "text": "Florida Governor Ron Desantis is willing to kill as many people in order to become President. Evil bastard!",
            "title_similarity": "0.5338904",
            "sentiment_compound": -0.9312
        },
        {
            "id": "hta1bfo",
            "score": 5,
            "text": "Right. And liberals are cancel culture.",
            "title_similarity": "0.25843495",
            "sentiment_compound": -0.25
        },
        {
            "id": "hta1dof",
            "score": 3,
            "text": "Is this the South rising again? Is this it?",
            "title_similarity": "0.1575658",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta1eut",
            "score": 3,
            "text": "“Pls don’t die I need you” -him\n\n“Anyways how fucking dare you” -Florida Man",
            "title_similarity": "0.5573354",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hta1g66",
            "score": 2,
            "text": "That’s on par for Floriduh",
            "title_similarity": "0.016267484",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta1j3n",
            "score": 7,
            "text": "Of course a republican governor did it, you guys better start voting or shit like this will be frequent",
            "title_similarity": "0.39666772",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hta1vmy",
            "score": 1,
            "text": "What is this...Opposite World?",
            "title_similarity": "0.030949667",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta215p",
            "score": 1,
            "text": "It pains me that my parents decided NOW is the time to go visit Florida 😣",
            "title_similarity": "0.6361144",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hta22nq",
            "score": 1,
            "text": "This belongs in nottheonion Reddit",
            "title_similarity": "0.071298614",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta25gx",
            "score": 1,
            "text": "It's okay Doc come up north.",
            "title_similarity": "0.055419333",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hta2906",
            "score": 1,
            "text": "Death cult strikes again.",
            "title_similarity": "0.30394322",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hta2a4v",
            "score": 1,
            "text": "Geez, it's 11:50pm......I almost went a whole day without saying WTF out loud. Then saw this post.",
            "title_similarity": "0.40752417",
            "sentiment_compound": 0.5595
        },
        {
            "id": "hta2cwq",
            "score": 2,
            "text": "Florida for the win again... smh.",
            "title_similarity": "0.34863302",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hta2doy",
            "score": 1,
            "text": "Did a triple take to make sure I was reading the headline correctly",
            "title_similarity": "0.24961835",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hta2fi9",
            "score": 1,
            "text": "Do you want a comet destroying the earth even though we still have time to fix it? \n\nThis is how human beings go extinction....",
            "title_similarity": "0.38298374",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hta2gs9",
            "score": 1,
            "text": "Florida really should be it's own country.",
            "title_similarity": "0.3764509",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta2gx1",
            "score": 5,
            "text": "GOP has become a fascist death cult of conspiracy theorists and nazis. I rly don’t get it. Are they just dumb? Were they always dumb and we’re just finding out now because they’ll believe anything they read and now that they have Facebook anyone can convince them of anything? I don’t get it I really dont. I have people that I thought were totally smart individuals that in the past few years have become complete and utter morons. Like to the point where you can’t even talk to them anymore they just start spewing nonsense. It has to be Fox and Facebook",
            "title_similarity": "0.46961713",
            "sentiment_compound": -0.9467
        },
        {
            "id": "hta2iok",
            "score": 1,
            "text": "Florida, need a I say more?",
            "title_similarity": "0.28459692",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta2m9l",
            "score": 1,
            "text": "These jokers do anything to stay in the news.",
            "title_similarity": "0.31278077",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta2pi6",
            "score": 3,
            "text": "Both presidents encourage the shot. The fuck are we arguing about. We are living in the dumbest timeline",
            "title_similarity": "0.47309485",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hta2qgq",
            "score": 3,
            "text": "Florida man fired for doing his job",
            "title_similarity": "0.6154106",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hta2qj6",
            "score": 1,
            "text": "Isn’t that what he is suppose to do.",
            "title_similarity": "0.115784295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta2qz9",
            "score": 3,
            "text": "This would be surprising if it weren't Florida.",
            "title_similarity": "0.20151787",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hta2vmc",
            "score": 5,
            "text": "Isn’t Ron Desantis a prize? He must think there’s a moat around the Governors castle.",
            "title_similarity": "0.42324466",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hta30ji",
            "score": 2,
            "text": "I will dance on Desantis’s grave.",
            "title_similarity": "0.2585512",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hta31r0",
            "score": 3,
            "text": "2 different realities.  what a time to be alive.",
            "title_similarity": "0.12447994",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hta34vc",
            "score": 3,
            "text": "This is utter madness.",
            "title_similarity": "0.05933009",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hta36jq",
            "score": 5,
            "text": "Not surprised with a fuckwit like DeSantis in charge",
            "title_similarity": "0.22545838",
            "sentiment_compound": 0.2105
        },
        {
            "id": "hta37bx",
            "score": 6,
            "text": "Do Floridians care that their state is the laughing stock of the united states?",
            "title_similarity": "0.32610163",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hta3b3k",
            "score": 2,
            "text": "Florida, home of…Floridians.",
            "title_similarity": "0.32221788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta3f5v",
            "score": 2,
            "text": "Florida is the Florida of America",
            "title_similarity": "0.3120763",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta3hm8",
            "score": 5,
            "text": "That there are no political consequences for actions such as this anymore is why I’ve basically given up. I’ll still vote and hope for the best, but I can’t see a way to get ourselves out of this abyss.  If a politician can fire a doctor for promoting medicine and be celebrated for it, I don’t even know what the point is anymore.",
            "title_similarity": "0.5772727",
            "sentiment_compound": 0.8462
        },
        {
            "id": "hta3m5b",
            "score": 1,
            "text": "Most will do it anyways.",
            "title_similarity": "0.03169853",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta3mjz",
            "score": 2,
            "text": "GDI all yah idiots had to do was keep to yourself & cover your wet holes for a bit",
            "title_similarity": "0.4296304",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta3q2x",
            "score": 5,
            "text": "The Health Medical Director got put on leave for doing their job by advising people in the middle of a global pandemic that's been raging on for nearly two years that people should be vaccinated; especially heath staff...?\n\nHokey shoot we are so close to living in \"Idiocracy\" that its not even funny...",
            "title_similarity": "0.748338",
            "sentiment_compound": -0.8129
        },
        {
            "id": "hta3y2b",
            "score": 2,
            "text": "https://youtu.be/xiTM2HQ0g98",
            "title_similarity": "0.06729267",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta414u",
            "score": 2,
            "text": "How do these people get votes. How can the voter base be so easily fooled by right wing media?",
            "title_similarity": "0.34258103",
            "sentiment_compound": 0.0613
        },
        {
            "id": "hta48ij",
            "score": 2,
            "text": "not mandating, just encouraging\n\nok Florida, I don't know what I expected",
            "title_similarity": "0.43379998",
            "sentiment_compound": -0.1471
        },
        {
            "id": "hta49xy",
            "score": 3,
            "text": "Fired for encouraging, not even enforcing, what the fuck",
            "title_similarity": "0.37654638",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hta4b6k",
            "score": 1,
            "text": "Florida is going to Florida.",
            "title_similarity": "0.3062925",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta4mae",
            "score": 2,
            "text": "Republicans dying at a rate of 2,000 voters per day gonna make getting back in power very difficult for the GOP this year and 2024",
            "title_similarity": "0.45864987",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hta4oor",
            "score": 1,
            "text": "In my state, our republican governor dished out thousands in bonuses to our deputy director. Probably for toeing the line.",
            "title_similarity": "0.49676687",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hta4q9c",
            "score": 5,
            "text": "The Party that fearmongered about “death panels” reveals themselves to be one giant death panel. Anyone who’s surprised raise your hand.",
            "title_similarity": "0.4514228",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hta4y8q",
            "score": 1,
            "text": "I hate the world we live in. When is the next stop to jump to the alternate timeline?",
            "title_similarity": "0.3714652",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hta4yud",
            "score": 1,
            "text": "That's what you get for trickle begging.",
            "title_similarity": "0.25187215",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta4zb4",
            "score": 2,
            "text": "Lmao Florida is hell on earth. Where the inbreds and geriatric go to die.",
            "title_similarity": "0.5511117",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hta510r",
            "score": 1,
            "text": "How stupid can this people get?  \nFuck fuck duck",
            "title_similarity": "0.29357934",
            "sentiment_compound": -0.886
        },
        {
            "id": "hta570e",
            "score": 3,
            "text": "What the fuck?\n\nWhat an unfathomably stupid firing. This is without a doubt the dumbest thing I've read all year. It's hard to fathom that anyone in power thought about this for any length of time and thought it even resembled a good idea.",
            "title_similarity": "0.4124627",
            "sentiment_compound": -0.8398
        },
        {
            "id": "hta5bvl",
            "score": 5,
            "text": "Florida, you’re a fucking embarassment to this country.",
            "title_similarity": "0.42892218",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta5dst",
            "score": 2,
            "text": "Do they just want everyone to die?",
            "title_similarity": "0.32842892",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hta5mnt",
            "score": 2,
            "text": "Florida DOH says it’s even conducting an inquiry into whether any laws were broken by sending the email. Is the best part.  He may have broken the law by protecting the health of the people needed to treat unhealthy people.  Florida is a prize. A consolation prize that you win in the losers bracket.  Like an ashtray in a mar-ill-lago golf tournament.",
            "title_similarity": "0.68226874",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hta5o0v",
            "score": 2,
            "text": "Florida is a horrible state…when I visit I poop and don’t flush.",
            "title_similarity": "0.5272411",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hta5oa8",
            "score": 2,
            "text": "We live in The Onionverse now.",
            "title_similarity": "0.17414743",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta5rmb",
            "score": 2,
            "text": "This is a crazy world we live in and at times it’s disappointing",
            "title_similarity": "0.1364817",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hta5tc2",
            "score": 13,
            "text": "The South gets so offended when they get called stupid backward hillbillies buuuuuut",
            "title_similarity": "0.3628601",
            "sentiment_compound": -0.7198
        },
        {
            "id": "hta5vxb",
            "score": 2,
            "text": "We are an idiocracy, except the idiots in the movie at least had good intentions.",
            "title_similarity": "0.33582553",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hta5xee",
            "score": 1,
            "text": "Florida is Rand McNally.",
            "title_similarity": "0.36762697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta60b6",
            "score": 1,
            "text": "On leave for just *encouraging* it? This is some 1940s Germany bullshit",
            "title_similarity": "0.3853078",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hta65t4",
            "score": 3,
            "text": "I would post this in r/Conservative but I got permabanned for posting an article about how DeSantis lost a million test kits.",
            "title_similarity": "0.62898594",
            "sentiment_compound": -0.4497
        },
        {
            "id": "hta67a9",
            "score": 2,
            "text": "ofc this happens in florida. fuck florida",
            "title_similarity": "0.3988331",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hta6ba5",
            "score": 2,
            "text": "Seems like an onion article",
            "title_similarity": "0.13090391",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hta6loc",
            "score": 2,
            "text": "Why is it that whenever I read about something incredibly stupid it is almost always in Florida?",
            "title_similarity": "0.508198",
            "sentiment_compound": -0.5709
        },
        {
            "id": "hta6p3x",
            "score": 2,
            "text": "Florida man has done it again",
            "title_similarity": "0.32040942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta6rdv",
            "score": 3,
            "text": "How can we be critical of opposition if the opposition fires or replaces opposition.",
            "title_similarity": "0.32538873",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hta71r6",
            "score": 6,
            "text": "Swing state that Florida is, it’s looking a little bit bluer with every passing anti-vaxxer. Oops, I mean _day_. With every passing day. 😬",
            "title_similarity": "0.4442202",
            "sentiment_compound": -0.34
        },
        {
            "id": "hta71tg",
            "score": 2,
            "text": "Because fucking DeSantis is a pandering tool and doesn’t give a shit about the residents of Florida.",
            "title_similarity": "0.54959136",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hta75ap",
            "score": 3,
            "text": "DeSantis is a madman. I hope the people of Florida are happy with a crazy person at it's helm. Hopefully his next health director just straight up encourages bath salts for all and DeSantis gets his face eaten. Dude even looks like a villain.",
            "title_similarity": "0.62355274",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hta788n",
            "score": 1,
            "text": "Contrary to what they'll lead you to believe, the GOP is madly in love with cancel culture",
            "title_similarity": "0.30256876",
            "sentiment_compound": 0.128
        },
        {
            "id": "hta79vh",
            "score": 2,
            "text": "The USA is a failed union. Just break off and see how quickly the \"south\" falls apart entirely.",
            "title_similarity": "0.53472114",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hta7bf2",
            "score": 2,
            "text": "Losing faith in humanity here. Somebody link me something that restores it.",
            "title_similarity": "0.3934955",
            "sentiment_compound": 0.34
        },
        {
            "id": "hta7k2r",
            "score": 3,
            "text": "Texas will do something dumber tomorrow upping the ante in the race to be the most embarrassing US state.",
            "title_similarity": "0.40691662",
            "sentiment_compound": -0.659
        },
        {
            "id": "hta7k46",
            "score": 1,
            "text": "So are we supposed to let them kill themselves and innocents in the process or...?",
            "title_similarity": "0.42070836",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hta7lch",
            "score": 1,
            "text": "Florida really is a backwards state.",
            "title_similarity": "0.31982267",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta7pkc",
            "score": 1,
            "text": "They’ve all lost there fucking minds down there",
            "title_similarity": "0.27191228",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hta7ut6",
            "score": 5,
            "text": "Biden is no prize, but the Republican party doesn’t boast an elected official that’s competent to govern! DeSantis is doing this because he believes this will get him votes, and it will. The rank and file of the party loves shit like this. The party is painting itself into a smaller and smaller corner. They have no interest in gaining voters; I wouldn’t be surprised if they introduced an application for new members to fill out to prevent rhinos from infiltrating the party. I can’t see any future for the organization. Someday Trump will die, and at that point the party will explode into splinter groups like the Bolshevik party did when Lenin died. Someone needs to be trying to put together a viable 3rd party that sane people can vote for. The GOP is living on borrowed time.",
            "title_similarity": "0.52218544",
            "sentiment_compound": 0.9767
        },
        {
            "id": "hta7x14",
            "score": 1,
            "text": "Republicans and conservatives are singlehandedly weeding themselves out by not getting vaccinated.",
            "title_similarity": "0.60645145",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta7zk5",
            "score": 2,
            "text": "How quickly can we get Florida out and DC or Puerto Rico in?",
            "title_similarity": "0.37035823",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta80c2",
            "score": 1,
            "text": "Head of DOT fired for suggesting employees respect stop signs. The DOT has stated that respecting stop signs is a personal choice",
            "title_similarity": "0.6651528",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hta81b7",
            "score": 4,
            "text": "The republican party is a full on death cult.",
            "title_similarity": "0.3537594",
            "sentiment_compound": -0.296
        },
        {
            "id": "hta83ml",
            "score": 1,
            "text": "The next pandemic is going to be awesome!",
            "title_similarity": "0.13166568",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hta850v",
            "score": 1,
            "text": "Seriously, fuck Florida, man.",
            "title_similarity": "0.40972036",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hta85ux",
            "score": 1,
            "text": "Surely it must be within the reach of modern technology to cut Florida off along the border and push it out into the ocean.",
            "title_similarity": "0.44809118",
            "sentiment_compound": 0.2263
        },
        {
            "id": "htaa087",
            "score": 1,
            "text": "Who are the snowflakes now?\n\n“Oh my boss sent an email encouraging vaccines, I can’t even!”",
            "title_similarity": "0.5325789",
            "sentiment_compound": 0.5707
        },
        {
            "id": "htaa6t8",
            "score": 1,
            "text": "What a world we live in",
            "title_similarity": "0.0245082",
            "sentiment_compound": 0.0
        },
        {
            "id": "htack90",
            "score": 1,
            "text": "What kind of bizarroland are we living in?",
            "title_similarity": "0.18689434",
            "sentiment_compound": 0.0
        },
        {
            "id": "htad314",
            "score": 2,
            "text": "Florida is the new Alabama",
            "title_similarity": "0.22538096",
            "sentiment_compound": 0.0
        },
        {
            "id": "htad976",
            "score": 2,
            "text": "Fucking DeSantis is a raving lunatic, pure psychopath. Trump was bad enough, I genuinely fear for the future of the world that this guy is almost as popular as him, and has a better than good shot at becoming president in a few years time.",
            "title_similarity": "0.45500126",
            "sentiment_compound": -0.3774
        },
        {
            "id": "htadabs",
            "score": 1,
            "text": "Poor guy. He looks so sad :(",
            "title_similarity": "0.2391211",
            "sentiment_compound": -0.8826
        },
        {
            "id": "htadbe8",
            "score": 3,
            "text": "It's a weird feeling to look at Florida with the judgment I have as a non-Floridian, knowing all too well that the rest of the world looks at me in the US with that same judgment.",
            "title_similarity": "0.5880226",
            "sentiment_compound": 0.2263
        },
        {
            "id": "htadqxt",
            "score": 1,
            "text": "Task failed succesfully?",
            "title_similarity": "0.18396828",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htadsqx",
            "score": 2,
            "text": "Fucking saw off Florida and let it sail",
            "title_similarity": "0.53263044",
            "sentiment_compound": 0.0
        },
        {
            "id": "htae38i",
            "score": 4,
            "text": "Geeze, the good old US of A is just Afghanistan with trees.",
            "title_similarity": "0.233831",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htae6nd",
            "score": 2,
            "text": "Doctor jailed for running high blood pressure screening at local community center.",
            "title_similarity": "0.6364753",
            "sentiment_compound": -0.6597
        },
        {
            "id": "htaeek8",
            "score": 3,
            "text": "Im sorry but are you ok Florida? What the shit.",
            "title_similarity": "0.3869064",
            "sentiment_compound": 0.8462
        },
        {
            "id": "htaeesx",
            "score": 8,
            "text": "Republicans are insane.",
            "title_similarity": "0.11580389",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htaeheg",
            "score": 3,
            "text": "Florida, United States... probably the only place where something like this would happen. Only in the US can the actual government be anti science, anti people, and so openly ignore popular sentiments.",
            "title_similarity": "0.5486742",
            "sentiment_compound": 0.2466
        },
        {
            "id": "htaeidm",
            "score": 3,
            "text": "wut? doctor tell you to take a pill to cure the disease, a politician tells you to ignore it. The Patient believes in Aliens. that's why the hospitals are full.",
            "title_similarity": "0.5966761",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htaeqlq",
            "score": 8,
            "text": "The Director of the Department of Motor  Vehicles has also been put on leave for recommending seatbelts to be worn while driving",
            "title_similarity": "0.5621823",
            "sentiment_compound": -0.34
        },
        {
            "id": "htaez0r",
            "score": 3,
            "text": "There's a Florida Department of Health? Seriously?\n\nHow in hell did the mentally unstable pile of smelly trash DeSantis allow that to happen?",
            "title_similarity": "0.61965346",
            "sentiment_compound": -0.8146
        },
        {
            "id": "htafa2c",
            "score": 2,
            "text": "Must be the results of pissing off that Navy Squid of a low life human they call a governot down there.",
            "title_similarity": "0.5127828",
            "sentiment_compound": -0.5859
        },
        {
            "id": "htafcth",
            "score": 2,
            "text": "Florida is such a national embarrassment.",
            "title_similarity": "0.37799278",
            "sentiment_compound": -0.4404
        },
        {
            "id": "htaff3f",
            "score": 4,
            "text": "I really hate this timeline.",
            "title_similarity": "0.20808169",
            "sentiment_compound": -0.6115
        },
        {
            "id": "htafkdn",
            "score": 1,
            "text": "But have you left Florida?",
            "title_similarity": "0.35498577",
            "sentiment_compound": 0.0
        },
        {
            "id": "htafs6l",
            "score": 3,
            "text": "It's as if the Florida government is openly trying to kill everybody and all these do gooders keep getting in the bloody way",
            "title_similarity": "0.5126996",
            "sentiment_compound": -0.8225
        },
        {
            "id": "htafv99",
            "score": 2,
            "text": "Reason No. 3005 why I want to leave Florida.",
            "title_similarity": "0.5431498",
            "sentiment_compound": 0.0258
        },
        {
            "id": "htag427",
            "score": 7,
            "text": "Florida: got your shit together!!!!!!!!!  \n   \nSigned, Every Goddamn Person Everywhere You Fucktards",
            "title_similarity": "0.4061525",
            "sentiment_compound": -0.8346
        },
        {
            "id": "htag44l",
            "score": 2,
            "text": "Shouldn’t this be on r/nottheonion?",
            "title_similarity": "0.08025095",
            "sentiment_compound": 0.0
        },
        {
            "id": "htag8lv",
            "score": 7,
            "text": "The violence, misinformation, and discrimination are the point of conservatism.",
            "title_similarity": "0.2734645",
            "sentiment_compound": -0.7506
        },
        {
            "id": "htagcye",
            "score": 1,
            "text": "FSFT\nFlorida so Fu*king Toxic",
            "title_similarity": "0.35697395",
            "sentiment_compound": 0.0
        },
        {
            "id": "htagf94",
            "score": 3,
            "text": "In other news, a fireman has been put on leave for changing batteries on fire alarms at the station.",
            "title_similarity": "0.6121213",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htaggaz",
            "score": 3,
            "text": "That's some dystopian bullshit so scary don't know where we're gonna end up a few years down the road.",
            "title_similarity": "0.27754402",
            "sentiment_compound": -0.8367
        },
        {
            "id": "htaglnp",
            "score": 5,
            "text": "I see nobody from the Florida GOP is defending this here. Why is that? Why do you support this? Do you not support this but are afraid of speaking up about it for whatever reason? Do you want people to think you are stupid? Everybody from the left of the center and a large percentage of the center thinks you are a hive of profound stupidity. Are we right? I do feel sorry for the healthcare workers who have to deal with you all.",
            "title_similarity": "0.63672423",
            "sentiment_compound": -0.8804
        },
        {
            "id": "htagnxr",
            "score": 7,
            "text": "So Florida’s banning doctors from giving medicinal advice, some messed up idea of freedom they have there.",
            "title_similarity": "0.6584776",
            "sentiment_compound": 0.6369
        },
        {
            "id": "htagxv4",
            "score": 3,
            "text": "Florida doing a suicide speedrun",
            "title_similarity": "0.5211189",
            "sentiment_compound": -0.6705
        },
        {
            "id": "htah1q1",
            "score": 6,
            "text": "Every day I am a little more embarrassed that I live in this country of nearly 50% knuckle dragging, mouth breathing, cult worshipping, reality denying douchebags.\n\nWe've passed comedy, we've passed satire, we've even passed sad. We're high fiving depressing on our way to pathetic.\n\nI wish every one of those fucking morons to have days as pleasant as they are.",
            "title_similarity": "0.43547755",
            "sentiment_compound": -0.7011
        },
        {
            "id": "htah74b",
            "score": 5,
            "text": "You have to be one stupid fucking person to not be vaccinated at this point. You don’t believe in science? Don’t use your phone, drive your car, use the internet or watch TV.",
            "title_similarity": "0.49425936",
            "sentiment_compound": -0.5267
        },
        {
            "id": "htahe14",
            "score": 5,
            "text": "On other news, the pope has been put on leave for telling people to pray",
            "title_similarity": "0.618962",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htahltc",
            "score": 2,
            "text": "Im so thankful I don't live in the state run by people with a collective IQ of 5",
            "title_similarity": "0.36994588",
            "sentiment_compound": 0.6115
        },
        {
            "id": "htahrpn",
            "score": 1,
            "text": "Not saying he was doing the wrong thing, but the careful words they chose to tell this makes me think he was a little bit more intense than merely suggesting they get vaccinated.  Probably went on a tirade.  And rightfully so.  Why the fuck would they put him on leave?  \n\nJust Florida things.",
            "title_similarity": "0.68712074",
            "sentiment_compound": -0.6914
        },
        {
            "id": "htaii4y",
            "score": 6,
            "text": "Ass backwards garbage state smh…. Can’t believe there are still people in denial about this stuff.",
            "title_similarity": "0.3562531",
            "sentiment_compound": -0.5423
        },
        {
            "id": "htaips4",
            "score": 3,
            "text": "Can't we just saw Florida off from the rest of the country and push it out to sea already?",
            "title_similarity": "0.5462929",
            "sentiment_compound": 0.0
        },
        {
            "id": "htaiui9",
            "score": 4,
            "text": "This has to be freedom of speech territory at this point. \n\nIn all their efforts to enjoy the \"freedom\" of America, they've done nothing but create a state dictatorship. \n\nOf course these are the same idiots that complain about cancel culture while trying to police the way people react to a subject...",
            "title_similarity": "0.54319596",
            "sentiment_compound": -0.1707
        },
        {
            "id": "htaizsm",
            "score": 3,
            "text": "How/why in the fuck does Florida do Florida shit",
            "title_similarity": "0.4055773",
            "sentiment_compound": -0.7964
        },
        {
            "id": "htajcl2",
            "score": 4,
            "text": "“Florida DOH says it’s even conducting an inquiry into whether any laws were broken…”\n\nHey Florida folks, is it required to have vaccinations to go to school? Like the vaccinations we all got as babies? \n\nI’m always confused why folks forget that’s a thing when talking about the shot. Shots are already legally required for tons of stuff",
            "title_similarity": "0.66763866",
            "sentiment_compound": -0.168
        },
        {
            "id": "htajh79",
            "score": 1,
            "text": "r/nottheonion is leaking.",
            "title_similarity": "0.18195447",
            "sentiment_compound": 0.0
        },
        {
            "id": "htajkh4",
            "score": 1,
            "text": "florida is real backwards ain't it",
            "title_similarity": "0.26765865",
            "sentiment_compound": 0.0
        },
        {
            "id": "htajllq",
            "score": 8,
            "text": "Dear America.\n\nYou are fucking nuts.\n\n&#x200B;\n\nSincerely, \n\nThe rest of the world.",
            "title_similarity": "0.307667",
            "sentiment_compound": 0.5221
        },
        {
            "id": "htajlnn",
            "score": 2,
            "text": "Not even a little surprising this happened in Florida. I mean last year they raided the home of a data scientist for not manipulating covid data.",
            "title_similarity": "0.62651527",
            "sentiment_compound": 0.4436
        },
        {
            "id": "htajmu6",
            "score": 2,
            "text": "Jfc. I’m so glad I live in Oregon, it’s mandated that you get the vaccine if you work in healthcare, education, government, or food service.",
            "title_similarity": "0.5599364",
            "sentiment_compound": 0.5949
        },
        {
            "id": "htajqvi",
            "score": 11,
            "text": "OMG. \n\nIdiocracy in real life.",
            "title_similarity": "0.16747907",
            "sentiment_compound": 0.0
        },
        {
            "id": "htak7t7",
            "score": 1,
            "text": "The one time Florida man tries to do the right thing..",
            "title_similarity": "0.40092415",
            "sentiment_compound": 0.0
        },
        {
            "id": "htakl2t",
            "score": 1,
            "text": "What if we just break Florida off from the mainland and push it out to sea? What then?",
            "title_similarity": "0.46877462",
            "sentiment_compound": 0.0
        },
        {
            "id": "htakvws",
            "score": 2,
            "text": "If this story wasn't coming out of Florida I would swear it was 1930's Nazi Germany!",
            "title_similarity": "0.4295298",
            "sentiment_compound": -0.126
        },
        {
            "id": "htakysb",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.18846291"
        },
        {
            "id": "htal5y4",
            "score": 2,
            "text": "But Republicans hate cancel culture right?!?!?!",
            "title_similarity": "0.3351311",
            "sentiment_compound": -0.874
        },
        {
            "id": "htal9l3",
            "score": 2,
            "text": "This insanity is unacceptable.",
            "title_similarity": "0.10385463",
            "sentiment_compound": -0.7717
        },
        {
            "id": "htalenz",
            "score": 3,
            "text": "What the fuck did I just read????? So, the government tells us to get vaccinated nothing happens. But if a medical director, medical! Tells his staff! Medical Staff! To get vaccinated when they work with sick people, he gets put on leave?????\n\nI'm done with this fucking country. I'm leaving as soon as my debts are paid off.",
            "title_similarity": "0.80143976",
            "sentiment_compound": -0.8701
        },
        {
            "id": "htalfjs",
            "score": 1,
            "text": "Can someone explain why “leave” is often a punishment? It’s like getting paid vacation time as a punishment to me. \n\n???",
            "title_similarity": "0.49377143",
            "sentiment_compound": -0.7059
        },
        {
            "id": "htali0q",
            "score": 13,
            "text": "“Both sides are the same” concern trolls are suspiciously quiet right now.",
            "title_similarity": "0.122856",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htalovz",
            "score": 2,
            "text": "Wtf . Why are these people so backwards",
            "title_similarity": "0.119490854",
            "sentiment_compound": -0.5859
        },
        {
            "id": "htalrgo",
            "score": 1,
            "text": "Medical Director: Could you please get vaccinated?\n\nHis staff: and I took that personally.",
            "title_similarity": "0.66370165",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htam036",
            "score": 2,
            "text": "Can we just ban the right yet?",
            "title_similarity": "0.2133922",
            "sentiment_compound": -0.5574
        },
        {
            "id": "htammpd",
            "score": 1,
            "text": "Dad gum! Florida is always out in front. (of something)",
            "title_similarity": "0.3390282",
            "sentiment_compound": 0.0
        },
        {
            "id": "htamwcz",
            "score": 2,
            "text": "Can't have medical director's advising people to take medicine.",
            "title_similarity": "0.53133214",
            "sentiment_compound": 0.0
        },
        {
            "id": "htamy67",
            "score": 2,
            "text": "Wtf is this world coming to? Seriously?",
            "title_similarity": "0.09687847",
            "sentiment_compound": -0.7059
        },
        {
            "id": "htamymw",
            "score": 4,
            "text": "\"A doctor? Giving medical advice? Not on my watch!\"\n\n--Florida Department of Health",
            "title_similarity": "0.69722736",
            "sentiment_compound": 0.4682
        },
        {
            "id": "htan1z2",
            "score": 2,
            "text": "Reminds me of good Samaritans that end up getting sued by someone they saved.",
            "title_similarity": "0.51050556",
            "sentiment_compound": 0.6908
        },
        {
            "id": "htan2eh",
            "score": 1,
            "text": "I’m vaccinated.  Let these dumbfucks burn.",
            "title_similarity": "0.5501052",
            "sentiment_compound": 0.0
        },
        {
            "id": "htan4o1",
            "score": 2,
            "text": "Fucking degenerates running the state.",
            "title_similarity": "0.3352081",
            "sentiment_compound": 0.0
        },
        {
            "id": "htanavd",
            "score": 4,
            "text": "What strange times we live in when a public health official can’t even suggest (not demand or require) doing things that would benefit the health of the public they work for.",
            "title_similarity": "0.53039306",
            "sentiment_compound": 0.3757
        },
        {
            "id": "htanj0r",
            "score": 3,
            "text": "18 days into the year and we already hit rock bottom?",
            "title_similarity": "0.34346986",
            "sentiment_compound": 0.0
        },
        {
            "id": "htanu0q",
            "score": 3,
            "text": "Florida is the Florida man of states",
            "title_similarity": "0.38467",
            "sentiment_compound": 0.0
        },
        {
            "id": "htanuv4",
            "score": 2,
            "text": "What’s going on on Florida. Is it something in the water?",
            "title_similarity": "0.27889815",
            "sentiment_compound": 0.0
        },
        {
            "id": "htanvmc",
            "score": 2,
            "text": "so I guess we're in Bizarro land now. This isn't good for the rest of the US. Can't have one state with such poor health, because we don't have internal border controls. That's why the feds are in charge of interstate commerce and public health.",
            "title_similarity": "0.59554636",
            "sentiment_compound": -0.6711
        },
        {
            "id": "htao4bc",
            "score": 2,
            "text": "Do they know it’s their voters that are dying?",
            "title_similarity": "0.47093046",
            "sentiment_compound": 0.0
        },
        {
            "id": "htaopw0",
            "score": 7,
            "text": "A doctor in my country was assaulted days ago because he advised a guy to get vaccinated. The guy was old, died afterwards and they blame the doc... Morons abound.",
            "title_similarity": "0.73832095",
            "sentiment_compound": -0.8934
        },
        {
            "id": "htaoqp1",
            "score": 8,
            "text": "I feel for The Onion writers who can no longer parody the actual news",
            "title_similarity": "0.4309892",
            "sentiment_compound": -0.296
        },
        {
            "id": "htaos0d",
            "score": 1,
            "text": "So much for freedom of speech",
            "title_similarity": "0.14582442",
            "sentiment_compound": 0.6666
        },
        {
            "id": "htaotsi",
            "score": 4,
            "text": "Florida is rotting from the inside out under DeSantis/Republican leadership.",
            "title_similarity": "0.55582464",
            "sentiment_compound": 0.0
        },
        {
            "id": "htaoya0",
            "score": 4,
            "text": "I don’t want to live in this reality anymore",
            "title_similarity": "0.20243417",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htaq5ag",
            "score": 2,
            "text": "Just a typical Tuesday in planet Florida.",
            "title_similarity": "0.3811174",
            "sentiment_compound": 0.0
        },
        {
            "id": "htaq5jc",
            "score": 3,
            "text": "If you change the name \"vaccine\" to \"gun\", they'll have no problem.",
            "title_similarity": "0.33375323",
            "sentiment_compound": -0.0366
        },
        {
            "id": "htaqi9g",
            "score": 3,
            "text": "If it was any other state I would say this belongs in /r/nottheonion",
            "title_similarity": "0.107271045",
            "sentiment_compound": 0.0
        },
        {
            "id": "htaqmhm",
            "score": 1,
            "text": "Just give up, everyone.",
            "title_similarity": "0.30878586",
            "sentiment_compound": 0.0
        },
        {
            "id": "htaqqxd",
            "score": 2,
            "text": "Aaaaand we are back in Bizarro World.",
            "title_similarity": "0.21228868",
            "sentiment_compound": 0.0
        },
        {
            "id": "htaqxuh",
            "score": 1,
            "text": "Florida gunna Florida",
            "title_similarity": "0.22656545",
            "sentiment_compound": 0.0
        },
        {
            "id": "htar0sz",
            "score": 5,
            "text": "Florida… dumber than the rest !",
            "title_similarity": "0.29765567",
            "sentiment_compound": -0.4199
        },
        {
            "id": "htar17q",
            "score": 3,
            "text": "If DeSantis is ever president, that will be the end of America.",
            "title_similarity": "0.4249429",
            "sentiment_compound": 0.0
        },
        {
            "id": "htargbu",
            "score": 6,
            "text": "ha, serves him right for trying to do the right thing and have common sense!! the nerd!!! now we can all get infected with covid like normal civilized people and-\n\n(this user has died)",
            "title_similarity": "0.4974837",
            "sentiment_compound": -0.8257
        },
        {
            "id": "htari36",
            "score": 3,
            "text": "Florida has a health department?",
            "title_similarity": "0.5006678",
            "sentiment_compound": 0.0
        },
        {
            "id": "htarqhp",
            "score": 7,
            "text": "A “personal choice” is no longer personal when it literally affects the entire world. \n\nThis crap would be done with if everyone had actually gotten vaccinated as soon as it was available. But no, we have jackasses in charge, and more jackasses that follow them.",
            "title_similarity": "0.5791856",
            "sentiment_compound": -0.9376
        },
        {
            "id": "htaryln",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "htas3l0",
            "score": 5,
            "text": "Is there not a subreddit for news specifically out of Florida? Like every article that I expect to be from the onion is actually about Florida.\n\nMaybe /r/Florida_or_onion?? 😝😂",
            "title_similarity": "0.5459846",
            "sentiment_compound": 0.7131
        },
        {
            "id": "htas79t",
            "score": 2,
            "text": "If people are allowed to talk about the right to chose not to get the vaccine, the opposite should also be allowed…",
            "title_similarity": "0.5036124",
            "sentiment_compound": 0.0
        },
        {
            "id": "htasqih",
            "score": 2,
            "text": "Fucking Florida man, the South is so sus.",
            "title_similarity": "0.39907256",
            "sentiment_compound": 0.0
        },
        {
            "id": "htasuqs",
            "score": 3,
            "text": "At this point let the stupid die out but do it at home and stop clogging hostipal beds, I have lost the last shred of give a fuck for humans",
            "title_similarity": "0.5640238",
            "sentiment_compound": -0.9178
        },
        {
            "id": "htat0hv",
            "score": 3,
            "text": "Jesus Tittyfucking Christ",
            "title_similarity": "0.21730405",
            "sentiment_compound": 0.0
        },
        {
            "id": "htat27i",
            "score": 1,
            "text": "\\#nottheonion  I can't even comprehend this article.  Embarrassed for Florida.",
            "title_similarity": "0.5029664",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htat43w",
            "score": 2,
            "text": "USA, Idiocracy the documentary",
            "title_similarity": "0.29358426",
            "sentiment_compound": 0.0
        },
        {
            "id": "htat6to",
            "score": 2,
            "text": "For some reason I can’t access the article.. might be my phone. \n\nSo he actually got out on leave for encouraging, not forcing people to take it? \n\nIf that’s the case that’s just insanity",
            "title_similarity": "0.5503058",
            "sentiment_compound": -0.128
        },
        {
            "id": "htat7s9",
            "score": 2,
            "text": "Stupid, selfish sociopaths.  I just bet the Trumper, and you know it's a Trumper, who made a big deal out of his encouragement of getting a vaccine is snickering to themselves.  May that person get Covid. They do not need to die from it, just suffer greatly.",
            "title_similarity": "0.522202",
            "sentiment_compound": -0.6192
        },
        {
            "id": "htatibk",
            "score": 2,
            "text": "Yep, thats the US for ya",
            "title_similarity": "0.101021454",
            "sentiment_compound": 0.296
        },
        {
            "id": "htatkg0",
            "score": 2,
            "text": "1.- Have vaccines for all age groups.\n2.- We get a mutation that is highly contagious and high mortality rate only for unvaccinated.\n3.- Allow red states to have anti-mask and vaccination mandates\n4.- keep an eye on the obituaries\n5.- Enjoy cheap real state.",
            "title_similarity": "0.51425195",
            "sentiment_compound": 0.3415
        },
        {
            "id": "htatm99",
            "score": 3,
            "text": "The most backwards thing I’ve ever heard of. Like, Health is in the name of their department.\n\nWhat’s next? That the sun revolves around the earth? Does anything make any sense anymore? It’s just seems contrarian to be contrarian. Tell them not to get the vaccine and then maybe they will. They’ll do the opposite of anything you suggest. Plain critical thinking skills.",
            "title_similarity": "0.58536744",
            "sentiment_compound": 0.1877
        },
        {
            "id": "htau6ka",
            "score": 1,
            "text": "don't you guys have doctor's strike?",
            "title_similarity": "0.5432808",
            "sentiment_compound": -0.128
        },
        {
            "id": "htauc3i",
            "score": 3,
            "text": "Next update from Florida’s Health Officials:\n\n-Make sure to remove the condom before having sex\n\n-Seat belts are a personal choice, no more fines or tickets. \n\n-A cigar a day keeps the doctor away, so nicotine up as best as possible.\n\nA message from Florida Health.\n\n-",
            "title_similarity": "0.70740116",
            "sentiment_compound": 0.6486
        },
        {
            "id": "htaudbq",
            "score": 2,
            "text": " r/Floriduh has to exist, right?",
            "title_similarity": "0.07301091",
            "sentiment_compound": 0.0
        },
        {
            "id": "htaumu3",
            "score": 5,
            "text": "Had to read this twice because I thought it was an Onion headline.",
            "title_similarity": "0.43956372",
            "sentiment_compound": 0.0
        },
        {
            "id": "htauunh",
            "score": 2,
            "text": "Well this ain't a dystopia, I don't know what is",
            "title_similarity": "0.080268785",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htauxo4",
            "score": 3,
            "text": "Dumbest fucking timeline",
            "title_similarity": "0.16466363",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htav6gg",
            "score": 4,
            "text": "'Murica is doomed lol. once somewhere we in EU aspired to go to,is now a near dystopian hellscape full of politics and hatred.",
            "title_similarity": "0.37727925",
            "sentiment_compound": -0.765
        },
        {
            "id": "htavgvu",
            "score": 2,
            "text": "If you told me this was a Babylon bee article I'd believe you",
            "title_similarity": "0.3066787",
            "sentiment_compound": 0.0
        },
        {
            "id": "htawuja",
            "score": 2,
            "text": "If that isn't bonkers and illuminate the mess that is the US!",
            "title_similarity": "0.23624063",
            "sentiment_compound": -0.4199
        },
        {
            "id": "htawxbl",
            "score": 3,
            "text": "This HAS to be a joke,. Twilight Zone much??",
            "title_similarity": "0.18163718",
            "sentiment_compound": 0.3736
        },
        {
            "id": "htawy06",
            "score": 4,
            "text": "We have reached full idiocracy status",
            "title_similarity": "0.21012849",
            "sentiment_compound": 0.1027
        },
        {
            "id": "htax54z",
            "score": 4,
            "text": "This kind of lunacy is why the Onion can't compete",
            "title_similarity": "0.3352356",
            "sentiment_compound": 0.0
        },
        {
            "id": "htaxj1x",
            "score": 1,
            "text": "We are truly in the end times.",
            "title_similarity": "0.1252003",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htaxnxb",
            "score": 2,
            "text": "I wonder how long until Florida finally gets swallowed by the sea?",
            "title_similarity": "0.4641324",
            "sentiment_compound": 0.0
        },
        {
            "id": "htaz847",
            "score": 1,
            "text": "These Onion articles just keep getting funnier 😆. Scratch that - I see I am in r/news not r/comedy. In other news, the onion writers get laid off - editor says onion news writes itself these days.",
            "title_similarity": "0.51374435",
            "sentiment_compound": 0.6369
        },
        {
            "id": "htazmbn",
            "score": 1,
            "text": "That's a dumbfounding title if I've ever seen one",
            "title_similarity": "0.20497915",
            "sentiment_compound": -0.2023
        },
        {
            "id": "htazq1u",
            "score": 1,
            "text": "key word is \"encouraging\" and apparently, they can't seem to understand what the word actually meant. These are the same ppl that pretend to be pariah.",
            "title_similarity": "0.3254043",
            "sentiment_compound": 0.4588
        },
        {
            "id": "htb1jka",
            "score": 5,
            "text": "Coming from someone that worked for Ronnie boy, someone should really look into his connections with nursing home, LAF, and daily testing for covid back in 2020.......",
            "title_similarity": "0.5032415",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb1n9p",
            "score": 3,
            "text": "Also, Ronnie boy once walked in and asked \" where are we testing the covid blood samples\"...",
            "title_similarity": "0.47314554",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb4aph",
            "score": 2,
            "text": "Soundtrack to this article: Team American World Police - America, fuck yeah!",
            "title_similarity": "0.37137896",
            "sentiment_compound": -0.3802
        },
        {
            "id": "htb73r0",
            "score": 6,
            "text": "America is a weird place",
            "title_similarity": "0.1400375",
            "sentiment_compound": -0.1779
        },
        {
            "id": "htb79ye",
            "score": 5,
            "text": "War on Florida man, if you kill them all what am I going to laugh at?",
            "title_similarity": "0.51406837",
            "sentiment_compound": -0.7184
        },
        {
            "id": "htb7c7e",
            "score": 2,
            "text": "For the love of Christ just vote this lunatic out in November. But knowing Florida, it's gonna Florida and vote desantis back in as governor",
            "title_similarity": "0.6806917",
            "sentiment_compound": 0.058
        },
        {
            "id": "htb7g0q",
            "score": 2,
            "text": "What kind of fucked up world do we live in where people are screamed at and looked down upon for doing what they can to protect everyone's health?",
            "title_similarity": "0.54989326",
            "sentiment_compound": -0.659
        },
        {
            "id": "htb7nyr",
            "score": 3,
            "text": "Florida is so backwards",
            "title_similarity": "0.2827918",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb7rab",
            "score": 7,
            "text": "\"So what policy should we have regarding Covid-19?\"\n\n\"Not the one Florida has.\"",
            "title_similarity": "0.40878546",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb7reu",
            "score": 6,
            "text": "this might be the most Florida headline ever",
            "title_similarity": "0.27059543",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb7rwj",
            "score": 4,
            "text": "Ron DeSantis is a fucking Terrorist.",
            "title_similarity": "0.29622146",
            "sentiment_compound": -0.7178
        },
        {
            "id": "htb7si4",
            "score": 2,
            "text": "Florida is \"Bizzaro World\".  Common sense doesn't exist.  Everything is opposite of the rest of the planet.",
            "title_similarity": "0.45150048",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb7uzv",
            "score": 5,
            "text": "“Highway patrol officer fired for enforcing seat belt laws…”",
            "title_similarity": "0.5179573",
            "sentiment_compound": -0.5574
        },
        {
            "id": "htb7wdf",
            "score": 2,
            "text": "Apologies if I’m wrong, but this sounds too nutty to be true. Has anyone verified it?",
            "title_similarity": "0.18950644",
            "sentiment_compound": 0.3919
        },
        {
            "id": "htb87r6",
            "score": 1,
            "text": "Documentary sent back from the future https://www.youtube.com/watch?v=sP2tUW0HDHA",
            "title_similarity": "0.24160239",
            "sentiment_compound": 0.0
        },
        {
            "id": "htb8gmg",
            "score": 3,
            "text": "Wtf... this is pants on head on fire stupid...",
            "title_similarity": "0.20699082",
            "sentiment_compound": -0.8625
        },
        {
            "id": "htb8okv",
            "score": 6,
            "text": "\"Teacher fired for encouraging children to study...\"\n\n\"Fireman put on leave for putting out fire...\" \n\n\"HVAC repairman let go by company for fixing people's AC and heating...\" \n\nThis damn headline is just as stupid as the above.",
            "title_similarity": "0.63980573",
            "sentiment_compound": -0.8528
        },
        {
            "id": "htba2g6",
            "score": 3,
            "text": "Just on paid leave, like when a cop shoots an innocent civilian, right?  Or was this more serious than that?",
            "title_similarity": "0.41816556",
            "sentiment_compound": 0.5372
        },
        {
            "id": "htba9pt",
            "score": 1,
            "text": "I'm also curious as to how this happened",
            "title_similarity": "0.14068358",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htbaway",
            "score": 3,
            "text": "Florida needs to be removed from the US.. literally hire a bunch of people to dig a mile-wide (and below sea level) channel around Florida to detach it.",
            "title_similarity": "0.6373565",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbb1j9",
            "score": 3,
            "text": "Our apologies for being such a bad example of how a state should be run. Not everyone in Florida is an asshole.",
            "title_similarity": "0.524332",
            "sentiment_compound": -0.5423
        },
        {
            "id": "htbb31v",
            "score": 2,
            "text": "Out here just embracing the stupid and screeching at anyone who doesn’t want to die slowly with them.",
            "title_similarity": "0.37430534",
            "sentiment_compound": -0.7906
        },
        {
            "id": "htbb6wz",
            "score": 7,
            "text": "This is what actual government censorship looks like. Not being banned from Twitter.",
            "title_similarity": "0.43869287",
            "sentiment_compound": 0.6098
        },
        {
            "id": "htbbe5t",
            "score": 4,
            "text": "We would like to hire this guy here in quebec. Send him over.",
            "title_similarity": "0.37555948",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htbbegg",
            "score": 4,
            "text": "This is a distraction meant for Desantis’ base. Can’t have them seeing the fact that even The Great Orange Dictator has called him a fucking moron.",
            "title_similarity": "0.51680386",
            "sentiment_compound": -0.2484
        },
        {
            "id": "htbbl4d",
            "score": 4,
            "text": "Florida Freedoom. Wait what! He said words to encourage! Lock him up! Freeeddddooooommmm!",
            "title_similarity": "0.5740714",
            "sentiment_compound": 0.6671
        },
        {
            "id": "htbbp6b",
            "score": 4,
            "text": "What in the absolute hell is going on down there",
            "title_similarity": "0.10592168",
            "sentiment_compound": -0.6808
        },
        {
            "id": "htbbvn6",
            "score": 5,
            "text": "Is anyone else hoping for a sea level rise that will take out Florida?",
            "title_similarity": "0.4020881",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htbc1aq",
            "score": 4,
            "text": "God damn I need to get out of this state",
            "title_similarity": "0.2568358",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htbccpf",
            "score": 3,
            "text": "They need a new governor like from last election",
            "title_similarity": "0.37737608",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htbcktf",
            "score": 3,
            "text": "We're going to be drinking Brawndo in no time",
            "title_similarity": "0.32854187",
            "sentiment_compound": -0.296
        },
        {
            "id": "htbcwac",
            "score": 2,
            "text": "They've got gerrymandering, we've got \"They're all fucking dead\"",
            "title_similarity": "0.4299547",
            "sentiment_compound": -0.6801
        },
        {
            "id": "htbd702",
            "score": 2,
            "text": "Let’s just push Florida out to sea.",
            "title_similarity": "0.39178795",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbd7s9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1641381"
        },
        {
            "id": "htbd9ul",
            "score": 3,
            "text": "The sad part is that my grandfather in Florida is not doing well at all and may pass anytime. My entire family down there is anti vax so I may not even get to go to my grandfather’s funeral when the time comes, because my uncles and cousins are so stupid, and they say, “ well, if you’re vaccinated you should be alright” not knowing how stupid they sound. NO ONE said the vaccines would keep you from getting it. They said it will lessen the chances of you getting or spreading it. And they don’t care. They. Don’t. Care.",
            "title_similarity": "0.69060904",
            "sentiment_compound": -0.6043
        },
        {
            "id": "htbdcda",
            "score": 3,
            "text": "I live down here in Trumpistan and wish I could be surprised by the stupid shit that goes on in Tallahassee.\n\nThe stunning Covid numbers are no big deal apparently.\n\nEven though the local school board is asking parents to drive their kids to/from school because they think Omicron is being spread on school busses.",
            "title_similarity": "0.5952997",
            "sentiment_compound": -0.4588
        },
        {
            "id": "htbe7y0",
            "score": 2,
            "text": "Can't cure stupid. I bet you, privately, desantis is vaccinated.",
            "title_similarity": "0.6020221",
            "sentiment_compound": 0.4168
        },
        {
            "id": "htbejib",
            "score": 3,
            "text": "This is what happens when you let Nazis run things.",
            "title_similarity": "0.40110937",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbekhl",
            "score": 2,
            "text": "So how many years until Flordia's a ghost state?",
            "title_similarity": "0.3200745",
            "sentiment_compound": -0.3182
        },
        {
            "id": "htbepsu",
            "score": 2,
            "text": "Florida man = Governor?",
            "title_similarity": "0.45581836",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbesyd",
            "score": 2,
            "text": "Isn’t he supposed to have an opinion? Isn’t that a big part of his job? Unbelievable.",
            "title_similarity": "0.26074886",
            "sentiment_compound": 0.2869
        },
        {
            "id": "htbevs2",
            "score": 3,
            "text": "Sorry, but if there was ever a time for the \"this is why aliens won't talk to us\" meme, that was now.",
            "title_similarity": "0.40672725",
            "sentiment_compound": -0.0387
        },
        {
            "id": "htbf4wj",
            "score": 2,
            "text": "Meanwhile in Australia its mandated. 93% of the pop over 15 yrs old is vaccinated. We are having our first major cases now.",
            "title_similarity": "0.37060454",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbf7zx",
            "score": 3,
            "text": "Desantis has been vaccinated. Tells you what you need to know.  I’m out of outraged nouns and adjectives at this point.",
            "title_similarity": "0.5717735",
            "sentiment_compound": -0.5423
        },
        {
            "id": "htbf8xo",
            "score": 5,
            "text": "Weird how the party of \"free speech\" tries to ruin a career for the guy doing his job.\n\nIf you believe Republicans want anything in America other than fascism, I've got some bridges to sell.",
            "title_similarity": "0.447451",
            "sentiment_compound": 0.2023
        },
        {
            "id": "htbfe4n",
            "score": 3,
            "text": "Our governor is a POS.",
            "title_similarity": "0.30703476",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbffav",
            "score": 2,
            "text": "And then Florida is crying over help from the feds.\n\nWhat a joke.",
            "title_similarity": "0.6618746",
            "sentiment_compound": 0.2023
        },
        {
            "id": "htbfgkk",
            "score": 4,
            "text": "America is fucking broken",
            "title_similarity": "0.26032507",
            "sentiment_compound": -0.5256
        },
        {
            "id": "htbfuz0",
            "score": 4,
            "text": "Why the hell have medical directors then if they can't encourage people ? What is this world coming to? Next people will be put on leave for the flu vaccine and Hep.B etc 🙄",
            "title_similarity": "0.7454976",
            "sentiment_compound": -0.8876
        },
        {
            "id": "htbg3o4",
            "score": 2,
            "text": "I love it when local government normalize insanity.",
            "title_similarity": "0.28181484",
            "sentiment_compound": 0.128
        },
        {
            "id": "htbg8js",
            "score": 3,
            "text": "Recommend vaccinations? Fired right away. \n\nRefuse vaccines? Believe it or not, also fired.",
            "title_similarity": "0.65751964",
            "sentiment_compound": -0.1867
        },
        {
            "id": "htbgcy9",
            "score": 3,
            "text": "Sounds like an excellent medical director in my opinion. Doing what he was hired to do in the first place - protect the public.",
            "title_similarity": "0.54426724",
            "sentiment_compound": 0.8316
        },
        {
            "id": "htbgeho",
            "score": 2,
            "text": "This has to be the dumbest thing ever",
            "title_similarity": "0.15773252",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htbgsdg",
            "score": 1,
            "text": "Of course it’s in Florida",
            "title_similarity": "0.22629905",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbh28j",
            "score": 1,
            "text": "An uno reverse take on \"a Florida man\".",
            "title_similarity": "0.43623346",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbh4fb",
            "score": 1,
            "text": "Jesus fucking tap dancing Christ, we are in the twilight zone here in Florida",
            "title_similarity": "0.4614445",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbhg5e",
            "score": 1,
            "text": "the cancer is spreading from Mara logos, i hope Florida falls off before it spreads to Georgia",
            "title_similarity": "0.6413071",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htbhmn7",
            "score": 1,
            "text": "As he should, because that wasn't very floridaman of him....",
            "title_similarity": "0.34073347",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbi7k2",
            "score": 1,
            "text": "Doctor to nurses drinking pepsi: you should drink water, it's healthier.",
            "title_similarity": "0.5042218",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbi7lt",
            "score": 2,
            "text": "Of course its Florida.\n\nWhat did he even do wrong?",
            "title_similarity": "0.4065356",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htbi9q0",
            "score": 2,
            "text": "The world has lost it's mind",
            "title_similarity": "0.2954626",
            "sentiment_compound": -0.3182
        },
        {
            "id": "htbidli",
            "score": 6,
            "text": "In other news the city's fire marshall has been suspended for suggesting his crew not play with fire.",
            "title_similarity": "0.607937",
            "sentiment_compound": -0.6705
        },
        {
            "id": "htbiqb2",
            "score": 1,
            "text": "And some people still wonder why the rest of the world looks at America as a problem.",
            "title_similarity": "0.33969805",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htbj5cn",
            "score": 2,
            "text": "We are truly fucked as a nation.",
            "title_similarity": "0.25610608",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htbj6kl",
            "score": 1,
            "text": "r/nottheonion if  it  hasn’t been  said  already.",
            "title_similarity": "0.14038643",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbjpx9",
            "score": 2,
            "text": "“Orange County Medical Director Dr. Raul Pino wrote an email to staff on Jan. 4th encouraging them to get vaccinated and boosted for COVID-19.\n\nIn it he wrote, “I have a hard time understanding how we can be in public health and not practice it.”\n\nAfter sending the email he was placed on administrative leave.\n\nIn an email to WMFE, the Florida Department of Health has confirmed Pino was put on leave because, “the decision to get vaccinated is a personal choice that should be free from coercion and mandates from employers.”\n\nFlorida DOH says it’s even conducting an inquiry into whether any laws were broken by sending the email.”",
            "title_similarity": "0.8509873",
            "sentiment_compound": 0.6486
        },
        {
            "id": "htblxw8",
            "score": 2,
            "text": "Whew, good thing he didn’t tell them to drive safe. Might have been let go indefinitely for such a devastating, snowflake melting comment.",
            "title_similarity": "0.49568895",
            "sentiment_compound": 0.128
        },
        {
            "id": "htbmri8",
            "score": 1,
            "text": "Well this isnt a nottheonion post so I don’t believe it",
            "title_similarity": "0.14838025",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htbmucw",
            "score": 4,
            "text": "Florida really is the arse crack of America.",
            "title_similarity": "0.36710548",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbn2q7",
            "score": 2,
            "text": "This timeline is getting more insane by the minute",
            "title_similarity": "0.12470505",
            "sentiment_compound": -0.4576
        },
        {
            "id": "htbn49q",
            "score": 2,
            "text": "This had me like YUP THAT'S ENOUGH REAL SATIRE FOR TODAY *exits Reddit*",
            "title_similarity": "0.33468884",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htbn5ay",
            "score": 3,
            "text": "Boy, this country sure is one giant shithole.",
            "title_similarity": "0.17217457",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htbn6cl",
            "score": 2,
            "text": "The GOP is like a government so small that it can enter your lungs and reproduce until you die.",
            "title_similarity": "0.4901361",
            "sentiment_compound": -0.34
        },
        {
            "id": "htbncg0",
            "score": 1,
            "text": "Nobody in Florida should even be aware that there is a vaccine! It’s called “Freedom”!",
            "title_similarity": "0.5254122",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbni58",
            "score": 2,
            "text": "Ron DeSantis is vaccinated, Wtf?",
            "title_similarity": "0.5552615",
            "sentiment_compound": -0.5859
        },
        {
            "id": "htbo4gz",
            "score": 2,
            "text": "Republicans: Quit making covid political!",
            "title_similarity": "0.39035857",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbott6",
            "score": 3,
            "text": "Amazing that even after Trump is out, the US continues to be the laughing stock of the world.",
            "title_similarity": "0.26398998",
            "sentiment_compound": 0.7906
        },
        {
            "id": "htbp0ks",
            "score": 5,
            "text": "hell yeah, dude. my state, once again, showing that they truly care about the people. love to see it.\n\n/s if you couldn’t see through my glaring sarcasm",
            "title_similarity": "0.31007794",
            "sentiment_compound": 0.7184
        },
        {
            "id": "htbpdpo",
            "score": 5,
            "text": "This state wasn't always this stupid. I can't wait to get the fuck out of here!",
            "title_similarity": "0.17967707",
            "sentiment_compound": -0.8313
        },
        {
            "id": "htbpplc",
            "score": 4,
            "text": "My parents got us the fuck out of Florida 20 years ago. Place is a hell hole where the worst people you know from every state moved to.",
            "title_similarity": "0.5978762",
            "sentiment_compound": -0.9217
        },
        {
            "id": "htbpqz7",
            "score": 2,
            "text": "When you don't adjust to greater risk to your work force because you are addicted to insane profits, that's late stage capitalism\n\nCancer, when you boil it down, is a disease where a mutation in a cell stops it from responding to stop doing what it's doing based on systematic pressure.\n\n\\*gestures broadly\\*",
            "title_similarity": "0.50870013",
            "sentiment_compound": -0.9083
        },
        {
            "id": "htbq6gc",
            "score": 3,
            "text": "How the hell is this not an Onion article? How is this real?\n\nOh I’m so tired of all this I can’t even get mad, just more tired.",
            "title_similarity": "0.36064777",
            "sentiment_compound": -0.9441
        },
        {
            "id": "htbqa1u",
            "score": 1,
            "text": "Thanks gawd we do not live in Florida. The governorship is insane.",
            "title_similarity": "0.42187855",
            "sentiment_compound": 0.0516
        },
        {
            "id": "htbr9cg",
            "score": 1,
            "text": "I am clueless: are florida and texas affiliated in some way? I often seem to read the same idiotics from these states",
            "title_similarity": "0.43949002",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htbrjlq",
            "score": 1,
            "text": "The guy should absolutely stand his ground and force these morons to fire him for competence",
            "title_similarity": "0.39506978",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htbrz4k",
            "score": 2,
            "text": "That is absolutely insane. He got fired for doing his job.",
            "title_similarity": "0.41992697",
            "sentiment_compound": -0.7645
        },
        {
            "id": "htbsoly",
            "score": 2,
            "text": "This sums up Florida in a nutshell.  The inmates are running the asylum.",
            "title_similarity": "0.5379596",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbtapx",
            "score": 1,
            "text": "Par for the Florida course.",
            "title_similarity": "0.30446786",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbtglf",
            "score": 3,
            "text": "This is why America is closing in on 1 million covid deaths.",
            "title_similarity": "0.45428053",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbvluv",
            "score": 1,
            "text": "Jesus fuck we're doomed",
            "title_similarity": "0.17169881",
            "sentiment_compound": -0.8271
        },
        {
            "id": "htbvvkq",
            "score": 1,
            "text": "I thought DeSantis was vaccinated???",
            "title_similarity": "0.50986373",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbw6ai",
            "score": 1,
            "text": "What fucking planet are we on jfc",
            "title_similarity": "0.1714012",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbw7io",
            "score": 1,
            "text": "i wonder whos more qualified for the job",
            "title_similarity": "0.108183675",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbwlrs",
            "score": 1,
            "text": "This should be about medicine, instead it is about loyalty.",
            "title_similarity": "0.4044269",
            "sentiment_compound": 0.5423
        },
        {
            "id": "htbwsw0",
            "score": 3,
            "text": "Holy shit. Wtf florida",
            "title_similarity": "0.37986013",
            "sentiment_compound": -0.8126
        },
        {
            "id": "htbx38n",
            "score": 2,
            "text": "More stupidity from the FL “government “, who clearly doesn’t give a shit about anyone.",
            "title_similarity": "0.35710716",
            "sentiment_compound": -0.624
        },
        {
            "id": "htbydi3",
            "score": 1,
            "text": "Freest country in the world, y'all. Big freedom, woohoo!\n\n/s\n\nSorry. I realize that only absolute dipshits genuinely believe the US is a bastion of freedom and that most of y'all aren't absolute dipshits.",
            "title_similarity": "0.35503075",
            "sentiment_compound": 0.9359
        },
        {
            "id": "htbyrmm",
            "score": 1,
            "text": "Our governor needs to be fired out of a cannon.  Into the sun.",
            "title_similarity": "0.39598906",
            "sentiment_compound": -0.5574
        },
        {
            "id": "htbyu9f",
            "score": 1,
            "text": "Ignore the evidence of your eyes and ears. And the mountain of corpses. Obey",
            "title_similarity": "0.40249264",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htbywhd",
            "score": 1,
            "text": "Florida is a 3rd world state at this point.",
            "title_similarity": "0.27967912",
            "sentiment_compound": 0.0
        },
        {
            "id": "htc0anc",
            "score": 2,
            "text": "From WaPo:\n\n\"A screenshot of the email posted to Twitter by NBC News reporter Marc Caputo shows that Pino may have also accessed potentially confidential worker health information.\"\n\nThis seems like a pretty important aspect of the story which is underreported and not being emphasized.\n\nhttps://www.washingtonpost.com/health/2022/01/19/florida-raul-pino-vaccinated-leave-desantis\n\nhttps://mobile.twitter.com/MarcACaputo/status/1483632549486280711",
            "title_similarity": "0.5882921",
            "sentiment_compound": 0.7579
        },
        {
            "id": "htc0l44",
            "score": 2,
            "text": "Why is Florida so fucked up?",
            "title_similarity": "0.33378336",
            "sentiment_compound": -0.7661
        },
        {
            "id": "htc1lwc",
            "score": 2,
            "text": "Of course. Because it's FLORIDA #howdidyounotseethatcoming",
            "title_similarity": "0.32521018",
            "sentiment_compound": 0.0
        },
        {
            "id": "htc1m7x",
            "score": 1,
            "text": "Who knew Florida Man was in office?",
            "title_similarity": "0.4298178",
            "sentiment_compound": 0.0
        },
        {
            "id": "htc2a22",
            "score": 2,
            "text": "Is he being silenced? Isn’t this what the republicans have been crying about…",
            "title_similarity": "0.39672565",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htc2bax",
            "score": 2,
            "text": "Floriduh needs to stop electing negligently murderous leadership.",
            "title_similarity": "0.42609558",
            "sentiment_compound": -0.7506
        },
        {
            "id": "htc2ktn",
            "score": 1,
            "text": "Why do they not include a copy of the email?  DeSantis has on numerous occasions recommended everyone get vaccinated.  Which makes the allegations here seem a bit bizarre.",
            "title_similarity": "0.62628794",
            "sentiment_compound": -0.128
        },
        {
            "id": "htc2ovw",
            "score": 1,
            "text": "It's Florida, should we be suprised",
            "title_similarity": "0.3770828",
            "sentiment_compound": 0.0
        },
        {
            "id": "htc34i6",
            "score": 1,
            "text": "Fortunately there are many other states in need of health medical directors.",
            "title_similarity": "0.32507065",
            "sentiment_compound": 0.0
        },
        {
            "id": "htc3km9",
            "score": 1,
            "text": "Florida is a national embarrassment",
            "title_similarity": "0.38992947",
            "sentiment_compound": -0.4404
        },
        {
            "id": "htc3lll",
            "score": 1,
            "text": "DeSantis and his administration want their constituents to die. There's no other explanation for this insanity.",
            "title_similarity": "0.48556885",
            "sentiment_compound": -0.88
        },
        {
            "id": "htc3sm0",
            "score": 1,
            "text": "What a world we live in. What will the Republican party do when they are done killing all of their voter base that they have used to stay in power for the last 50 years?",
            "title_similarity": "0.48224345",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htc4p2r",
            "score": 1,
            "text": "WHAT THE FUCK? Are the sociopathic fascist down there just trying to skip the dictatorship and go straight to dystopia? Absolutely insane. #GOPKYS",
            "title_similarity": "0.40993708",
            "sentiment_compound": -0.883
        },
        {
            "id": "htc4pij",
            "score": 1,
            "text": "Covid will last forever because immature brats hate being told what to do. Just reopen manzanar and keep all of the antivaxers there or send them all to Alabama",
            "title_similarity": "0.53750974",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htc52y7",
            "score": 1,
            "text": "I don't believe this, but yeah, I can believe it.",
            "title_similarity": "0.08800545",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htc59uu",
            "score": 1,
            "text": "Our county health department director was let go because he had the temerity to suggest people should wear masks. Politically we are a deep red county in a blue state.",
            "title_similarity": "0.61683327",
            "sentiment_compound": 0.0
        },
        {
            "id": "htc5iov",
            "score": 1,
            "text": "Whoever put him on leave should stand trial for official misfeasance and be sentenced to jail time.  Not kidding.  That is exactly what was done.",
            "title_similarity": "0.43814534",
            "sentiment_compound": -0.1521
        },
        {
            "id": "htc5s53",
            "score": 1,
            "text": "In other news, a teacher is dismissed for suggesting that students should *probably* go to school",
            "title_similarity": "0.58327955",
            "sentiment_compound": 0.0
        },
        {
            "id": "htc5x6i",
            "score": 1,
            "text": "I really do feel sorry for the like 7 sane people left in Florida at this point. And I’m so confused as to why the Republican strategy is to literally kill their voter base. Who’s going to vote for these nut jobs when their most fervent supporters die of Covid?",
            "title_similarity": "0.64031726",
            "sentiment_compound": -0.7467
        },
        {
            "id": "htc65s4",
            "score": 1,
            "text": "I live in Texas and I'm not sure which state is the bigger joke. Florida will NOT QUIT with the shenanigans.",
            "title_similarity": "0.4095319",
            "sentiment_compound": 0.0613
        },
        {
            "id": "htc67lm",
            "score": 5,
            "text": "This can’t be right! MAGAts HATE censorship. They don’t want to fall victim to Facebook’s private company that wants to stop deadly lies from spreading (PCTWTSDLFS) censorship, so they would definitely be against the government telling a man what he can and can’t say in an e-mail. If this is true, I expect an outburst from Floriduh conservatives that will save this guy’s job. Any minute now…/s.",
            "title_similarity": "0.5325776",
            "sentiment_compound": -0.3739
        },
        {
            "id": "htc68s6",
            "score": 5,
            "text": "If you look at the statistics for Florida in healthometers/coronavirus, you will find that Florida reports almost no deaths for COVID.  Other states with the same number of cases report ten or a hundred times as many deaths.  I suspect some serious fiddling with the numbers, presumably to make someone look good.  I hope someone makes a really big stink out of it.",
            "title_similarity": "0.565843",
            "sentiment_compound": -0.0735
        },
        {
            "id": "htc6qi5",
            "score": 1,
            "text": "There has to be more to it than that.",
            "title_similarity": "-0.08269804",
            "sentiment_compound": 0.0
        },
        {
            "id": "htc6x5z",
            "score": 3,
            "text": "Shit like this makes me feel like we don't deserve to continue on as a species.",
            "title_similarity": "0.3003738",
            "sentiment_compound": 0.1027
        },
        {
            "id": "htc80g7",
            "score": 2,
            "text": "Wondering now if the Florida Head of Department of Corrections would be put on leave for encouraging the prisoners to remain jailed.........",
            "title_similarity": "0.7097784",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htc8hlw",
            "score": 3,
            "text": "You're embarrassing yourselves (yet again), Florida.",
            "title_similarity": "0.40223134",
            "sentiment_compound": -0.3818
        },
        {
            "id": "htc8vdn",
            "score": 2,
            "text": "So can I drive 120 mph in Florida because it's my personal choice?",
            "title_similarity": "0.5204464",
            "sentiment_compound": 0.0
        },
        {
            "id": "htc9dlu",
            "score": 3,
            "text": "For those of you that don't live in Florida, being put on leave in Florida isn't a bad thing.  Think beaches, sun, beer.........",
            "title_similarity": "0.45987952",
            "sentiment_compound": 0.3919
        },
        {
            "id": "htc9q8g",
            "score": 1,
            "text": "Anyone else hear calliope music?",
            "title_similarity": "0.124208935",
            "sentiment_compound": 0.0
        },
        {
            "id": "htc9zf1",
            "score": 1,
            "text": "Can we just sell Florida?!",
            "title_similarity": "0.44364828",
            "sentiment_compound": 0.0
        },
        {
            "id": "htcamtb",
            "score": 1,
            "text": "Floriduh strikes again!",
            "title_similarity": "0.100076094",
            "sentiment_compound": -0.4199
        },
        {
            "id": "htcawrd",
            "score": 1,
            "text": "\"Florida Man\" is Governor.",
            "title_similarity": "0.44102287",
            "sentiment_compound": 0.0
        },
        {
            "id": "htcb1tl",
            "score": 3,
            "text": "Florida is completely off my list for future vacations. There's not a chance in hell I'd visit The Plaguelands",
            "title_similarity": "0.551615",
            "sentiment_compound": -0.7461
        },
        {
            "id": "htcc3z8",
            "score": 3,
            "text": "Christ all mighty, you can't put into words how fucking dumb American logic is, what kind of society has it become - they'll be lynching people for reading next, that's if they haven't burned all the books first.",
            "title_similarity": "0.50779194",
            "sentiment_compound": -0.5563
        },
        {
            "id": "htccj7x",
            "score": 1,
            "text": "\"Florida Man\" is Governor.",
            "title_similarity": "0.44102287",
            "sentiment_compound": 0.0
        },
        {
            "id": "htcf1dr",
            "score": 2,
            "text": "in case you still didnt realize the GOP is an actual death cult...",
            "title_similarity": "0.37721962",
            "sentiment_compound": -0.5994
        },
        {
            "id": "htcff5y",
            "score": 4,
            "text": "Republicans sure love getting Americans killed.",
            "title_similarity": "0.27645922",
            "sentiment_compound": 0.25
        },
        {
            "id": "htciwov",
            "score": 3,
            "text": "\"Florida Man\" is Governor.",
            "title_similarity": "0.44102287",
            "sentiment_compound": 0.0
        },
        {
            "id": "htck49g",
            "score": 1,
            "text": "Man what is next here in Floriduh? Boxcars?😳",
            "title_similarity": "0.1691953",
            "sentiment_compound": 0.0
        },
        {
            "id": "htcmk6g",
            "score": 2,
            "text": "Florida doesn't want its Health Department just going around and promoting health and whatnot.",
            "title_similarity": "0.6115045",
            "sentiment_compound": 0.3134
        },
        {
            "id": "htcpm9b",
            "score": 2,
            "text": "While I won't say fuck Florida, fuck their current governor with an red hot tire iron.",
            "title_similarity": "0.4883034",
            "sentiment_compound": -0.1655
        },
        {
            "id": "htcs8rq",
            "score": 1,
            "text": "Well it's Florida. What else can anyone else expect?\n\nThis is just another example of, \"respecting people's choices\". \n\nNo one was forced to do anything and that still set the snowflakes off.",
            "title_similarity": "0.5439665",
            "sentiment_compound": 0.0258
        },
        {
            "id": "htcubxs",
            "score": 4,
            "text": "Florida = A lost cause",
            "title_similarity": "0.37016863",
            "sentiment_compound": -0.3182
        },
        {
            "id": "htcuvj5",
            "score": 3,
            "text": "WTF?\n\n\"I have a hard time understanding how we can be in public health and not practice it.”\n\nSent that in an email and then put on administrative leave...so he works from home now?",
            "title_similarity": "0.69345474",
            "sentiment_compound": -0.7425
        },
        {
            "id": "htcw2na",
            "score": 1,
            "text": "Now that is messed up .",
            "title_similarity": "0.016067073",
            "sentiment_compound": -0.34
        },
        {
            "id": "htcwepn",
            "score": 2,
            "text": "The more time that passes the more Idiocracy begins to look like a modern day documentary.",
            "title_similarity": "0.2746083",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htczrbq",
            "score": 1,
            "text": "Descant is is a sick puppy. It’s creepy that this kind of tyranny can go on in any state America today. Eff descant is and all his supporters.",
            "title_similarity": "0.41315836",
            "sentiment_compound": -0.1027
        },
        {
            "id": "htd0ruz",
            "score": 5,
            "text": "If the medical director is unable to dispense recommendations regarding public health then what is the point of having the agency to begin with. I feel sorry for Florida residence but a majority of them elected idiots like the governor making compassion for them difficult.",
            "title_similarity": "0.7604714",
            "sentiment_compound": 0.5927
        },
        {
            "id": "htd15nh",
            "score": 2,
            "text": "Idiotacracy at it’s finest",
            "title_similarity": "0.14619496",
            "sentiment_compound": 0.0
        },
        {
            "id": "htd1vsp",
            "score": 2,
            "text": "Nice bit of governing there.",
            "title_similarity": "0.04728228",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htd29z9",
            "score": 1,
            "text": "Florida ends free speech.",
            "title_similarity": "0.5037847",
            "sentiment_compound": 0.5106
        },
        {
            "id": "htd3rpw",
            "score": 1,
            "text": "Idiocracy, here we come.",
            "title_similarity": "0.15044954",
            "sentiment_compound": 0.0
        },
        {
            "id": "htd47hl",
            "score": 5,
            "text": "This is the word the DeSantis republicans want to live in",
            "title_similarity": "0.19568521",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htd9rah",
            "score": 3,
            "text": "We aren't even three weeks into January, and here Florida is trying to win the dumbest thing of the year award.",
            "title_similarity": "0.45178577",
            "sentiment_compound": 0.6124
        },
        {
            "id": "htdbm5a",
            "score": 1,
            "text": "DeSantis needs a brain transplant",
            "title_similarity": "0.26877826",
            "sentiment_compound": 0.0
        },
        {
            "id": "htdk4wi",
            "score": 2,
            "text": "When I think desantis couldn’t turn into more a joke with his pandemic response.  During a public health crisis, don’t let your doctors recommend anything to you! It’s the devil!",
            "title_similarity": "0.6183382",
            "sentiment_compound": -0.7274
        },
        {
            "id": "htdl703",
            "score": 2,
            "text": "Doesn’t that headline say all that needs to be said about Florida these days?",
            "title_similarity": "0.4952634",
            "sentiment_compound": 0.0
        },
        {
            "id": "htdlvue",
            "score": 1,
            "text": "Florida is disgusting.",
            "title_similarity": "0.30883434",
            "sentiment_compound": -0.5267
        },
        {
            "id": "htdnojp",
            "score": 1,
            "text": "It’s Florida.  What do y’all expect??",
            "title_similarity": "0.34418374",
            "sentiment_compound": 0.0
        },
        {
            "id": "htdtngz",
            "score": 2,
            "text": "Simply for encouraging? Suggesting they take take care of themselves? No mandates? \n\nI would be brushing up my resume and checking in other states to see if they need a Medical Director.",
            "title_similarity": "0.64578193",
            "sentiment_compound": 0.7131
        },
        {
            "id": "htdvesg",
            "score": 2,
            "text": "Freedom as long as the emphasis is on the dumb.",
            "title_similarity": "0.24575096",
            "sentiment_compound": 0.2263
        },
        {
            "id": "htdvmo5",
            "score": 3,
            "text": "If he can't even make medical recommendations what's the point of the job title? Just put an intern in there that just yes sirs the powers that be if that is what Florida wants.",
            "title_similarity": "0.7220311",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htdwud5",
            "score": 1,
            "text": "Executive power run amok.",
            "title_similarity": "0.19048354",
            "sentiment_compound": 0.0
        },
        {
            "id": "htdy6p7",
            "score": 3,
            "text": "Yeah Florida should just secede at this point.",
            "title_similarity": "0.4150584",
            "sentiment_compound": 0.296
        },
        {
            "id": "htdyisj",
            "score": 2,
            "text": "Now would be an opportune time for him to speak honestly to the public",
            "title_similarity": "0.23554455",
            "sentiment_compound": 0.6908
        },
        {
            "id": "htdzr56",
            "score": 3,
            "text": "Should of just let the USSR just wipe Florida off when they had the chance.",
            "title_similarity": "0.55441505",
            "sentiment_compound": 0.25
        },
        {
            "id": "hte0glo",
            "score": 3,
            "text": "Imagine being punished for literally doing the right thing, thats when you know evil ppl are in charge",
            "title_similarity": "0.35549814",
            "sentiment_compound": -0.8126
        },
        {
            "id": "htea5c8",
            "score": 3,
            "text": "“Florida Man gets fired for doing his job”.",
            "title_similarity": "0.6369233",
            "sentiment_compound": -0.5574
        },
        {
            "id": "htgexpu",
            "score": 1,
            "text": "I saw a Desantis sticker yesterday.  It said “Make America Florida”. I wish I had a punchline.",
            "title_similarity": "0.60933065",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hth264j",
            "score": 1,
            "text": "What a dystopian wasteland",
            "title_similarity": "0.1561975",
            "sentiment_compound": 0.0
        },
        {
            "id": "htitngj",
            "score": 1,
            "text": "DeSantis for America, everybody.",
            "title_similarity": "0.13698046",
            "sentiment_compound": 0.0
        },
        {
            "id": "htpwd6e",
            "score": 1,
            "text": "Meanwhile,   Meatloaf,   an anti-vaxxer.........refused the vaccine and then caught covid and  DIED.",
            "title_similarity": "0.53911304",
            "sentiment_compound": -0.6523
        },
        {
            "id": "hwhuozs",
            "score": 1,
            "text": "In canada we fire the unvaccinated (depends on your job/company)",
            "title_similarity": "0.46917966",
            "sentiment_compound": -0.34
        }
    ]
}