{
    "For the first time ever, the NATO Response Force has been activated as a defensive measure in response to Russia's ongoing invasion of Ukraine.\n": [
        {
            "id": "hyfpsco",
            "score": -13,
            "text": "NATO Response Force: \n\nReady! \n\nAim! \n\nWrite a stern letter to Putin!",
            "title_similarity": "0.62703335",
            "sentiment_compound": 0.5229
        },
        {
            "id": "hyfqact",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hyey1ar",
            "score": 39,
            "text": "[deleted]",
            "title_similarity": "0.09147855"
        },
        {
            "id": "hyfjyqv",
            "score": 3,
            "text": "Oh god.\n\nI've been telling people that this won't turn into WW3. It's a game of chicken and someone will blink before it comes to that. Everyone involved are idiots, but someone will blink. Up till right now I've assumed NATO would be the ones to blink (and I'll bet Putin did too). \n\nBut this is not a blink.\n\nAfter reading this article, for the first time ever, I'm seriously concerned that we're going to see WW3 in my lifetime.\n\nFuck.",
            "title_similarity": "0.45946252",
            "sentiment_compound": -0.7391
        },
        {
            "id": "hyfu03j",
            "score": -5,
            "text": "We're really just going to stand by and watch as tyranny takes over an entire country?\n\nThis sucks.",
            "title_similarity": "0.46704948",
            "sentiment_compound": -0.4357
        },
        {
            "id": "hyfksou",
            "score": 3,
            "text": "Well we got a nut running the largest conventional military in the world head on into eastern Europe if not now then when? activate all the shit you got\n\nFuck Putin",
            "title_similarity": "0.6199382",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hygf3w4",
            "score": -2,
            "text": "Putins not worried. He has Syria, Chechnya, Belarus, Iran and Myanmar. He’s counting on NATO to “believe and hope for the best” in these countries. NATO needs to wake the fuck up. They’ve been setting this shit up for years. China just wants to reclaim Taiwan and North Korea and take advantage of this situation. China will enter North Korea saying they are trying to help deter nuclear weapons. If they make their move. Philippines won’t do shit. Japan and South Korea will try. But Myanmar will help china. Only hope to stop china is THE VIET KONG. But they have gotten soft over the years. They are no where up to par in air or navy battles. So they’ll just shut their mouths until china completely claims the fishing areas. Then they will go back to gorilla war tactics and push them out. Good luck everyone. 2 or more countries fighting 1 or more country together is World war. Look up what has to happen to consider it to be a world war. And we’re at the beginning stages of it.",
            "title_similarity": "0.5824246",
            "sentiment_compound": -0.9574
        },
        {
            "id": "hyg1g71",
            "score": -13,
            "text": "NATO response force in reality just USA",
            "title_similarity": "0.4172796",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfugqv",
            "score": 3,
            "text": ">The activation of the response troops does not mean that any US or NATO troops will go into Ukraine\n\naaaand I stopped reading",
            "title_similarity": "0.5533062",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyflv90",
            "score": -8,
            "text": "Thank you Germany for continuing to fund this invasion.",
            "title_similarity": "0.42126113",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyewqtr",
            "score": 28,
            "text": "It's interesting - Ukraine not being officially part of NATO. \n\nIt's in NATO's best interest to keep Ukraine independent as a buffer from deeperRussian territorial aggression.",
            "title_similarity": "0.6173862",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hyf7uxd",
            "score": 2,
            "text": "Shits about to get real",
            "title_similarity": "0.25029886",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyftgh3",
            "score": 1,
            "text": "Putin \"I don't like NATO\"\n\n\"We are a deterent we aren't actually using it\"\n\nPutin \"well I guess I'll activate it then\"",
            "title_similarity": "0.48963302",
            "sentiment_compound": -0.0026
        },
        {
            "id": "hyf88xl",
            "score": -23,
            "text": "Ukraine wants into NATO, NATO must welcome Ukraine in now.",
            "title_similarity": "0.7050706",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyhjal7",
            "score": 4,
            "text": "And in America, the right wing propaganda machine is  in overdrive kissing Putin’s feet what can only be explained as evil intent at this point.\n\nWhen the rest of the world, including the fucking Taliban, are condemning Russia then why these prominent right wing hosts are going out of their way defending Putin is so strange??\n\nProof: https://youtu.be/d1BQW9HIkz8",
            "title_similarity": "0.54064727",
            "sentiment_compound": -0.4812
        },
        {
            "id": "hyf763u",
            "score": 6,
            "text": "Wait, so are nato going into Ukraine or are they just on standby?",
            "title_similarity": "0.67183614",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygm2a9",
            "score": -2,
            "text": "Needs to be an offensive measure now. No way they’d lose. Plus, what, is Russia going to nuke all of NATO?",
            "title_similarity": "0.6929774",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hyh55sn",
            "score": 2,
            "text": "Can we PLEASE call this invasion a terrorist attack? It’s literally terrorism, especially when the head terrorist leader says they will use nukes against people \nThat’s LITERALLY terrorism!\n\n“Department of Defense Dictionary of Military Terms defines terrorism as: The calculated use of unlawful violence or threat of unlawful violence to inculcate fear; intended to coerce or to intimidate governments or societies in the pursuit of goals that are generally political, religious, or ideological.”",
            "title_similarity": "0.47821462",
            "sentiment_compound": -0.9916
        },
        {
            "id": "hyff8h2",
            "score": 2,
            "text": "I still think one of the NATO countries’ covert ops or some anti-Putin Russians will off him within next weeks. I can’t imagine him coming out of this he’ll alive.",
            "title_similarity": "0.59693575",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyfshqi",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.09147855"
        },
        {
            "id": "hyfuqsd",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hygctwr",
            "score": 1,
            "text": "You can help with your economic vote and Canada will match your donation\r  \n\r  \nhttps://www.redcross.ca/\r  \n\r  \nhttps://www.theglobeandmail.com/canada/article-canada-plans-to-match-individual-donations-to-red-cross-for-ukraine/",
            "title_similarity": "0.51111495",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyh8h6t",
            "score": -1,
            "text": "I mean cool but it's kind of bullshit to stand by just because someone is not in the club but supports everything you stand for. Meanwhile you lose ground when or if Ukraine is overtaken. Then you have a bigger shit show and give Russia control of that energy sector",
            "title_similarity": "0.5756988",
            "sentiment_compound": -0.8604
        },
        {
            "id": "hyf5dnr",
            "score": 6,
            "text": "Wow this is going down fast. History: hold my beer",
            "title_similarity": "0.2497052",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hyf8sds",
            "score": -18,
            "text": "\"has been activated as a defensive measure in response to bad PR for standing by and doing nothing while Ukraine is overrun.\"\n\nfixed it.",
            "title_similarity": "0.6252847",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyfi81y",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.09147855"
        },
        {
            "id": "hyhf39i",
            "score": 0,
            "text": "NATO should of done something against America and its allies when we invaded Iraq off miss information. We killed thousands of innocent people because of lies with no consequences. But somehow we were the good guys...",
            "title_similarity": "0.5327278",
            "sentiment_compound": -0.0
        },
        {
            "id": "hyhmgfz",
            "score": 0,
            "text": "Am I the only one who thinks that NATO should, perhaps, start military action, despite the risks involved? Kremlin needs to be deactivated.",
            "title_similarity": "0.63684726",
            "sentiment_compound": 0.2057
        },
        {
            "id": "hyglcuo",
            "score": -4,
            "text": "European countries need to take the lead on this. France, Germany cmon man what’re y’all waiting on. US can’t do everything.",
            "title_similarity": "0.43655583",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyh5oia",
            "score": -4,
            "text": "Ukraine is not a NATO member nation we don't need war, why die for Danzig.",
            "title_similarity": "0.41813844",
            "sentiment_compound": -0.1911
        },
        {
            "id": "hyfkisz",
            "score": 3,
            "text": "I wish NATO would allow some if its soldiers if they want to \"volunteer\" unofficially in Ukraine. Seems like the right thing to do, under the circumstances.",
            "title_similarity": "0.60356665",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hyfxr23",
            "score": 2,
            "text": "Why? Ukraine isn't even in NATO. And if we are going to protect them. Let's vote them in first. Who cares some old people 30 years ago said we wouldn't let Ukraine in. Times change. People in power cha..... nevermind I'll shut up",
            "title_similarity": "0.5686753",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hyg0gpm",
            "score": -1,
            "text": "“Please prepare to stand, watch and do nothing.”",
            "title_similarity": "0.2586956",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyg6jrl",
            "score": 3,
            "text": "To sit at their bases and do nothing. No sanctions on gas. China can make up tech sanctions easy. Italy and Germany are blocking taking away SWIFT. \n\nNATO will huff and puff....then quietly take back sanctions and do jack all",
            "title_similarity": "0.41021615",
            "sentiment_compound": 0.5749
        },
        {
            "id": "hygrign",
            "score": -1,
            "text": "It’s time to take Russia down once and for all. Putin thinks he’s going to reestablish the former Russian empire. He will not succeed and within a decade there will be someone else running Russia. It’s time for america to test our space weapon and show the world that they have no chance against us.",
            "title_similarity": "0.6443013",
            "sentiment_compound": -0.6776
        },
        {
            "id": "hyfgbr7",
            "score": -14,
            "text": "Aaaaaaaand still the Ukraine will be ignored while the West makes tsk tsk noises.",
            "title_similarity": "0.4053234",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyfk1oz",
            "score": -7,
            "text": "I want Putin to make a misstep so bad, get NATO to teach him a fucking lesson in geopolitics and war...",
            "title_similarity": "0.5775454",
            "sentiment_compound": -0.8439
        },
        {
            "id": "hyfa9ec",
            "score": 31,
            "text": "Are we generally in agreement that the problem isn't Russia at such, but particularly and specifically Vladimir Putin?\n\nIf so, isn't assassination the best immediate course of action?",
            "title_similarity": "0.51746905",
            "sentiment_compound": -0.1136
        },
        {
            "id": "hyf3er1",
            "score": -32,
            "text": "this is actually pretty fucking horrible on so many levels\n\nFirst of all it shows Nato and its allies KNOW how serious this threat is they KNOW had bad this situation in Ukraine is.\n\nthey KNOW that once Putin takes Ukraine he could very well try to go after a Nato ally country .........but they are going to sit back and do NOTHING as Putin takes over Kiev rumors are missiles are incoming into Kiev any time now.......this situation is esculating rapidly and NATO is going to SIT THERE just because Ukraine is NOT an member and WATCH as Putin takes over the country and ONLY after he sets foot on any of their land.......will they do a god damn thing\n\nby that time Russia might have a better foothold in deploying troops and all  Putin is already threatening other countries already (thus why likely NATO has deployed this)\n\nwhat Putin is doing is bad.  But the worlds lack of response to Ukraine i think is worse.\n\nLet history remember that NATO and its allies are going to sit by and do NOTHING as Ukraine is attacked and ONLY when Putin crosses their line will they do a god damn thing.\n\nthis is shaping up to be something pretty horrible.  and it could have stopped here and now.   Fuck do nothing leadership.",
            "title_similarity": "0.6038141",
            "sentiment_compound": -0.9867
        },
        {
            "id": "hyfk3cn",
            "score": -8,
            "text": "Deterrence to what? They flat out said they aren’t stepping foot into Ukraine which is the only country that actually needs help. Posturing and wasting money.",
            "title_similarity": "0.547858",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygo07x",
            "score": -3,
            "text": "It'd be awesome if this force wasn't predictably compromised of 98% Americans",
            "title_similarity": "0.39475936",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyh06o9",
            "score": 2,
            "text": "THIS IS PUTIN'S WAR, NOT RUSSIA'S. Nearly no one wants the war excrpt the authorities. Thousands of people protested, and a big part was arrested.",
            "title_similarity": "0.49220115",
            "sentiment_compound": -0.9051
        },
        {
            "id": "hyhh9pz",
            "score": -3,
            "text": "It's weird how they can not enter Ukraine and help them, basically because of paper work. \n\nPeople are dying, but on paper, Ukraine is not a \"real\" member of NATO. Read-only permissions.",
            "title_similarity": "0.42570645",
            "sentiment_compound": 0.128
        },
        {
            "id": "hyfkq6d",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.09147855"
        },
        {
            "id": "hygfvua",
            "score": 1,
            "text": "I love the way Biden justifies moving troops forward. Well-played.",
            "title_similarity": "0.33621812",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hygxvc3",
            "score": -1,
            "text": "Ooh, a parade. Now you see why Finland and Sweden think NATO is merely a costly circus that can't do shit when it's time for action.",
            "title_similarity": "0.46585703",
            "sentiment_compound": 0.3662
        },
        {
            "id": "hyg66vv",
            "score": 2,
            "text": "They are standing by to send a withering amount of thoughts, love and prayers to the good people of Ukraine via Facebook, WhatsApp and Twitter. I heard it’s going to be a called Operation Twitzkreig!",
            "title_similarity": "0.55832076",
            "sentiment_compound": 0.8122
        },
        {
            "id": "hygpre4",
            "score": -5,
            "text": "What a fucking joke. NATO is a joke. We ALL know that what's happening in Ukraine is WRONG. On all levels. Bombing civilian buildings, hospitals, kindergartens. \n\nAnd NATO sits with their hands up their asses. \n\nPressure NATO. To recognize Ukraine as a member immediately!\n\nhttps://www.change.org/NatoUkraine",
            "title_similarity": "0.5625263",
            "sentiment_compound": -0.3883
        },
        {
            "id": "hygdb5o",
            "score": -5,
            "text": "For the third time in recent memory, the West has proven itself to be ruled by cowards and hypocrites. You’d think we would have learned. Do something about him, he will not stop so long as he thinks he can get away with it.",
            "title_similarity": "0.44582477",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hygpsex",
            "score": 0,
            "text": "This is all great and flowers, but they aren’t going to send them to Ukraine to help with invasion :/ they just defend eu countries",
            "title_similarity": "0.5221139",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hygwmid",
            "score": 1,
            "text": "I'm surprised at how eager are people of an armed conflict between Russia and NATO. \n\nEverything is fun and games until the first idiot throws a nuclear head, and then everything is over. \n\nFucking kids.",
            "title_similarity": "0.5513731",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyfbq7m",
            "score": 32,
            "text": "I am pretty sure I saw Russian combatants just over the border, in Poland. NATO should square up. The US can't act unilaterally, but if NATO said go, well...",
            "title_similarity": "0.65980273",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyi7q2w",
            "score": -6,
            "text": "Outrage as Russia invaded Ukraine. Support and applaud as UK and USA invade Iraq Syria Libya and Afghanistan. Financial support for Israel as it occupies palestine. Fighting back invaders in Ukraine hailed as heroes but Terrorists in other countries. Double standards with selective empathy",
            "title_similarity": "0.6384541",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hyfi4q8",
            "score": -10,
            "text": "what is this gonna do? nothing. Russia will take control of  Ukraine and there is nothing the rest of the world can do to stop that. Putin knows this and that's why he went ahead with it. nothing will stop him. sanctions are nothing but a slap in the wrist to him as his elite. he knows that hurting Russia even more financially will mean the rest of the world will be hurt financially too. he is playing that card.",
            "title_similarity": "0.5869872",
            "sentiment_compound": -0.8304
        },
        {
            "id": "hyfg0ze",
            "score": 3,
            "text": "This doesn’t mean much.. yet. It’s more of a PR announcement. It means mostly that NATO’s military wing is now under a unified command and the focus of the Alliance is now on a specific region. But there won’t be a movement in Ukraine and mostly they will do some positioning for posturing and of course monitoring the movements of the Russian army. Very few countries have operational capacity of the scale needed though and even less actual combat experience. \nThe US of course, France, the UK and also Greece and Turkey.\nIt’s impossible for Greece to mobilize troops in that region in numbers beyond well.. symbolic and probably the same is true for Turkey as well, even ignoring the tension and issues between the two nations. \nThe missile and ballistic shield and array stationed in Eastern Europe is the key issue.",
            "title_similarity": "0.57999766",
            "sentiment_compound": 0.1575
        },
        {
            "id": "hyfl4re",
            "score": -3,
            "text": "Bitch, shoulda done that yesterday.",
            "title_similarity": "0.3615121",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hyfmq5f",
            "score": -3,
            "text": "Maybe this is them moving troops in preparation for a “peace keeping” mission into Ukraine.  Not saying that’s the case, but does anyone truly believe we are getting the complete story?   They could be doing a “Russia” too.   I hope not, because that would really be bad (WW3), but really what’s the end point with this?  I mean the Russians are already taking over Ukraine and Russia already said if Finland or Switzerland try or join NATO there would be consequences.  Putin is not going to stop. What’s next? he feels threaten by Poland or any other NATO alley near Russia and invade? .  Better try to stop him now than later I guess.",
            "title_similarity": "0.6990504",
            "sentiment_compound": 0.7411
        },
        {
            "id": "hygrr65",
            "score": 3,
            "text": "Please fucking do something nato help Ukraine",
            "title_similarity": "0.62147593",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyhcd92",
            "score": -3,
            "text": "He hasn't shown aggression outside Ukraine.  Wtf is NATO doing. Sanctions don't matter. They got china. Enemy of enemy kinda of shit",
            "title_similarity": "0.46495128",
            "sentiment_compound": -0.9233
        },
        {
            "id": "hyewq8c",
            "score": 146,
            "text": "No, NATO still isn't helping Ukraine since its not a NATO country.",
            "title_similarity": "0.36376095",
            "sentiment_compound": -0.2235
        },
        {
            "id": "hyf1mtj",
            "score": -28,
            "text": "Here's a crazy thought: what if nato is gearing up for a surprise counter offensive against Russia? If that was the case, they certainly wouldn't say it. In fact, they would say the exact thing they're saying now, the exact thing putin was saying up until he invaded Ukraine. I doubt that's what actually happening, but damn it would be crazy",
            "title_similarity": "0.687618",
            "sentiment_compound": -0.8338
        },
        {
            "id": "hyf9kyf",
            "score": -7,
            "text": "And just like that wwIII began",
            "title_similarity": "0.25551367",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyfpw5x",
            "score": -8,
            "text": "It's starting to sound like NATO's plan is to let every authoritarian government they can find with a military get geared up for war and do what they want while they watch from the sides and act surprised\n\nEDIT: I dunno, I'm not great at putting thoughts into words, but i kinda just think that once the rest of the world sees Russia just get away with whatever like they've been doin with Crimea, i think Georgia too if i remember correctly, and now Ukraine, then China might just go \"welp, Taiwan is ours now\" for example",
            "title_similarity": "0.6302597",
            "sentiment_compound": 0.2507
        },
        {
            "id": "hygc3ot",
            "score": 7,
            "text": "They need to move faster. People of Ukraine are being murdered",
            "title_similarity": "0.5051265",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hyfl87o",
            "score": 0,
            "text": "How fucking crazy would it be to have a fucking nuke go off on a city in present day.. I can’t even imagine 1 let alone hundreds/thousands.",
            "title_similarity": "0.3607021",
            "sentiment_compound": -0.5709
        },
        {
            "id": "hyfmvvf",
            "score": 0,
            "text": "The first time they've done so defensively, maybe.  But surely they organized to this level for Yugoslavia and Afghanistan and Libya",
            "title_similarity": "0.5655934",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hyfpuq8",
            "score": 0,
            "text": "That’s one crazy time to be alive",
            "title_similarity": "0.19650717",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyfsw9b",
            "score": 0,
            "text": "Yay!!!! Urkraine has a chance now. Let’s gooooo",
            "title_similarity": "0.26478255",
            "sentiment_compound": 0.7627
        },
        {
            "id": "hyfwemp",
            "score": 0,
            "text": "So what happens now ? Is this the part where the madman starts nuking stuff ?",
            "title_similarity": "0.303156",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfycno",
            "score": 4,
            "text": "Putin has verabally threatened the world in his speech yesterday.  NATO should go in to repel Russian forces from Ukraine to contain the threat.",
            "title_similarity": "0.76050866",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hyg6ji7",
            "score": -4,
            "text": "Why is NATO so slow ?  Did ppl have to die for them to take this seriously??",
            "title_similarity": "0.35281798",
            "sentiment_compound": -0.7442
        },
        {
            "id": "hygcult",
            "score": -5,
            "text": "Nuclear war here we come! Putin doesn't bluff",
            "title_similarity": "0.47539353",
            "sentiment_compound": -0.636
        },
        {
            "id": "hygxs71",
            "score": 0,
            "text": "Isn't it technologically feasible to cover ALL borders from ALL nuclear risk area with drones/air forces and prevent a nuke from ever leaving the borders of wherever it was launched from?  Surely monitoring every square inch of these borders, however massive, can be done and with added automation as necessary for disabling said nukes.\n\nNever allow anyone to use a nuke EVER again.  That's what we all need to be going for.",
            "title_similarity": "0.58318913",
            "sentiment_compound": -0.3326
        },
        {
            "id": "hyh6wen",
            "score": 4,
            "text": "NOT SOON ENOUGH!  Nato and biden,boris,macron germany all allowed this to happen!! Churchill rolling in his grave while traitor trump licks his master boots.. !",
            "title_similarity": "0.42638072",
            "sentiment_compound": -0.5815
        },
        {
            "id": "hyh7cb9",
            "score": -3,
            "text": "Too little too late.  Russian won’t care.  NATO won’t even defend Ukraine, no way they will invade Russia.  And the Russians won’t invade another nation until Ukraine is fully wrapped up.  This is just a political move so people think they are actually helping but an empty gesture.",
            "title_similarity": "0.600325",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hyhib00",
            "score": 0,
            "text": "Imagine Bitcoin was invented by Russians and investors are funding their war against Ukraine… that would suck.",
            "title_similarity": "0.6625242",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hyjgv89",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hylghh5",
            "score": 0,
            "text": "Please try not to link CNN, but instead look for an AP article or something similar.",
            "title_similarity": "0.2980833",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hyg1om2",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hygpg2x",
            "score": -5,
            "text": "So regular NATO is there for what then? Passing the buck if the little NATO office fails? What a farce.",
            "title_similarity": "0.47647572",
            "sentiment_compound": -0.6804
        },
        {
            "id": "hyfnt10",
            "score": 11,
            "text": "Good strategy to move 2/3s of your military in hostile territory with an open flank to the North where a better equipped army is sitting \n\nPutin is such a genius….",
            "title_similarity": "0.641972",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyfrdmk",
            "score": 5,
            "text": "If WW3 starts, it doesn't end until Russia is glassed into oblivion.",
            "title_similarity": "0.5115744",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfwfwf",
            "score": 6,
            "text": "Every single I become more and more afraid for the Ukrainian people and the safety and security of Europe as a whole. Every minute a war rages on between Ukraine and Russia, seemingly as Russia has no plans to stop. We don't know if Ukraine will still be a country by the end of the week. And whose to say what happens afterwards... Will a WWIII break out? Will nuclear weapons be used? Is this the final frontier of humanity? All of this scares me and stresses me out even more...\n\nI'm an teenager born an American and proud to be an American. And I want to live to see the birth of my children at one point and to raise a family. I want to be able to live my life to the fullest before I go. I don't want that to all be stripped away from me and my family all because of one man's greed. It terrifies me to think that people like Putin exist. And his actions will affect us all. Russia has already massacred so many of the Ukrainians, the people who stayed to defend their land and country. Will their lives be in vain? Will it all be for nothing?\n\nWhen will these men learn that the actions they commit hurt millions of people... We hurt our generation and we hurt the generations after us. Holding the guilt and blunt of the aftermath. We hurt our children make life harder for them to live happily. When will they see that we're all killing our own kind and violence is never the answer. That's to say if Putin even realizes it. Before it's too late.\n\nSo we stand here today, scared and afraid as time ticks. People dying and injured every second, a war raging on and history being made. I hope that my future will still look bright and I will live to tell the tale. And for Ukraine, I pray strongly that God be by their side and fuel their strength and ambition to push Russia out. I pray NATO and the European leaders will stand up against Putin and stop him from capturing the rest of Ukraine and Europe.\n\nMay God be with us all",
            "title_similarity": "0.6234255",
            "sentiment_compound": -0.985
        },
        {
            "id": "hygtpuw",
            "score": -6,
            "text": "🥱\n\n**N**o **A**ction **T**alk **O**nly.",
            "title_similarity": "0.1966854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyh81qf",
            "score": 7,
            "text": "Can't fucking believe people are cheering for escalation. Like dude your house is going to get nuked.",
            "title_similarity": "0.44700992",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hyh1qi6",
            "score": -13,
            "text": "What's about NATO's encroachment into Ukraine that's been building since the US-backed coup in 2014? Putin would have to be an idiot to allow NATO any more expansion than it already had.",
            "title_similarity": "0.6794972",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyf1k7f",
            "score": -1,
            "text": "Did they rebrand this NATO \"Response Force\" since 1999? Or am i just misreading the title?",
            "title_similarity": "0.5129721",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfo91f",
            "score": -1,
            "text": "They sitting at the worst nuke disaster.  An claimed it",
            "title_similarity": "0.3540707",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hyfp9ox",
            "score": -1,
            "text": "As Trump said,\" oh wonderful!\"",
            "title_similarity": "0.30307",
            "sentiment_compound": 0.6114
        },
        {
            "id": "hyfrnwy",
            "score": -1,
            "text": "Edit: on a serious note, this is interesting. I hope it's the start of a broader coalition against armed incursion for profit.",
            "title_similarity": "0.48000246",
            "sentiment_compound": 0.802
        },
        {
            "id": "hyft0ve",
            "score": -1,
            "text": "McGonagall vibes",
            "title_similarity": "0.14903839",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfw0v4",
            "score": 1,
            "text": "So, NATO is officially sending troops to Ukraine?",
            "title_similarity": "0.7923765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfwdns",
            "score": 1,
            "text": "I figured it out.\nCorona Is going to give us the zombies that we were promised.\nBut it needed the new variant  to get the extra kick of nuclear radiation\nSo world war III will mutate the new Corona variant\nBoom there's our zombies",
            "title_similarity": "0.53325105",
            "sentiment_compound": -0.7199
        },
        {
            "id": "hyfwmbu",
            "score": 1,
            "text": "we’ve been re-re-watching the avengers so this is kinda the same right? NATO ASSEMBLE!",
            "title_similarity": "0.56235564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfx5q9",
            "score": -1,
            "text": "I wonder why this was the first time it was activated, and not when Israel invaded surrounding countries",
            "title_similarity": "0.41569892",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfx7xs",
            "score": 1,
            "text": "C'mon man, Elden Ring just dropped. Chill.",
            "title_similarity": "0.29375166",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfzspr",
            "score": -1,
            "text": "Yes! NATO forces are being activated, all of you kiss your two mommies and daddies.... But yeah this means jack all since they're just as useful as a fridge in the artic.",
            "title_similarity": "0.46428978",
            "sentiment_compound": 0.8655
        },
        {
            "id": "hyg0ew5",
            "score": 1,
            "text": "So COVID is off the table for good?  No we get to dodge WW III?",
            "title_similarity": "0.36156282",
            "sentiment_compound": 0.264
        },
        {
            "id": "hyg3r3g",
            "score": 1,
            "text": "And that force will just sit there. Along with other NATO forces.\nThere is nothing any external force can do to prevent the disaster unfolding in Ukraine and in Russia itself. \nMany many people, soldiers and innocent bystanders are going to die. War is death, destruction and unrelenting misery.\nThis situation will drag on and on and on.\nPerhaps the Real challenge for NATO is in how not to get caught up in it \nArguably the swift imposition of sanctions may have accelerated the invasion. And it is not as if Russia did not see the sanctions coming. So it is naive to assume that Russia is not prepared to deal with them.\nPerhaps the only possible path to stopping this death and destruction route lays in Russia itself.",
            "title_similarity": "0.57865286",
            "sentiment_compound": -0.9886
        },
        {
            "id": "hyg4ug6",
            "score": -1,
            "text": "This move is comparable to putting a condom on just to masturbate.\n\nEDIT: Why the downvotes? You'all know this is just an exercise AT MOST, as well as you know that NATO has no balls to confront Russia physically. They pushed Ukraine in this position and currently are playing dumb.",
            "title_similarity": "0.5603335",
            "sentiment_compound": -0.3238
        },
        {
            "id": "hyg9j0c",
            "score": -1,
            "text": "It won’t be me they ask to go to war; it’ll be my doctor wife, and that’s terrifying to me",
            "title_similarity": "0.42848718",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hygd96a",
            "score": 1,
            "text": "They're on vacation don't worry :)",
            "title_similarity": "0.14531824",
            "sentiment_compound": -0.0191
        },
        {
            "id": "hygkgfd",
            "score": 1,
            "text": "This force is fairly new, and they've been activated in parts before.  They've worked on disaster relief before, which might be what they will do here.",
            "title_similarity": "0.42968178",
            "sentiment_compound": -0.25
        },
        {
            "id": "hygmymw",
            "score": 1,
            "text": "Can someone please explain to me why no one is willing to go into Ukraine? In layman’s terms please???",
            "title_similarity": "0.5167155",
            "sentiment_compound": 0.5204
        },
        {
            "id": "hyguu40",
            "score": -1,
            "text": "Maybe China will invade Russia",
            "title_similarity": "0.5301927",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygv1cb",
            "score": 1,
            "text": "Russia better Stop or I'll have to get involved",
            "title_similarity": "0.47459352",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hygvm5j",
            "score": -1,
            "text": "Wouldn’t it be great if Germany actually paid their membership fees to nato so their troops would be fully supported? Five thousand helmets- really?",
            "title_similarity": "0.5326675",
            "sentiment_compound": 0.7937
        },
        {
            "id": "hyh2p4z",
            "score": 1,
            "text": "how do i join the resistance?",
            "title_similarity": "0.317048",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyh62xf",
            "score": 1,
            "text": "So are the policing nations going to wait 3 years and once Putin has taken more countries , then we come in and help?  It’s the WWII playbook all over again.",
            "title_similarity": "0.55360985",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyh6aab",
            "score": 1,
            "text": "What a joke, so they are just going to sit outside of Ukraine and watch all the bad shit without helping",
            "title_similarity": "0.38875136",
            "sentiment_compound": -0.7775
        },
        {
            "id": "hyhd52o",
            "score": -1,
            "text": "If you are born in a territory or commonwealth you are a us citizen.  US Virgin Islands are a territory.  St Thomas, St Croix and St John",
            "title_similarity": "0.3812687",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyhee9h",
            "score": 1,
            "text": "The response force is only 16 years old or so. First time ever makes it sound like it's been around forever.",
            "title_similarity": "0.33015662",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyhqojg",
            "score": -1,
            "text": "Yes we’ll rally around the flag, all, wherever it may wave!\n\nShouting the battle cry of freedom!\n\nFrom the Old World, tried and true, to the New World, ever brave!\n\nShouting the battle cry of freedom!\n\nFor freedom forever!\n\nHuzzah, all, huzzah!\n\nDown with the tyrants!\n\nUp with the Star!",
            "title_similarity": "0.4263865",
            "sentiment_compound": 0.9227
        },
        {
            "id": "hyild4l",
            "score": 1,
            "text": "They won’t help though, watch",
            "title_similarity": "0.126387",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyj12fd",
            "score": 1,
            "text": "Maybe we can teach the Russians how to drive peacefully. I dare you to watch Russian dash cam videos on YouTube. It will make you scared to drive!!!",
            "title_similarity": "0.4802391",
            "sentiment_compound": 0.3348
        },
        {
            "id": "hyftt43",
            "score": 7,
            "text": "GOOD.\n\nWe cannot have regimes like this on the planet. We've all been through enough. Total war? No fucking thanks. I really hope Russia's defeat sends a strong signal to every other despot.",
            "title_similarity": "0.5959989",
            "sentiment_compound": -0.56
        },
        {
            "id": "hyf46th",
            "score": -14,
            "text": "Is anyone else onboard with or expecting tactical nukes? Just keep it in Europe.",
            "title_similarity": "0.41731858",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfpl12",
            "score": 22,
            "text": "Dude missin lol All of that progress he made, getting Trump elected and punching America in the nuts, just to go suicidal. Boy miss his meds?",
            "title_similarity": "0.40403908",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hygm8gj",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hyf8kyk",
            "score": -16,
            "text": "I think Russia should sign a peace agreement And NATO should remove some sanctions. After that both sides need to have a very long talk about what has transpired over the past 3 months. We hope for the best when it comes to our planet.",
            "title_similarity": "0.6470959",
            "sentiment_compound": 0.93
        },
        {
            "id": "hyfjn3h",
            "score": -2,
            "text": "Do u think ww3 can start ?",
            "title_similarity": "0.258196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfu0y2",
            "score": 2,
            "text": "Putin's bunghole is now puckered. Keep it puckered.",
            "title_similarity": "0.37869638",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfyd1w",
            "score": -2,
            "text": "Oh im Ivan thanx no Im American  German protesting",
            "title_similarity": "0.41932014",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hyg93b4",
            "score": 2,
            "text": "Putin has been free all these years to encourage other countries to voluntarily become his allies. That's how NATO works. Apparently Putin has to attack and subjugate any free country he wants for an \"ally\".",
            "title_similarity": "0.6259964",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hyga7of",
            "score": 2,
            "text": "Who needs NATO? The world.",
            "title_similarity": "0.52316105",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygg2mm",
            "score": 2,
            "text": "This is kinda worrisome. There is no way Russia can win a war against NATO without resorting to Nuclear weapons. \n\nBefore anyone starts with the whole MAD stuff. Russian military considers a draw the same as a win",
            "title_similarity": "0.63173264",
            "sentiment_compound": -0.7744
        },
        {
            "id": "hygh4ih",
            "score": 2,
            "text": "What fucking good is that gonna do.\n“Oh we’re assembling alright, but we’re not gonna fight.”\nWe’re just gonna stand there and look reaally reeeaaalllyyyy scary.\nWtf",
            "title_similarity": "0.44783735",
            "sentiment_compound": -0.8361
        },
        {
            "id": "hygh8uo",
            "score": 2,
            "text": "It’s 1914 all over again",
            "title_similarity": "0.3144167",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygjvet",
            "score": 2,
            "text": "The NATO force sounds like we just revealed our power rangers each ally has. I kinda dig it",
            "title_similarity": "0.56311226",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hygooji",
            "score": -2,
            "text": "Do Only Good Everyday",
            "title_similarity": "0.1258854",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hygqeo6",
            "score": -2,
            "text": "And now nukes will be involved, for fuck sakes.",
            "title_similarity": "0.4331419",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyguvzh",
            "score": -2,
            "text": "Can’t wait to see Steve Carell in this!",
            "title_similarity": "0.32159308",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygwx0t",
            "score": 2,
            "text": "Take your time, folks, no big hurry. Just a few lives and democracy on the line here.",
            "title_similarity": "0.2186355",
            "sentiment_compound": -0.296
        },
        {
            "id": "hygxtap",
            "score": 2,
            "text": "Good news.  Because Putin is toxic, like Trump?   Like how may citizens in Russia even agree with this war moves?    Bottom line it is all frightening !  Clearly I do not have an answer.  I fear for all.",
            "title_similarity": "0.57185066",
            "sentiment_compound": 0.351
        },
        {
            "id": "hygy1of",
            "score": 2,
            "text": "NATO isnt going to do shit but posture. Russia is not going beyond Ukraine.",
            "title_similarity": "0.52396744",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hygy2k5",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.09147855"
        },
        {
            "id": "hyh8wx3",
            "score": -2,
            "text": "This is it. World War 3",
            "title_similarity": "0.37509394",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyhm26n",
            "score": -2,
            "text": "IMPOTENCE.  It really seemed like there should be an \"I\" in NATO.",
            "title_similarity": "0.4737826",
            "sentiment_compound": 0.4173
        },
        {
            "id": "hyhrge9",
            "score": 2,
            "text": "Nothing. Just nato pretending like they’re doing something.",
            "title_similarity": "0.30851135",
            "sentiment_compound": 0.2969
        },
        {
            "id": "hyiyyap",
            "score": 2,
            "text": "This is a test btw. If we don’t show up in force now, it’ll show Russia exactly how strong or weak we are. If we are too weak to combine, he will invade again, if we are United he won’t.\n\nPosturing seems stupid, but it can prevent wars",
            "title_similarity": "0.5657066",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hyg5pkk",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hygqt5y",
            "score": -11,
            "text": "I thought this was news till I saw CNN 🙄",
            "title_similarity": "0.36844593",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyf8ig1",
            "score": -3,
            "text": "So we don't know how large or small the force will be.  And it's only been placed on alert, not actually activated.  And we know the force will not fight in the Ukraine.  Here's what Putin hears: a small troop of girl scouts will be watching Russia win the war in the Ukraine.  Could we have made an emptier threat?",
            "title_similarity": "0.63683563",
            "sentiment_compound": -0.2062
        },
        {
            "id": "hyflryl",
            "score": 2,
            "text": "democracies giving hoards of money to autocrates thinking this is good....imagine all the billions Europa has given Putin buying gas and petrol....stupid is as stu.........",
            "title_similarity": "0.4080046",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyfngma",
            "score": 4,
            "text": "Putin became little hitler https://youtu.be/9-axJTzj0VU",
            "title_similarity": "0.40501198",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfyewg",
            "score": -2,
            "text": "Defense? Why aren't we in there to help Ukraine?",
            "title_similarity": "0.5747154",
            "sentiment_compound": 0.5514
        },
        {
            "id": "hyg81zf",
            "score": 3,
            "text": "This essentially does nothing for Ukraine..it’s just a headline and makes it seem like nato is doing something",
            "title_similarity": "0.5083546",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hygeurj",
            "score": -2,
            "text": "NATO response force?  I don't think Putin will fear anything unless we put the cub scouts on alert",
            "title_similarity": "0.54276544",
            "sentiment_compound": -0.25
        },
        {
            "id": "hygj9av",
            "score": 2,
            "text": "Please tell me NATO Response Force is a lame name for two dozen soldiers in uniquely specialized, fully functional, Iron Man suits.",
            "title_similarity": "0.41704732",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyglfmw",
            "score": 4,
            "text": "This sounds like a ww3 declaration.\n\nI can't say enjoyed my life very much.",
            "title_similarity": "0.23000541",
            "sentiment_compound": -0.0521
        },
        {
            "id": "hygxlbi",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hyhllxe",
            "score": -4,
            "text": "Activated then what.  NATO is proving to be chickens",
            "title_similarity": "0.33764014",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyg0hmy",
            "score": 6,
            "text": "So what this means is that NATO is deploying their immediate response force to an impending threat. This does not in any way mean they will be deployed to Ukraine being that Ukraine is not a NATO Ally.\n\nNRF or NATO Response Force is sort of like a discount Special Forces but with more of a focus on defensive tactics and providing military support to a country or countries who can't provide a fast enough response. They aren't typically called for countries with an established military or for engagements where the NATO Ally far outweighs the other in military capacity.\n\nIn this case, NATO is deploying them in response to the impending threat against Poland and other neighboring NATO Allies around Ukraine. Unfortunately what that means is that Ukraine will not benefit from this in any way. I hate to say it, but this is a publicity stunt and it shows in how vague it is on details.",
            "title_similarity": "0.66243017",
            "sentiment_compound": -0.9139
        },
        {
            "id": "hyg966w",
            "score": 4,
            "text": "Remember when last year NATO was questioned to exist or not because everything seemed chill with Russia? Glad that didn’t happen.",
            "title_similarity": "0.5751678",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyghzpn",
            "score": 3,
            "text": "I’m not worried about Putin winning this campaign… I’m worried about him losing it. He’s fucking 70, he’s an ego maniac,  he’s going to lose his biggest endeavor… and he can fire hundreds of nukes if he wants. That’s the terrifying part.",
            "title_similarity": "0.4371862",
            "sentiment_compound": -0.8863
        },
        {
            "id": "hygj1cc",
            "score": -5,
            "text": "Trash talk ok you a poop",
            "title_similarity": "0.08288628",
            "sentiment_compound": 0.296
        },
        {
            "id": "hygj957",
            "score": 4,
            "text": "If Putin is getting his ass kicked by Ukraine, imagine NATO. Russia's military is literally inept. The Fins proved it way back in the day during the Winter War. When your military strategy is to throw your men at the enemy till you win it says a lot.",
            "title_similarity": "0.6834826",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hygtzvw",
            "score": -5,
            "text": "Glad they just let them invade and get a foothold in Ukraine first",
            "title_similarity": "0.5940189",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hyig5vc",
            "score": 4,
            "text": "Grant membership to NATO to Ukraine immediately",
            "title_similarity": "0.69871557",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyfjnya",
            "score": -15,
            "text": "NATO should back down, I don’t want this world to go nuclear. Still lots of things in this life I want to do.",
            "title_similarity": "0.50307083",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hyg3eh8",
            "score": 15,
            "text": "And NATO is still mulling over Swift? Why is it STILL a \"last resort\"!? How many last resorts are there?\n\nI thank the west for their heavy weapons, funds and training, however this is not enough. We need ALL sanctions immediately. Not tomorrow. Not next week. Immediately.\n\nI don't understand why west isn't moving unmarked special forces into Ukraine like Russia did at the start of 2014 war and then just denying their existence.\n\nIf Ukraine falls. Belarus, Finland, Baltic states, Poland - they will be next! Surely Europe would rather fight in Ukraine than in their own countries!?",
            "title_similarity": "0.6351739",
            "sentiment_compound": -0.8017
        },
        {
            "id": "hyf4lpx",
            "score": 16,
            "text": "Salami tactics https://www.youtube.com/watch?v=o861Ka9TtT4",
            "title_similarity": "0.3352569",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygmwin",
            "score": -15,
            "text": "Biden is a weak wake leader",
            "title_similarity": "0.024151783",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyf7v24",
            "score": -5,
            "text": "Isn’t it funny you can put everyone involved in this on an island and the rest of us could literally continue living but instead a few will decide the fate of everyone.",
            "title_similarity": "0.28187138",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hygeigg",
            "score": 6,
            "text": "Maybe now would be a good time for the fence sitter nations to join NATO.",
            "title_similarity": "0.5288327",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hygu338",
            "score": -4,
            "text": "Turkey should leave NATO. This a European problem.",
            "title_similarity": "0.42380738",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hygz5e5",
            "score": -6,
            "text": "Is it just me or is anyone else getting Tom Clancy story like vibes from all of this?  All we need now is a provocation by a rogue Russian (or Russian allied) general on Nato leaving us on the precipice of WW3, a failed military coup in Russia with leaves Putin dead and a new more Western leaning person ending up as leader of Russia who orders the immediate stand-down and withdrawal of all Russia military forces while in the background, a team of US CIA special forces hunt down and take out the rogue general.",
            "title_similarity": "0.6245995",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyfoj0f",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hyfvn9j",
            "score": 18,
            "text": "Pretty badass, not going to lie. Yes I’m against all war for the most part but come on, it’s like all the world was like, “yo time to roll up on this bitch Putin. Dudes crossed the line homies.” I like the unity. \n\nStay strong Eastern Europe",
            "title_similarity": "0.51392615",
            "sentiment_compound": 0.8462
        },
        {
            "id": "hyfw2xz",
            "score": 6,
            "text": "And Rohan will answer",
            "title_similarity": "0.21026385",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyhy8lh",
            "score": -6,
            "text": "Nato still licking usa ass...",
            "title_similarity": "0.2998918",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyfdb9a",
            "score": 22,
            "text": "Can NATO plan and carry out counter offensive measures into Russia? Or can they only operate in defense?",
            "title_similarity": "0.67618597",
            "sentiment_compound": -0.4329
        },
        {
            "id": "hyf0gml",
            "score": 77,
            "text": "Please give the response swift wings and guide them true to aid and stand side by side with the Ukrainian patriots repelling this misguided Russian incursion.",
            "title_similarity": "0.67771155",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyfxr9y",
            "score": 7,
            "text": "Mitt Romney fucking called it.",
            "title_similarity": "0.33224738",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygb53p",
            "score": 7,
            "text": "just thinking, how much of the Russian Military is in Ukraine now? Can't ALL of Europe just bum-rush Putin's palace right now? A quick cheeky lil' assassination attempt and viola! \\*chef kiss\\*",
            "title_similarity": "0.62080723",
            "sentiment_compound": -0.4122
        },
        {
            "id": "hyfzy6w",
            "score": 8,
            "text": "This feels like tip towing around a fire that everyone is afraid to put out. This will all be pointless if Ukraine is lost",
            "title_similarity": "0.38402575",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyggvry",
            "score": 8,
            "text": "I find it interesting they specifically mention Sweden and Finland. \n\n\"We were joined today by our close partners Sweden, Finland, and the European Union,\"\n\nThat's a direct fuck you to Putin in my opinion.",
            "title_similarity": "0.5684406",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyfc0j3",
            "score": 73,
            "text": "Does this mean that because Ukraine isn’t a member of NATO, that’s the only thing holding back World War III?",
            "title_similarity": "0.6197595",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyg6tz2",
            "score": -28,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hyfqy4d",
            "score": -9,
            "text": "Yea slept while Israel india n China fuck shit up and woke when Russia goes to war? Lol",
            "title_similarity": "0.40682793",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hyfndws",
            "score": 151,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hyey5i9",
            "score": 4147,
            "text": "The response from western nations and NATO has been slow. To their credit, the sanctions have been harsh, but it's just too little and so disjointed.\n\nWhile this is a promising development from NATO, it does not mean that these forces will enter Ukraine to assist their efforts to fight Russia. It simply means that they are mobilized in defense of NATO allies. \n\nMy hope is that in the coming 24-48 hours, Russia will be removed from SWIFT and more military support will be incoming to Ukraine. [Putin has made his goals clear](https://www.washingtonpost.com/politics/2022/02/25/words-deeds-putin-shows-hes-rejecting-even-soviet-era-borders/), and [he's not going to stop with Ukraine](https://www.cbsnews.com/news/russia-ukraine-vladimir-putin-antony-blinken-soviet-bloc-expansion/). Letting this continue without a more robust response is a fool's errand.",
            "title_similarity": "0.60625064",
            "sentiment_compound": 0.8328
        },
        {
            "id": "hyfte5d",
            "score": 53,
            "text": "Being born in the early 70s, I sure have packed a lot of huge events into half a lifetime. \n\nCan we have some big positive events instead of warfare and disease tho?",
            "title_similarity": "0.39674243",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hyftnjf",
            "score": 10,
            "text": "Might be time to play tit for tat and invade Kaliningrad... Using Putlers own justifications.  Coz u know, uhm, 70 years ago, that was Germany.",
            "title_similarity": "0.5500347",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyfz99q",
            "score": 11,
            "text": "Cold War 2 had been announced, why can’t game devs come up with something original instead of remaking the same thing just for a quick money grab",
            "title_similarity": "0.5366994",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hygmyte",
            "score": -11,
            "text": "Europe is weak they never had the stomach for a fight that’s why others always bail them out. Ever meet an EU rep? They are passive people I could slap their wife’s ass and they’d shake my hand and thank me. \n\nUkrainians should be proud they are not NATO.",
            "title_similarity": "0.41525453",
            "sentiment_compound": 0.128
        },
        {
            "id": "hygoc70",
            "score": -12,
            "text": "This could possibly escalate things further. In my opinion, the only safe move is to sacrifice Ukraine.",
            "title_similarity": "0.6088683",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyftrpw",
            "score": 38,
            "text": "Putin overreached massively, here. Ukraine will fight, is fighting. According to various sources, Russian troops and armor are taking big losses - as many as 1,000 Russian casualties in a couple days. Rather than shaking NATO resolve, that resolve is hardening. Public opinion has not been swayed by Russian spin. The longer this goes on, the more likely it becomes that other nations will resort to more than sanctions - monetary and military aid could come. Putin could have started a war to push Russia's border further west, but end up with a divided Ukraine in which the western-aligned portion has an actual NATO and western military presence in country - in other words, another red zone even closer to Russia's border than before. This would be a massive failure, and would likely see others move to push Putin out.",
            "title_similarity": "0.635633",
            "sentiment_compound": -0.8422
        },
        {
            "id": "hyf7s5x",
            "score": 364,
            "text": "It seems we're living in times were decades happen in days.",
            "title_similarity": "0.19265625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygcj0a",
            "score": 41,
            "text": "I dont want to see humanity go down in a nuclear holocaust. But we cannot allow this motherfucker to have his way. If the world does not act strongly enough against him, then it will be a long and steady line of wanna be dictators and strongmen who will follow after. Mayybe it will be China's next, and 20 years from now when some racist prick from Bumfuck Idaho or Africa or some cult leader gets the tech then we're all fucked. The information age is the best defence we have against facism and authoritarianism. When information is freely available to all, then the psycho's behind Fox news or the Great firewall can hold no sway. We've got a long way to go, but if we can teach people to think for themselves, to consider various sources, to have empathy for their fellow humans and just not want to freaking kill each other over ridiculous issues when Earth can support as all if we can work as a team... then there is no limit to what the Human race can achieve.",
            "title_similarity": "0.5188262",
            "sentiment_compound": -0.9653
        },
        {
            "id": "hyex4ei",
            "score": 569,
            "text": "Headline sounds misleading.\n\nIt is in \"response\" to it but to make sure Russia does not go beyond Ukraine to any of the bordering NATO member countries.\n\nThat said, I don't think Putin will do it.  Maybe Mordova since they are not NATO member country.",
            "title_similarity": "0.5791202",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyg3i86",
            "score": 17,
            "text": "God why can’t we all just go home and have a pint. Imagine if everyone just stopped and had a pint with their friends. Put the guns down, drink some beer, enjoy the sunset boys. Oh okay no Putin wants to kill people.. okay then.",
            "title_similarity": "0.26366597",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyfn7r3",
            "score": -20,
            "text": "And this is why nato should have been dissolved in92.",
            "title_similarity": "0.529841",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfjx1v",
            "score": 175,
            "text": "Do we still do defcons?  What defcon are we at?",
            "title_similarity": "0.27061456",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfr2z6",
            "score": 58,
            "text": "You’re damn right people are afraid to step in directly & help. The threat of global nuclear war is a pretty big one.",
            "title_similarity": "0.4636374",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hyf6ohf",
            "score": 235,
            "text": "2/3 of Russia’s land force is invading Ukraine now. Not much in the way between the Baltic states and Moscow.",
            "title_similarity": "0.64647853",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfbgko",
            "score": 1118,
            "text": "\"May you live in interesting times.\"\n\n- A polite Chinese way of saying fuck you",
            "title_similarity": "0.14149523",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyfoas8",
            "score": 105,
            "text": "I'll take the U.S's 750 billion dollar military over the Russian's 48 billion dollar military.",
            "title_similarity": "0.44938838",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfvl50",
            "score": 24,
            "text": "Even if Ukraine loses this war, they’ll make Russia piss and shit blood for decades.",
            "title_similarity": "0.57858276",
            "sentiment_compound": -0.922
        },
        {
            "id": "hyfkslt",
            "score": 451,
            "text": "I'm wondering in all seriousness, if Putin gave the order to launch nuclear missiles if they would actually listen. \n\nBecause Putin may not care about his people or the world at all and be ready to take everyone down with him, but the people under him, the soldiers and launch operators that actually have to do the literal key turning and button pressing? Idk if they would willingly kill their own families/countrymen and plunge the world into a nuclear holocaust.\n\nMy mind goes to the movie Crimson Tide.",
            "title_similarity": "0.53086674",
            "sentiment_compound": -0.8524
        },
        {
            "id": "hyg22pt",
            "score": 30,
            "text": "Bruh I can barely relax anymore. I feel like this entire Ukraine crisis has uncovered some serious issues I have - legit terminally online atm and I never do this. I dunno how to relax at this point",
            "title_similarity": "0.40370977",
            "sentiment_compound": 0.3832
        },
        {
            "id": "hyg80bl",
            "score": 28,
            "text": "It’s almost like Putin was diagnosed with some incurable illness and is going out with a bang.",
            "title_similarity": "0.43670028",
            "sentiment_compound": -0.1263
        },
        {
            "id": "hyfy8k7",
            "score": 74,
            "text": "I mean... it sucks that it has come to this, but this is kinda the point of NATO right? To have a collaborative military force to stomp on the face of nations that are causing a mess.",
            "title_similarity": "0.563931",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hyfk97h",
            "score": 2575,
            "text": "This is Cold War 2.0. The problem is there is no USSR or Communist Party just Putin. If he has gone crazy, the Russians need to stop him now themselves.",
            "title_similarity": "0.6066978",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hyfdw53",
            "score": 83,
            "text": "They are just sending reinforcements to the Baltics and Poland.",
            "title_similarity": "0.5153677",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyf55ay",
            "score": -35,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hyfy5cz",
            "score": 31,
            "text": "I'm starting to hate the phrase \"for the first time ever\" as it's been used quite a bit in recent years, and it's never for something good.",
            "title_similarity": "0.30555257",
            "sentiment_compound": -0.7274
        },
        {
            "id": "hyfnci2",
            "score": 548,
            "text": "Putin is such a dumbass.  He was worried about NATO encroaching on his country, his by invading a sovereign country illegally he has now brought about historic moves by NATO.\n\nI hope the Russian people can see how Putin is no genius, and his foolish moves have brought about death for their neighbors and misery for the Russian people now that the entire world is condemning this and sanctions are going to strangle their economy.\n\nPush Putin into the streets and rip him to pieces like Mussolini was by the Italians.",
            "title_similarity": "0.52242976",
            "sentiment_compound": -0.9062
        },
        {
            "id": "hyg13p2",
            "score": 297,
            "text": "Three tours in Iraq that I didn't want to be a part of. Now I'm out and there's a cause I would be proud to stand for. Damnit.",
            "title_similarity": "0.47901478",
            "sentiment_compound": -0.1336
        },
        {
            "id": "hyggazv",
            "score": 39,
            "text": "Ugh, I preferred the COVID crisis. Can we go back to that please?",
            "title_similarity": "0.23765264",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyf060i",
            "score": 157,
            "text": "Curious if anyone knows -- are there actual \"NATO forces\" or are any troops/materiel actually traditional assets of member state national defense forces?\n\nAnd if so, is there any way a bystander would recognize mobilized troops as belonging to NATO instead of to one member state?",
            "title_similarity": "0.5375389",
            "sentiment_compound": 0.594
        },
        {
            "id": "hyfuulk",
            "score": 162,
            "text": "Real question but maybe stupid: Do you think any unofficial plans for killing Putin is being talked of?",
            "title_similarity": "0.4398613",
            "sentiment_compound": -0.9136
        },
        {
            "id": "hyewnoe",
            "score": 12609,
            "text": "I hoped living through historical events would feel better than this.\n\nEdit to add I recognize most historical events aren’t objectively enjoyable, and that there is absolutely privilege in commenting about this while I am able to be safe. It’s just a fucking shame we as a species don’t learn enough of the right lessons from our past, so that there could be more positive events taking place instead.",
            "title_similarity": "0.31395185",
            "sentiment_compound": 0.9273
        },
        {
            "id": "hyfes9r",
            "score": 1588,
            "text": "In all seriousness..not knowing any of you across the vast ocean behind my computer screen, I truly hope we don't all go down in a burning nuclear ball of flame together. What the fuck is wrong with people? 8 billion people suffer for one mans greed.",
            "title_similarity": "0.37528646",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hyg1if9",
            "score": 45,
            "text": "Hey all you guys that keep saying you’d go back in time and kill Hitler? Yeah, well…",
            "title_similarity": "0.38986856",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyg4ww5",
            "score": 45,
            "text": "Anyone who thinks this is good news for the Ukraine or mobilization of forces to aid them doesn’t understand, this is just nato countries making sure Russia sticks to blowing up the Ukraine and not moving on any nato allies",
            "title_similarity": "0.6994556",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyfme8i",
            "score": 3968,
            "text": "Navy Vet here, I’ve worked with NATO in the Mediterranean theater. It is an absolute awesome sight to see all the nations coming together for a common cause.  Also most of the European navy ships have pubs onboard, which is nice.",
            "title_similarity": "0.3698116",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hyfpcwt",
            "score": 1108,
            "text": "The only way this ends is when Putin is dead.",
            "title_similarity": "0.43146884",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hyewtl7",
            "score": 2243,
            "text": "Wow this is pretty historical isn't it? Can anyone explain the significance of activating this?",
            "title_similarity": "0.29548025",
            "sentiment_compound": 0.8577
        },
        {
            "id": "hyf7fxz",
            "score": 1980,
            "text": "I think it’s pretty clear at this point that Putin is thinking as a Russian Empire admirer as he publicly denounced USSR and Lenin, and said something like “the existence of Ukraine is a  grief mistake caused by Lenin and his Bolsheviks friends” (can’t remember the exact phrase. So he eyeing Finland is not impossible",
            "title_similarity": "0.5508145",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hyf4vs1",
            "score": 2996,
            "text": "Park then on the Slovakian and polish borders quick before crazy Ivan gets any more bright ideas",
            "title_similarity": "0.45768282",
            "sentiment_compound": 0.2006
        },
        {
            "id": "hyg09vz",
            "score": 2112,
            "text": "No panic guys. We are holding strong. Love from Ukraine",
            "title_similarity": "0.38634685",
            "sentiment_compound": 0.8807
        },
        {
            "id": "hyg1164",
            "score": 145,
            "text": "We need aliens to intervene",
            "title_similarity": "0.38656783",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfohs6",
            "score": 10485,
            "text": "It feels like we’ve been speed-running the entire 20th century.",
            "title_similarity": "0.3942865",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyf3lf4",
            "score": 10450,
            "text": "Even if it is just posturing, that's a pretty big move.",
            "title_similarity": "0.26904243",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyg79qa",
            "score": 189,
            "text": "The Russian military is committing war crimes against Ukrainian civilians",
            "title_similarity": "0.5902605",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hygaiad",
            "score": 459,
            "text": "As a person of Baltic origin, I think it's proper time to acknowledge the US and other NATO troops who are actually pulling through the promises set by NATO treaties.\n\nEstonia has kept its military spending over 2% of GDP year after year because historical events (Molotov-Ribbentrop Pact) which makes people doubtful regarding foreign allies. You can never trust someone 100% to come to your defense at the darkest hour, no matter what they have been saying before.\n\nThus, seeing the troops movements into these frontline countries in Europe, I share my gratitude for the allies who have kept their word. Thank you!",
            "title_similarity": "0.6017925",
            "sentiment_compound": 0.4617
        },
        {
            "id": "hyfhrjt",
            "score": 10418,
            "text": "I wonder if they are doing this in part to force Russia to redeploy troops to the border with nato.\n\nEvery Russian unit sitting at the border or at sea “just in case” is a Russian unit not going to ukraine.",
            "title_similarity": "0.63912106",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfmbta",
            "score": 13972,
            "text": "Relax Putin. It's just a peacekeeping force.",
            "title_similarity": "0.4515824",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyf7j7p",
            "score": 2,
            "text": "Too late, they are trying to talk it over",
            "title_similarity": "0.17640102",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfeogy",
            "score": 1,
            "text": "Time for the aliens in Clarke’s “Childhood’s End” to show up.",
            "title_similarity": "0.3744318",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfjlfb",
            "score": 2,
            "text": "What about the SPFS \nhttps://en.m.wikipedia.org/wiki/SPFS\nArmenia, Belarus, Germany, Kazakhstan, Kyzgryzstan, and Switzerland",
            "title_similarity": "0.38046193",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfjr7z",
            "score": 14,
            "text": "I didn’t even know the NATO Response Force was a thing until today…",
            "title_similarity": "0.56786025",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfm83j",
            "score": 4,
            "text": "Well at least they'll get a good view as their neighbor get attacked.",
            "title_similarity": "0.36639082",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyfo4mw",
            "score": 1,
            "text": "Let's do an extra check on the Minuteman engines as well. We're going to need them.",
            "title_similarity": "0.50941914",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyfoxmd",
            "score": 3,
            "text": "Where can I buy a NATO flag?",
            "title_similarity": "0.449561",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfoyt2",
            "score": 2,
            "text": "I got to see  protest  in Russia poor folks goona die. They did anyway",
            "title_similarity": "0.51227725",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hyfpw9g",
            "score": 1,
            "text": "Wonder what Putin has up his sleeves",
            "title_similarity": "0.39996246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfq6wx",
            "score": 1,
            "text": "What about the EU-Ukraine Agreement? Shouldn't the EU be jumping in right about now?",
            "title_similarity": "0.63234806",
            "sentiment_compound": 0.5514
        },
        {
            "id": "hyfqadu",
            "score": 2,
            "text": "He’s not gonna stop at Ukraine!",
            "title_similarity": "0.46695244",
            "sentiment_compound": 0.2914
        },
        {
            "id": "hyfqbtq",
            "score": 3,
            "text": "when u wish u paid more attention in history class, but too much shit at home made me blinder",
            "title_similarity": "0.33733734",
            "sentiment_compound": -0.6187
        },
        {
            "id": "hyfqd8a",
            "score": 55,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hyfqpnx",
            "score": 3,
            "text": "Ukraine fighting a proxy war for NATO right now is a tragedy, it's been over 2 days with multiple weeks of Intel coming in. As soon as Russia threatened nuclear violence these groups should have been mobilizing. And I suspect beyond NATO's Response Force, there have been other special ops forces deployed around Russian borders. \nIt's possible though that Putin was predicting this kind of response and will be using as justification to his people for using nuclear strikes. Even so all of this is still completely unhinged.",
            "title_similarity": "0.68887055",
            "sentiment_compound": -0.9633
        },
        {
            "id": "hyfrctl",
            "score": 3,
            "text": "Everyone got their Fallout 4 / Metro cosplay ready.",
            "title_similarity": "0.3687526",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyfrmmp",
            "score": 1,
            "text": "what do they mean by the west’s response has been too little? like not enough aid was sent?",
            "title_similarity": "0.23370413",
            "sentiment_compound": 0.3751
        },
        {
            "id": "hyfspuk",
            "score": 1,
            "text": "2021 thought it couldn't be topped. 2022 said sir move aside.",
            "title_similarity": "0.35103685",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfsuyl",
            "score": 2,
            "text": "Wait, so they have only been in offensive measure all these while?",
            "title_similarity": "0.2783211",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyfsvno",
            "score": 1,
            "text": "NATO needs to be ready in case.",
            "title_similarity": "0.45283863",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyft371",
            "score": 1,
            "text": "So this seems like very good news to me, but what exactly does it mean? Does it mean boots on the ground on Polands border or elsewhere, does it mean naval positioning and preparations or what exactly? Just curious as to what extent this announcement means as far as troop deployments or other measures?",
            "title_similarity": "0.5200422",
            "sentiment_compound": 0.7557
        },
        {
            "id": "hyfu6n1",
            "score": 3,
            "text": "I'm imagining a Power Rangers esque montage of a highly skilled, elite warrior group getting into their respective vehicles from all different parts of the world.\n\nSo basically M.A.S.K.",
            "title_similarity": "0.44757876",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyfuw6z",
            "score": 2,
            "text": "Side note: what is this about cyberattacks now triggering Article 5?",
            "title_similarity": "0.38641486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfvh7h",
            "score": 1,
            "text": "When's China gonna start doing the same.",
            "title_similarity": "0.26965684",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfvkt8",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09147855"
        },
        {
            "id": "hyfw0fr",
            "score": 22,
            "text": "What about Swift? Why is it STILL a \"last resort\"!?",
            "title_similarity": "0.25940838",
            "sentiment_compound": 0.351
        },
        {
            "id": "hyfw49b",
            "score": 1,
            "text": "What happens if Russia invades Ireland? They aren’t in NATO and have one of the smallest armies in the world, right on Britains doorstep.",
            "title_similarity": "0.49620327",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfwr65",
            "score": 1,
            "text": "Good, just take a small detour over Ukraine carpet bomb all the Russian positions and just tell Putin one of your planes got lost and got a bit off track.",
            "title_similarity": "0.51780725",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyfwu11",
            "score": 1,
            "text": "what does that mean, exactly?",
            "title_similarity": "0.06273675",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyfxo8s",
            "score": 2,
            "text": "All this talk gives me the sum of all fears vibe...",
            "title_similarity": "0.36558652",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyfy196",
            "score": 11,
            "text": "I don't understand the difference between countries providing Ukraine with guns and ammo and stuff and just directly sending their armies. How is one helping them and its okay but the other is off limits?",
            "title_similarity": "0.5530976",
            "sentiment_compound": 0.2617
        },
        {
            "id": "hyfz64i",
            "score": 2,
            "text": "Is that like space force?",
            "title_similarity": "0.19061223",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyfzbil",
            "score": 1,
            "text": "I have to say...I expected a Russian invasion to be more effective. I'm glad it's not, but they should have captured that whole country by now. Feels like this won't progress.",
            "title_similarity": "0.6253425",
            "sentiment_compound": 0.5545
        },
        {
            "id": "hyfzc42",
            "score": 1,
            "text": "Pretty useless now imo.NATO should have done it long time ago and send troops to Ukraine before Russia invaded,Putin would have never launched full country invasion.He would have just continued using eastern separatist regions for proxy wars and we could have avoided all this mess.",
            "title_similarity": "0.63571423",
            "sentiment_compound": -0.8161
        },
        {
            "id": "hyfziuc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hyfzoi7",
            "score": 7,
            "text": "As the article states, Ukraine is not a part of NATO. This is being done to placate certain member states of the alliance. The U.S. and the Western European countries have made it clear that they are not going to intervene militarily, and it is extremely doubtful that they will impose really painful sanctions, of the sort that will really hurt Europe as well (just look at the list of carve-outs requested by various countries). Despite all the media furor this has generated, it is very clear that Ukraine is not a core security concern for either the United States or Europe.",
            "title_similarity": "0.50479615",
            "sentiment_compound": -0.323
        },
        {
            "id": "hyfzr6n",
            "score": 15,
            "text": "Currently the European theatre (EUCOM) is in Defcon 2, which is alarming.\r  \n\r  \n\r  \n\r  \nhttps://www.defconlevel.com/european-command-news.php",
            "title_similarity": "0.43965283",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyfzszr",
            "score": 1,
            "text": "Turkey should seal off the Black Sea, stopping Russian ships. The modern treaty controlling access is the 1936 Montreux Convention Regarding the Regime of the Straits, which remains in force as of 2022. This Convention gives the Republic of Turkey control over warships entering the straits but guarantees the free passage of civilian vessels",
            "title_similarity": "0.53384596",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyfzx6z",
            "score": 2,
            "text": ">to shield and protect the one billion citizens we swore to protect\n\nProtect whom??? \nThis whole article was a whatabouttism. No clarity on who is supporting whom and if NATO will defend Ukraine if russia becomes more aggressive or will be on Russias side. \n\nOr maybe i cant comprehend this article that’s so damn vague.",
            "title_similarity": "0.6815994",
            "sentiment_compound": 0.444
        },
        {
            "id": "hyg02e5",
            "score": 1,
            "text": "Captain Price is definitely gonna save us.",
            "title_similarity": "0.29775968",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyg07of",
            "score": 2,
            "text": "Let’s hope it ends swiftly and cost dearly for the Russians.",
            "title_similarity": "0.48266855",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hyg0j2i",
            "score": 11,
            "text": "> \"We were joined today by our close partners Sweden, Finland, and the European Union,\" the statement reads.\n\nFeels like burying the lede, but probably just not officially confirmed yet.",
            "title_similarity": "0.51099974",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hyg1bxa",
            "score": 2,
            "text": "But they aren’t sending in forces to help the Ukrainian people. Letting the Ukraine fall will be the start. Putin is not gonna just settle for this.",
            "title_similarity": "0.5409149",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hyg1evr",
            "score": 1,
            "text": "God it's gonna be weird  reading that Putin Isekai manga now.",
            "title_similarity": "0.32242292",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyg1mm6",
            "score": 1,
            "text": "So question : \n\nCan any NATO members say “we have citizens in Ukraine that are “being bullied” and need protection so we are deploying a “Peacekeeping force” to protect them. “The government of Ukraine has invited us to as they are tied up in another campaign. “\nGo into Eastern Ukraine and just “camp out”",
            "title_similarity": "0.69091094",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyg1ok9",
            "score": 1,
            "text": "Put shit is horrific  no need guns .",
            "title_similarity": "0.26484317",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hyg1qzd",
            "score": 3,
            "text": "Will this be the same force to activate during an alien invasion? Legit curious if there are protocols for that (like if aliens turn out to be hostile assholes)",
            "title_similarity": "0.46726254",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyg1t7d",
            "score": 1,
            "text": "They're going to Germany/Poland and some other Eastern European countries, not to Ukraine. But sounds like they're moving supplies in to help the war effort",
            "title_similarity": "0.4883237",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hyg1vgt",
            "score": 1,
            "text": "Well if that isn't foreboding as hell...",
            "title_similarity": "0.08610914",
            "sentiment_compound": 0.6969
        },
        {
            "id": "hyg29uh",
            "score": 1,
            "text": "I hope they keep the peace hard af",
            "title_similarity": "0.1714849",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hyg2gza",
            "score": 3,
            "text": "One exchange away from WW3 once we are lined up at each other's borders. It's kind of shit's nuts. Can't Russians just hurry up and give him some of that tea that he loves to give to people.",
            "title_similarity": "0.45910567",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyg358n",
            "score": 3,
            "text": "You see NATO wouldn’t actually invade Russia, but they would need to move their troops anyway, because of the implication",
            "title_similarity": "0.58697367",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyg3952",
            "score": 1,
            "text": "Really  omg   im  sorry",
            "title_similarity": "0.12454658",
            "sentiment_compound": -0.144
        },
        {
            "id": "hyg3k6t",
            "score": 3,
            "text": "We’re watching history unfold before our own eyes!",
            "title_similarity": "0.34592152",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyg3pba",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09147855"
        },
        {
            "id": "hyg3ts5",
            "score": 1,
            "text": "I'm surprised this is only the first time.",
            "title_similarity": "0.16196918",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyg4g74",
            "score": 3,
            "text": "Is this gonna trigger a world war? :'(",
            "title_similarity": "0.49374163",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hyg506s",
            "score": 1,
            "text": "Hasn't NATO deployed their forces before?",
            "title_similarity": "0.4519456",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyg5dxf",
            "score": 1,
            "text": "Saw the title and thought of [this](https://m.youtube.com/watch?v=ilas1l9jtpY)",
            "title_similarity": "0.29853946",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyg7eva",
            "score": 1,
            "text": "https://youtu.be/JrMiSQAGOS4",
            "title_similarity": "0.16548255",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyg7vtc",
            "score": 15,
            "text": "Something tells me this is a time that will be off limits to time travelers.",
            "title_similarity": "0.26462567",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyg8un2",
            "score": 1,
            "text": "It infuriates me, everyone in NATO and the EU are still playing by the rules, while that pissant putin is the mouse that roars.   How about we all gang up on the bully, and kick some financial azz?",
            "title_similarity": "0.4827328",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hyg8xjp",
            "score": 1,
            "text": "Still doesn’t feel like it’s enough- unless we get a surprise, doesn’t sound like they’re going to take on Russia directly in Ukraine where they are needed most. I read the article, someone please feel free to let me know if I misunderstood (but at least it’s something).",
            "title_similarity": "0.5861616",
            "sentiment_compound": 0.631
        },
        {
            "id": "hyg95wb",
            "score": 9,
            "text": "Expect the next meltdown from Putin.\n\nFuck Putin.",
            "title_similarity": "0.5451547",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyga39w",
            "score": 13,
            "text": "\"... NATO will maintain its Open Door to those European states who share our values and who one day may seek to join our Alliance.\"\n\nIt's as if they  are tired of years of tip-toe dancing around the question of Nato - Baker, Bush, all the recriminations, accusations of diplomatic mistakes.\n\nPutin said that Ukrainian independence is a threat to the existence of Russia, Nato seems happy to haunt his worst nightmares",
            "title_similarity": "0.60304916",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hyga54z",
            "score": 3,
            "text": "Time to read Red Storm Rising again.",
            "title_similarity": "0.38269633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyga7ev",
            "score": 2,
            "text": "What does any of that mean.  The whole article is vague and could accurately describe a million different situations.",
            "title_similarity": "0.21462923",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hygalxe",
            "score": 8,
            "text": "So that accomplishes little besides making NATO members feel better, while Ukraine takes on a full invasion alone. Fuck Putin and his threats. Push comes to shove he's just a bully and will crumble all the same",
            "title_similarity": "0.5316777",
            "sentiment_compound": -0.683
        },
        {
            "id": "hygapfl",
            "score": 2,
            "text": "I shat my pants when the b52s appeared on freerader",
            "title_similarity": "0.28281692",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygaq2e",
            "score": 2,
            "text": "Owe finally decided to get off our asses?",
            "title_similarity": "0.2988491",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygbjax",
            "score": 1,
            "text": "BBC Maps:   \n\n\n[https://www.bbc.com/news/world-europe-60506682](https://www.bbc.com/news/world-europe-60506682)",
            "title_similarity": "0.44366884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygbnnz",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "0.07271719"
        },
        {
            "id": "hygdafn",
            "score": 3,
            "text": "Nato should let Ukraine use their airbases Russia would not be able to attack them then.",
            "title_similarity": "0.6094777",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyge928",
            "score": 5,
            "text": "Well this is. Foreboding...",
            "title_similarity": "0.12907232",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hygeam8",
            "score": 9,
            "text": "1980s synth-based war movie music intensifies.",
            "title_similarity": "0.36014616",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hygedy2",
            "score": 3,
            "text": "Get behind the Russians, set up new border line, take the suprised invaders prisoner. Just like Russia.",
            "title_similarity": "0.57871735",
            "sentiment_compound": -0.25
        },
        {
            "id": "hygei99",
            "score": 31,
            "text": "People, please start calling it “Putin’s War” \n\nSay it everywhere, use it only. Choose this man’s legacy, define him. Define him by every dead Russian and every dead Ukrainian.",
            "title_similarity": "0.594362",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hygesfi",
            "score": 3,
            "text": "Why hasn’t Ukraine been fast tracked to being approved to join NATO?  They requested membership, so where is the response?  The existing NATO member nations seem pretty slow off the mark in sending troops into the region in support of other NATO nations Putin intends to target next, possibly by next week, if they take Ukraine in the next 48 hrs. This entire world response seems like they expected Putin to walk away because they imposed sanctions.  Utterly clueless.",
            "title_similarity": "0.66987497",
            "sentiment_compound": 0.8647
        },
        {
            "id": "hygewzb",
            "score": 1,
            "text": "Hopefully this is a Peacemaker-esque peace keeping force.",
            "title_similarity": "0.26766318",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hygfckq",
            "score": 2,
            "text": "The LaLiLuLeLo is ahead of schedule.",
            "title_similarity": "0.10848201",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygfupv",
            "score": 2,
            "text": "All those years of preparing for a [tank invasion through the Fulda Gap](https://en.wikipedia.org/wiki/Fulda_Gap), and the front has already been moved over 500 miles to the East.",
            "title_similarity": "0.5231124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygg4vi",
            "score": 4,
            "text": "Makes me wonder if China won't take this time to \"help protect\" Taiwan by moving a sizeable force on to it. I hear they are saying no because they already consider it part of China but IDK.\n\nI also wonder what role the US would play with any of this if Trump had been elected. Would we have troops in Russia to \"help stop the Ukraine's aggression against Russia\" or some such or would we just sort of ignore it altogether?",
            "title_similarity": "0.5527445",
            "sentiment_compound": -0.5088
        },
        {
            "id": "hyggf49",
            "score": 1,
            "text": "I want big daddy Putin to give me a rimmer",
            "title_similarity": "0.46848068",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyghy82",
            "score": 4,
            "text": "Should be playing Russian games.  Stealth aircraft hitting their positions and aircraft.. then simply say. We aren't doing that... What a silly suggestion",
            "title_similarity": "0.5401008",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hygikas",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09147855"
        },
        {
            "id": "hyginf4",
            "score": 3,
            "text": "Good, stand by and stand ready. If he touches any NATO country WW3 is gonna be everyone vs Putin!  I'd love to see how much Russia could change without Putin. Maybe they will stop being the bad guys. That would be pretty cool. Bust most likely the job would go to another ex KGB agent.",
            "title_similarity": "0.6463454",
            "sentiment_compound": 0.8655
        },
        {
            "id": "hygixt3",
            "score": 8,
            "text": "People acting like Russia remotely cares.  Of every nuked up country, Russia will use them because Putin is the biggest narcisist in the world and would rather burn it down than lose or remotely look like a loser.",
            "title_similarity": "0.5537286",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hygki4h",
            "score": 12,
            "text": "I can’t believe Russia just threatened Finland and Sweden…..",
            "title_similarity": "0.4997463",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hygmvio",
            "score": 3,
            "text": "Why not remove Russia from United Nations?",
            "title_similarity": "0.5624913",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hygmywc",
            "score": 15,
            "text": "This will make ya forget the last two years of Covid.",
            "title_similarity": "0.36508912",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hygn2xg",
            "score": 2,
            "text": "Serious question.\n\nWhat if NATO or an Allie decided to help Ukraine, what would be consequences?\n\nWhat about if if a non-NATO country, like Australia decided to send troops to Ukraine and help them?\n\nWhat are the consequences? What would/could Putin do about it?",
            "title_similarity": "0.6503104",
            "sentiment_compound": 0.8205
        },
        {
            "id": "hygn3ld",
            "score": 4,
            "text": "First time ever they are being used for what they were built",
            "title_similarity": "0.37021604",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygo1i9",
            "score": 3,
            "text": "NATO: We're just doing our ***Drill*** as usual.\n\nPutin: F\\*ck\n\nI really hope the whole world helps Ukraine ASAP, their president is fighting and is never backing down! They're somehow cornered and in dire need of full support from allies. To all the help, god speed and thank you!",
            "title_similarity": "0.67248094",
            "sentiment_compound": 0.8273
        },
        {
            "id": "hygog3i",
            "score": 3,
            "text": "Start training the Ukrainian citizens how to use the U.S javelins. Fire and forget right. Burn there tanks. Maybe take the insignia off some NATO jets and send them in. Russia did it in Vietnam.",
            "title_similarity": "0.64216566",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hygol7f",
            "score": 5,
            "text": "Don’t worry, Putin. It’s just a military exercise.\n\nWe have every right to deploy our military in our shared borders 👍",
            "title_similarity": "0.6331314",
            "sentiment_compound": -0.128
        },
        {
            "id": "hygomqh",
            "score": 2,
            "text": "Went the entire Cold War not activating it. Here we go.",
            "title_similarity": "0.47581387",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hygp2ih",
            "score": 1,
            "text": "Sounds like the same tactics that Putin was using prior to the invasion: buildup of troops nearby in an attempt to intimidate. Same thing in reverse here: buildup of NATO forces all around, to breathe down Putins' neck and make *him* nervous. After all, he gets all hot and bothered over NATO to begin with, right? There's a reason for that.",
            "title_similarity": "0.6382266",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hygp4vl",
            "score": 5,
            "text": "What are the chances that NATO or any of its member nations actually engage in conventional warfare with Soviet, I mean Russian forces?",
            "title_similarity": "0.66114104",
            "sentiment_compound": 0.25
        },
        {
            "id": "hygp5fb",
            "score": 1,
            "text": "No need to worry Putin, we are just swiftly assembling for a peace talk",
            "title_similarity": "0.49037236",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hygph9d",
            "score": 3,
            "text": "Canada is matching all donations made to the Canadian Red Cross to help support Ukraine.\n\nIf you’re looking for some way to help,[start here](https://donate.redcross.ca/page/100227/donate/1).",
            "title_similarity": "0.58093077",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hygrg8m",
            "score": 3,
            "text": "Anyone know how that doomsday clock is looking right about now?",
            "title_similarity": "0.42062736",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hygroft",
            "score": 3,
            "text": "Just a peace keeping force doing some training exercises. Pinky promise Putin.",
            "title_similarity": "0.5013711",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hygrr09",
            "score": 2,
            "text": "So imUkraine wants to be part of NATO. Which would afford all the protections of the world superpowers. Russia doesn’t want this, so in part why they’re attacking. Yet Ukraine can’t be accepted if there are “external” disputes with another nation, such as this scenario. Seems like a catch-22 with some really serious consequences.",
            "title_similarity": "0.65464985",
            "sentiment_compound": -0.2006
        },
        {
            "id": "hygsbph",
            "score": 1,
            "text": "I wonder how much of this conflict is sourced back to poor domestic leadership polls, and a corresponding willingness for limited theatre war as a convenient remedy for that \n\nIt wouldn’t be the first time imho - hopefully ww3 doesn’t kick off because Ukraine/Russian disputes over NATO membership, because that sure would be pathetic",
            "title_similarity": "0.5150652",
            "sentiment_compound": -0.8814
        },
        {
            "id": "hygsf1r",
            "score": 2,
            "text": "Has this war been named yet? I think Putin's war would be most appropriate.",
            "title_similarity": "0.624964",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hygsgaq",
            "score": 7,
            "text": "The amount of Russian propaganda and Russian “trolls” on Reddit is terrifying",
            "title_similarity": "0.44900855",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hygt43l",
            "score": 1,
            "text": "It's not much but it's a start. You're f*cked now Putin!",
            "title_similarity": "0.37350774",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygt9ly",
            "score": 1,
            "text": "Breaking news; russia commits genocide at ‘insert task force area’, security forces move in to denazify the denazifyers",
            "title_similarity": "0.6498531",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hygtebz",
            "score": 1,
            "text": "Breaking news. Russia is a nuclear super power per Vladimir Putin. Hmm interesting development",
            "title_similarity": "0.59457517",
            "sentiment_compound": 0.765
        },
        {
            "id": "hygtfut",
            "score": 1,
            "text": "Oh boy! It's time to play NUCLEAR ROULETTE! Don't fuck up, or we all die!",
            "title_similarity": "0.4587316",
            "sentiment_compound": 0.3018
        },
        {
            "id": "hygtlvk",
            "score": 2,
            "text": "All fun and games until Putin unleashes his hidden power",
            "title_similarity": "0.5081744",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hygu3if",
            "score": 4,
            "text": "Don’t forget Russia’s future invasion of Finland and Sweden",
            "title_similarity": "0.64043784",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hygumlu",
            "score": 6,
            "text": "Russia is the new north Korea",
            "title_similarity": "0.60594153",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygvacu",
            "score": 8,
            "text": "If this war has done anything, it's been exposing Russia's military posturing as being as empty and false as their state media.\n\nUkraine is outgunned and outnumbered yet inflicting heavy losses. Russians are crossing the border not knowing the directions to Kyiv, immediately surrendering or fleeing when they meet resistance. Platoons of paratroopers who should be some of the most elite forces in their military are being beaten back by civilian militias or shot out of the sky like sitting ducks by last generation anti-air missiles. This might go down in history alongside the charge of the light brigade, and god help Russia if they decide to try and hold Ukraine should they succeed - insurgency warfare with javelin missiles, NLaws and the will to fight to the last breath will be true hell for them.",
            "title_similarity": "0.5982538",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hygvp5i",
            "score": 1,
            "text": "Lllleeettttsss GOOOOOOO!",
            "title_similarity": "0.15711564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygw0bo",
            "score": 2,
            "text": "I’ve been wondering what intelligence has been saying behind closed doors. Do they think Putin will actually invade Baltics and are prepping for that? Or is this just postering in case he gets hungry for more.",
            "title_similarity": "0.512679",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hygw39x",
            "score": 1,
            "text": "It was about fucking time!",
            "title_similarity": "0.19864908",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygwv6o",
            "score": 1,
            "text": "Where are my hoiv generals? We all know what this is going to do to the Russian division deployments.",
            "title_similarity": "0.68180096",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygwvta",
            "score": 1,
            "text": "Serious question, and I'm not trying to victim blame here. From the article:\n\n>In a message released Friday morning, Zelensky thanked NATO for its support but urged the alliance to do more, lamenting the fact that Ukraine was left to fend for itself.\n\n>\"We are alone in defending our country. Who is ready to defend us together with us? Honestly, I don't see any,\" Zelensky said. \"Who is ready to give Ukraine a guarantee of joining NATO? Honestly, everyone is afraid.\"\n\nDid Ukraine not have the option to join the NATO Alliance? If they had, would Putin have risked invading?\n\nI honestly don't know the answers to these questions and that's why I'm asking.",
            "title_similarity": "0.6162574",
            "sentiment_compound": 0.9573
        },
        {
            "id": "hygww60",
            "score": 1,
            "text": "Now let’s see this dog actually bite !",
            "title_similarity": "0.33585054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygx927",
            "score": 1,
            "text": "No one's even saying they are going to fight NATO......they could've prevent everything by actively helping Ukrainian army now....Instead of such travesty.",
            "title_similarity": "0.5925",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hygxb90",
            "score": 2,
            "text": "Russia is 100% the fire nation.",
            "title_similarity": "0.52252185",
            "sentiment_compound": -0.34
        },
        {
            "id": "hygy1oq",
            "score": 1,
            "text": "Send some of them to take Putin's 2 billion dollar fortress he built himself.",
            "title_similarity": "0.53353363",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygy9g1",
            "score": 3,
            "text": "Well, this IS huge news. Damn Putin, what you doing bro?",
            "title_similarity": "0.51868093",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hygyqny",
            "score": 2,
            "text": "Every Russian unit sitting at the border or at sea “just in case” is a Russian unit not going to ukraine.",
            "title_similarity": "0.47908312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hygytg5",
            "score": 5,
            "text": "Interesting. While doing a quick search, I'm seeing that NATO has either modified, or are considering modifying, Article 5 to include cyber attacks on member nations. Maybe at the very least, this means that the different nations are easier able to support one another during a cyber assault, or at least maybe reduce the intensity of future cyber strikes.",
            "title_similarity": "0.5824326",
            "sentiment_compound": -0.25
        },
        {
            "id": "hygyygu",
            "score": 11,
            "text": "People keep saying this going to turn into a world war, but I just don’t see that happening. Putin is a piece of shit, but he isn’t stupid. He is not going to push past invading Ukraine, and NATO is not going to insert itself directly in the defense of Ukraine. NATO is currently flexing its military muscles as more of a warning to Putin, and prepping for the worst case scenario that Putin is stupid enough to invade a NATO nation.\n\nIt fucking sucks, but I highly doubt NATO nations will do much else to help Ukraine other than through embargo’s on Russia, and support to Ukraine through funding, intelligence, etc. \n\nNATO is trying everything to avoid a world war 3, and Putin knows this which is why he is invading Ukraine right now.",
            "title_similarity": "0.5775826",
            "sentiment_compound": -0.9852
        },
        {
            "id": "hygzime",
            "score": 3,
            "text": "are we going to combine our robots to make one giant robot?",
            "title_similarity": "0.40752247",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyh10kk",
            "score": 1,
            "text": "Mover over orchids, there’s a new corpse flower in town.",
            "title_similarity": "0.35186827",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hyh1zhi",
            "score": 3,
            "text": "I thought nuclear fallout wasn't supposed to happen until October 23rd, 2077 :(",
            "title_similarity": "0.5047332",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyh3vv5",
            "score": 2,
            "text": "\"what are you doing step-country?\"",
            "title_similarity": "0.3084997",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyh5u7d",
            "score": 2,
            "text": "If NATO or Russia attack one another, it's World War 3 in 8K.",
            "title_similarity": "0.64781165",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hyh6dil",
            "score": 5,
            "text": "If Putin can claim Ukrainian territory than Ukraine can claim it has joined NATO.",
            "title_similarity": "0.6415856",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyh6i1l",
            "score": 1,
            "text": "Well good. This is a long shot but I hope it makes Putin back down. It seems the whole world is against him.",
            "title_similarity": "0.4869795",
            "sentiment_compound": 0.7469
        },
        {
            "id": "hyh6l6b",
            "score": 2,
            "text": "Why, why the fuck do we keep Russia around?\n\nEdit: and don’t say nukes. The world could vaporize Putin before he even knew he was a dead man and before they ever fired a tube.\n\nWhy?",
            "title_similarity": "0.57548594",
            "sentiment_compound": -0.9146
        },
        {
            "id": "hyh6zhq",
            "score": 7,
            "text": "It's a shame the people of Russia who are caught up in this are going to suffer (and obviously the Ukrainians suffering for no reason other than Putin being a cunt), but at the end of this, Russia is going to be an even bigger shithole than it is now.",
            "title_similarity": "0.5397625",
            "sentiment_compound": -0.7935
        },
        {
            "id": "hyh9a52",
            "score": 1,
            "text": "People are organizing on r/volunteersForUkraine to go over and fight",
            "title_similarity": "0.3850596",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyh9nw4",
            "score": 3,
            "text": "Pls take Finland into NATO. With force if necessary. We could declare war to Norway and surrender immediately.",
            "title_similarity": "0.6170498",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyha7yc",
            "score": 1,
            "text": "I was just thinking this. If they're focusing all their attention on Ukraine why not NATO invade them from every other bordering country?",
            "title_similarity": "0.7155088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyhabc2",
            "score": 2,
            "text": "They joining the fight or just setting up as a show of strength?",
            "title_similarity": "0.3765424",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hyhb49d",
            "score": 1,
            "text": "So are these people considered the best of the best?",
            "title_similarity": "0.13165182",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hyhbfup",
            "score": 3,
            "text": "I mean... NATO was literally created to push back against Russian aggression during the Cold War.",
            "title_similarity": "0.7238162",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hyhbo25",
            "score": 1,
            "text": "Time to stop growing and start showing.",
            "title_similarity": "0.24205783",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyhcvzr",
            "score": 1,
            "text": "“Mr Magoo I don’t think we’re in Kansas anymore”\n\n\nToo bizarre to be true. \n\n\nSupreme commander’s nickname is “Magoo” and he’s born in Kansas.",
            "title_similarity": "0.39931774",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyhe3jp",
            "score": 3,
            "text": "Have Ukraine 'loan' the western Oblasts and Lviv to Poland and don't tell the Russians so that when they come, the Russians will be attacking Poland and suddenly find themselves being blown to hell by American and allied air power.\n\nNot seriously proposing this but I thought it was an amusing idea.",
            "title_similarity": "0.59757483",
            "sentiment_compound": -0.0364
        },
        {
            "id": "hyhe6ws",
            "score": 1,
            "text": "What would be the force numbers ?",
            "title_similarity": "0.16257814",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyhfm8p",
            "score": 2,
            "text": "Honestly…wtf is this world coming too?!?!",
            "title_similarity": "0.3287986",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyhgcrj",
            "score": 3,
            "text": "Get out 50k troops in Japan / Korea into the Pacific. Get some Boats into the Black Sea. Throw some left hooks lol dam. Trillions of dollars on the military time to flex somethin",
            "title_similarity": "0.43701124",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyhgee1",
            "score": 2,
            "text": "I want to see all of the former Soviet republics to back the Russian People in a new Revolution to give them democracy!\n\nStop the war. Free the Russian People!",
            "title_similarity": "0.6434338",
            "sentiment_compound": -0.4738
        },
        {
            "id": "hyhhxyn",
            "score": 1,
            "text": "“The activation of the response troops does not mean that any US or NATO troops will go into Ukraine, which is not a member. US President Joe Biden has been clear that US troops are deploying to eastern Europe to help bolster NATO countries nervous about Russia's aggressive actions, and they will not be fighting in Ukraine.”\n\nKey words: “within Ukraine”, and “in Ukraine”.\n\nWhat is not said is NATO will defend borders around NATO members and allies.",
            "title_similarity": "0.6442162",
            "sentiment_compound": 0.5733
        },
        {
            "id": "hyhjb3b",
            "score": 1,
            "text": "A nobody who had his day ruined",
            "title_similarity": "0.15480807",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyhl4u8",
            "score": 1,
            "text": "NATO Force combine to form NATOMAYO SUPREME.",
            "title_similarity": "0.48129877",
            "sentiment_compound": 0.6523
        },
        {
            "id": "hyhm2m7",
            "score": 1,
            "text": "We must retake Chernobyl. …………….joking aside.",
            "title_similarity": "0.48347646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyhmku8",
            "score": 2,
            "text": "/r/volunteersForUkraine for anyone looking to volunteer in any capacity. 🇺🇦",
            "title_similarity": "0.30035397",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyhn3aj",
            "score": 14,
            "text": "You know, unexpectedly I think TikTok is making this the most closely scrutinized war we have ever had.    There are large amounts of videos all from civilian perspectives showing the atrocities and horrors of this invasion up close and personal.   \n\nIts making the war seem more tragic and personal and is acting as a MASSIVE PR tool against Russia.    It's help spur the massive uproar against Putin and friends.   Its fascinating.",
            "title_similarity": "0.5646194",
            "sentiment_compound": -0.7755
        },
        {
            "id": "hyhofh5",
            "score": 1,
            "text": "And where is Putin for all of this?",
            "title_similarity": "0.46445423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyhqhgn",
            "score": 1,
            "text": "So what does that actually mean? What happens?",
            "title_similarity": "0.12541588",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyhwx7s",
            "score": 2,
            "text": "Why are Russia still allowed to be part of the UN, they are the aggressor in this situation and should be removed until they start behaving. We cannot help Ukraine whilst still giving Russia time of day.",
            "title_similarity": "0.5959457",
            "sentiment_compound": -0.1675
        },
        {
            "id": "hyi041y",
            "score": 1,
            "text": "will NATO now help ukraine ?",
            "title_similarity": "0.6155566",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyi1fns",
            "score": 1,
            "text": "Hmmm I guess the NATO will deploy troops to strengthen borders. They cannot help the Ukraine because they are not in the NATO. That's something Russia feared the most and would never accept.",
            "title_similarity": "0.5892485",
            "sentiment_compound": -0.6533
        },
        {
            "id": "hyi2mok",
            "score": 3,
            "text": "I guess the Ukrainians will be pleased to hear there’s a shit tonne of troops stood around in neighbouring countries ready to protect said countries but nothing being done to support the innocent people within Ukraine.",
            "title_similarity": "0.55177003",
            "sentiment_compound": 0.8338
        },
        {
            "id": "hyi2sut",
            "score": 4,
            "text": "The biggest airforce in the world is USAF. The second biggest is the American navy.",
            "title_similarity": "0.37584615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyi54kn",
            "score": 2,
            "text": "I'm just reading all the articles this morning. I mean, what did Putin expect, the world to be like \"Yeah sure you can invade that whole sovereign nation and everything, don't worry about any time of resistance from anyone outside of Ukrainian.....just do it, see what happens\"",
            "title_similarity": "0.6437973",
            "sentiment_compound": 0.8129
        },
        {
            "id": "hyi9kb3",
            "score": 1,
            "text": "I know there are people in the reserves for the military. Is NATO like that? People are waiting to be called or are they active people that just switch roles?",
            "title_similarity": "0.4919315",
            "sentiment_compound": 0.6767
        },
        {
            "id": "hyijy7w",
            "score": 2,
            "text": "They like peace so much they’re willing to kill for it. (Stolen from Peacemaker)",
            "title_similarity": "0.23132494",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyikhgf",
            "score": 3,
            "text": "I think we need to have joint military exercises with Moldova and every other country bordering Russia",
            "title_similarity": "0.676675",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyip5bq",
            "score": 3,
            "text": "Just a psa I’m seeing a lot of new accounts on reddit lately attacking both political parties and also defending Russian actions. Let’s keep in mind that it benefits the enemies of freedom to get us at each other’s throats. One nuke goes off and I pray that would be enough to get us all to drop our party first mentality I see turning into a froth mouthed frenzy lately but I’m not so sure cause a sane response would be for us to put up a united front before that happens but I don’t see it. Let’s pull it together people, I don’t care what letter is in front of who you  voted for.",
            "title_similarity": "0.5755974",
            "sentiment_compound": 0.8042
        },
        {
            "id": "hyipyj4",
            "score": 1,
            "text": "Time to observe the hell out of Russia!",
            "title_similarity": "0.6022625",
            "sentiment_compound": -0.7088
        },
        {
            "id": "hyivc92",
            "score": 2,
            "text": "Ugh, don't power watch anything Gundam related. I keep expecting a mobile suit to come out of somewhere in Ukraine and save the day.",
            "title_similarity": "0.5005032",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyj1ard",
            "score": 3,
            "text": "I say USA adds Russia to its fleet. We can bridge them from Alaska and de-nazify those poor souls. Putin’s money will pay for everything!!!",
            "title_similarity": "0.59525895",
            "sentiment_compound": -0.6571
        },
        {
            "id": "hyj2ava",
            "score": 1,
            "text": "It’s about damn time somebody sacked up and did something",
            "title_similarity": "0.317156",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyj5s7g",
            "score": 3,
            "text": "How many people need to die to satisfy Putin's infantile ego and thirst for dominance.",
            "title_similarity": "0.42318255",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hyj650f",
            "score": 2,
            "text": "Putin might need to wash some windows on a top floor soon",
            "title_similarity": "0.35003388",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyj7unp",
            "score": 4,
            "text": "If Russia gets bogged down and unable to complete its objectives. I wonder how Putin will react, he'd look terrible and I'd imagine his leadership in question.",
            "title_similarity": "0.48302904",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyjldkz",
            "score": 2,
            "text": "From what I understand this units was founded in early 2000s and its previous partial activations includes stuff like hurricane relief and additional security at the Olympics. Probably be mostly helping process refugees in nato member countries bordering Ukraine.",
            "title_similarity": "0.64447916",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hymcx71",
            "score": 1,
            "text": "Find the target via intel.  Lase target with 4 different angles to hit the mountain target.  Send hyperbaric heads into said mountain and end this version of Hitler of this generation.  Strategy and the world uniting can only end this.",
            "title_similarity": "0.5304587",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp3qft",
            "score": 1,
            "text": "remember this isn't russia this is fucking dipshit putin",
            "title_similarity": "0.38243324",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hyr5zdd",
            "score": 1,
            "text": "Well Russia is knocking at the gates of Europe.",
            "title_similarity": "0.6165396",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyw9m9a",
            "score": 1,
            "text": "Ooooooooh thats bad.... Yup thats really bad...\n\nBut then again, Putin did a dum dum dum ass woopsie.",
            "title_similarity": "0.3030177",
            "sentiment_compound": -0.8554
        },
        {
            "id": "hyxeer2",
            "score": 2,
            "text": "Nato needs to send/donate  DRONES , so that Ukraina has a fighting chance, \n\nagainst that 45 kilometer long russian chechia long army convoy heading to kiev. \n\n???????\n\nWhy have they not donated Drones already? Are we just waiting to see a genocide happen. And what the heck is Europe going to do in the after math?",
            "title_similarity": "0.6650845",
            "sentiment_compound": -0.3527
        },
        {
            "id": "hzebu5q",
            "score": 1,
            "text": "The activation of the response troops does not mean that any US or NATO troops will go into Ukraine...",
            "title_similarity": "0.58635926",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzs9gop",
            "score": 1,
            "text": "So what does that actually mean for us smooth brains?",
            "title_similarity": "0.055070907",
            "sentiment_compound": 0.0
        }
    ]
}