{
    "Russia faces heavy losses as it attacks Ukraine on all fronts\n": [
        {
            "id": "hyog4zh",
            "score": -2,
            "text": "Putin literally drew the laughter away from Trump. Not to say we're not still laughing at him, but god damn is putin a fucking idiot",
            "title_similarity": "0.4930982",
            "sentiment_compound": -0.8226
        },
        {
            "id": "hyonl1w",
            "score": -1,
            "text": "So what was the trump quote again about how this was genius?  pretty much turned out as well as he was able to articulate.\n\nah some 'i'd rather be russian than a democrat' folks here.  Well, let me know how that turns out.",
            "title_similarity": "0.29700214",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hyomexk",
            "score": -15,
            "text": "Trump should call his friend Putin and tell him to cool it.  \nIt would give Trump a chance to finally, do something good for the world.",
            "title_similarity": "0.22192632",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hyp67s3",
            "score": -25,
            "text": "Propaganda.  Next American media headlines.  “Putin got on his knees and sucked Zelensky off while sobbing in pain from the devastation the Ukrainians have caused to his army”.",
            "title_similarity": "0.7903876",
            "sentiment_compound": -0.9136
        },
        {
            "id": "hynvm10",
            "score": -15,
            "text": "cruise missiles for Moscow- lets dispense with not hunting vlad down.",
            "title_similarity": "0.28445995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyopeuz",
            "score": -2,
            "text": "A business reporter wrote about a war\nNot his specialty idkhow much id believe here",
            "title_similarity": "0.39383197",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyo0dwp",
            "score": -31,
            "text": "[deleted]",
            "title_similarity": "0.27962857"
        },
        {
            "id": "hyozm7g",
            "score": 81,
            "text": "Ukraine’s capital is completely surrounded 4 days in.  And reddit is still pretending Ukraine is going to repel the overwhelming Russian troops, tanks, helicopters and aircraft\n\nWhy all the denial?",
            "title_similarity": "0.66118455",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyp3zk2",
            "score": 0,
            "text": "Putin is already taking the #1 spot for fattest L of 2022, and it’s only been a couple months!",
            "title_similarity": "0.26141146",
            "sentiment_compound": 0.6155
        },
        {
            "id": "hyp3im1",
            "score": -1,
            "text": "This is getting embarrassing Russia",
            "title_similarity": "0.6618976",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hypnyjf",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.25767428"
        },
        {
            "id": "hyoxpif",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "0.25767428"
        },
        {
            "id": "hyoswau",
            "score": 2,
            "text": "Honestly, I'd take this as welcome news... but I don't trust it much. Russia is perhaps *the most* prolific user of propaganda, and I don't trust a single snippet of authenticity to be reported out of there.",
            "title_similarity": "0.5341513",
            "sentiment_compound": -0.7654
        },
        {
            "id": "hyove38",
            "score": 0,
            "text": "The Ukraine is not weak.",
            "title_similarity": "0.12435783",
            "sentiment_compound": 0.3412
        },
        {
            "id": "hyp3x0h",
            "score": 3,
            "text": "No matter who wins or loses ,Russia has lost all credibility and will continue to lose credibility, as long as Putin is in charge.",
            "title_similarity": "0.6484628",
            "sentiment_compound": -0.3968
        },
        {
            "id": "hypfdwo",
            "score": 0,
            "text": "How heavy tho….cus those look like the crumbling remains of Ukraines buildings. I think we all are rooting for Ukraine, but let’s not pretend Russia isn’t wiping the floor with them…they don’t stand a chance without help.",
            "title_similarity": "0.66922474",
            "sentiment_compound": 0.204
        },
        {
            "id": "hyqgybc",
            "score": 0,
            "text": "I wish we criticised and put sanctions on the United States like we are to Russia right now when they lied about Iraq having weapons of mass destruction and invaded it causing thousands of innocent(more for sure)civilians to lose their lives.",
            "title_similarity": "0.6436719",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hyqpmnk",
            "score": 0,
            "text": "Everyone bitches about our spending on military til the threat of war is here and they shut the hell up",
            "title_similarity": "0.674909",
            "sentiment_compound": -0.9501
        },
        {
            "id": "hyoxvb0",
            "score": 0,
            "text": "Fuck them all. They all deserve death for following the orders of a fascist. Death to Putin.",
            "title_similarity": "0.65359676",
            "sentiment_compound": -0.9423
        },
        {
            "id": "hypgsmk",
            "score": -6,
            "text": "They call Ukrainians brave for resisting a foreign power occupying their country but call Iraqi, Afghans, Syrians, and Yemeni terrorists for doing the same.",
            "title_similarity": "0.50580335",
            "sentiment_compound": -0.6652
        },
        {
            "id": "hyofi4w",
            "score": -25,
            "text": "I feel like Putin isn't really running the invasion.  He just told people to invade without any plan.  They are rolling in with their WWII junk first, hoping to dump it in Ukraine and make Ukraine use up their ammo.  It is surprising that we don't see a lot of drone or arial attacks on the capitol.  Very few missiles and cannon fire.  None of the 'shock and awe' of the US.  I think small batallions are just rolling into various places and getting ambushed.  It doesn't look like a full frontal assault.  Maybe Putin is waiting before he sends in his more elite forces, or his military is much less prepared.  My theory is Putin and the oligarchs are looting a lot of money from Russia for themselves and not keeping the military up to date.",
            "title_similarity": "0.41482684",
            "sentiment_compound": -0.5602
        },
        {
            "id": "hyoi54r",
            "score": 12,
            "text": "This Ukrainian article states that the Russians have lost 3,500 troops. So that only leaves 196,500...",
            "title_similarity": "0.5103896",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hypp7pz",
            "score": 3,
            "text": "Calling BS on this one",
            "title_similarity": "0.1011704",
            "sentiment_compound": 0.0
        },
        {
            "id": "hynrxg9",
            "score": 74,
            "text": "The second most powerful military is bleeding to   Ukraine, r/UkraineIsVeryBadass",
            "title_similarity": "0.6766524",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hynrvst",
            "score": 62,
            "text": "Sad that life had to be lost, but can only be so sad about it being Russians. My crackpot theory is that Putin has been diagnosed with stage 4 cancer or some terminal illness and just wants to take the world out with him.",
            "title_similarity": "0.61866856",
            "sentiment_compound": -0.963
        },
        {
            "id": "hyp7kc0",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "0.25767428"
        },
        {
            "id": "hypmja2",
            "score": 0,
            "text": "hopefully this is a short lived war but unless it end's with the ousting of Putin it will be for nothing, then we have taiwan to look forward to next.",
            "title_similarity": "0.24292374",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hypsc6m",
            "score": 0,
            "text": "They have a big  air force they haven’t really used yet but Ukraine has very little to stop that. Monday they say Putin wants to finish it by any means necessary. He has no compunction now if he ever did",
            "title_similarity": "0.35200292",
            "sentiment_compound": -0.6786
        },
        {
            "id": "hyo77o2",
            "score": 8,
            "text": "If Russia's army is this weak but still considered to be stronger than China's this begs the question how weak is China's army?",
            "title_similarity": "0.31538826",
            "sentiment_compound": -0.3894
        },
        {
            "id": "hyph91o",
            "score": 4,
            "text": "From what i am seeing,they are already in Kiev after just few days. Russians are bombing the shit out of ukranians.",
            "title_similarity": "0.7118344",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hypggtu",
            "score": 5,
            "text": "I might be missing something here, but this appears to be a Ukrainian source why are we accepting this as if it's word of god? I get that this situation sucks and fuck Russia for attacking of course but you got to be pretty hopelessly naïve to think Ukraine doesn't have all the reason in the world to spread disinformation as well...",
            "title_similarity": "0.49000826",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hyoqcvf",
            "score": -1,
            "text": "Russian troops are all conscripts. The Russian army is running out of food, fuel and water. This is Afghanistan all over again, except the Ukrainian military has the tools in place to inflict the kind of losses that make conscripts surrender enmasse when the shit hits the fan. There are millions of Ukrainians and not that many Russians. This is going to turn into a protracted shit show.",
            "title_similarity": "0.74950916",
            "sentiment_compound": -0.0754
        },
        {
            "id": "hyovoxz",
            "score": -1,
            "text": "I’m speechless at how bad this has gone for putin. His ground forces are literally having to push their vehicles at times because they have no gas…wtf?\n\nI made a prediction early on that putin probably overestimated himself and didn’t listen to advisors, solely based on the one thing I knew about him. His judo skills. I noticed he didn’t do very basic things correctly that are like things you’d expect from novice but not someone with a black belt with years of experience. My guess is people were too afraid of him to correct these things and that probably went from not just judo but on up to really big important matters. I was really talking out of my ass, but hell,  it looks like I was maybe on to something.",
            "title_similarity": "0.4963",
            "sentiment_compound": -0.8333
        },
        {
            "id": "hyowsx1",
            "score": 1,
            "text": "Putin is done... Why do you think he makes everyone sit so far from him? It's because he's scared they are going to off him every time the door opens.",
            "title_similarity": "0.5519938",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyph0xi",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.25767428"
        },
        {
            "id": "hyotx4i",
            "score": -27,
            "text": "Anyone else signing up for the Ukrainian 'foreign legion'? It's open to any 18-40 year old without a criminal record. I'm applying tomorrow. I'm 54 with a gammy eye but they said sometimes they take people up to 60. Always been an antiwar person but Putin is our generation's Hitler so you're sort of duty bound to do something.",
            "title_similarity": "0.36259046",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hyp85ay",
            "score": 1,
            "text": "This is probably true, but the source is literally called Kyiv independent. Don't get your hopes up",
            "title_similarity": "0.24660265",
            "sentiment_compound": -0.2728
        },
        {
            "id": "hypnoyq",
            "score": 1,
            "text": "Those numbers combined with the source sounds like propaganda to me. 3500 soldiers lost in 3 days? I very much doubt that",
            "title_similarity": "0.42159706",
            "sentiment_compound": -0.5542
        },
        {
            "id": "hypux8h",
            "score": 2,
            "text": "Russia has 6257 Nukes and 1 Paranoid Dictator",
            "title_similarity": "0.53823376",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyqi60t",
            "score": 2,
            "text": "I would be very cautious about any news, especially that pumped up, from Ukrainian media sources.",
            "title_similarity": "0.39801827",
            "sentiment_compound": -0.1761
        },
        {
            "id": "hyp1k3g",
            "score": 37,
            "text": "# Source: KyivIndependent\n\nSo take it with a grain of salt, like all propaganda (old) images of President in military gear, stories of that ghost pilot, that tank crusing the car (it was a Ukranian anti-air vehicle, and was an accident) etc.\n\nNOTE: This does NOT mean I hate Ukraine. I am anti-war and hate ALL WAR. Be it by USA (Iraq, Libya, Somalia, Syria etc), Saudia (Yemen etc), Israel (Palestine), or Russia",
            "title_similarity": "0.6169843",
            "sentiment_compound": -0.8816
        },
        {
            "id": "hyovxyt",
            "score": -15,
            "text": "fox news is russian state media",
            "title_similarity": "0.3848434",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyonq7y",
            "score": -11,
            "text": "what are the russians giving their troops, tissue paper?  i can't believe how bad they are at this",
            "title_similarity": "0.54825205",
            "sentiment_compound": 0.6428
        },
        {
            "id": "hyo413z",
            "score": 32,
            "text": "Guess he was Putin all his eggs in one basket",
            "title_similarity": "0.23611169",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypcr2o",
            "score": -4,
            "text": "That's because they are sending in poor unexperienced kids, as you all cheer for their deaths!",
            "title_similarity": "0.4473633",
            "sentiment_compound": 0.126
        },
        {
            "id": "hypn7yi",
            "score": -3,
            "text": "People need to chill with this. They are sending in 1980 to 90 junk with inexperienced conscripts as meatshield against an enemy they will win anyways. Why send in ur best and risk losing those equipment when u don’t need to. As this drags on u will likely see more advanced units.",
            "title_similarity": "0.42426538",
            "sentiment_compound": 0.3
        },
        {
            "id": "hypxhan",
            "score": 2,
            "text": "The Kyiv independent says Russia is losing bad\n\nLol",
            "title_similarity": "0.6064098",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyqm7nc",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.25767428"
        },
        {
            "id": "hys92k6",
            "score": 3,
            "text": "A lot of the right blames Biden for Putin’s invasion of the Ukraine. \n\nThey’ll claim he’s weak and Putin doesn’t respect him and that’s why Putin invaded. \n\nMany on the right cheer Putin on while damning Ukraine “Democrat money laundering country” “Pelosi kids, Biden’s kids, etc..”\n\nThe shit I hear from the right is amazing and their still steadfast lock step with Trump is as strong as it’s been. Of course, Trump praises Putin so they must. “Rather be a Russian than a Democrat”, they’ve got the T-shirt to prove it. \n\nBut…\n\nIn one way I think the right is correct in that Biden plays a part in this is because….\n\nBiden, his DOJ, the Democrats have failed to go after our own greatest criminal….\n\nDonald Trump.  \n\nOf course Putin is embolden, we can’t even bring our own corrupt criminal president to justice how are going to hold a foreign one accountable?\n\nTrump needs to be brought to justice and spend the rest of his life in a cell at best.  \n\nJustice must prevail or all for not.",
            "title_similarity": "0.5687424",
            "sentiment_compound": 0.9831
        },
        {
            "id": "hyonsbh",
            "score": 92,
            "text": "Nobody else notice all the propaganda?",
            "title_similarity": "0.21008614",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyolyyd",
            "score": 45,
            "text": "[removed]",
            "title_similarity": "0.25767428"
        },
        {
            "id": "hyo1vku",
            "score": 49,
            "text": "Putin made the same mistake Adolph made when he attacked Stalingrad in WW2. Only took exaggerated intel and advice from yes men, believed in his own superiority to a fault. Thought that the a massive force would win a surrender after intimidating the enemy. Never believing “a lesser people” could fight back and outmaneuver him. Refusing to retreat after running into a brick wall. Allowing his troops to get stuck without resupply or a plan to win.",
            "title_similarity": "0.45737737",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hyp62wx",
            "score": 0,
            "text": "Imagine china atacking russia after the war finishes.",
            "title_similarity": "0.35614222",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hypjl2e",
            "score": 4,
            "text": "Clearly this is a trustworthy *independent* source. \n\nA reminder to redditors: Take what you see, hear and read about this war with a grain of salt. You are being bombarded with an enormous amount of propaganda from all sides at the moment.",
            "title_similarity": "0.51244986",
            "sentiment_compound": -0.1503
        },
        {
            "id": "hypq6hc",
            "score": 0,
            "text": "I'm afraid this will end up like the Russo-Finnish “Winter War” of 1939-40 where the Finns put up a spirited defense and inflicted mass casualties on the Russians but in the end were crushed by pure weight of numbers",
            "title_similarity": "0.71741396",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hypvbxs",
            "score": 0,
            "text": "https://youtu.be/X-I7DMSz9Hs",
            "title_similarity": "0.109506115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqey7i",
            "score": 0,
            "text": "As much as I would wish to believe this Russia is not really trying that hard at this point. If they really wanted to they could just use a lot of Missles and drop bombs. They kinda just taking it wasy",
            "title_similarity": "0.33229545",
            "sentiment_compound": -0.0164
        },
        {
            "id": "hyr5yjh",
            "score": 0,
            "text": "You guys have to consider the news source, its going to be full of propaganda and bias.\n\nExperts say Russia hasn't even utilised their advance equipment yet, so 👀😬",
            "title_similarity": "0.6300478",
            "sentiment_compound": -0.6222
        },
        {
            "id": "hys7l8c",
            "score": 0,
            "text": "Just give up Russia. Go home. \n\nFuck.\n\nYou’re doing all this shit for Putin?",
            "title_similarity": "0.49844128",
            "sentiment_compound": -0.8294
        },
        {
            "id": "hysjnc9",
            "score": 0,
            "text": "Intentional losses, Soviet era equipment",
            "title_similarity": "0.6134486",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyssstr",
            "score": 0,
            "text": "This is genocide to wipe out the Ukrainians, so that Putin can use the Ukraine as a buffer b/w Russia and NATO countries and the West.  Unless Putin is taken down, I have no difficulty seeing Russia simply bombing the hell out of the Ukraine.  I doubt that Putin is the only person in the Russian oligarchy who sees the Ukraine as a necessary geographic buffer b/w Russia and the West.  Those people do not care what shape the Ukraine is left in.  In their mind, the country can be rebuilt in Russia’s image.",
            "title_similarity": "0.62159103",
            "sentiment_compound": -0.8268
        },
        {
            "id": "hyogzsl",
            "score": 5,
            "text": "Is there a breakdown of Ukrainian losses too?",
            "title_similarity": "0.4923026",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hypb6mf",
            "score": 6,
            "text": "I don’t support Russia, but I don’t think Kyiv independent may be the most unbiased source on the matter",
            "title_similarity": "0.2910124",
            "sentiment_compound": 0.1054
        },
        {
            "id": "hyo4w96",
            "score": 18,
            "text": "Almost makes me wonder why Ukraine is willing to negotiate.",
            "title_similarity": "0.3244058",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp0w9p",
            "score": 32,
            "text": "Source: Kiev \n\nIt’s the same as upvoting “Russia is winning” and the source being Russia.com\n\nWhy is Reddit so full of people who gargle propaganda",
            "title_similarity": "0.5473579",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyohhyz",
            "score": 30,
            "text": "Russia underestimated Ukraine. Unfortunately, the prognosis for Ukraine is still doubtful.",
            "title_similarity": "0.56106025",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hynxp7u",
            "score": 39,
            "text": "Russia has always been seen as a threat for its nuclear stock piles. Let's hope that is a bluff too, and it turns out like war machines Ex-wife missile.",
            "title_similarity": "0.6323836",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyntne3",
            "score": 849,
            "text": "Putin tried to draw the US into a conflict and got caught bluffing, now he’s getting his ass handed to him by the Ukrainians. Meanwhile the US and it’s NATO allies are taking options away on other fronts while arming Ukraine.",
            "title_similarity": "0.6208737",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hyokatm",
            "score": 1,
            "text": "Reports are coming in from Kiev that Russian forces are blocking exits and surrounding the city, not allowing citizens to leave. They expect a full push soon.",
            "title_similarity": "0.6241251",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyolj14",
            "score": 1,
            "text": "Ukraine’s president vs Putin. 1v1. Battle to the death. I don’t see a better way to end all of this.",
            "title_similarity": "0.6770928",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyoljaq",
            "score": -1,
            "text": "Said this before but, these losses will have an effect at home. The only legal option is for Russians to hate Ukrainians for killing their kin. We all know they should hate Putin for it and many will but there will be a significant portion who will hate Ukraine. Fuckin Hatfield and McCoy blood feud style, they’re going to want to fight forever.",
            "title_similarity": "0.718518",
            "sentiment_compound": -0.9847
        },
        {
            "id": "hyope3h",
            "score": 1,
            "text": ">February 26, 2022 9:19 am\n\nKarma-farming",
            "title_similarity": "0.19062495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoqrtm",
            "score": 1,
            "text": "Russia can't exactly publish everyday they're gunning down Ukrainians by the  thousands to the world (or their own people for that matter) right?  Even if true. \n\nInversely Ukraine can boast everday when they did anything to the Russians while also report what Russia did to them.",
            "title_similarity": "0.7426125",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyosjhx",
            "score": 1,
            "text": "Serious question, How is Russia actually losing? Aren't they suppose to have one of the best militaries in the world?\n\nedit: No I'm not rooting for Ukraine to lose, I'm genuinely curious based on what I heard in the past.",
            "title_similarity": "0.4034207",
            "sentiment_compound": -0.168
        },
        {
            "id": "hyot5a9",
            "score": 1,
            "text": "They've lost 14 fighter jets and how many did 'the ghost' take down?",
            "title_similarity": "0.46619618",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyov6us",
            "score": 1,
            "text": "Do you think it is possible he led with canon fodder to expose their positions, and is holding his better trained, reserves after finding out their capabilities?",
            "title_similarity": "0.22256526",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyovtsr",
            "score": 1,
            "text": "We shouldn’t be happy about this. Many of them were brainwashed pawns in Purim’s game.",
            "title_similarity": "0.5048092",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hyow5zj",
            "score": -1,
            "text": "Yes, and that’s why Biden took the US out of Afghanistan-I read that he wanted to do that since the Obama administration, but Obama probably thought eh, let’s leave that for Hillary to clean up (since everyone assumed she’d win in 2016). Biden took a look at what Putin was planning and was like nope, we can’t afford to be distracted by shipping toilet paper and porn to soldiers in a mountainous desert just to prop up a corrupt government with zero support from the people when this psycho over here is going to test the waters for a European invasion. And thank god he did.",
            "title_similarity": "0.47575682",
            "sentiment_compound": 0.9633
        },
        {
            "id": "hyoz2ae",
            "score": 1,
            "text": "Snap back to reality… ope; there’s goes gravity.",
            "title_similarity": "0.037876263",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoznqk",
            "score": 1,
            "text": "  Invade and take over Russia before is too late.",
            "title_similarity": "0.4671141",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp06zq",
            "score": 1,
            "text": "Get wrekt you commie bastards",
            "title_similarity": "0.4570784",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hyp0ewi",
            "score": 1,
            "text": "Great hope get there ass beat. But getting desperate enough to drop nukes! read they thinking and threating to",
            "title_similarity": "0.43079197",
            "sentiment_compound": -0.8244
        },
        {
            "id": "hyp45lr",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.27962857"
        },
        {
            "id": "hyp52jo",
            "score": -1,
            "text": "Russians thought they would go in and be greeted as liberators. Now where would they get that crazy idea",
            "title_similarity": "0.3923956",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyp6soj",
            "score": 1,
            "text": "My only fear is that Putin will do something really stupid like drop a nuke. Cuz right now he looks really fuckin weak and you just know Putin can’t live with that. \n\nMaybe not nukes but something else. Guy is insane",
            "title_similarity": "0.5108643",
            "sentiment_compound": -0.8412
        },
        {
            "id": "hyp7407",
            "score": 1,
            "text": "I am going, out on a lim here and just saying it could Russians at some point in the near future get tired. Of Vladimir Putin’s leadership, in their country and overthrow him and his government by rebelling it seems that at some; point that may be the case for what Russians are going through now.",
            "title_similarity": "0.5654646",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hyp7zb7",
            "score": 1,
            "text": "The Ukraines are fucking bad asses! I have so much admiration for them.",
            "title_similarity": "0.5929643",
            "sentiment_compound": -0.0789
        },
        {
            "id": "hypease",
            "score": 1,
            "text": "I’m still very concerned that Russian forces are slowly pushing from the north and northeast towards Kyiv, and that they’re on the verge of taking Berdyansk and landing forces in Odessa.\n\nI’m also worried that Putin will launch indiscriminate bombing campaign against civilians, because moskals don’t know how to fight any other way.",
            "title_similarity": "0.6897532",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hypg1hi",
            "score": -1,
            "text": "It's not that this was ever considered an easy win to begin with.\n\nWhile the russian forces are significantly stronger, the ukrainian forces aren't a slouch either.",
            "title_similarity": "0.37460595",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hypg92g",
            "score": 1,
            "text": "I wonder if this would become like the Vietnam war that the US tried to take over Vietnam… that didn’t work out so well…",
            "title_similarity": "0.38840175",
            "sentiment_compound": -0.34
        },
        {
            "id": "hypight",
            "score": -1,
            "text": "Thank god \n\nPlease crush them financially before we have to step foot over there and start something that could possibly lead to nuclear types of warfare",
            "title_similarity": "0.5783435",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hypmsxt",
            "score": 1,
            "text": "I've been following all the combat progress, and it looks like Russia will take Kyiv sometime next week. My soul is with Ukraine, but the pragmatist isn't currently optimistic like some in this thread. Anybody?",
            "title_similarity": "0.56405425",
            "sentiment_compound": -0.4867
        },
        {
            "id": "hyppdgr",
            "score": 1,
            "text": "Oh well. I wonder what I might have for lunch tomorrow, because I sure as shit don't care about Russia and their problems.",
            "title_similarity": "0.24215838",
            "sentiment_compound": -0.6734
        },
        {
            "id": "hypq08h",
            "score": -1,
            "text": "I'm afraid this will end up like the Russo-Finnish “Winter War” of 1939-40 Finns put up a spirited defense and inflicted mass casualties on the Russians but in the end were crushed by pure weight of numbers.",
            "title_similarity": "0.71629906",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hypwoto",
            "score": 1,
            "text": "Did Russia face heavy losses or suffer heavy losses?\n\nAgreed with most of the comments that life lost is sad, be it Ukrainian, Russian or even Americans.",
            "title_similarity": "0.7178564",
            "sentiment_compound": -0.9042
        },
        {
            "id": "hypzj6z",
            "score": 1,
            "text": "Ah yes, when looking for factual information about this invasion/war , my first choice to read is\n>\tTHE KYIV INDEPENDENT",
            "title_similarity": "0.41001433",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyq1p9h",
            "score": -1,
            "text": "I am not pro-Russian, but everyone needs to take articles like these with several grains of salt. Propaganda is propaganda.",
            "title_similarity": "0.44534543",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hyq7min",
            "score": 1,
            "text": "We need another seal team 6moment... Go into Russia,capture the fart and bring him to justice. The last thing we need is to have him kill himself in a bunker",
            "title_similarity": "0.5132223",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyq7qc4",
            "score": 1,
            "text": "Over 4k if the Ukrainian Rep at teh UN is to be believed.",
            "title_similarity": "0.3522603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqfha1",
            "score": 1,
            "text": "As much as I love to see Ukraine come out on top, I just can't see this ending well no matter what happens. Worst case scenario, Putin uses nukes. Is it likely? Probably not. Best case scenario, Ukraine is successful in getting Russia to stop the invasion. What then is stopping Russia from reorganizing their strategy, stockpiling more weapons, and trying again next year? It's clear no one will actually aid Ukraine in any form other than money, and Ukraine has no intentions to push the battle back into Russia. It seems the only hope is for Ukraine to exhaust all resources from the Russian army (a not so easy task) and hope the sanctions work to keep them from building their forces back again, or for Russian citizens to overthrow Putin. \n\nNo matter what, I think this war is far from over.",
            "title_similarity": "0.4844408",
            "sentiment_compound": -0.8891
        },
        {
            "id": "hyqup72",
            "score": -1,
            "text": "Well, how in the world does this kyividindendent nation article know these exact figures?  I highly doubt it.",
            "title_similarity": "0.41699952",
            "sentiment_compound": -0.1761
        },
        {
            "id": "hyr0go1",
            "score": -1,
            "text": "Cool random numbers you made up, Kyiv Independent. Not saying they're doing badly either, necessarily, just that this is 100% bullshit they pulled out of a hat.",
            "title_similarity": "0.27930036",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyrv3yg",
            "score": 1,
            "text": "Are these numbers credible? I can’t find anything similar in any other news source \n\n“Russia lost 14 planes, 8 helicopters, 102 tanks, 536 BBM, 15 heavy machine guns, and 1 BUK missile since Feb. 24, according to Ukraine’s military. \n\nThe Kremlin also lost over 3,500 soldiers, Ukraine’s Armed Forces said on Feb. 26. Nearly 200 service members have been kept hostage.”",
            "title_similarity": "0.593001",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyrvuo7",
            "score": -1,
            "text": "Anyone think this article might be a bit skewed to one side?  I don't know. . .   It's reminiscent of Baghdad Bob from Operation Desert Storm.",
            "title_similarity": "0.34348398",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoa253",
            "score": -7,
            "text": "Ukraine - hang tough, I'm always reminded of this - from the movie Zulu. 1963.\n\nWiki - Just over 150 British and colonial troops defended the station against attacks by 3,000 to 4,000 Zulu warriors. The massive attacks by the Zulu on Rorke's Drift came very close to defeating the much smaller garrison, but were consistently repelled.\\[9\\] Eleven Victoria Crosses were awarded to the defenders, along with a number of other decorations and honours.",
            "title_similarity": "0.5311721",
            "sentiment_compound": 0.6876
        },
        {
            "id": "hyoq08j",
            "score": 6,
            "text": "On the one hand, this is certainly propaganda.\n\nBut on the other: If Russia wasn’t taking heavy losses then they would be doing better and not even pretending to be in peace talks",
            "title_similarity": "0.40448713",
            "sentiment_compound": 0.7849
        },
        {
            "id": "hyowim6",
            "score": 6,
            "text": "*according to Ukraine\n\nNot saying we should rely on Russian sources or anything, but Ukraine (and NATO) has literally no reason to provide accurate statistics on their or Russian losses to the public. It feels like everyone on Reddit has forgotten that war propaganda is a thing.",
            "title_similarity": "0.5023554",
            "sentiment_compound": -0.9231
        },
        {
            "id": "hyp1rdz",
            "score": -14,
            "text": "The amount of hate that a country is receiving is astounding.\n\nI mean fuck, where was all this hate for the last 20 years of American occupation in the Middle East?\n\nIs it because they were brown people and not white? It's so hypocritical.",
            "title_similarity": "0.605078",
            "sentiment_compound": -0.9325
        },
        {
            "id": "hyoikma",
            "score": 8,
            "text": "I kind of worry that he is using a \"rope a dope\" strategy, where he lets the Ukrainian forces do their best against the crappiest Russian forces; expend their best weapons and people etc, then roll in with the elite forces when the defensive edge has been blunted.\n\nNamed by (or possibly before, but definitely used by) Muhammad Ali where he would dodge and let an opponent exhaust themselves, then start his real offensive & take them out.",
            "title_similarity": "0.5978569",
            "sentiment_compound": -0.2609
        },
        {
            "id": "hyntgnl",
            "score": 195,
            "text": "Leaders should fight wars and not their people.  Put them in one room, bare handed and see what happens.  Putin would be ripped apart.",
            "title_similarity": "0.5396668",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hyp332w",
            "score": 9,
            "text": "I think some of the numbers of Russian losses cited in the article are bullshit. There's no way Russia has lost 102 tanks in 3 days.",
            "title_similarity": "0.44211933",
            "sentiment_compound": -0.875
        },
        {
            "id": "hyoom1o",
            "score": 2,
            "text": "Im just concerned that the more difficult It will be for putin the crazier he gets to reach his goal",
            "title_similarity": "0.5712003",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hyov6ym",
            "score": -2,
            "text": "We should update the saying to be \"never attack Ukraine in winter\"",
            "title_similarity": "0.33859667",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hyov78l",
            "score": -2,
            "text": "Currently, the Russian military has failed to achieve any of it's initial objectives during the opening days of the operation and is well behind schedule, not to mention that UK intelligence agencies estimated that Russian casualties were around 3x higher than Ukrainian forces during the first 2-3 days of the conflict. By any measure it looks like Russian forces are preforming poorly going off the information that's currently available. \n\nIf Ukraine fends off Russia on it's own, the Russian army might be reveled to be a paper Tiger by the end of the conflict, which would be a major humiliation for Putin's regime considering the amount of propaganda and government spending that's put into their armed forces.",
            "title_similarity": "0.57364106",
            "sentiment_compound": -0.7346
        },
        {
            "id": "hyowssg",
            "score": 2,
            "text": "Huge respect for Ukraine, they knew no-one was going to help them and the only option was to make russia bleed for every foot they advanced. Russia fights for a better life for their oligarchs while Ukraine fights for its right to exist needless to say one is a much more powerful motivator. take notice other world leaders when a people react to the situation instead of just sitting around and waiting for it to happen.",
            "title_similarity": "0.58174855",
            "sentiment_compound": 0.8655
        },
        {
            "id": "hyoxa6t",
            "score": 2,
            "text": "On the bright side, China is watching this and hopefully will be less inclined for war for Taiwan.",
            "title_similarity": "0.09805081",
            "sentiment_compound": 0.2415
        },
        {
            "id": "hyoxstm",
            "score": 2,
            "text": "If these numbers are accurate this is a historically embarassing military disaster for Russia on a scale comparable to the Battle of Tsushima.",
            "title_similarity": "0.6476395",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hyoy0md",
            "score": 2,
            "text": "Any independent sources? i doubt an ukraine newspaper would report against its own country. that would crater morale",
            "title_similarity": "0.40308326",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyp00gw",
            "score": 2,
            "text": "Zelensky deserved a hell of a statue ... With balls of steel",
            "title_similarity": "0.31379673",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyp2sol",
            "score": 2,
            "text": "How do I know this isn't propaganda? How can anyone on the internet realistically assess the current outcome of the war? Asking for a friend...",
            "title_similarity": "0.25831026",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyp3g6q",
            "score": 2,
            "text": "Russia is going through the \"found out\" stage.",
            "title_similarity": "0.41321653",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp67nk",
            "score": 2,
            "text": "How come there’s no video of all these attacks?",
            "title_similarity": "0.36402005",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hyp6wrc",
            "score": 2,
            "text": "I'm really curious about Ukraine's losses as well. Reddit makes it seem (and I hope this is true) that Ukraine is winning without question, despite overwhelming odds.",
            "title_similarity": "0.4879903",
            "sentiment_compound": 0.8777
        },
        {
            "id": "hyp7dw7",
            "score": 2,
            "text": "Good. Send them bastards back to russia so they can ask putin what the fuck he was thinking. If this invasion ends in a loss putin is 100 percent fucked and gonna end up Vanished as if stalin came back to life just to poof him",
            "title_similarity": "0.6094701",
            "sentiment_compound": -0.9062
        },
        {
            "id": "hyp7fst",
            "score": 2,
            "text": "I think Putin thought Ukraine would surrender like Afghanistan did when the US pulled out.",
            "title_similarity": "0.44221443",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyp80l3",
            "score": 2,
            "text": "Russia is so fucked from here on out. Putin is probably going to get killed. But Russia's future doesn't look good.",
            "title_similarity": "0.70236003",
            "sentiment_compound": -0.8469
        },
        {
            "id": "hyp8t71",
            "score": 2,
            "text": "I just hope he doesn't start nuking Kyiv (or the whole world) because he's losing.",
            "title_similarity": "0.40476334",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hypebms",
            "score": 2,
            "text": "You can lose the battle,  lose 1000s of fighter jets,  tanks and 10000s of soldiers but you can still win the war.  Winner should be decided by their objectives completed.\n\nFor Ukraine,  nobody expected em to take Russia heads on or open a new front at Russian border. For them,  main goals are keep Russians occupied in close hand to hand combat in their cities,  don't lose Kiev and few other major cities,  have the government intact until ceasefire and peace talks.  \n\nFor Russia,  lost equipments and personal matters less than taking control of few Cities,   disruption of government,  exile zielinski,  instill fear in Ukraine citizens and army and make them desert the defense and give up their arms.  No one sane expected Ukraine to fold in 2 days except for US MSMs and fake war think tanks. \n\nImo, it's a stalemate as of now.  No one is winning and no one really gets anything out of the stupid bloody  war.",
            "title_similarity": "0.48364714",
            "sentiment_compound": -0.9613
        },
        {
            "id": "hyph0sc",
            "score": -2,
            "text": "war always sucks. i'm positive ukraine has lost a lot more.",
            "title_similarity": "0.82440335",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hyphwaq",
            "score": -2,
            "text": "I'm sure they know it, that's why I don't exactly get it\n\nWhen is the last time a foreign invasion worked? The US can't even take Afghanistan and Russia thinks \"hey imma try with someone much stronger and to whom NATO actually gives a fcuk ...",
            "title_similarity": "0.428254",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyppm53",
            "score": 2,
            "text": "This is Kyiv independent , it is an Ukrainian news paper. That’s all.",
            "title_similarity": "0.38456872",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypq5ah",
            "score": 2,
            "text": "Wow, all these years I have thought the Russians were near peers to the US military. They are shite. The only thing they have are nukes.",
            "title_similarity": "0.43172988",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hypxzq4",
            "score": -2,
            "text": "*checks source*\n\n\"Kyiv independent\"\n\nSure thing boss.",
            "title_similarity": "0.20050094",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyr1vv8",
            "score": 2,
            "text": "I genuinely suspect this is wartime propaganda. Ukraine keeps on unleashed devastating losses on Russia, each time getting closer and closer to Kyiv.",
            "title_similarity": "0.80038947",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hyo4quy",
            "score": 2064,
            "text": "And YET THEY CAN STILL WIN. Remember where you are: The Reddit Echo Chamber. Donate to make sure humanitarian aid is ready; press your representatives to condemn and sanction Russia. Remember when we all thought Bernie was gonna get the nomination? Imagine THIS POST on a polar opposite platform: they'll be talking about victory with as much confidence as some of these people are.\n\nEDIT: Stop upvoting and **start sending donations to Doctors without Borders, UNICEF or something else worthy.** An upvote is useless. Wait. WAIT. Ok do BOTH\n\nOh yay an award, that will fuckn help. Donate now.",
            "title_similarity": "0.37990087",
            "sentiment_compound": 0.9625
        },
        {
            "id": "hyorsda",
            "score": 33,
            "text": "Russia sent little boys to fight real warriors.   You can’t teach warrior pride and a will to fight.   People who love their country will always be worth more on the battlefield than people who fear a dictator.  \n\nUkraine will be the graveyard of the Putin regime and it will be the gateway to a new balance of power in Europe in which the Russian people will pay for Putin’s mistakes for generations.  \n\nAs an American I salute the Ukrainian people and I welcome Vlad’s demise.   Slava Ukraini!",
            "title_similarity": "0.56295854",
            "sentiment_compound": -0.5983
        },
        {
            "id": "hyoirr5",
            "score": 3,
            "text": "Instead of blitzkrieg Putin went for \"let's slowly and obviously amass troops and then very slowly and awkwardly start to attack.\"",
            "title_similarity": "0.30130127",
            "sentiment_compound": -0.6872
        },
        {
            "id": "hyot3xl",
            "score": 2,
            "text": "good. fuck em, god damn fascist cunts.",
            "title_similarity": "0.39721304",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hyoze1k",
            "score": 3,
            "text": "Kyiv Independent may be slightly biased as a news source",
            "title_similarity": "0.2842859",
            "sentiment_compound": -0.204
        },
        {
            "id": "hyp2wh3",
            "score": 2,
            "text": "Ukraine is like that small city you think you can conquer easily when you first start playing Civ until it's like 100 turns later and you're sunk into your chair playing for pride.",
            "title_similarity": "0.26480213",
            "sentiment_compound": 0.886
        },
        {
            "id": "hyp7jsz",
            "score": 3,
            "text": "Now is the perfect time to invade Russia",
            "title_similarity": "0.35381705",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hyp7uor",
            "score": 3,
            "text": "What about Ukraine’s loses",
            "title_similarity": "0.55820143",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyp8oz5",
            "score": 2,
            "text": "Not to mention the international levels of damage it’s taking to its economy. With Russia being removed from SWIFT and heavy tariffs placed on all Russian goods the economy in Russia is already tanking.\n\nThe soldiers are well equipped but not willing, they wanted to protect their motherland not go out and invade others motherlands.\n\nPutin is banking on people backing down when he waves around the “I have nukes” card but has been gobsmacked to see that it’s only been backfiring on him. The world is in active resistance against him.\n\nThe thing Putin never thought of is now starting yo happen as it has always happened to tyrants and autocrats. The regime is beginning to collapse",
            "title_similarity": "0.57769775",
            "sentiment_compound": 0.4618
        },
        {
            "id": "hyp9uma",
            "score": 3,
            "text": "Are there any non-Ukrainian sources verifying these figures as well?",
            "title_similarity": "0.14863585",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hypajgt",
            "score": 5,
            "text": "I just picture American military just sitting back laughing saying “give ‘em hell boys give em hell!”",
            "title_similarity": "0.31142977",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hypdctw",
            "score": 2,
            "text": "With the amount of propaganda coming out of Russia, we have to take this type of news with a grain of salt. Russia will happily take a perception hit for strategic advantages.\n\nThe reality is, this is no way Russia loses to Ukraine. The only thing being decided is how much longer can Russia push NATO. I'd rather skip to the part where we actually sanction their oil and force peace conversations.",
            "title_similarity": "0.37946326",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyppccd",
            "score": -4,
            "text": "I haven’t seen any of the Ukrainians wearing masks. I have yet to confirm their vaccination status but it may be that chemical warfare is taking place. I have seen video with my own eyes of the ukranians breathing on the Russians",
            "title_similarity": "0.4475103",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyq2jqc",
            "score": 2,
            "text": "Good lord….. thank God the Donald is not is the Oval Office.   !!!!!!!!! So much more horrifying events would be happening.    Although he says otherwise. \nNo way On Gods green earth would I have ever thought the world would be in this current position.  \nI pray this madness leads to better things.   Jury still out on that belief.",
            "title_similarity": "0.41308647",
            "sentiment_compound": 0.4654
        },
        {
            "id": "hyq6hw0",
            "score": 4,
            "text": "This is where it gets really bad. Ukrainians have the advantage of being invaded so the have good defensive positions as well as civilians coming to arms increasing their numbers. They know the lay of the land and any urban warfare will be brutal for Russia when most windows have a rifle pointed at them. While every Russian soldier may not have the fight in them that the whole of Ukraine does Russia has the numbers. Putin can afford heavy losses, especially in the first 7 days. At some point he will decide that enough civilians have left populated areas and the remaining people are \"soldiers\". Russian air raids can level the cities of Ukraine via carpet bombing. Russian supplies will be brought to the front lines and more infantry will follow after massive air raids. Sadly the numbers are against Ukraine. However, like Syria, the urban warfare could go on for a long time. Especially if Ukraine is supplied with the weapons and soldiers necessary. Even then, it's a real shitty situation for Ukraine. What will the rest of the world do? Sanctions can feel the same as military action. If Putin is to become a cornered rat (like the one he has spoken of in his youth) then we should all be very concerned. Honestly, I think he already feels cornered. Rightfully so. He has few cards to play but, one ace in the hole. He's already escalating nuclear readiness verbally hoping its scary enough to change the reaction of western Europe and the US. But, it's not. He has nothing left to fight for. And like the cornered rat he is, lashing out might mean taking the whole of civilization down with him. What is the alternative? Ukraine folds like Crimea and life goes on? Peace talks go well and Russia leaves? Sanctions force the Russians to give up? Russia is a failed state and we are seeing the last grasping breaths. It can be argued whether it's been forced upon them by or not. But the reality is now. And it is unfolding in front of our eyes.",
            "title_similarity": "0.666472",
            "sentiment_compound": -0.4343
        },
        {
            "id": "hyoodqh",
            "score": 11,
            "text": "Get fucked, Putin you fucking old ass worthless piece of shit bum.",
            "title_similarity": "0.5708236",
            "sentiment_compound": -0.9427
        },
        {
            "id": "hyon7c0",
            "score": 26,
            "text": "Fuck Putin! Making Russians die for your stupid cause! Shame shame shame!!! Bloodshed on both sides. Fuck you PUTIN!",
            "title_similarity": "0.73389053",
            "sentiment_compound": -0.9771
        },
        {
            "id": "hyo26id",
            "score": 265,
            "text": "so sorry Russia you thought the opposite would have been true!\n\nomg if Russia loses this will be the most humiliating loss they have had in like forever lol",
            "title_similarity": "0.6984649",
            "sentiment_compound": 0.1098
        },
        {
            "id": "hyorqtx",
            "score": 4,
            "text": "Putin is Napoleon.\n\nDon't invade Ukraine in the winter.",
            "title_similarity": "0.3918651",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoulmj",
            "score": 4,
            "text": "Don’t trust ANY casualty numbers. At this point it’s all propaganda one way or another.",
            "title_similarity": "0.462869",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyovp6h",
            "score": 5,
            "text": "I’m not sure what the cutoff is for being considered a “world superpower” but I think Russia’s capabilities are vastly overestimated.",
            "title_similarity": "0.5191003",
            "sentiment_compound": -0.1232
        },
        {
            "id": "hyp21tw",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.25767428"
        },
        {
            "id": "hyp6fsd",
            "score": -4,
            "text": "But Russia don't even lose one hundred soldiers, and already took almost all Ukraine, lol",
            "title_similarity": "0.36827192",
            "sentiment_compound": 0.7345
        },
        {
            "id": "hyp8vkn",
            "score": 5,
            "text": "It's like Finland, 1940 all over again.",
            "title_similarity": "0.35930234",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hypi7zz",
            "score": -3,
            "text": "Thanks for impartial news Kyiv Independent!",
            "title_similarity": "0.13042283",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hypsy5h",
            "score": 4,
            "text": "I spent my whole life believing that Russia was the #2 superpower in the world and nearly equal to the US in technology and might.\n\nI feel like I just found out that the #2 most powerful Pokemon is actually a baked potato.",
            "title_similarity": "0.33450276",
            "sentiment_compound": 0.6801
        },
        {
            "id": "hypw5c0",
            "score": 5,
            "text": "Things not going well for Putler.\n\nIn America, Trump praising Putler while Russia is an enemy of the US. Sadly, some have followed him in this and that is not acceptable.\n\nPut these two things together and I think now would be a great time for Putin to demand from Trump that $400 Million that he owes him.",
            "title_similarity": "0.5666165",
            "sentiment_compound": -0.2444
        },
        {
            "id": "hyq42vf",
            "score": 4,
            "text": "The thing I keep coming back to is Trump trying to shake down Zelenskiy re: missiles on his phone call. Really puts into sharp relief the extent to which Trump, and Putin, misread his presidency.",
            "title_similarity": "0.3861345",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hyopgd5",
            "score": 16,
            "text": "according to kyiv independent...",
            "title_similarity": "0.18607116",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyot3lw",
            "score": 13,
            "text": "Not trolling. Seriously wondering since the first casualty of war is the truth and this report is coming from [Kyivindependent.com](https://Kyivindependent.com) and the world has taken a side in this.  But, how is this actually going?",
            "title_similarity": "0.3432443",
            "sentiment_compound": -0.41
        },
        {
            "id": "hyo97md",
            "score": 16,
            "text": "In the heat of the war, Vladimir Vladimirovich Putin , Sergej Lawrow, \"Spy Chief\" Sergey Naryshkin and the rest of the whole cabinet  took the time to pay visit to an orphanage in the Ural Mountains. \"Their desperate facial expressions, utter sadness and tearful eyes were hard to endure\" said 6 year old Yuri about the visitors.",
            "title_similarity": "0.62468195",
            "sentiment_compound": -0.8805
        },
        {
            "id": "hyok6i9",
            "score": 127,
            "text": "The Russians are still gaining more ground, they are still pushing forward. Good, the Russians are taking losses but the reality is still grim for the people of Ukraine. More needs to be done and inaction on the part of the rest of the world is going to subsequently result in a larger loss than the worlds conscience can handle.",
            "title_similarity": "0.68116665",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hyof6rk",
            "score": -5,
            "text": "Nice to see somewhere in the world there are still men willing to fight…",
            "title_similarity": "0.19199164",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hypea9f",
            "score": 17,
            "text": "⚠️ If you're in #Ukraine and reading this please turn geolocation off on your phone now. Russia is using it to track gatherings. Tell those around you to do the same.",
            "title_similarity": "0.42883673",
            "sentiment_compound": 0.3869
        },
        {
            "id": "hyogliy",
            "score": 7,
            "text": "R/Russia is a fascinating place for propaganda",
            "title_similarity": "0.39414573",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyokc5p",
            "score": 5,
            "text": "Let's see how long this lasts when the coffins of Russian soldiers start arriving....",
            "title_similarity": "0.42146313",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyon6bf",
            "score": 7,
            "text": "It’s incredibly sad that so many people from both countries are dying over the whims of madmen.",
            "title_similarity": "0.72413486",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hyouyiz",
            "score": 7,
            "text": "Not that I don't want this to be true, but the source on this is very sus. Ukraine is in the middle of a war - I'd expect every bit of news out of it to be propaganda.",
            "title_similarity": "0.6480423",
            "sentiment_compound": -0.7941
        },
        {
            "id": "hyp5dp0",
            "score": -4,
            "text": "And to think that Trumpf likes the Russians. They are smarter than any American leader, except for Trumpf.",
            "title_similarity": "0.31669223",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hyo0rc9",
            "score": 6,
            "text": "Ukraine had a diamond core.",
            "title_similarity": "0.36994863",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyq0huj",
            "score": 8,
            "text": "Trump when seeing the Ukrainian crisis first unfold on TV “and I said: This is genius. Putin declares a big portion of the Ukraine… Putin declares it as independent. Oh, that’s wonderful.”\n\nThe former US president said that the Russian president had made a “smart move” by sending “the strongest peace force I’ve ever seen” to the area.\n\nDonald Trump ladies and gentlemen 👎",
            "title_similarity": "0.43389624",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyo380e",
            "score": -72,
            "text": "I'm thinking trusting the already corrupt Kyiv media is a pretty stupid idea. It's almost as bad as trusting the US lame stream even after decades of war lies.",
            "title_similarity": "0.5589498",
            "sentiment_compound": -0.8187
        },
        {
            "id": "hyobybl",
            "score": 467,
            "text": "Russia: Uh oh oopsie, I did a fucky wucky.\n\nMy heart goes out to the poor kids who were lied to and led to believe they weren't going to war, there are no winners in this situation.\n\nUkraine is not to be trifled with, they will be free.",
            "title_similarity": "0.41228512",
            "sentiment_compound": 0.5255
        },
        {
            "id": "hyosb5p",
            "score": 11,
            "text": "It took Putin a long weekend to create a Ukrainian equivalent to the Mujahideen in Afghanistan.\n\nGeography may be conquered but the history of insurgents defending their homeland doesn't have many losses for the side with home field advantage.",
            "title_similarity": "0.4402808",
            "sentiment_compound": 0.7129
        },
        {
            "id": "hyoqt6r",
            "score": 38,
            "text": "This is like when I used to play CIV 5. Go to war with a small country and seemingly out of nowhere I get my ass handed to me and a few turns later I’m giving up everything I own to make peace.",
            "title_similarity": "0.49908298",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyp5gox",
            "score": 13,
            "text": "Putin probably sent his youngest and inexperienced troops first to see how Ukraine would react and counter. This means there’s still time to get aid and weaponry into Ukraine to be prepared for the real army. Just don’t use the same tactics because Russia will have prep’d for that. \n\nGet more aid, weaponry, and tactical support in now!",
            "title_similarity": "0.46917748",
            "sentiment_compound": 0.2056
        },
        {
            "id": "hyoo93m",
            "score": 43,
            "text": ">according to Ukraine’s military. \n\nWhen this isn't in your headline, it's as if you are purposely misinforming people.\n\nCountries are notorious for giving false information during war.",
            "title_similarity": "0.6057027",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hyosf3l",
            "score": 46,
            "text": "Ukraine should annex Russia.",
            "title_similarity": "0.40180242",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypsa4e",
            "score": -16,
            "text": "I’m seeing a war torn nation w buildings burning but it’s Russia who at losses. Last time I checked it’s Ukrainian who have lost all their homes 😂",
            "title_similarity": "0.82090026",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyod5i9",
            "score": 742,
            "text": "3,500 Russian soldiers lost and counting. Brothers/sisters/moms/dads/friends who are just taking orders and won’t be coming home.\n\nAll for a schmuck who can’t put his pride aside. How many more have to die before this lunatic comes to grips with wtf he’s doing?\n\nNot to mention the Ukranian losses, but at least Ukraine knows what they’re fighting for.\n\nJust fucking sad.",
            "title_similarity": "0.678029",
            "sentiment_compound": -0.9405
        },
        {
            "id": "hyp3fre",
            "score": -16,
            "text": "[removed]",
            "title_similarity": "0.25767428"
        },
        {
            "id": "hyop5gh",
            "score": 56,
            "text": "Putin can go fuck himself.",
            "title_similarity": "0.3849821",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyooidk",
            "score": 801,
            "text": "Putin was expecting to roll right into Ukraine and take it in a few days like Germany did with Poland in 1939. He was expecting to be in complete control of the country by this time and installing a puppet government.\n\nInstead he's yet to attain air superiority, is losing tanks left and right from running out of gas, anti-armor, or getting stuck in the mud, has suffered at the very least a thousand casualties, is facing protests at home and abroad, and has an economy in complete free-fall.\n\nHe seriously underestimated the response he'd get, and it shows. Can Ukraine maintain this momentum? I don't know. I think it's a case of running down the clock until Russia's economy is so tattered that Putin has no option except to just pull out of Ukraine.\n\n***EDIT: It's been brought to my attention that It took about a month for Poland to be taken over, not a few days. My apologies.***",
            "title_similarity": "0.5816542",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hyo1g7e",
            "score": 694,
            "text": "Putin’s days in power are coming to a close. Military leadership won’t tolerate this humiliation. The problem will be with the next guy they install.",
            "title_similarity": "0.6019758",
            "sentiment_compound": -0.795
        },
        {
            "id": "hyoa4eg",
            "score": -29,
            "text": "[removed]",
            "title_similarity": "0.25767428"
        },
        {
            "id": "hyo4jmb",
            "score": 612,
            "text": "Its simple math, one cannot just waltz in a country as big as Ukraine, having 48.000,000 milion people-with 200.000 soliders, from all sides. \nI hope that Putin will sip on that novitchok tea soon, cause he is fucked.",
            "title_similarity": "0.5194373",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyodqw8",
            "score": 250,
            "text": "It turns out you can't blitzkrieg Ukraine no matter which side you attack from.",
            "title_similarity": "0.3735751",
            "sentiment_compound": -0.4895
        },
        {
            "id": "hyoiuax",
            "score": 966,
            "text": "Russia just set themselves back decades....for nothing.",
            "title_similarity": "0.48569492",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyosfrt",
            "score": 33,
            "text": "Putin basically going bankrupt as we speak",
            "title_similarity": "0.65786827",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyoxv6l",
            "score": 170,
            "text": "I'm worried that as crazy as Putin is right now, he might feel like he needs to show the world he isn't weak. And if his troops can't do it, he'll launch a nuke.",
            "title_similarity": "0.43686315",
            "sentiment_compound": 0.0788
        },
        {
            "id": "hyor6no",
            "score": 50,
            "text": "Definitely don't want the Russians to die needlessly. What a pointless invasion. Putin has only strengthened the West with this.",
            "title_similarity": "0.33667907",
            "sentiment_compound": 0.0971
        },
        {
            "id": "hynsc8h",
            "score": 6412,
            "text": "Putin miscalculated big time. He thought that this would be as easy as Crimea or Georgia. After seeing the Taliban roll through Afghanistan with welcoming arms within days, he thought that Ukraine’s reaction would be similar. These are tough people who suffered and who want democracy and freedom in their country. They will not go out without a fight.",
            "title_similarity": "0.46180493",
            "sentiment_compound": 0.8309
        },
        {
            "id": "hyo5cwf",
            "score": 689,
            "text": "Didn’t know Ukrainians were related to Chesty Puller\n\n> They are in front of us, behind us, and we are flanked on both sides by an enemy that outnumbers us 29:1. They can’t get away from us now!” “Great. Now we can shoot at them from every direction.”",
            "title_similarity": "0.6212504",
            "sentiment_compound": -0.7345
        },
        {
            "id": "hyoaghs",
            "score": 1619,
            "text": "Unverified reports of up to 3400 Russian KIA in 3 days\n\nif true, that’s quickly approaching total KIA (6400) of the US/Afghan + US/Iraq war in 20years combined",
            "title_similarity": "0.50165385",
            "sentiment_compound": -0.9225
        },
        {
            "id": "hyo9wh6",
            "score": 868,
            "text": "I really feel like Ukraine is playing this strategically very well. Sucking in Russia (choosing to consolidate on strong defensive points) and not fighting them much on the way. It serves to extend their supply lines and make it a logistical issue if they're running anti-supply hit and run groups behind the battle lines.",
            "title_similarity": "0.44403225",
            "sentiment_compound": 0.8618
        },
        {
            "id": "hyomchm",
            "score": 203,
            "text": "\"We are surrounded!\"\n\n- \"Good, that means we can advance in every direction.\"",
            "title_similarity": "0.25980434",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hyp8otu",
            "score": 216,
            "text": "Ukraine refuses to dehumanize the enemy on their soil. They have treated prisoners with dignity and integrity. They understand the best weapon is to keep showing the human face of war. Brilliant and brave, Ukraine.",
            "title_similarity": "0.29195812",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyoozdh",
            "score": 1485,
            "text": "I really hope this isn't just bias and propaganda. I hope that Ukraine is bleeding Russia dry to the point where they're forced to completely pull out.",
            "title_similarity": "0.60271615",
            "sentiment_compound": 0.3376
        },
        {
            "id": "hyophdg",
            "score": 9569,
            "text": "Those heavy losses are most likely young men who don’t want to be there. I’m sorry for lives lost and families ruined.",
            "title_similarity": "0.5752988",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hyo0ew8",
            "score": 12974,
            "text": "Russia and heavy losses. Name a more iconic duo.",
            "title_similarity": "0.67957854",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyntc7r",
            "score": 9179,
            "text": "They underestimated Ukraine.",
            "title_similarity": "0.5567652",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyns24m",
            "score": 16667,
            "text": "A country who was already economically on a downward slide has waged a war that has not only worsened their status economically but it's also weakening their military. I mean this has gotta be one of the worst decisions in the history of the world by a countries leader.",
            "title_similarity": "0.69762796",
            "sentiment_compound": -0.8846
        },
        {
            "id": "hyok7xh",
            "score": 126,
            "text": "the leaders of Russia are weak.I feel bad for the Russian people but they need to become part of this fight more than ever. This could be the chance to end Putin bullshit of making his friends rich and his people poorer.. step up Russians, take what is yours.",
            "title_similarity": "0.608879",
            "sentiment_compound": -0.4854
        },
        {
            "id": "hyoeiwq",
            "score": 8127,
            "text": "Putin wanted to be Czar, now it looks like it's going to be Nicholas II.",
            "title_similarity": "0.31690034",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyos9xm",
            "score": 4816,
            "text": "Putin is revealing far more than he ever intended about Russia’s military capacities. It was one thing to invade Afghanistan in the 1980s, but modern Ukraine is a different beast altogether. Fascinating.",
            "title_similarity": "0.5754137",
            "sentiment_compound": 0.6956
        },
        {
            "id": "hyp1quc",
            "score": 858,
            "text": "Imagine spending 30 years robbing your own people to create one of the wealthiest oligarch classes in modern history... And this is what your military looks like",
            "title_similarity": "0.5567111",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hyolcc3",
            "score": 4983,
            "text": "Honestly I'm more nervous of what Putin might do if the situation becomes clearly unwinnable. He's not really the type to shrug and say \"I tried\" and go home.",
            "title_similarity": "0.38484555",
            "sentiment_compound": 0.5118
        },
        {
            "id": "hyo7eoy",
            "score": 1,
            "text": "Almost feels like this should be in r/UpliftingNews",
            "title_similarity": "0.084680334",
            "sentiment_compound": 0.3008
        },
        {
            "id": "hyo8b3g",
            "score": 1,
            "text": "Can anyone tell me how all of this started?  I’m talking all the way back to the Warsaw Pact.  Or where is an unbiased source of information that isn’t slanted in one direction.",
            "title_similarity": "0.22366461",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyoatjc",
            "score": 1,
            "text": "Good idea that, attacking on several fronts.  If only I could remember the last time an army tried that....hmm...",
            "title_similarity": "0.51154745",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hyoctoo",
            "score": 1,
            "text": "Plans never survive first contact with an enemy",
            "title_similarity": "0.4693337",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyod6bw",
            "score": 3,
            "text": "Just in: the Russian bride prices hit an all-time low.",
            "title_similarity": "0.572724",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyoebhx",
            "score": 2,
            "text": "That's what you giiiiiiiiiiiiiit.",
            "title_similarity": "0.03141875",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyohnau",
            "score": 1,
            "text": "Ukraine is doing some awesome shit!",
            "title_similarity": "0.48169836",
            "sentiment_compound": 0.2003
        },
        {
            "id": "hyohvxf",
            "score": 1,
            "text": "Wonder what my great great great babushka would be saying right now at the state of her homeland’s leadership",
            "title_similarity": "0.37653846",
            "sentiment_compound": 0.9231
        },
        {
            "id": "hyol2sr",
            "score": 2,
            "text": "Every day the Russians do not win, they lose. The Ukrainian forces get stronger fast. Currently the Russians still hold a material and tactical advantage, but they are 7-10 days away from losing the initiative.",
            "title_similarity": "0.6047144",
            "sentiment_compound": -0.3626
        },
        {
            "id": "hyol7j0",
            "score": 1,
            "text": "Yeah, but their plan is to lost 50,000 men and 1000 tanks.  So this is all going perfectly to plan.  Sorry Russian troops, your commander is a fucking moron.",
            "title_similarity": "0.6179801",
            "sentiment_compound": -0.1875
        },
        {
            "id": "hyol8a5",
            "score": 1,
            "text": "You know, I under estimated Ukraines resolve and I am glad I was wrong. But having said that, and if these stats are true (zero reason for them being lies because there are TONS of videos of Russians getting fucked up), then the Russian generals/leadership AND their planning is complete and utter shite. \n\nIn the ENTIRE Iraqi invasion, plus several years of occupation, the US lost around 4500 soldiers and a small amount of tanks/etc, and definitely no planes (the Iraqis were using Russian equipment...). This over years of occupation. The invasion part we barely lost a few hundred.",
            "title_similarity": "0.54639465",
            "sentiment_compound": -0.8768
        },
        {
            "id": "hyolwxr",
            "score": 2,
            "text": "The flag of the Golden Kraine flies high",
            "title_similarity": "0.17490889",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyom2sy",
            "score": 4,
            "text": "This conflict shows how inept Russian military is",
            "title_similarity": "0.68168473",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyoma52",
            "score": 1,
            "text": "I doubt the casualty numbers being reported, but there are absolutely brutal photos popping up on Twitter.",
            "title_similarity": "0.48207313",
            "sentiment_compound": -0.8761
        },
        {
            "id": "hyomzir",
            "score": 1,
            "text": "I think Putin was expecting Ukraine to more or less lay down when he invaded, and was pro-Russian enough to not have anywhere near this resistance.  Between that and having the troop buildup on their borders for weeks, he was hoping this would be similar to the Taliban re-invading Iraq.  I’m proud that Ukrainians chose to fight for democracy instead of turn tail and run to the autocrat",
            "title_similarity": "0.42392495",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyon435",
            "score": 3,
            "text": "Regardless whether Russia succeeds, at this point doesn’t look like it, how fucked is Russia? \n\nEven if Russia gets Ukraine, their economy is fucked. How will they compete in this globalized world? Russia is gonna become the next North Korea after this",
            "title_similarity": "0.5527998",
            "sentiment_compound": -0.6662
        },
        {
            "id": "hyonb2z",
            "score": 3,
            "text": "Weak move to threaten with nukes. He must be desperate. \n\nIf he want’s to use them, he will use them. \n\nDid he imagine we would panic and just give in to whatever demands he’s got?\n\nHe’s lost it.",
            "title_similarity": "0.37691128",
            "sentiment_compound": -0.9081
        },
        {
            "id": "hyonhpe",
            "score": 3,
            "text": "Russia, the country that has lost every war they have ever started. Including their own civil war.",
            "title_similarity": "0.7434857",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hyonnig",
            "score": 1,
            "text": "💩tin drank his own koolaid and some how thought the Ukrainians would just cave and welcome him, that the world would just accept this.",
            "title_similarity": "0.23517865",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hyoo0wv",
            "score": 2,
            "text": "How many Ukrainian loses?",
            "title_similarity": "0.6103602",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hyoo8ui",
            "score": 3,
            "text": "“This has been the worst ~~trade deal~~ invasion of Ukraine in the history of ~~trade deals~~ invading Ukraine, maybe ever.” - Sadimir Putin",
            "title_similarity": "0.75344396",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hyood8a",
            "score": 6,
            "text": "At this point, Putin has failed so badly that we have to give him some way to turn tail and run without totally humiliating him. Like you lost in baseball, but you still get pizza after the game. Everyone gets a trophy!",
            "title_similarity": "0.3356197",
            "sentiment_compound": -0.4859
        },
        {
            "id": "hyoot6e",
            "score": 3,
            "text": "They are seemingly making all the mistakes that people normally make when invading Russia...",
            "title_similarity": "0.73006785",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyopeyr",
            "score": 3,
            "text": "Putin might have something to gain but Russia as a country and the Russian soldiers do not.\nMeanwhile, the Ukrainians have everything to lose.\nI could not hope for a better outcome than for Russia to suffer heavy losses and regret every moment of this invasion.",
            "title_similarity": "0.7256468",
            "sentiment_compound": -0.9275
        },
        {
            "id": "hyopl5z",
            "score": 3,
            "text": "*Fields of Prokhorovka*\n\n*Where the heat of battle burned*\n\n*Suffered heavy losses*\n\n*And the tide of war was turned*\n\n*Driving back the Germans*\n\n*Fighting on four fronts*\n\n*Hunt them out of Russia*\n\n*Out of Soviet land*\n\nSeems like history's repeated itself in a rather *unexpected* way, Joakim's probably taking notes already. :D",
            "title_similarity": "0.80512965",
            "sentiment_compound": -0.8109
        },
        {
            "id": "hyopuf3",
            "score": 2,
            "text": "Serious question, why don't they have losses from both sides listed?  It feels like we are getting a very skewed viewpoint.  I know morale and all, but is there any other reason?",
            "title_similarity": "0.48232737",
            "sentiment_compound": 0.3796
        },
        {
            "id": "hyopyph",
            "score": 3,
            "text": "Wow and this is the 2nd largest military in the world. Goes to show you the saying quality over quantity is so true. I thought they would steamroll Ukraine. I wonder if Russia is just sending their weakest or newest regiments in first?",
            "title_similarity": "0.48491424",
            "sentiment_compound": 0.6269
        },
        {
            "id": "hyoqazt",
            "score": 2,
            "text": "More fronts to take losses on. Fucking geniuses.",
            "title_similarity": "0.41508698",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyoqd23",
            "score": 3,
            "text": "Makes me wonder what's Putin's next move. Walking away with nothing to show for sounds impossible for him. Will he double down on the military action? My prediction is they get all of what they want which is at minimum achieve demilitarization and install a pro Russia government  or if they fail that, at least inflict enough pain so that they can get some concessions out of it.",
            "title_similarity": "0.41424197",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hyoqdb4",
            "score": 2,
            "text": "Ukraine has full entrenchment",
            "title_similarity": "0.4611618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoqj8n",
            "score": 3,
            "text": "What do people think about the press junket that Putin pulled telling his defence minister to put special nuclear operations in place? Is it because he’s actually at risk of looking more of an idiot than he is now?",
            "title_similarity": "0.42877138",
            "sentiment_compound": -0.4448
        },
        {
            "id": "hyoqpvp",
            "score": 3,
            "text": "Problem is they never gave a shit about heavy losses and aren't afraid to throw people at a problem until it goes away.",
            "title_similarity": "0.20302053",
            "sentiment_compound": -0.6341
        },
        {
            "id": "hyor6zs",
            "score": 3,
            "text": "Ukraine is doing a great job. Let’s hope this nonsense end soon before Russia wrecks their economy plus their military.",
            "title_similarity": "0.60866225",
            "sentiment_compound": 0.596
        },
        {
            "id": "hyor7s9",
            "score": 3,
            "text": "They can organize a killer defense and capitalize off it to turn it into an invasion/route but planning an invasion isn't a Russian advantage",
            "title_similarity": "0.33963233",
            "sentiment_compound": -0.5439
        },
        {
            "id": "hyos75m",
            "score": 2,
            "text": "Oh, did the backflip tomahawk training not come in handy? How sad",
            "title_similarity": "0.3315314",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyos9yc",
            "score": 2,
            "text": "I wouldnt hold my breath they kinda do the heavy losses to win at all costs thing alot",
            "title_similarity": "0.59500974",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyosk5j",
            "score": 1,
            "text": "Hopefully they can come to peace soon on this",
            "title_similarity": "-0.049389333",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hyoszy2",
            "score": 13,
            "text": "Russia loves to take heavy losses in every war. They just love throwing bodies at the enemy.",
            "title_similarity": "0.668162",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyot7va",
            "score": 3,
            "text": "When the dust settles guess we’ll see what the cost in human life really is. It’s hard to imagine with the intense level of urban fighting that the Russians are having a light time of it out there.",
            "title_similarity": "0.58686",
            "sentiment_compound": -0.4336
        },
        {
            "id": "hyotxtg",
            "score": 47,
            "text": "I hope this is what finally gives Russia the courage to dethrone Putin and *hopefully* install someone better",
            "title_similarity": "0.41699356",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hyou4qp",
            "score": 2,
            "text": "I dont understand Putins motives/endgame...\nlike what is the point? Or what was the point supposed to be?",
            "title_similarity": "0.35134548",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hyouekm",
            "score": 2,
            "text": "This is only half the story. What about Ukrainian losses? And who can hold out for longer?",
            "title_similarity": "0.3861188",
            "sentiment_compound": -0.4696
        },
        {
            "id": "hyouj91",
            "score": 1,
            "text": "Can you imagine if they actually do “take the country“? They’re gonna be fighting a losing battle until they get the hell out. Putin is an imbecile and from what reports were seen may be slightly unhinged. Hope somebody with sense takes this guy out before he does something catastrophic.",
            "title_similarity": "0.56140625",
            "sentiment_compound": -0.944
        },
        {
            "id": "hyouu4n",
            "score": 1,
            "text": "Turns out that despite having the bigger force, fighting a war not even your own people want means your morale is in the gutter and you end up losing.",
            "title_similarity": "0.51429635",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hyov2fr",
            "score": 2,
            "text": "I guess we will truly see how well Russia's invasion is going by the results at the negotiation table.",
            "title_similarity": "0.32607487",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hyov3ta",
            "score": 2,
            "text": "Anybody got anything unbiased on this?",
            "title_similarity": "-0.0051271785",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hyovbkm",
            "score": 1,
            "text": "What gives me pause before I get hopeful is the fact that enemy losses are usually compared to friendly losses, which... just aren't present here.",
            "title_similarity": "0.3922986",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyovf9w",
            "score": 2,
            "text": "A man’s ego is one hell of a drug",
            "title_similarity": "0.4216234",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hyovg9o",
            "score": 3,
            "text": "“Appear weak when you are strong, and strong when you are weak” - Sun Tzu, The Art of War",
            "title_similarity": "0.4512512",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyow3q6",
            "score": 2,
            "text": "Is this actually a lot? Russia's a big ass country and I'd assume they have a lot more equipment than what's been lost. Are there numbers for Ukraine as well to put into perspective?",
            "title_similarity": "0.5183429",
            "sentiment_compound": -0.6199
        },
        {
            "id": "hyow7zr",
            "score": 2,
            "text": "How do we know this isn’t some ploy to raise moral of Ukraine before the real invasion begins? I mean, Putin cannot be this stupid? He managed to become basically a king of a country through his KGB tactics. He has to be familiar with war tactics. \n\nI hope I’m wrong but I feel this is like the Raptors from Jurassic Park testing the fences.",
            "title_similarity": "0.46790725",
            "sentiment_compound": -0.2869
        },
        {
            "id": "hyowa3y",
            "score": 2,
            "text": "There’s no way that we know this, save perhaps an intelligence source that we could have just compromised, leaked by an American or US ally, who probably has a different idea of “high” than Russians even if he is being honest. \n\nFew countries can afford the protective measures that US forces often enjoy, and based on our record these past years, we would probably have found more success taking more loses sooner in shorter wars. It probably would have been better on civilians as well.\n\nCivilians usually take the brunt of conflict, and in America’s recent history she had hardly been an exception to this rule. We are good at keeping our KIA numbers down (and at not talking about other casualty counts), but we aren’t good at delivering results or protecting civilians in the long run. \n\nRussia isn’t going to fight this like we would, and how that costs them or the people in the region will only be known in time. Right now it’s too soon to tell if the costs are worth it, as we don’t have any reliable information on what those costs even are.",
            "title_similarity": "0.3409146",
            "sentiment_compound": 0.8431
        },
        {
            "id": "hyox57a",
            "score": 2,
            "text": "\"WITNESS ME!\" - Ukraine",
            "title_similarity": "0.43397075",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyox89c",
            "score": 3,
            "text": "I served in a NATO armoured unit and from what I have seen from the Russians so far is very underwhelming.  This war is far from over so we can't count the Russians out yet, they have so much more resources to draw on.  Still, the idea of Russian forces invading Latvia or Poland after getting through with Ukraine seems impossible.  Russia can't manage logistics on its own border so I can't see them being able to do better with supply lines snaking through millions of hostile Ukrainians.  \n\nTheir young troops seem confused.  It's like they were never given a proper set of orders.  Their equipment is dated and their tactics don't seem coordinated across the battlefield (what's with dropping unsupported troops to be mopped up by local forces?).  \n\nFYI, armoured vehicles with multiple antennae are usually a troop leaders vehicle and he is relaying information to higher and giving direction to his men on the ground.  These are good vehicles to destroy.",
            "title_similarity": "0.58029103",
            "sentiment_compound": -0.7522
        },
        {
            "id": "hyox9bs",
            "score": 1,
            "text": "Russia has a big military.  They don’t seem to have a lot of soldiers though.",
            "title_similarity": "0.41820574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoxev8",
            "score": 2,
            "text": "when this is over Ukraine will have sunflower fields everywhere.",
            "title_similarity": "0.2242364",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoxlf4",
            "score": 2,
            "text": "Ukraine continues to kick the crap out of the Russians.",
            "title_similarity": "0.7934326",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyoxliq",
            "score": 2,
            "text": "I’m conflicted as on one side I’m glad Russia is at a loss and that Putin is hopefully shitting bricks right now knowing he’s fucked and that this isn’t as easy as he thought it would be. \n\nBut, at the same time though, so many lives on both ends are being lost over the insane decision of one man, and that Russians everywhere will face loss of family members while facing undeserved backlash over decisions that were not their own.",
            "title_similarity": "0.6645353",
            "sentiment_compound": -0.802
        },
        {
            "id": "hyoxmqg",
            "score": 5,
            "text": "They’ll never financially recover from this",
            "title_similarity": "0.4344651",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoxmt6",
            "score": 1,
            "text": "So who is going to roll into Russia after this and claim some territory?",
            "title_similarity": "0.34632713",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoxrf8",
            "score": 1,
            "text": "Is put putin really sending the best of his forces first or just the poor soldiers he finds can be killed to make Ukraine waste their ammunition. Then send a second third wave of troops and better equipment.",
            "title_similarity": "0.5497949",
            "sentiment_compound": -0.4654
        },
        {
            "id": "hyoxy1h",
            "score": 2,
            "text": "Putinism is a death cult. Heathcare? nah! Die a hero! /s",
            "title_similarity": "0.5514823",
            "sentiment_compound": -0.7339
        },
        {
            "id": "hyoy7xk",
            "score": 3,
            "text": "I'm concerned Putin might do something really dumb, like drop a nuke or something.... His ego is not going to like this resistance...",
            "title_similarity": "0.43877512",
            "sentiment_compound": -0.6472
        },
        {
            "id": "hyoyhat",
            "score": 1,
            "text": "Ukraine if they have the planes capable should bomb political buildings in Moscow.",
            "title_similarity": "0.5936392",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyoyne0",
            "score": 1,
            "text": "Slava Ukraini!\n\nAlso sparing a thought for the young men on both sides who have to endure this pointless war.",
            "title_similarity": "0.49465722",
            "sentiment_compound": -0.636
        },
        {
            "id": "hyoyqe6",
            "score": 3,
            "text": "My company sells aviation parts all around the globe to many different customers. We are no longer doing any business with Russia, Belarus, or Ukraine. Good luck to Russia on finding aviation parts with everyone black listing them. No banks are even allowing Russian payments.",
            "title_similarity": "0.48927826",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyoyqm6",
            "score": 1,
            "text": "3500 Russian soldiers KIA? How accurate are those numbers? Great for the Ukrainian defenders if true",
            "title_similarity": "0.47210422",
            "sentiment_compound": 0.3873
        },
        {
            "id": "hyoyqmt",
            "score": 2,
            "text": "I love it. Get fucked!",
            "title_similarity": "0.31204402",
            "sentiment_compound": -0.126
        },
        {
            "id": "hyoytic",
            "score": 3,
            "text": "Putin is a very dangerous man. I think he has lost his mind. I am very afraid eh is going to do something really bad.",
            "title_similarity": "0.64124453",
            "sentiment_compound": -0.8586
        },
        {
            "id": "hyoyviw",
            "score": 1,
            "text": "Vladdy has a wide set vageen and a heavy flow",
            "title_similarity": "0.39857978",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyoz0ei",
            "score": 4,
            "text": "\"They've got us surrounded... poor bastards.\"  \\~Ukraine probably.",
            "title_similarity": "0.66475916",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hyoz3fo",
            "score": 5,
            "text": "All the pointless loss of life just to inflate a dictator’s ego. I hope that one day he will be put on trial for all the war crimes he committed.",
            "title_similarity": "0.5502029",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyoz70h",
            "score": 1,
            "text": "“Instead of 2021 Afghanistan like Pewtin predicted, Russia got 1979 Afghanistan”",
            "title_similarity": "0.2954567",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyozf5b",
            "score": 2,
            "text": "I wonder if the fallout from this is Putin being deposed in a new Russian revolution? I wonder where this goes",
            "title_similarity": "0.49687266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyozfj6",
            "score": 2,
            "text": "As a Ukrainian, I will say, \"We told you not to fuck with us.\"",
            "title_similarity": "0.41967228",
            "sentiment_compound": 0.431
        },
        {
            "id": "hyoznyk",
            "score": 1,
            "text": "Just stop. Stop. Go home and let's just end this",
            "title_similarity": "0.2616304",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyozwb4",
            "score": 2,
            "text": "[And now the EU is asking Ukraine \"what sort of planes do you need and how many of each?\"](https://twitter.com/shashj/status/1498035551168983043?s=21)",
            "title_similarity": "0.4285431",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp03xo",
            "score": 3,
            "text": "Just going to leave this here\n\n[You not say Ukraine weak!](https://youtu.be/teSXcJlpMl8)",
            "title_similarity": "0.28815416",
            "sentiment_compound": -0.126
        },
        {
            "id": "hyp0i2a",
            "score": 3,
            "text": "500 armored vehicles. Holy shit. \n\nThey’re almost nearing what we lost to KIA in total in Iraq. \n\nWhat is Putin doing yo",
            "title_similarity": "0.5051252",
            "sentiment_compound": -0.8964
        },
        {
            "id": "hyp0obv",
            "score": 2,
            "text": "Here's hoping that Putin's echo chamber that he has created will be filled with his own screams of agony.",
            "title_similarity": "0.5982207",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hyp0q5g",
            "score": 2,
            "text": "This is heartening, but I can’t help but think we are at the point of the Battle of Helm’s Deep where Theoden wonders out loud “is this it? Is this all you can conjure Saruman?”\n\nRussia hasn’t pulled out the big guns that we know they have, and a losing desperate madman can make desperate decisions.",
            "title_similarity": "0.51590884",
            "sentiment_compound": -0.8594
        },
        {
            "id": "hyp0qzs",
            "score": 1,
            "text": "This source isn’t exactly independent. Don’t get me wrong, I want this to be true but you should temper your expectations from a news source like this.",
            "title_similarity": "0.24184616",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hyp102s",
            "score": 2,
            "text": "Unwinnable war for Putin from the very start. Even if he has rolled into each larger city with huge resistance, he still wouldn’t have been able to keep a puppet government in power for very long.",
            "title_similarity": "0.6015201",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyp10rk",
            "score": 2,
            "text": "Fantastic news!  Keep up the fight Ukraine!",
            "title_similarity": "0.5430748",
            "sentiment_compound": 0.3786
        },
        {
            "id": "hyp116o",
            "score": 5,
            "text": "according to a Feb. 26-27 survey by the group Rating. Across Ukraine, pessimistic sentiment is low and the level of faith in Ukraine’s armed forces has grown significantly.\n\nImagine that, your being invaded, your kids are blown up, and pessimism is at an all time low. \n\nIts like they finally can let all that built up resentment, grief, anger out after all those years of being bullied and fearmongered",
            "title_similarity": "0.60632527",
            "sentiment_compound": -0.9501
        },
        {
            "id": "hyp11bl",
            "score": 3,
            "text": "That’s the problem with ego, man. Surround yourself with people that will just tell you you’re right, and you’re gonna think you’re always right. \n\nIt’s a MUCH lesser extent since I don’t run a goddamn country, but this is the reason I’ve told my close friends and my family “if I’m fuckin up, tell me.” Because I’ve fucked up a lot and always thought I was right. You need people to keep you in check in regular life let alone running a massive country. Now he’s just getting teenagers killed and ruining his country.",
            "title_similarity": "0.45985",
            "sentiment_compound": -0.9524
        },
        {
            "id": "hyp15wb",
            "score": 3,
            "text": "I think the jump the shark moment will be when the kremlin sends in steven segal.",
            "title_similarity": "0.21729003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp18rb",
            "score": 3,
            "text": "Russia is a pariah nation now. \n\nWelcome to the Burma, North Korea, Sudan, Syria and Iran club you shit eating dirt bags. \n\nThey’ve guaranteed another iron curtain and Cold War isolating their freezing shithole to remain in the most primitive parts of the 20th century for another couple decades. \n\nMission Accomplished, Vladimir!",
            "title_similarity": "0.61122715",
            "sentiment_compound": -0.69
        },
        {
            "id": "hyp19sm",
            "score": 1,
            "text": "Ya know how you're not supposed to invade Russia in the winter? Same shit applies to the neighbors apparently",
            "title_similarity": "0.36115056",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyp1cmw",
            "score": 1,
            "text": "It’s crazy to think while under such duress the Ukrainians we’re able to count all of these casualties so quickly.",
            "title_similarity": "0.64467037",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyp1e3y",
            "score": 1,
            "text": "Is there any content about the fights? Videos? Maybe via telegram? Any chance to get content to share it to Russian friends so that They can share it further with their families in Russia? \nGoal: inform the people!",
            "title_similarity": "0.34257558",
            "sentiment_compound": 0.7936
        },
        {
            "id": "hyp1llr",
            "score": 2,
            "text": "They had it coming.  And if they agree to withdraw, they still need to be punished harshly by the world for this.",
            "title_similarity": "0.6536628",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyp1tj7",
            "score": 3,
            "text": "Thousands of young Russians and Ukrainians will die for nothing more than Putin’s ambitions. I’m happy Ukraine is holding out, I’m sad they had to.",
            "title_similarity": "0.62710357",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyp1vg9",
            "score": 1,
            "text": "You cannot just slowly try to roll in completely exposed armored divisions into deeply hostile territory without air superiority and overwhelming infantry support. I thought this was well-known info in 2022.",
            "title_similarity": "0.40305632",
            "sentiment_compound": -0.4257
        },
        {
            "id": "hyp1xzz",
            "score": 1,
            "text": "Does anyone know how this compares to Ukraine’s losses?",
            "title_similarity": "0.48704448",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyp1yos",
            "score": 1,
            "text": "and almost none of us those losses are the people who actually deserved to die",
            "title_similarity": "0.3556241",
            "sentiment_compound": -0.765
        },
        {
            "id": "hyp213g",
            "score": 3,
            "text": "Wanna know a quick and easy way to fix a slumping economy?? Using military force, grab a neighboring country that is smaller and doing better!\n\nHmmm? What's that? It probably won't work? Uhm, you sure? Bc we kinda already sent the tanks and everyone over to start already.",
            "title_similarity": "0.36330748",
            "sentiment_compound": 0.8538
        },
        {
            "id": "hyp23n0",
            "score": 2,
            "text": "Wholesome\n\nThe losses I mean",
            "title_similarity": "0.30760407",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyp28dh",
            "score": 5,
            "text": "You would think russia of all countries would understand who long city sieges can be.",
            "title_similarity": "0.52758837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp2nsq",
            "score": 1,
            "text": "I hope this doesn’t make Putin use heavier nuclear force. But with that psychopath it might just happen.",
            "title_similarity": "0.27340025",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hyp2u3h",
            "score": 1,
            "text": "Keep giving them hell Ukraini's. This is better than an underdog sports story cause the stakes...",
            "title_similarity": "0.3403838",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyp32b6",
            "score": 4,
            "text": "Putin called on Ukrainians to lower their weapons and turn against their government, the world calls on Russians to do the same. Pray for Ukraine.",
            "title_similarity": "0.6099462",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyp36xy",
            "score": 8,
            "text": "I think at this point I'm hoping...\n\n* Putin ends this calmly, and takes the loss.\n* China realizes how invading a country goes pretty poorly and doesn't do the same with Taiwan.",
            "title_similarity": "0.36883655",
            "sentiment_compound": 0.745
        },
        {
            "id": "hyp3arp",
            "score": 1,
            "text": "I'm still surprised they invaded to begin with. I thought invasion/land based wars were over.",
            "title_similarity": "0.3230488",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyp3ixi",
            "score": 9,
            "text": "Basic rule of war is concrete supply lines. This dumb dumb can’t even refuel his tanks! You’ve already lost Poutine, before you began.",
            "title_similarity": "0.56468254",
            "sentiment_compound": -0.9283
        },
        {
            "id": "hyp41rs",
            "score": 1,
            "text": "Best case scenario? Russia takes too long to stop Putin. They suffer near unrecoverable military losses. They spiral into financial ruin and the bailout is a complete dearming of their nuclear payloads.",
            "title_similarity": "0.71565014",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hyp48x3",
            "score": 1,
            "text": "https://youtu.be/1vdiEABLFoo",
            "title_similarity": "0.037567634",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp4cea",
            "score": 1,
            "text": "Ummm... Are we expecting nukes? How long before Putin gets desperate and says fuck it all?",
            "title_similarity": "0.48992974",
            "sentiment_compound": -0.7319
        },
        {
            "id": "hyp4mjb",
            "score": 1,
            "text": "I'm actually shocked at how ill prepared and seemingly inept the Russians are considering the size of their military. They've just come across as stupid and weak and any future threats against any nation won't be taken as seriously now that they've shown their hand.",
            "title_similarity": "0.53554916",
            "sentiment_compound": -0.8689
        },
        {
            "id": "hyp4rsi",
            "score": 3,
            "text": "People are far too quick to jump to conclusions, i hate Putin as much as the next guy, but he's clearly only sent the pawns in so far. Hardly a war of attrition after 4 days.",
            "title_similarity": "0.5424472",
            "sentiment_compound": -0.5765
        },
        {
            "id": "hyp4yke",
            "score": 1,
            "text": "They've got Ukraine surrounded. The poor bastards.",
            "title_similarity": "0.69089186",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hyp524c",
            "score": 45,
            "text": "I don't want to be pessimistic, but I think it's important to realize Russian doctrine is to fix the enemy no matter what the losses are, then launch the main attack. \n\nWe may not have seen the real fight yet.",
            "title_similarity": "0.41243565",
            "sentiment_compound": -0.9487
        },
        {
            "id": "hyp5jbq",
            "score": 1,
            "text": "Everyone else should start stealing their land back by moving fences like they did",
            "title_similarity": "0.47357148",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyp5ngc",
            "score": 1,
            "text": "Well the Russians will need to find a Nikita Khrushchev to get them out of this quagmire.",
            "title_similarity": "0.5501195",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyp62uj",
            "score": 1,
            "text": "this is why US is a big fan of drone attacks.",
            "title_similarity": "0.46113074",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyp6akk",
            "score": 8,
            "text": "Any way to verify this information?",
            "title_similarity": "0.018566255",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp6e4p",
            "score": 3,
            "text": "What’s also sad is that 1) military is mandatory in Russia for all 18+ year olds and that 2) those 18 year olds are being sent into Ukraine without even knowing who they will be fighting and for what.\n\n“Oh y’all are being sent for a military exercise, give up your phone and get into a truck”\n\n“Hey boys, Ukraine is attacking us. Go fight or face a tribunal, we will give all the information over to the FSB (Russian FBI)” \n\nAs a result, many young 18-20 year olds are killed in a war they don’t wanna fight. The lucky (and smart) ones give in to Ukrainian soldiers",
            "title_similarity": "0.6917913",
            "sentiment_compound": -0.9468
        },
        {
            "id": "hyp6nu6",
            "score": 1,
            "text": "This puts a smile on my face",
            "title_similarity": "-0.06624649",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyp6pxv",
            "score": 7,
            "text": "^Ukraine:\n\nCall an ambulance!\n\n#But not for me",
            "title_similarity": "0.5177222",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp6q4x",
            "score": 1,
            "text": "3,500 is an astronomical number for just a few days. The US lost just slight more (4500) in the entire second gulf war.",
            "title_similarity": "0.36456656",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hyp741j",
            "score": 1,
            "text": "In any Hollywood blockbuster I would laugh off the level of heroism shown by Ukraine as completely over the top.",
            "title_similarity": "0.45021826",
            "sentiment_compound": 0.9241
        },
        {
            "id": "hyp7nxy",
            "score": 1,
            "text": "Russia is trying the killbot strategy.",
            "title_similarity": "0.5139741",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp7xd3",
            "score": 1,
            "text": "All credit to Ukrainian forces for their immense courage and fight, but this exposes Russia big time. Sure, Russia hasn't utilised all of its capabilities, but it's failing (after almost a year of preparation) to take a country that is literally on its doorstep, and is now resorting to desperate nuclear weapon threats. \"Mighty Russia\" indeed.",
            "title_similarity": "0.610881",
            "sentiment_compound": -0.891
        },
        {
            "id": "hyp7zu5",
            "score": 1,
            "text": "Ukraine is game to you? How about I smash your little board?",
            "title_similarity": "0.5990473",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp83as",
            "score": 3,
            "text": "Russian leaders sending men in to die, while the leaders relax the safety of their own homes. \n\nCondolences to the Ukrainian and Russian casualties, who are victims of the greed of Russian leaders. Such an infuriating and senseless tragedy.",
            "title_similarity": "0.59631586",
            "sentiment_compound": -0.9001
        },
        {
            "id": "hyp89j7",
            "score": 1,
            "text": "How tragic for the Russian people and their soldiers. It’s honesty the saddest thing I’ve seen in awhile - these soldiers can’t possibly want to carry out these orders. There’s nothing in it for them or their families.",
            "title_similarity": "0.617845",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyp8bx3",
            "score": 2,
            "text": "Imagine being a massive country and waging a war on a tiny country and getting butt fucked. Hilarious.",
            "title_similarity": "0.70095193",
            "sentiment_compound": -0.765
        },
        {
            "id": "hyp8cng",
            "score": 12,
            "text": "I feel horrible for these kids Putin is using as cannon fodder what an awful situation to be in. Hope some of them can surrender and get off the lines.",
            "title_similarity": "0.6141251",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hyp8da0",
            "score": 3,
            "text": "Here’s to Putin and Lukoshenko being ousted!",
            "title_similarity": "0.5971898",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyp8mdg",
            "score": 4,
            "text": "Even after this atrocity the global community needs to choke the absolute fuck out of Russia. Like sanction the ever-loving shit out of them to the point they are begging to survive. Force putin to grovel and beg for relief, then make him stand trial for the murder of thousands upon thousands of innocent people. Russia needs to held to the flames since they don't ever seem to get the message.",
            "title_similarity": "0.735078",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hyp9o69",
            "score": 3,
            "text": "Putin is a fool. Their army sucks. I would prefer that the USA never has to go to war again but in this sort of combat we would wipe them off the face of the earth.",
            "title_similarity": "0.52487475",
            "sentiment_compound": -0.8266
        },
        {
            "id": "hypa5bi",
            "score": 1,
            "text": "OK now you can go home we’ve had enough of that",
            "title_similarity": "0.14159599",
            "sentiment_compound": 0.4466
        },
        {
            "id": "hypab7h",
            "score": 2,
            "text": "Is this really true? I want to believe, but it’s hard to believe that one of the mightiest armies in the world is doing so badly.",
            "title_similarity": "0.4039486",
            "sentiment_compound": -0.6964
        },
        {
            "id": "hypaydo",
            "score": 4,
            "text": "Bleed them dry Ukraine, water the ground with their blood.",
            "title_similarity": "0.5670968",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypbbjh",
            "score": 4,
            "text": "I have a theory that the Russian military doesn’t want to fight this war for Putin. Low moral will lose you a war. If the previous video I saw of captured soldiers is true and they thought it was an exercise. Not going to turn out well.",
            "title_similarity": "0.45135045",
            "sentiment_compound": -0.8939
        },
        {
            "id": "hypbfx3",
            "score": 2,
            "text": "What about Ukrainian losses? Does anyone know if there's a data center that we can check to see the war losses as this evolves?",
            "title_similarity": "0.5286184",
            "sentiment_compound": -0.8645
        },
        {
            "id": "hypbhao",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.25767428"
        },
        {
            "id": "hypbuzt",
            "score": 14,
            "text": "The way I see it one of two possibilities are occurring.\n\n1) Putin miscalculated the capabilities of Ukraine and figured they would bend over and take it similar to Crimea. \n\n2) The Russians are sending their expendable young conscripted units out to test the waters and wear down the resistance forces.\n\nThe way things have been playing out (heavy losses, Russian soldiers that aren't even putting up a fight, no Spetnatz to be seen, etc.) Makes me think option #2 is the more likely situation. I hope that this is not the case because it means that without UN intervention (and more realistically the US) Ukraine is going to be facing extremely dark times in the days to come.",
            "title_similarity": "0.5760075",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hypc29h",
            "score": 3,
            "text": "The logistical abilities of the Russian military is terrible. Tanks running out of fuel, begging a petrol station for fuel, then getting detained. It’s comical. Putin’s a fucking idiot, someone needs to put a bullet in his head.",
            "title_similarity": "0.6921251",
            "sentiment_compound": -0.8122
        },
        {
            "id": "hypc2mp",
            "score": 2,
            "text": "I so hope this takes down Putin power and approval rating. All pro Ukraine countries indirectly will help Ukraine with food/ammunition/armor. Hope Ukraine has enough will power and boots on ground to Fuck Putin and his puppets. This jackass needs to learn a lesson.",
            "title_similarity": "0.54312503",
            "sentiment_compound": 0.6301
        },
        {
            "id": "hypccxp",
            "score": 5,
            "text": "While it's certain that Russia miscalculated, I'm not 100% willing to trust numbers from the Ukraine defense ministry since it's fully in their best interests to exaggerate",
            "title_similarity": "0.54453635",
            "sentiment_compound": 0.8948
        },
        {
            "id": "hypco58",
            "score": 1,
            "text": "Like bannerlord siege that did not go as well as expected.",
            "title_similarity": "0.40419245",
            "sentiment_compound": 0.1744
        },
        {
            "id": "hypcp1g",
            "score": 1,
            "text": "This is probably the worst decision ever in military history Russia is already being punished with massive amount of sanctions for this I fail to see what taking Ukraine is even going to do.\n\nAlso annexing Ukraine is meaningless once Putin is up the next president after him will probably just give Ukraine its independence again this war is meaningless",
            "title_similarity": "0.7258314",
            "sentiment_compound": -0.9683
        },
        {
            "id": "hypcvil",
            "score": 2,
            "text": "Let's hope this is true!",
            "title_similarity": "-0.002513403",
            "sentiment_compound": 0.7177
        },
        {
            "id": "hypd5oa",
            "score": 1,
            "text": "Ukraine is to war like the bengals were this year in the NFL. Putins mistake was thinking they were the jets",
            "title_similarity": "0.67916346",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hypdlnn",
            "score": 1,
            "text": "I don't get how a world superpower is as weak as this? Can someone ELI5 ?\n\nThe conspiracy theorist part of me is developing a complex \"Something else is happening here that we can't see\" theory and I don't want to humour it.",
            "title_similarity": "0.35592085",
            "sentiment_compound": -0.8568
        },
        {
            "id": "hypdufp",
            "score": 3,
            "text": "These numbers are very similar to those released by TASS and appeared on the livefeed a few hours ago, so I think they are accurate.",
            "title_similarity": "0.14814854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hype0zi",
            "score": 4,
            "text": "Mess with the bull and you get the fucking horns, motherfucker. I hope Putin burns in hell.",
            "title_similarity": "0.58870864",
            "sentiment_compound": -0.8773
        },
        {
            "id": "hypehkt",
            "score": 9,
            "text": "VIZZINI: You fell victim to one of the classic blunders. The most famous is “Never get involved in a land war in Asia.” But only slightly less well known is this: “Never go in against a Sicilian when death is on the line! Ahahahaha, ahahahaha, ahahaha–",
            "title_similarity": "0.3943808",
            "sentiment_compound": -0.8338
        },
        {
            "id": "hypf4bo",
            "score": 2,
            "text": "And just like that, Spetsnaz reputation got replaced by Ukrainian grit.",
            "title_similarity": "0.51083297",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hypflcv",
            "score": 1,
            "text": "They really thought they were going to “shock and awe” them and then roll into the capitol like it was Baghdad.",
            "title_similarity": "0.43749326",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hypfmex",
            "score": 2,
            "text": "Nowadays everybody wanna talk like they got something to say\n\n\nBut nothing comes out when they move their tanks, it’s just a bunch of ol’rubbish. \n\nThe muthafuckas act like they forgot about Ukraine.",
            "title_similarity": "0.47389913",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hypfz2t",
            "score": 1,
            "text": "They think [Ukraine is weak](https://24.media.tumblr.com/25be3c8d17d0fa0d43e4b5b12ddbd068/tumblr_mrdh49JVbC1s2qde4o3_1280.png)",
            "title_similarity": "0.49720234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypg7eh",
            "score": 2,
            "text": "Glory to Ukraine! Glory to heroes! Invaders eat a dick!",
            "title_similarity": "0.5434657",
            "sentiment_compound": 0.8349
        },
        {
            "id": "hypg8jq",
            "score": 2,
            "text": "If true, GOOD.\n\nThis is enraging.  \n\nIt should be beyond expensive to secure Ukraine and I hope that make it more expensive to hold it every day that the Russians are there.",
            "title_similarity": "0.56566274",
            "sentiment_compound": 0.7865
        },
        {
            "id": "hypggzy",
            "score": 3,
            "text": "It's good to see Ukraine wasn't a sitting duck, nor a game to Putin.",
            "title_similarity": "0.2416579",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hypghl3",
            "score": 3,
            "text": "Did the Ukrainian government throw open the arsenals? If the people are armed this conflict could continue beyond the capital/government falling. It's nearly impossible to govern an armed population without their consent.",
            "title_similarity": "0.6576452",
            "sentiment_compound": -0.5982
        },
        {
            "id": "hypgo70",
            "score": 7,
            "text": "In the spirit of Russia being complete ass hats, let’s all learn how to say “go fuck yourself” in Ukrainian!\n\nSpelling: **іди ебати себе**\n\nPronunciation: **idy ebaty sebe**",
            "title_similarity": "0.6127996",
            "sentiment_compound": -0.7644
        },
        {
            "id": "hyph8i7",
            "score": 1,
            "text": "I don't think heavy losses are new to Russia. Have you seen the death count for ww2? It's rediculously imbalanced.",
            "title_similarity": "0.4956909",
            "sentiment_compound": -0.3903
        },
        {
            "id": "hyphd77",
            "score": 1,
            "text": "Putin is either feeling really stupid or really desperate right now.",
            "title_similarity": "0.55005187",
            "sentiment_compound": -0.699
        },
        {
            "id": "hyphk7f",
            "score": 2,
            "text": "Curious about the numbers for Ukraine, comparibly. Heavy loss for Russia is great but means nothing if Ukraine is having the same, right?",
            "title_similarity": "0.5939374",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hyphuuj",
            "score": 2,
            "text": "They underestimated phantom drone strikes with missiles coming out of the sky like fucking zeus.",
            "title_similarity": "0.48031518",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hypi0rc",
            "score": 1,
            "text": "But what did it cost \n\nEverything ….",
            "title_similarity": "0.29363263",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypiuji",
            "score": 3,
            "text": "Correct. However, what are the casualties of Ukraine so far? No one seems to be reporting this, only the Russian loses.",
            "title_similarity": "0.5963478",
            "sentiment_compound": -0.5829
        },
        {
            "id": "hypix8e",
            "score": 1,
            "text": "Russia expected it to be like Crimea in 2014 where they were welcomed with embrace.",
            "title_similarity": "0.20048031",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hypj0re",
            "score": 2,
            "text": "A caged animal will strike out desperately, Putin might just go nuclear rather than face an embarrassing defeat.",
            "title_similarity": "0.42231628",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hypja1r",
            "score": 2,
            "text": "I feel like every post I see about this, it’s just a huge circus.  How is this real life?  Russia invades Ukraine, runs out of gas, soldiers deflect, man tows a tank with a tractor.  What is even going on? 🤯",
            "title_similarity": "0.72024286",
            "sentiment_compound": 0.6322
        },
        {
            "id": "hypjc8k",
            "score": 2,
            "text": "Hasn’t been a week yet and they’ve lost a ton of equipment. Not going to have much left after a few more weeks of this. Lol.",
            "title_similarity": "0.4247679",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hypjdpd",
            "score": 2,
            "text": "Well if I were Russia, I'll be throwing everything at Ukraine now. It's not the time to be throwing in noobie recruit as cannon foughter. Cause now that situation has gotten so internationally for Russia, if they don't win the downfall of Putin regimes is going to be the least of their problem. Russia is probably going to be split apart again (the 22 republics within most if not all are going to declare independence) . Russia might be force to pay reparation to Ukraine while already broke AF. There's probably going to be revolution and the US and EU are going to \"govern\" it to \"maintain\" stability. It's going to be one of the poorest nation in the world, and it's people are either going to stay and starve or immigrate to another country.",
            "title_similarity": "0.63827264",
            "sentiment_compound": -0.9227
        },
        {
            "id": "hypkk4z",
            "score": 3,
            "text": "This is not going how I expected but I am so glad Ukraine is on its way to victory.",
            "title_similarity": "0.32704854",
            "sentiment_compound": 0.743
        },
        {
            "id": "hypkwm4",
            "score": 1,
            "text": "Imagine being so useless you can surround an entire country and still lose?",
            "title_similarity": "0.59405434",
            "sentiment_compound": -0.7443
        },
        {
            "id": "hypky1f",
            "score": 2,
            "text": "Ukraine citizens aint nothing to mess with.",
            "title_similarity": "0.214223",
            "sentiment_compound": -0.2075
        },
        {
            "id": "hyplccd",
            "score": 3,
            "text": "Putin sent the sacrificial lambs to the slaughter. It seems it's all young men (conscripted?), undertraimed and ill-equipped. Many may not be there voluntarily or even know why they are there (indoctrinated or blindly following orders). Is this really the state of the second strongest military superpower in the world or is Putin lulling everyone into a false sense of security before unveiling his true might? Either way, Europe and the rest of the world need to act and not let off the gas until this whole Russia thing is squashed.\n\nEdit: Also, let's not forget our qualm isn't with the Russian people, but with Putin and his enablers.",
            "title_similarity": "0.5892224",
            "sentiment_compound": 0.6178
        },
        {
            "id": "hyplekf",
            "score": 1,
            "text": "FUCK PUTIN BRO literally sacrificing his own men for some arbitrary reason",
            "title_similarity": "0.6278311",
            "sentiment_compound": -0.6408
        },
        {
            "id": "hyplgge",
            "score": 1,
            "text": "Is this the best military Russia has? What’s with all the old equipment? Did we travel back in time to the 1980’s?",
            "title_similarity": "0.32480928",
            "sentiment_compound": 0.6946
        },
        {
            "id": "hyplqnf",
            "score": 2,
            "text": "Iron morale and balls of steel those ukrains",
            "title_similarity": "0.429227",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyplqsn",
            "score": 3,
            "text": "Unfortunately in Russia the only news they are hearing, is saying that reports of losses and surrenders/captures are all Ukrainian nazi propaganda, and in fact Russian forces have walked in unopposed in a friendly and non-violent manner. Unfortunately the Ukrainians are using their civilians as human shields, in a shocking war crime fashion, and so Russia must continue the attack in order to protect the innocent Ukrainian/Russian civilians. \n\nNot an /s. This is actually what they are being told and believe to be true. All Russian war crimes are false propaganda, or ukrainian war crimes. Russia is in fact winning. However the evil west are on the side of the ukrainian Nazis, and the sanctions being imposed are a sign of this. \n\nIn order to prevent the evil starvation of the poor Russian citizenry, we must oppose the western world, who have been overrun with nazis. \n\nSo... yeh. Russian public is on the side of Putin, and a lot of them think massive bombing runs and the use of nukes is completely valid in order to protect their freedom from oppression. (Western oppression, that is. Everyone is free in Russia.)",
            "title_similarity": "0.5657933",
            "sentiment_compound": -0.9643
        },
        {
            "id": "hyplqt9",
            "score": 1,
            "text": "Any Hoi4 players here?",
            "title_similarity": "0.076360755",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyplum5",
            "score": 1,
            "text": "Russia has no friends boo hoo",
            "title_similarity": "0.5396677",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hypme8h",
            "score": 1,
            "text": "Putin is not Russia Putin is a little man with a big ego problem",
            "title_similarity": "0.4151375",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hypmnue",
            "score": 1,
            "text": "If Ukraine is victorious they should consider invading Russia.",
            "title_similarity": "0.46550667",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypmpza",
            "score": 12,
            "text": "I have never felt so fortunate to be able to freely do yard work as I did today. Thinking of the Ukrainians all day, hoping they are free to do their own yard work at their homes very soon.",
            "title_similarity": "0.2509856",
            "sentiment_compound": 0.9143
        },
        {
            "id": "hypnang",
            "score": 1,
            "text": "Is there any realistic scenario where Ukraine pulls this out without outside assistance?  The military comparison pre-invasion was massively in Russia’s favor but I keep hearing these optimistic Cliff notes.",
            "title_similarity": "0.4222862",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hypo4yf",
            "score": 4,
            "text": "It took the US over a month to secure Fallujah in Iraq. With all of their intel and toys and a relatively weak to non-existent army to oppose them.\n\nKyiv is a modern western city with a modern military and western backing.\n\nPutin really thought they could take over the whole country in five days.\n\nInsanity.",
            "title_similarity": "0.53100485",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hypoda3",
            "score": 1,
            "text": "i need ammunition, not a ride\nhttps://imgur.com/KajH8tn",
            "title_similarity": "0.32483327",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypokn7",
            "score": 2,
            "text": "Metal up your ass Putin.   May you meet your well deserved Qaddafian fate.",
            "title_similarity": "0.34472173",
            "sentiment_compound": -0.34
        },
        {
            "id": "hypopl9",
            "score": 3,
            "text": "Get em, Ukraine! Much love from the US",
            "title_similarity": "0.3135997",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hyppf7a",
            "score": 3,
            "text": "At this point, it is a war of attrition. Like a lot of news outlets and analysts have said, the longer this war goes on, the more civil unrest there will be back in Russia. I really do hope Ukraine holds out long enough for them to experience peace again.",
            "title_similarity": "0.666083",
            "sentiment_compound": -0.0891
        },
        {
            "id": "hyppipa",
            "score": 2,
            "text": "I wonder if they gave every soldier a rifle this time or if reinforcements are expected to pick up their predecessor's gear again.",
            "title_similarity": "0.24142933",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyppk3b",
            "score": 1,
            "text": "This is like what Finland did to the USSR in the Winter War.  But Russia so big and has so many more soldiers and equipment. \n\nPutin, I believe, will only back down if China pulls his leash.",
            "title_similarity": "0.5865319",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hyppoat",
            "score": 5,
            "text": "Putin go fuck yourself!\n\nGlory to Ukraine 🇺🇦",
            "title_similarity": "0.6393274",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyppsjx",
            "score": 1,
            "text": "Good. Hope they felt every second of it too.",
            "title_similarity": "0.108471915",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hyppx4h",
            "score": 1,
            "text": "I haven't seen anything about casualties on the Ukrainian side. While it's good to see Russia getting what they deserve I hope it isn't coming at to heavy a cost for Ukraine",
            "title_similarity": "0.26172054",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hypq0id",
            "score": 1,
            "text": "liveuamap.com allows you to see what happens from afar. Data is obviously outdated and probably inexact at times but it was surprisingly good",
            "title_similarity": "0.25006267",
            "sentiment_compound": 0.7684
        },
        {
            "id": "hypq378",
            "score": 3,
            "text": "It's almost like betting everything ICBMs doesn't really help you with \"liberation\" invasions, who knew?",
            "title_similarity": "0.34142536",
            "sentiment_compound": -0.069
        },
        {
            "id": "hypqigb",
            "score": 3,
            "text": "I feel so bad for all the Russian children that have been sent to their death for the sake of Putin and his ego",
            "title_similarity": "0.7485342",
            "sentiment_compound": -0.8552
        },
        {
            "id": "hypqp4m",
            "score": 2,
            "text": "Source is a little biased. I hope it’s true but obv skeptical.",
            "title_similarity": "0.16172576",
            "sentiment_compound": -0.1619
        },
        {
            "id": "hypqtac",
            "score": 3,
            "text": "Sounds like the majority of the forces sent in were young conscripts. I wonder if the Ukrainian forces will be able hold back the main force, veterans and special forces. \n\nEither way, not a good luck for arguably the second most powerful military in the world.",
            "title_similarity": "0.4447471",
            "sentiment_compound": 0.3415
        },
        {
            "id": "hypquky",
            "score": 3,
            "text": "Russia's military might always seemed kind of terrifying before.\n\n\nNow it's a massive joke.\n\n\nThe only scary thing about Russia atm is the nukes and Putin's lust for power.",
            "title_similarity": "0.5533341",
            "sentiment_compound": -0.7178
        },
        {
            "id": "hypqvke",
            "score": 3,
            "text": "Up voting seems weird. I fucking hate that. I hate what russia is doing but the last thing I want to see is anyone die so needlessly.",
            "title_similarity": "0.67789936",
            "sentiment_compound": -0.8778
        },
        {
            "id": "hypr1m7",
            "score": 3,
            "text": "a completely unverifiable source. way to go reddit",
            "title_similarity": "0.4179192",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyprait",
            "score": 7,
            "text": "Russia has become that cliché rogue terrorist nation with nukes.",
            "title_similarity": "0.6574719",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hyprxsu",
            "score": 3,
            "text": "It seems there have been way more losses on the Russian side than the Ukrainian side. How did that happen?",
            "title_similarity": "0.5604626",
            "sentiment_compound": -0.4576
        },
        {
            "id": "hypry1l",
            "score": 1,
            "text": "Interesting the difference between Afghanistan and Ukraine.",
            "title_similarity": "0.4889841",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyps0k0",
            "score": 3,
            "text": "Young men and maybe women? sent to their deaths because of some delusional fucking vision of a maniac",
            "title_similarity": "0.5229639",
            "sentiment_compound": -0.204
        },
        {
            "id": "hyps7cx",
            "score": 1,
            "text": "But what about ukranian losses among citizens?",
            "title_similarity": "0.41609842",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hypstb6",
            "score": 4,
            "text": "Fuck these guys, like seriously, fuck these motherfuckers. They didn’t expect this kind of response, and it’s amazing to see it, and fuck them.",
            "title_similarity": "0.40771288",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hypt6nc",
            "score": 2,
            "text": "The war is costing Russia an estimated $20 Billion per day.",
            "title_similarity": "0.54734826",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hypta7a",
            "score": 7,
            "text": "This might end up being the fall of Russia. Based on estimates of total forces air and ground (navy is a joke once they burn their current missile stockpile) the current commitments and financial resources they have at their disposal will not allow them an easy victory. As seen. If they dip too far into their resources they don't have the production capacity for new armaments. They are trying to subdue Ukraine using everything that's about to expire, the 80s tech. If they hold out, that gets rid of that and Russia can't produce the new stuff in volume for a multitude of reasons. At that point they become a super dangerous NK type nation.",
            "title_similarity": "0.5885366",
            "sentiment_compound": 0.6941
        },
        {
            "id": "hyptau3",
            "score": 4,
            "text": "This is why dangerous autocratics hate the academics and intellectuals",
            "title_similarity": "0.6357044",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hypte51",
            "score": 1,
            "text": "Turn the guns towards the capital. Eject put in by force",
            "title_similarity": "0.44058144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypth5a",
            "score": 4,
            "text": "Having the element of surprise is a huge advantage in battle. Unfortunately for Russia, the only ones surprised about the attack were their soldiers doing the attacking. They had no preparations, no plans, just a bunch of scared/confused kids who were ordered to attack. You would think a KGB super spy would know how that was going to turn out.",
            "title_similarity": "0.46324554",
            "sentiment_compound": -0.5126
        },
        {
            "id": "hyptlqm",
            "score": 2,
            "text": "I don't think we've seen all that Russia has to throw in tbh.",
            "title_similarity": "0.4410683",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyptr4k",
            "score": 8,
            "text": "They just revealed how much Russia's military sucks ass. They're so bad that Putin is already threatening with nukes, which should be the very last option. It's like sucker punching someone and isn't fair.",
            "title_similarity": "0.74052876",
            "sentiment_compound": -0.9438
        },
        {
            "id": "hyptrsg",
            "score": 9,
            "text": "Putin’s (imminent) fate. Either:\n\n1. Suicide \n2. Assassination (by his generals)\n\nWhat do you think?",
            "title_similarity": "0.53863066",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hyptyym",
            "score": 3,
            "text": "I wonder if part of it has to do with the Russians themselves. We already know that some of them were not told they'd be killing Ukrainians. Are some of them just not fighting as hard as they \"could\"? It'll be interesting to see the stories on the ground on both sides. I wonder if Russians are surrendering, for example.",
            "title_similarity": "0.48461315",
            "sentiment_compound": -0.0757
        },
        {
            "id": "hypu6nx",
            "score": 4,
            "text": "This is just like in Civ when I size up the neighbors and realize I can *totally* use my 3 archers, spearman and a scout to take over that city state in my way.\n\nSpiker alert: I usually take heavy losses on a fronts",
            "title_similarity": "0.56574535",
            "sentiment_compound": 0.25
        },
        {
            "id": "hypuj5r",
            "score": 1,
            "text": "What will a Post-Putin Russia be?",
            "title_similarity": "0.29852402",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypulxw",
            "score": 8,
            "text": "This is pretty much Russia’s Vietnam",
            "title_similarity": "0.27802593",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hypum03",
            "score": 1,
            "text": "Keep on collecting those Russian dog tags/patches, Ukraine! \n\nNLaw We Trust!",
            "title_similarity": "0.42137554",
            "sentiment_compound": 0.5972
        },
        {
            "id": "hypunpk",
            "score": 7,
            "text": "Good fuck Russia, and death to fascist scum. Get the fuck out of a country you don’t belong and go back home.",
            "title_similarity": "0.59678626",
            "sentiment_compound": -0.9118
        },
        {
            "id": "hypuotj",
            "score": 3,
            "text": "What is a “BBM” in the context of the article? Google was not helpful on this.",
            "title_similarity": "0.24731639",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hypuw7z",
            "score": 1,
            "text": "This does put a smile to my face, 4rd largest military getting wrecked",
            "title_similarity": "0.36162093",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hypv1fy",
            "score": 4,
            "text": "Ukrainians created website where russian people can find their captured sons/fathers/husbands but rospotrebnadzor (censorship machine they have ) blocked access to it not spread sad statistics",
            "title_similarity": "0.4772292",
            "sentiment_compound": 0.2917
        },
        {
            "id": "hypvc5e",
            "score": 6,
            "text": "There's only one life Russia needs to lose in this war, and he's the one person living in a secluded billion dollar mansion barking orders behind a well made desk wrapped in silk.",
            "title_similarity": "0.4509143",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hypvg9i",
            "score": 3,
            "text": "Russian military strategy also feels... Suspect. \n\nI'm no expert, but modern warfare doesn't seem to support large troop lines with tanks anymore. \n\nRussia is rolling long columns of tanks and personnel transports and it just seems like that isn't the play when one man with a single use rocket tube on a hill can take out an entire truck/tank worth more than said rocket.",
            "title_similarity": "0.5603168",
            "sentiment_compound": -0.5915
        },
        {
            "id": "hypvnk3",
            "score": 1,
            "text": "Dont get all too excited. This is just like the 1st week.  Arent wars months-years long?",
            "title_similarity": "0.3040508",
            "sentiment_compound": 0.7798
        },
        {
            "id": "hypw0hw",
            "score": 3,
            "text": "Good new but also still sucks for all those Russian soldiers who didn’t want to be there in the first place. Putin deserves nothing less than a rope",
            "title_similarity": "0.6207093",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hypwb0k",
            "score": 2,
            "text": "Discipline beats numbers 9 times out of 10.",
            "title_similarity": "0.23358145",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypwcl8",
            "score": 4,
            "text": "Ukraine is using Turkish drones to attack from the air!!!",
            "title_similarity": "0.51405907",
            "sentiment_compound": -0.6093
        },
        {
            "id": "hypwenj",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.25767428"
        },
        {
            "id": "hypx25b",
            "score": 9,
            "text": "I hope this is true and not just propaganda to boost morale.",
            "title_similarity": "-0.03461039",
            "sentiment_compound": 0.8458
        },
        {
            "id": "hypx9h4",
            "score": 3,
            "text": "In the weeks and months before the invasion the media kept yammering on about how Ukraine was no match for the Russians and how Ukraine had no real chance in this. What’s the deal with that? Is the US government smart enough to have used the media to spread disinformation to Russia?",
            "title_similarity": "0.6153749",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hypxtou",
            "score": 1,
            "text": "Kinda hope they just lose everything and Russia becomes Ukraine lol",
            "title_similarity": "0.59415996",
            "sentiment_compound": 0.4033
        },
        {
            "id": "hypxugw",
            "score": 1,
            "text": "Kinda hope they just lose everything and Russia becomes Ukraine lol",
            "title_similarity": "0.59415996",
            "sentiment_compound": 0.4033
        },
        {
            "id": "hypy2qt",
            "score": 2,
            "text": "Thought they were gonna blitzkrieg huh",
            "title_similarity": "0.3741595",
            "sentiment_compound": 0.0
        },
        {
            "id": "hypy5vs",
            "score": 2,
            "text": "I’ll donate gofundme for Russian body bags. The more the better.",
            "title_similarity": "0.3338381",
            "sentiment_compound": 0.4902
        },
        {
            "id": "hypy64t",
            "score": 2,
            "text": "Problem is, he still has his red button",
            "title_similarity": "0.25129375",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hypy689",
            "score": 2,
            "text": "Forbes Top 40 most powerfull people in the world\n“Number #2 Vladimir Putin”\n\nLol :)",
            "title_similarity": "0.40322453",
            "sentiment_compound": 0.765
        },
        {
            "id": "hypyizg",
            "score": 4,
            "text": "Trump must be devastated.",
            "title_similarity": "0.6593319",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hypytz8",
            "score": 3,
            "text": "As an American, it’s nice to see someone else fail at an invasion.",
            "title_similarity": "0.16418424",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hypz1qw",
            "score": 1,
            "text": "Goes to show you how amazing the US military is. Sailing and Flying to Iraq, 8500 miles away. Lauching 1000s of guided bombs and sorties. They achieved total full spectrum air superiority in about 3 hours after the first cruise missiles launched..... Russia has lost more men in 5 days in their Invasion of Ukraine, than the US military in it's entire Iraqi occupation of 11 years... America never lost any fighters to enemy bandits. And apart from the Battle of Fallujah, no battle had more than 30 deaths for the US military. \n\n&#x200B;\n\nSaddam was found in a hold in the ground in his pajamas and hung later. \n\n&#x200B;\n\nIraq had the largest Army in the middle east at the time of Invasion. They had the largest amount  of towed atrilery. They had Mig 29s and SU 25s.  And S200 air defense systems. \n\n&#x200B;\n\nAnd. It. Meant. Nothing. \n\n&#x200B;\n\n&#x200B;\n\nRussia. You are not on America's level. Hell, you're not even on your little brothers level. Ukraine is pushing your shit in. Hard. You should retreat. While you can.",
            "title_similarity": "0.4447158",
            "sentiment_compound": -0.6914
        },
        {
            "id": "hypz91q",
            "score": 1,
            "text": "Fuck Putin and every one of those oligarch arseholes who have enabled him.",
            "title_similarity": "0.7045199",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hypzu1n",
            "score": 1,
            "text": "act like its fake russian news and kill more?",
            "title_similarity": "0.63459617",
            "sentiment_compound": -0.743
        },
        {
            "id": "hyq01fx",
            "score": 2,
            "text": "Half the Russian soldiers probably don't even want to be there.",
            "title_similarity": "0.4749959",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hyq07yr",
            "score": 2,
            "text": "He will be the shame of his people for generations",
            "title_similarity": "0.71301985",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyq0i6d",
            "score": 5,
            "text": "He fell victim to one of the classic blunders.",
            "title_similarity": "0.4563711",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hyq0mpq",
            "score": 1,
            "text": "Ukraine is filled with some mad lads.",
            "title_similarity": "0.73335963",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyq0mqo",
            "score": 3,
            "text": "There’s no way Russia will be able to stabilize these cities. I’m not sure what they hell they’re thinking.",
            "title_similarity": "0.48837656",
            "sentiment_compound": -0.8299
        },
        {
            "id": "hyq0vwm",
            "score": 3,
            "text": "My goodness, it’s like reading a report from WW2. Such a pointless waste of life. Many of the Russian soldiers are practically children who thought they were signing up for boot camp. \n\nSome of them were captured and the Ukrainian soldiers let them call their parents, who were very surprised these untrained, very young men were fighting in Ukraine. [Twitter](https://mobile.twitter.com/SethAbramson/status/1497706057891823623?cxt=HHwWjoC-6a7u9cgpAAAA)",
            "title_similarity": "0.5488041",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hyq0xkt",
            "score": 3,
            "text": "Honestly, Russia is a bunch of bitches. Cowards.",
            "title_similarity": "0.7033806",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyq18w9",
            "score": 2,
            "text": "“Everyone has a plan until they get punched in the mouth.” - Mike Tyson.",
            "title_similarity": "0.49906415",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq1mpb",
            "score": 2,
            "text": "Anyone else nervous about this?? I feel like Putin is too much of an egotistical warlord to admit defeat.... and Ukraine has no nuclear deterrence aside from the Budapest memorandum, which is hard to trust imo. With Ukraine kicking Russia's conventional army's ass, I feel like we're gonna see Putin start flexing Nuclear more.",
            "title_similarity": "0.5368763",
            "sentiment_compound": -0.5204
        },
        {
            "id": "hyq1uik",
            "score": 2,
            "text": "And again…. What the f is the point of this???   \nGod bless Ukrainian people, all who support.   This invasion is beyond madness.   \nAnd the Donald say…. Putin is a genius?????\nI fear for all fighting for truth.   I have heartwarming feelings as I read many accounts of many in other countries assisting.    We are a global community.   Many are connected genetically so to speak in in this region.",
            "title_similarity": "0.6383336",
            "sentiment_compound": 0.6843
        },
        {
            "id": "hyq29q7",
            "score": 1,
            "text": "Putin probably told his generals he will strap each one to a nuclear warhead if they don’t start making real progress and he needs to use nukes.",
            "title_similarity": "0.44970277",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyq2ak5",
            "score": 1,
            "text": "Is it true that “Ukraine’s health ministry said that at least 198 Ukrainians, including three children, had been killed in the invasion”?  That’s a 15 to 1 ratio if it’s true.",
            "title_similarity": "0.5179318",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyq2bv4",
            "score": 1,
            "text": "Is there discussion somewhere of what would be the global fallout of such an event such as Putin releasing nukes were to occur? Fallout physically to the earth.  Financially to the economy both locally,  nationally and globally. Other details of something like this would happen,  God forbid.",
            "title_similarity": "0.53029776",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyq2pze",
            "score": 2,
            "text": "Russian warship, go fuck yourself\nThis says it all",
            "title_similarity": "0.66105187",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hyq2y8c",
            "score": 1,
            "text": "What if the CIA funded and armed an “American” army that is trained and equipped with anti-aircraft capabilities, drones, the whole nine yards? Can AWACS be effective outside of the borders of Ukraine (NATO counties)? I’m sure enough guys would volunteer for this.",
            "title_similarity": "0.379426",
            "sentiment_compound": 0.6966
        },
        {
            "id": "hyq3uto",
            "score": 3,
            "text": "I would like to remind everyone that Putin is very unlikely to actually use nuclear warfare. Doing so would wipe Russia off the face of the earth literally and in terms of their entire economy. They know other counties have nukes and can and will destroy them easily.",
            "title_similarity": "0.6299946",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyq4cij",
            "score": 8,
            "text": "The longer this war drags out the worse the optics get. We’re literally witnessing a fairly large scale European war in real time, the likes of which we haven’t seen since 1945. Putin just can’t understand the new power of social media that plays a very important part in war.",
            "title_similarity": "0.6780614",
            "sentiment_compound": -0.9068
        },
        {
            "id": "hyq4f25",
            "score": 1,
            "text": "Russia can’t stop losing lmao",
            "title_similarity": "0.61658823",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyq4n65",
            "score": 3,
            "text": "This has really turned in a way I wasn’t expecting. I haven’t been around (or paying attention to the news) for very many wars, but it just seems mind-boggling to me that Russia, with all of its resources, is doing so poorly.",
            "title_similarity": "0.57646394",
            "sentiment_compound": -0.3483
        },
        {
            "id": "hyq577h",
            "score": 1,
            "text": "And remember, no Russian",
            "title_similarity": "0.25827068",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyq5y5k",
            "score": 4,
            "text": "Fucked around, found out",
            "title_similarity": "0.3321839",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hyq7ml5",
            "score": 2,
            "text": "Isn’t this Russias main strategy? Throw waves of bodies until something cool happens?",
            "title_similarity": "0.3600624",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hyq7uxs",
            "score": 2,
            "text": "The sad part about this is that Putin will not back off from this until he gets what he wants, he will keep on going even if half his army is dead. He's in a lose lose situation here if he backs off now. The more this drags on the worse it gets.",
            "title_similarity": "0.5733738",
            "sentiment_compound": -0.954
        },
        {
            "id": "hyq81bl",
            "score": 4,
            "text": "My friend at work mentioned he has a medic friend in Poland and he said about 3 days ago a Russian fighter jet carpet bombed about 1500 Ukrainian civilians and military. \n\nI have not seen any reports of this so ai hope it is not true.",
            "title_similarity": "0.50833327",
            "sentiment_compound": 0.8337
        },
        {
            "id": "hyq8azt",
            "score": 3,
            "text": "I see nothing but mass mutiny in store for Putin if things get out of control. Hitler 2.0.",
            "title_similarity": "0.52615035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyq8xr0",
            "score": 2,
            "text": "Let us pray for continued heavy losses for Russia or surrender",
            "title_similarity": "0.67112684",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyqade5",
            "score": 8,
            "text": "Well, even if something horrible happens to all of us now - I want to celebrate that we fucked him.\n\nHe came to our land, he tried to destroy us, he told us we have no chance, HE TOLD US WE DO NOT EXIST. And we fucked him.\n\nWe fucking won.",
            "title_similarity": "0.5256428",
            "sentiment_compound": -0.815
        },
        {
            "id": "hyqay3z",
            "score": 2,
            "text": "I assume that (active) military bases would be targeted first; am I correct in this? Living quite close, scary close, to an Air Force base, with, Army, Marine Corps, & Naval bases relatively close in Southern California, I’m not feeling particularly safe right now. If anyone would like to speak about the likelihood of California being levied, I’m happy to hear from you.",
            "title_similarity": "0.2931965",
            "sentiment_compound": 0.3461
        },
        {
            "id": "hyqb4kg",
            "score": 3,
            "text": "I'm beginning to wonder if Vlad really thought this thing through before he jumped in with both feet. /s/",
            "title_similarity": "0.29971933",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqbrqf",
            "score": 1,
            "text": "\n\"The enemy may shatter our bodies, but they cannot break our spirit. Even now they advance on our capital, to seize by force what they cannot claim by right. They cannot imagine what awaits them. WE WILL SMITE THE INVADERS FROM OUR LANDS! Though they sweep over our lands like the snows of winter, never again will we bow before them; never again endure their oppression; never again endure their tyranny. We will strike without warning and without mercy, fighting as one hand, one heart, one soul. We will shatter their dreams and haunt their nightmares, drenching our ancestors' graves with their blood. And as our last breath tears at their lungs; as we rise again from the ruins of our cities... they will know: Ukraine belongs to the Ukrainians.\"",
            "title_similarity": "0.607971",
            "sentiment_compound": 0.6232
        },
        {
            "id": "hyqckau",
            "score": 1,
            "text": "Will that stay true once Belarus joins them?",
            "title_similarity": "0.038372874",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyqcnij",
            "score": 1,
            "text": "Take with a grain of salt. They've been spamming this so it is being used as propaganda. Meanwhile they have been low key about their losses, which amounts to 190 (according to Ujraine), including civilians; which I find very hard to believe if this were a general siege.",
            "title_similarity": "0.4905563",
            "sentiment_compound": -0.8622
        },
        {
            "id": "hyqcrff",
            "score": 1,
            "text": "Every time on Reddit it says this many Russians die or Russians losing unfortunately this website it to bias to tell what’s really going on.It’s kind of annoying.",
            "title_similarity": "0.7613555",
            "sentiment_compound": -0.9061
        },
        {
            "id": "hyqdqj2",
            "score": 3,
            "text": "I’m just deeply saddened by the number of Russian men sent off to fight some pointless “war” where they’re really just bodies. So much needless loss",
            "title_similarity": "0.73536944",
            "sentiment_compound": -0.8204
        },
        {
            "id": "hyqe5hj",
            "score": 4,
            "text": "Remember when Putin threatened ANYBOODY  that would potentially get in his way when it came to the Ukraine and threatened that there would be consequences? \n\nAnd the world said f*ck you! \n\nElon Musk providing satellite internet for Ukraine, anonymous hacking rushing tv, the EU cutting Russia out of swift banking, Japan saying it would host US nukes to be closer to Russia, trade sanctions on so many levels, countries closing their air space to any Russian crafts, and countless countries supplying funds and support for Ukraine. \n\nGood job Putin! You really scared everyone.",
            "title_similarity": "0.70938456",
            "sentiment_compound": -0.5963
        },
        {
            "id": "hyqeb2p",
            "score": 1,
            "text": "This war will single-handedly remove russia from global influence",
            "title_similarity": "0.6428739",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyqf31l",
            "score": 2,
            "text": "My comment will get buried under all the others but as far as Im happy knowing ukrainian resistance is doing well, how reliable are these informations? What is the real situation on both sides? If I only rely on Reddit it's almost like Ukraine is winning already. There is a gap between sources.",
            "title_similarity": "0.4365309",
            "sentiment_compound": 0.9474
        },
        {
            "id": "hyqfrvq",
            "score": 1,
            "text": "Maybe there will be a coup among Russian top officials and Putin will be found dead by “suicide” in his quarters. I can’t see how this could turn into an upside for them. Plus Ukraine has shown the world how cool and badass they are and honestly…branding.",
            "title_similarity": "0.5569602",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hyqfx3e",
            "score": 1,
            "text": "We’Re gOnNa DrOp tHe SpAcE sTaTiOn oVeR yOu iF yOu dOnt QuIt lAuGhInG aT uS.",
            "title_similarity": "0.48216122",
            "sentiment_compound": -0.5759
        },
        {
            "id": "hyqg8j4",
            "score": 3,
            "text": "So like, last month, they were enjoying the huge benefits of high resources prices, and then bam now they are broke, thousands of Slavic people dead on both sides and we are like why did you commit suicide on so many level?\n\nWTF are they thinking?",
            "title_similarity": "0.6256455",
            "sentiment_compound": -0.6077
        },
        {
            "id": "hyqgcbt",
            "score": 2,
            "text": "Trying to balance being glad that Ukraine is fighting well and being sad that young Russian soldiers forced into a stupid war are dying",
            "title_similarity": "0.5960274",
            "sentiment_compound": -0.8957
        },
        {
            "id": "hyqgees",
            "score": 1,
            "text": "Any verification on this?  It's hard to take these BDAs as accurate",
            "title_similarity": "0.20030002",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyqhobs",
            "score": 3,
            "text": "I believe most of the Russian soldiers are hungry, tired and demoralized because of poor logistical support. It also seems some of their vehicles are breaking down along the road.",
            "title_similarity": "0.6493898",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hyqhwcj",
            "score": 3,
            "text": "I just want to point out for the sake of our friendly Russian trolls how Machiavellian it would be for Putin to stage a completely unwinnable assault on all fronts just to thin the ranks of people in the military who want his job.\n\nHave a nice day!",
            "title_similarity": "0.5750463",
            "sentiment_compound": 0.4241
        },
        {
            "id": "hyqiloi",
            "score": 3,
            "text": "Russia can only fight for so long, Putin isn't dumb enough to waste his entire fighting force on Ukraine. He will only go as far as he can before its humiliating. Ukraine has their entire way of life and their lives at stake. They will fight to the last man.",
            "title_similarity": "0.5896107",
            "sentiment_compound": -0.8401
        },
        {
            "id": "hyqjb29",
            "score": 1,
            "text": "I mean, good for them, but ukraine is defending territory that they had been militarizing for what, months?  Years?  Of course the attacker is going to be at a disadvantage.",
            "title_similarity": "0.5996357",
            "sentiment_compound": -0.8466
        },
        {
            "id": "hyqjdyl",
            "score": 2,
            "text": "They are in front of us, behind us, and we are flanked on both sides by an enemy that outnumbers us 29:1. They can't get away now",
            "title_similarity": "0.51860815",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyqjn5q",
            "score": 1,
            "text": "Ukraine has  a 6|6|6 leader and more moral",
            "title_similarity": "0.29039064",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyqk2uo",
            "score": 6,
            "text": "Russia is calling up reservists?  Arn't they like retired soldiers? \n\n\nI thought their army was over 900k and they only sent 70% of the 190k force they have on the border?",
            "title_similarity": "0.40896773",
            "sentiment_compound": -0.3919
        },
        {
            "id": "hyqkhfe",
            "score": 3,
            "text": "Putin will die in 2022.",
            "title_similarity": "0.32867563",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyql2qe",
            "score": 3,
            "text": "Russian warship- go fuck yourself.\n🇺🇦GLORY TO UKRAINE🇺🇦",
            "title_similarity": "0.60201406",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hyqm1d2",
            "score": 2,
            "text": "While the chances of any Ukrainian soldiers or defence planners seeing this is pretty low I will say\n\n**Don’t get cocky Ukraine**. It’s good for everyone to see some early victory’s but don’t assume it’s smooth sailing from here on out. Be ready for anything. Enjoy the morale boost, celebrate with your buddies, but don’t assume this is all Russia has to send at you. Cautious optimism",
            "title_similarity": "0.29838932",
            "sentiment_compound": 0.9754
        },
        {
            "id": "hyqmbb4",
            "score": 3,
            "text": "Russians realizing this is a big mistake and replacing their own government would be the ultimate uno reverse card!",
            "title_similarity": "0.65124667",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hyqn9yr",
            "score": 4,
            "text": "Ukraine is united against invasion. Russia will not win and its hilarious that they're gonna pull out and look so damn weak.",
            "title_similarity": "0.58768284",
            "sentiment_compound": -0.6418
        },
        {
            "id": "hyqnopf",
            "score": 1,
            "text": "Is the Kyiv independent a reliable source for war casualties?",
            "title_similarity": "0.38114887",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyqnsse",
            "score": 2,
            "text": "Chernobyl, that’s what worries me.",
            "title_similarity": "0.5578116",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyqo1v7",
            "score": 2,
            "text": "If I had a nickel for every time Russia (of all countries) forgot that you NEVER start a land war in Asia in the WINTER, I'd have 2 nickels.  \n\n\nNot a lot.  But what the hell is wrong with the education over there that they did it TWICE?!  \n\n\n(Yes, I know Finland and the Ukraine are BOTH Europe... so was the part of Russia that killed more Nazis than the Russian Military)",
            "title_similarity": "0.48820174",
            "sentiment_compound": -0.9583
        },
        {
            "id": "hyqodj8",
            "score": 1,
            "text": "Serious question:  Did we know that the Russian military was this inept?  I would have expected better from North Korea.  Is this a case of shit's not done yet and the worst is yet to come, or has the Russian military degraded to almost comical ineptitude?",
            "title_similarity": "0.4671874",
            "sentiment_compound": -0.6868
        },
        {
            "id": "hyqohx2",
            "score": 2,
            "text": "If he looses, does Ukraine get to occupy RUSSIA? HAHA",
            "title_similarity": "0.4656643",
            "sentiment_compound": 0.4824
        },
        {
            "id": "hyqozjy",
            "score": 2,
            "text": "I want this to be true but \"feel good\" news can happen on both fronts.",
            "title_similarity": "0.16230004",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyqr1et",
            "score": 3,
            "text": "Honest question: what would have to happen before Russia decided to execute Putin, or throw him into jail forever? Surely he's not 100% protected from all repercussions.",
            "title_similarity": "0.57728",
            "sentiment_compound": 0.5851
        },
        {
            "id": "hyquqfk",
            "score": 7,
            "text": "What I'd love to see is Ukraine to BEAT Russia.  As in \"make them surrender\".  And then march unopposed to Moscow and demand that the Russians hand over Putin for war crimes trials in The Hague.\n\nOf course, Ukraine will get reparations for damages and Russia gets broken up further, and all the nukes are confiscated and destroyed.  And then we can go after China and North Korea and squeeze those suckers dry.\n\nAnd in my NEXT comic book --",
            "title_similarity": "0.62038434",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hyqwter",
            "score": 3,
            "text": "Now would be the best time for Georgia to reclaim the land they lost to Russia.",
            "title_similarity": "0.30870384",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyqx8xy",
            "score": 3,
            "text": "i have a gut feeling that Putin is sick and he is pressured to do everything he planned to do with the small time frame he is left to have.",
            "title_similarity": "0.6280393",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hyqxbrm",
            "score": 2,
            "text": "Remember the war is only a few days old it's a little early to start making predictions",
            "title_similarity": "0.1729001",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyr1t1k",
            "score": 1,
            "text": "Russia don't care, Russia send more.",
            "title_similarity": "0.34161237",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hyr2pai",
            "score": 2,
            "text": "Soldiers of the Russian Federation: is this worth dying for? Return to your homes, save your worthy lives.",
            "title_similarity": "0.36872703",
            "sentiment_compound": 0.8034
        },
        {
            "id": "hyr6vyq",
            "score": 1,
            "text": "Ukrainian spirit will NEVER be crushed.",
            "title_similarity": "0.19907984",
            "sentiment_compound": 0.4646
        },
        {
            "id": "hyr76j4",
            "score": 1,
            "text": "So Putin's popularity is going to crash?",
            "title_similarity": "0.49848375",
            "sentiment_compound": 0.1725
        },
        {
            "id": "hyr7lpv",
            "score": 2,
            "text": "There's nothing outsiders can do to stop Russia right now because, just by launching this war with no provocation at the tail end of a pandemic, Putin proved he's not entirely sane. He also doesn't care about the hundreds of Russian families whose members will die in this pointless war, nor the millions that are and will be suffering with sanctions shattering their livelihoods. \n\nThis war can definitively establish that waging war on a whim causes only suffering. That humanity has not yet learned that lesson in the 21st century despite two world wars, Korea, Vietnam, Afghanistan and so many other destructive conflicts is truly distressing.",
            "title_similarity": "0.52576596",
            "sentiment_compound": -0.9891
        },
        {
            "id": "hyrajrd",
            "score": 1,
            "text": "I am interested how much losses Ukraine faces to compare these numbers. Does somebody have reliable resources?",
            "title_similarity": "0.517434",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyrekmf",
            "score": 1,
            "text": "Russia is not fighting dull out they trying to encircle Ukraine and take it with out much cost to the people. \n\nI get why Russia is doing it but war is not the answer.",
            "title_similarity": "0.5584196",
            "sentiment_compound": -0.6329
        },
        {
            "id": "hyrgw05",
            "score": 1,
            "text": "Russia really is just a paper tiger.",
            "title_similarity": "0.32426286",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyri6hw",
            "score": 1,
            "text": "Is there anywhere you could find reliable, impartial sources for what's actually going on out there?",
            "title_similarity": "0.0119227",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyrlio9",
            "score": 1,
            "text": "This coming from a website called kiev",
            "title_similarity": "0.26406384",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyrmiwv",
            "score": 2,
            "text": "That pie faced inbred despot should be hung from a lamp post",
            "title_similarity": "0.25931764",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyroo76",
            "score": 2,
            "text": "Basically the Russian military have receive the taste of their own medicine.",
            "title_similarity": "0.30397692",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyrpvpu",
            "score": 5,
            "text": "Isn't he threatening nukes since he lost so bad? What a fucking spineless joke.",
            "title_similarity": "0.4840319",
            "sentiment_compound": -0.3688
        },
        {
            "id": "hys5ahg",
            "score": 2,
            "text": "I hope it's actually going this well. A bit hesitant to believe large numbers from a news source coming directly from the underdog defender. But here's hoping",
            "title_similarity": "0.19721441",
            "sentiment_compound": 0.7217
        },
        {
            "id": "hyscum2",
            "score": 1,
            "text": "Go Ukraine! Fuck you Putin!",
            "title_similarity": "0.6720586",
            "sentiment_compound": -0.6229
        },
        {
            "id": "hyslilg",
            "score": 2,
            "text": "Dear aliens, \n\nOne man had a bad day and he killed us all. Seems really petty and stupid, but it wasn't our decision to make, maybe we shouldn't have let madmen have so much power? Oh well, too late now\n\nFormerly mankind.",
            "title_similarity": "0.49625063",
            "sentiment_compound": -0.5312
        },
        {
            "id": "hysmgpo",
            "score": 2,
            "text": "Honest question: is he actually losing or just testing the waters and will keep throwing dudes at it until he wins?",
            "title_similarity": "0.32550323",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hysmo2b",
            "score": 1,
            "text": "Losing on more than the Ukrainian front. They're being financially strangled. They can't bomb that.",
            "title_similarity": "0.5060624",
            "sentiment_compound": -0.538
        },
        {
            "id": "hysocic",
            "score": 2,
            "text": "I think that , if the oligarchs in Russia suffer enough financial damage, Putin will be “involuntarily replaced.”",
            "title_similarity": "0.6048171",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hyspivq",
            "score": 1,
            "text": "If Russia launches nukes, maybe we will finally get to see some of the nifty-neato UFO tech that the U.S. has been reverse engineering.  Go Team Roswell!  /s",
            "title_similarity": "0.35868293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytarxf",
            "score": 1,
            "text": "Because we need him to pay in front of the world...to this day there ate skeptics that refuse to believe Hitler died in that bunker...and since the Soviet union cremated his body we will never know for sure. If we allow history to repeat itself we will never learn from it... We need justice along the lines of Saddam Hussein or Osama bin laden not like Hitler...and definitely not like the confederate leadership... At this point the best end for him would be exactly like Mussolini",
            "title_similarity": "0.5539946",
            "sentiment_compound": -0.2593
        },
        {
            "id": "hyts86p",
            "score": 1,
            "text": "In all of Russia’s history they’ve always had the numbers but never the strength. Now though Ukraine has more numbers due to the amount of countries and people willing to support them. Putin will not be able to win this ridiculous war.",
            "title_similarity": "0.51686835",
            "sentiment_compound": -0.5933
        },
        {
            "id": "hyupzpz",
            "score": 1,
            "text": "B v vbb.  J7.   In b.   Ng v vgh",
            "title_similarity": "0.13138306",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvglmc",
            "score": 1,
            "text": "Its 31 countries vs russian army. Intelligence, drone surveillance and modern equipment from usa/europe make hella difference.  I saw a video from ukraine ministry of defence and it had the sale HUD as a USA reaper drone.",
            "title_similarity": "0.4928942",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hzu95xh",
            "score": 1,
            "text": "I was referring to the part where we went in and took him out.",
            "title_similarity": "0.25443625",
            "sentiment_compound": 0.0
        }
    ]
}