{
    "Biden Administration Expands Sanctions Against Russia, Cutting Off U.S. Transactions With Central Bank\n": [
        {
            "id": "hyscvvw",
            "score": -32,
            "text": "Rest assured that if a republican was in the white house, non of this economic pressure on russia would be happening.  God has sent Joe Biden to save the people of Ukraine from russia. Keep him in your prayers.",
            "title_similarity": "0.5354109",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hysisme",
            "score": 24,
            "text": "Biden should also sanction American political figures that continue to support and promote Vladimir Putin and his actions (ie.  Donald Trump)\n\nEdit: Do I really have to name names to appease the butthurt MAGAts?  You know the GOP who’s-who of pro-Putin “I-wish-Putin-was-my-President-Instead-of-Biden”  players….\n\nDonald Trump, Marjorie Qanon Green, Tucker Carlson, etc…",
            "title_similarity": "0.6132521",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hys0f64",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.3200304"
        },
        {
            "id": "hysx4v3",
            "score": -5,
            "text": "All of you are celebrating too early.",
            "title_similarity": "0.110220164",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hysmvnn",
            "score": 21,
            "text": "But where will the Republican party get it's funding?!?!?",
            "title_similarity": "0.31319484",
            "sentiment_compound": 0.6882
        },
        {
            "id": "hyscf0o",
            "score": 32,
            "text": "GOP’s starting to sweat.",
            "title_similarity": "0.23237978",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysn3j2",
            "score": 14,
            "text": "i expect the Republicans to start a gofundme page for Russia.\n\nif they haven’t already done so.",
            "title_similarity": "0.662966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv8gu3",
            "score": 3,
            "text": "US continues to get oil from Russia.",
            "title_similarity": "0.5754945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hys061f",
            "score": 62,
            "text": "[deleted]",
            "title_similarity": "0.32003033"
        },
        {
            "id": "hyv1fkh",
            "score": 2,
            "text": "does this mean the US isn't buying oil from Russia anymore? because until we do that we are literally paying for their war effort",
            "title_similarity": "0.68080276",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyseavh",
            "score": 71,
            "text": "Thank God Trump isn't president. He would have just spread America's ass cheeks nice and wide for Putin.",
            "title_similarity": "0.63438153",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyt3jff",
            "score": 11,
            "text": "Republicans don’t want sanctions. That cuts off their donation lines. Ask the NRA. \n\nThey want full scale war. War is profitable for the American ruling class. Always the same shit. “Turn it to glass”\n\nWhile at the same time they claim Biden is not projecting strength while also claiming that he should be focused on home. \n\nThe doublespeak drives me mad. I refuse to be gaslit by traitors.",
            "title_similarity": "0.5992517",
            "sentiment_compound": -0.9385
        },
        {
            "id": "hysd0vq",
            "score": -32,
            "text": "[removed]",
            "title_similarity": "0.29832333"
        },
        {
            "id": "hysx4gd",
            "score": 3,
            "text": "Certainly Putin has had all this planned for years in advance. I wonder if Putin had expected Trump to be reelected and be the US president in 2022?",
            "title_similarity": "0.45258984",
            "sentiment_compound": 0.34
        },
        {
            "id": "hytdk7m",
            "score": 4,
            "text": "This honestly scares me at this point - we are effectively at war with Russia and are destroying their economy. We aren’t the aggressor and we are doing what we absolutely must, but I wonder how this will affect Russians, will they really blame Putin or rally behind him to stronghand the world. \n\nIf that happens, we are all gonna die.",
            "title_similarity": "0.7369458",
            "sentiment_compound": -0.9151
        },
        {
            "id": "hyu9cn4",
            "score": -4,
            "text": "Putin could easily choose to see this as an act of war",
            "title_similarity": "0.5562044",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hyswc2o",
            "score": -1,
            "text": "Cool hope this doesn’t backfire on us. Biden has to fuck our oil oligarchs too though gas is too expensive and it’s their fault.",
            "title_similarity": "0.5640595",
            "sentiment_compound": -0.25
        },
        {
            "id": "hytjysb",
            "score": -12,
            "text": "Everyone cheering that this happened are really ignorant of history and do not realize the potential accumulation of human skulls events like this can cause. Tanking the Russian economy/currency is a sure fire way to invite more aggression, not less. If I am a non-nato state with a land border that connects with Russia, I'd be shittibg my pants. We are incredibly close warfare on a global scale and tanking the Russian economy could cause it.",
            "title_similarity": "0.6555898",
            "sentiment_compound": -0.0166
        },
        {
            "id": "hysnqyw",
            "score": 20,
            "text": "I know Biden is not a very popular leader in the US, but he has totally outclassed Putin at every turn leading up to and during this conflict. He is flexing US power in the best possible way, without any American blood spilled or warmongering. From the standpoint of an outsider, he's doing an amazing job",
            "title_similarity": "0.4299345",
            "sentiment_compound": 0.4657
        },
        {
            "id": "hysvhdx",
            "score": -16,
            "text": "Ordinary Russian people are gonna suffer.\n\nFuck the government.",
            "title_similarity": "0.72078",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hys5fwa",
            "score": 360,
            "text": "Fox News won't say a word because they've already made their point and repeated it and repeated it. 1) They would never admit they're just US propaganda for the worst shit-takes 2) if they do mention it will be 30 seconds and then back to the next FOX NEWS ALERT PSAKI IS A LYING COWARD THAT DRINKS BIDEN'S SWEAT WE PROBABLY DIDN'T MAKE UP",
            "title_similarity": "0.5569829",
            "sentiment_compound": -0.9122
        },
        {
            "id": "hyskur2",
            "score": -28,
            "text": "Not to rain on the sanction parade… obviously Russia has prepared for this.. however at what point do we stop cornering Russia? At this point it’s too late for Russia to back out, these sanctions will last. They have no choice but to escalate right? I’m not political guru but even I see the danger in cutting off Russia even further. They’re gonna say f*** it at some point.",
            "title_similarity": "0.6863184",
            "sentiment_compound": -0.8156
        },
        {
            "id": "hys9utv",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.3200304"
        },
        {
            "id": "hysu8ku",
            "score": 3,
            "text": "i have something that i want to understand, russian people (not the government) are being treated like dogs and getting beaten and getting a huge amount of hate, even though they are against this and they are not silent about it, but imagine seeing the world hate you just because you were born in a specific place, how could they go against putin if they kept being treated like that, if someone can explain this to me i would be grateful",
            "title_similarity": "0.5933651",
            "sentiment_compound": 0.128
        },
        {
            "id": "hytdzjo",
            "score": 2,
            "text": "I'm sad for the people of Russia. The actions of their leader will throw them into deep economic trouble and that can lead to all kinds of things that only affect the average person.",
            "title_similarity": "0.63933975",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hyti7ie",
            "score": 0,
            "text": "But ignores oil related sanctions because it's in their interest. Double standards",
            "title_similarity": "0.47043744",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hyu3l33",
            "score": 1,
            "text": "Not enough.  Any ties to Putin should be cause for property seizures.  Doesn't trump have a bunch of golf courses?  Turn them back to nature.",
            "title_similarity": "0.6172861",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuymbq",
            "score": 1,
            "text": "Now with that in place what are we doing for the Russian people who are completely hit by these sanctions.",
            "title_similarity": "0.7626572",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyu4ku6",
            "score": 10,
            "text": "Biden is doing an amazing job here. Simply masterful. He didn’t overreact on day one and launch all sanctions at once. He left himself and thr Europeans plenty of fiscal firepower to slowly ramp up the pressure day by day and organized the Europeans to lead the way, showing that this is truly a coalition and not just the us. Seriously, he has tip toed this minefield like a fucking boss.",
            "title_similarity": "0.4286731",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hysdbv0",
            "score": 62,
            "text": "Wonder how many in the GOP are gonna come out and say something about this since they're no longer getting paid by the Russians.",
            "title_similarity": "0.64074314",
            "sentiment_compound": -0.296
        },
        {
            "id": "hytdobo",
            "score": -6,
            "text": "We really need to sanction China instead.",
            "title_similarity": "0.4958542",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytaedb",
            "score": -9,
            "text": "Sanctions don't work.  There are workarounds",
            "title_similarity": "0.44824174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysg1zo",
            "score": -15,
            "text": "We still buying oil from them tho? Oh, ok cool",
            "title_similarity": "0.26307327",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyt2uoy",
            "score": -17,
            "text": "Yet we are still buying their oil \n\nWe could be using the keystone pipeline by now and importing 800k barrels a day for our ally. Instead we are buying 500k barrels a day from Russia and helping them finance this mess. \n\nBut Biden pandered to the far left and killed the pipeline along with American jobs and killed our energy independence.",
            "title_similarity": "0.6502776",
            "sentiment_compound": -0.9215
        },
        {
            "id": "hysjoe5",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.2983234"
        },
        {
            "id": "hysjen0",
            "score": 4,
            "text": "I support every single sanctions/pressure we put on the Kremlin, but I have to say that I'm scared about the reaction of Putin. He's unstable and the more he will be pushed against the wall the more he can act out of desperation.. I hope he can come to some reason and retract his troop from Ukraine without starting ww3.",
            "title_similarity": "0.67576134",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hyt80bp",
            "score": 3,
            "text": "How about now we deport all the POS congressmen and GOP pundits who are still openly supporting Putin?",
            "title_similarity": "0.68338895",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hys969w",
            "score": 410,
            "text": "Joe Biden is fighting Vladimir Putin on one hand and the entire Republican party on the other hand. They absolutely cannot tweet about this war without insulting President Biden in the process.",
            "title_similarity": "0.69090414",
            "sentiment_compound": 0.5578
        },
        {
            "id": "hysgl7p",
            "score": 24,
            "text": "I wonder how this affects all those republicans that are taking Russian money \n\nExplains why tucker Carlson switched sides",
            "title_similarity": "0.7248111",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt5j7s",
            "score": 5,
            "text": "Oh no! What’s the Orange Dumpster Fire gonna do? 70% of their funds come from Russia",
            "title_similarity": "0.64897215",
            "sentiment_compound": -0.5093
        },
        {
            "id": "hyu1yhh",
            "score": -6,
            "text": "I am fearful backing russia into a corner might see putin using nuclear weapons and then everyone loses.",
            "title_similarity": "0.6625745",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hyut3iq",
            "score": 0,
            "text": "Ha how about our shits who use that bank as well.",
            "title_similarity": "0.47256",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyvqbji",
            "score": 0,
            "text": "But why are we still purchasing Oil from them?! It's 60% of their economy!! Open up the regs on home drilling! We need to provide Europe with oil and LNG. Cut off Putins income!",
            "title_similarity": "0.5669794",
            "sentiment_compound": -0.5883
        },
        {
            "id": "hysk4sz",
            "score": -31,
            "text": "Democrats just can't help but want wars constantly.",
            "title_similarity": "0.4321444",
            "sentiment_compound": -0.7822
        },
        {
            "id": "hys3drj",
            "score": -42,
            "text": "Should have done that day one.",
            "title_similarity": "0.14173067",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv5qi3",
            "score": -5,
            "text": "So THIS is how Biden gets reelected. Convenient.",
            "title_similarity": "0.22769791",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysczfa",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.2983234"
        },
        {
            "id": "hysftsa",
            "score": 105,
            "text": "The Republican party is in trouble.  No more donations!",
            "title_similarity": "0.55835986",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hysk28q",
            "score": 1,
            "text": "Took 5+ days of war and insiders have known for months about this so anyone who needs to be hurt by this will probably be fine. Again - it's the most vulnerable who suffer while the wealthy are unscathed. Honestly need to have an emergency shut off valve on all transactions and use some kind of civil forfeiture in anything in transit and assets to Russian shell companies (e.g. real estate in new York etc....)",
            "title_similarity": "0.67096746",
            "sentiment_compound": -0.8341
        },
        {
            "id": "hysm8hi",
            "score": 1,
            "text": "Is there anything else the United States can do at this point beyond putting boots in Ukraine? Are there any tougher sanctions that can be enacted?",
            "title_similarity": "0.54151595",
            "sentiment_compound": 0.594
        },
        {
            "id": "hysqzy8",
            "score": 1,
            "text": "That dude is going to have nothing left, and is going to go out guns blazing. Keep your eyes on the sky, if you see the mushroom….. run.",
            "title_similarity": "0.40809613",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt1ta0",
            "score": 1,
            "text": "Pardon my ignorance, but is all this freezing bank accounts and cutting off transactions something new or something we’ve done every time someone has gone to war? I can’t seem to recall a time before the Canadian supply chain protests and this Ukrainian conflict where banks being frozen was such a big news story every week.",
            "title_similarity": "0.641601",
            "sentiment_compound": -0.9224
        },
        {
            "id": "hyt8ipt",
            "score": 1,
            "text": "Alright keep it going…",
            "title_similarity": "-0.029704325",
            "sentiment_compound": 0.25
        },
        {
            "id": "hyt9s78",
            "score": 1,
            "text": "Takes effect when? 60-90 days?",
            "title_similarity": "0.21287557",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytb5b1",
            "score": 1,
            "text": "But how will Donald get his money????",
            "title_similarity": "0.35941184",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytdco1",
            "score": 1,
            "text": "Tomorrow's headline:\n\nRussia begins borrowing from Pakistan",
            "title_similarity": "0.6614772",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyth2eg",
            "score": -1,
            "text": "So random question. How does this affect the US and it’s economy?",
            "title_similarity": "0.45703566",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytkgsv",
            "score": 1,
            "text": "Is there a complete updated list of all sanctions, bans, removals, freezes, seizures, hacks, losses, and actions taken against Russia?",
            "title_similarity": "0.6562921",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hytnu0r",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2983234"
        },
        {
            "id": "hytr3bp",
            "score": 1,
            "text": "I HATE saying this. But here's the end problem. Ukraine will gets   \nwallowed up by Russia because the world has YET AGAIN failed to act on   \nan enormous scale to stop Putin/Hitler with physical force. Russia will   \nput it a puppet government. Will the word recognize Ukraine as Ukraine   \nor as Russia? Now, how do you deal with sanctions?",
            "title_similarity": "0.79093885",
            "sentiment_compound": -0.9357
        },
        {
            "id": "hyu8ntj",
            "score": -1,
            "text": "Finally. Cancel culture put to good use",
            "title_similarity": "0.31734866",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyug7rx",
            "score": -1,
            "text": "If the US sanctions you then you'll end up like Iran..they do \"okay\" ..if the world sanctions you then you end up like Iraq after 1991 \"fifth world country\"",
            "title_similarity": "0.59198105",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyuilc7",
            "score": 1,
            "text": "When is Biden going to close US airspace to Russian aircraft like the other civilized nations have done.",
            "title_similarity": "0.8068522",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyusuw2",
            "score": 1,
            "text": "You need to freeze Russian  Central bank access to their 500 billion in offshore reserves quickly and fully everywhere!  They will be trying to reclaim all their foreign reserves as fast as possible to stabilize their economy and fund the invasion!",
            "title_similarity": "0.7137492",
            "sentiment_compound": 0.1984
        },
        {
            "id": "hytjc2s",
            "score": -8,
            "text": "Yet he got rid of our oil just to buy 80 million barrels for Russia every month.",
            "title_similarity": "0.5668649",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt1u85",
            "score": -14,
            "text": "Biden does literally nothing without being pushed into it and he ends up looking like an asshole every time. Why does he never do the right thing, right off the bat ? Ukraine, Covid Tests, Student Loans. Just be fucking proactive for once.",
            "title_similarity": "0.5759134",
            "sentiment_compound": 0.6801
        },
        {
            "id": "hysit6s",
            "score": 15,
            "text": "Cut off reliance on Putin’s oil. Yes, we will pay more at the pump. But it will also spur a turn to renewables and EVs that should’ve happened in the fucking 70s. Make this despot beg for fucking mercy. C’mon Biden! It’s the only way to inflict actual pain - his wallet.",
            "title_similarity": "0.6849396",
            "sentiment_compound": -0.2388
        },
        {
            "id": "hyug3gy",
            "score": -8,
            "text": "Every American Needs to Read this Statement by the Russian Foreign Ministry before things reach the point of no return\n\n\"MOSCOW, February 28 Russian Foreign Ministry Spokeswoman Maria Zakharova expressed confidence on Monday that experiments of NATO and Western public’s staying mum on the situation in Donbass resulted in a humanitarian and political disaster in Europe.\n\n'NATO’s experiments and the deafening silence of the Western public - these are the reasons behind the humanitarian and political disaster in Europe. An end was to be put to this, since the West refused to conduct any negotiations whatsoever and welcomed aggressive statements and direct threats of Kiev puppets towards Russia,' the diplomat wrote.\n\n'Russia did not launch a war, it is ending it,' Zakharova stressed. 'Throughout these years, the Russian side was urging the global community to stand against the consistent annihilation of the Donbass population. 'These are millions of people, who were losing their loved ones every day, living in basements to flee the shelling,' she added.\n\n'Where were all these countries and their public during these eight years that the war continued, and how did they condemn the killing of at least 13,000 people throughout these years?' the diplomat asked.\n\n'None among those who are \"yelling now\" in \"civilized countries\" has ever rallied to support the population of Donetsk and Lugansk with the demand to stop bloodshed, she stressed. 'The world was silent. 'Submissive silence of the global community and their disregard for the bloody catastrophe resulting from the anti-constitutional coup in Ukraine in 2014, staged with the direct participation of the US, the EU, Germany, Poland, Lithuania, Estonia, Latvia and other NATO countries, simply encouraged the Kiev regime to continue to destroy their own population,' Zakharova stressed.\"",
            "title_similarity": "0.7104335",
            "sentiment_compound": -0.9889
        },
        {
            "id": "hyt0xo8",
            "score": 2,
            "text": "Dude is on the way out and he doesn't even know it.",
            "title_similarity": "0.30002302",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytd7fu",
            "score": 2,
            "text": "Make Ukraine join the NATO ASAP so the Allies  fuck all Russians? Burocracy is a fucking  World Evil !",
            "title_similarity": "0.7481433",
            "sentiment_compound": -0.8193
        },
        {
            "id": "hyte4qo",
            "score": -2,
            "text": "But, how are we paying for all the oil we are STILL going to be importing from them…??? 🤨",
            "title_similarity": "0.4332369",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytl53v",
            "score": 2,
            "text": "Early on I felt the sanctions were far to light, but seeing the implementation of the SWIFT bans and other follow ups i stand corrected. The sanctions will work in time i new believe. I would still like to see a ban on Russian oil and gas entering America, I don’t think thats been done yet but could be wrong. That would really hurt them wouldn’t it?",
            "title_similarity": "0.5984014",
            "sentiment_compound": -0.8604
        },
        {
            "id": "hyu284r",
            "score": -2,
            "text": "What's going to end the fucking massacre us fucking up financials for all of Russia. Putin is ready to drop nukes on anything and everything. I'd like to see a sane person with a good morals behind them nukes instead of a senile but smart wack job like Putin. The guy is having fun getting his gang to kill innocent civilians. He's a billionaire who's lived a lavish life. He don't give a fuck about anyone but himself.",
            "title_similarity": "0.6590402",
            "sentiment_compound": 0.9257
        },
        {
            "id": "hyu3ci8",
            "score": 2,
            "text": "The shit thing is regular Russian citizens that want nothing to do with the invasion cannot access their own money to purchase daily necessities. \n\nFor US citizens; Imagine if Trump had gone war crazy and the US was slapped with every sanction in the book. Food prices skyrocketing, no access to your own assets, all because some shitheaded dictator wants to do some chest puffing.",
            "title_similarity": "0.68783176",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hyua35j",
            "score": 2,
            "text": "And people said Biden was a pussy first ever sanction on Russia’s national bank",
            "title_similarity": "0.62184083",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyubxmm",
            "score": -2,
            "text": "They're a co belligerent with Russia.",
            "title_similarity": "0.60468775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuv0vb",
            "score": 2,
            "text": "The article neglected mention how Biden stopped following Puti on Twitter. That'll show em",
            "title_similarity": "0.4631989",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hystlmu",
            "score": 10,
            "text": "Everyone saying to go full 100% with sanctions for years and turn russia back to the stone age aren’t looking at the big picture. Vladimir Putin is cornered. He has nothing left to lose if this goes too horribly wrong and we dont give russia some sort of out. Do y’all really want to go up in a nuclear blaze because that’s how you get nukes launched at you. \n\nI understand this man is evil, and that makes a lot of us mad. I understand that we want to punish Putin and the Russian brass for this decision they have made to invade Ukraine. But for the love of god, give them an out to lift the sanctions and nothing so unreasonable that it would be seen as being spat on in the face. Something along the lines of just leaving Ukraine would do. Putin is old and will soon be replaced, we need to give Russia a chance to get out while simultaneously not giving in to Putins demands or the world will be destroyed.",
            "title_similarity": "0.69427514",
            "sentiment_compound": -0.5233
        },
        {
            "id": "hytf4ae",
            "score": -10,
            "text": "The Russian citizenry do not deserve to be hit like this. They should not have to suffer because of one person’s actions.",
            "title_similarity": "0.56252027",
            "sentiment_compound": 0.6542
        },
        {
            "id": "hyshxgp",
            "score": 4,
            "text": "Can someone explain why all of these additional sanctions were not implemented with the first round of sanctions? Wouldn't it be more efficient to totally cut them off instead of doing it in portions?",
            "title_similarity": "0.5946933",
            "sentiment_compound": 0.264
        },
        {
            "id": "hysksh5",
            "score": 3,
            "text": "So can I buy Russian rubles right now and just wait to see if it goes up in price?",
            "title_similarity": "0.5786303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysmt22",
            "score": 3,
            "text": "> The leaders of the European Commission, France, Germany, Italy, the United Kingdom, Canada and the U.S. also plan to limit the sale of so-called golden passports. A Biden administration described the golden passports as a loophole that allows wealthy Russians connected to the Kremlin to become citizens in other countries and access certain financial systems.\n\nThis was new to me, but I think they must be talking about immigration programs that allow people in who would benefit the economy by immigrating.\n\nFor example, suppose you own a small factory in country A and want to move to country B to start a factory there instead. Country B says OK because you will be contributing something valuable to their economy (creating jobs and/or investing your capital into the economy).\n\nSo that makes it worthwhile to allow you to immigrate.\n\nWikipedia has some more info here: https://en.wikipedia.org/wiki/Immigrant_investor_programs\n\nAnyway, the point is, these programs themselves seem legit. The basic concept isn't shady. They are not literally selling passports. When the administration talks about loopholes, I guess they may mean wealthy Russians have ways of abusing the program.\n\nAt any rate, whether wealthy Russians use it legitimately or abuse it, it will stop being open to them.",
            "title_similarity": "0.68173444",
            "sentiment_compound": 0.9538
        },
        {
            "id": "hysnxs1",
            "score": 5,
            "text": "And Biden has another huge card to play: Ban the US dollar from Russian Banks. The Federal Reserve has the power to do that in one second with out the approval of another country",
            "title_similarity": "0.8540536",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hyt5jq5",
            "score": 2,
            "text": "biden is also getting advice from obama, this is why putin is going to get gangbanged",
            "title_similarity": "0.5580722",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyufa48",
            "score": 4,
            "text": "This is pretty terrifying. I hope Putin doesn't get desperate enough to launch  nukes. Does anyone remember what happened when the USA cut off oil to Japan in 1940?",
            "title_similarity": "0.6344688",
            "sentiment_compound": 0.3098
        },
        {
            "id": "hysihrc",
            "score": -28,
            "text": "Now will Reddit stop supporting Socialism? The people of Europe don't want the Soviet Union back.",
            "title_similarity": "0.615997",
            "sentiment_compound": 0.1225
        },
        {
            "id": "hysjkw2",
            "score": 3,
            "text": "Lots of Russian simps on the subs these days, guess more positions will be opening up for Internet comrade position.",
            "title_similarity": "0.44446564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysq3it",
            "score": 5,
            "text": "Yesterday it was 'two Russian oligarchs want Putin to stop\", and today Biden is \"we're not listening, here's some more sanctions ya fucks!\"\n\nKudos to the Biden admin. In the past I could easily see where we might pause activities in light of potential peace negotiations and rich people crying, but instead we're tightening the screws. THAT'S how you handle gangster-lead nations.",
            "title_similarity": "0.7924402",
            "sentiment_compound": 0.1306
        },
        {
            "id": "hysw4ol",
            "score": 4,
            "text": "Finally, Biden hitting the Republicans where it hurts!",
            "title_similarity": "0.4775718",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hyt4uav",
            "score": 5,
            "text": "Here's to Russia becoming a third world nation.  Did it to yourself, Putin you fucking dumbass.  One step too far.  Here's to hoping your soon-to-be starving populace rips you limb from limb.  \n\nA perfectly shitty end for a perfectly shitty man.",
            "title_similarity": "0.6833282",
            "sentiment_compound": -0.4005
        },
        {
            "id": "hytg4i2",
            "score": 2,
            "text": "Great. It's about time someone made life harder for the average Russian.\n\nIf there's sure way to de-escalate conflict, its punitive economic sanctions, as history shows",
            "title_similarity": "0.75487804",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyud5dv",
            "score": -2,
            "text": "looking good for Crypto!",
            "title_similarity": "0.18077722",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hyukqv3",
            "score": -5,
            "text": "But lets keep buying Russian Oil!!!\n\nPlease don't revert back to trump policies, be a real democrat",
            "title_similarity": "0.7045083",
            "sentiment_compound": 0.5894
        },
        {
            "id": "hyv2f7m",
            "score": 3,
            "text": "Good\n\nNext.  \n\nFreeze and proceed to legally confiscate the assets and debts of all of Russia’s top 1% wealthiest globally.\n\nSame with ALL Russian government and companies assets and debts globally.  Repeat for Belarus.\n\nLet the courts decide which and how much to sell.  Sales of those assets and payments of debt will be paid to Ukraine for war damages.",
            "title_similarity": "0.7252835",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hywj16s",
            "score": -4,
            "text": "Democrats voted against the sanction of a Russian pipeline.  I thought republicans were the ones that liked Russia?",
            "title_similarity": "0.5931374",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hys93jf",
            "score": 231,
            "text": "Big plus for Trump.\n\n[https://forensicnews.net/russian-government-bank-deposited-500-million-into-deutsche-bank-subsidiary-as-it-lent-to-trump/](https://forensicnews.net/russian-government-bank-deposited-500-million-into-deutsche-bank-subsidiary-as-it-lent-to-trump/)\n\nImpossible to make payments now.",
            "title_similarity": "0.65894884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysht1y",
            "score": 145,
            "text": "As someone from europe, im so so so happy Trump isnt the president right now.",
            "title_similarity": "0.38651562",
            "sentiment_compound": 0.752
        },
        {
            "id": "hysq73b",
            "score": 7,
            "text": "I see that Tulsi Gabbard flipped around once the lifeline to her russian money got cut off. Typical.",
            "title_similarity": "0.7469637",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hytd19u",
            "score": 5,
            "text": "Thank fuck we at least have an adult in office right now.",
            "title_similarity": "0.19732705",
            "sentiment_compound": -0.25
        },
        {
            "id": "hysq0ub",
            "score": 15,
            "text": "Imagine if Trump was still the president, it would have been a disaster, he’d probably send aid to the poor Russians being “treated so badly” by the Ukrainians",
            "title_similarity": "0.7156404",
            "sentiment_compound": -0.802
        },
        {
            "id": "hysnko7",
            "score": 5,
            "text": "Good. I want to see the Russian economy be plunged into the stone age. I want to see bread lines and depression-level situation in Russia (just as they are subjecting the Ukrainians to...), so that it forces the Russian people to revolt against this disgusting Putin regime. End this now.",
            "title_similarity": "0.7904569",
            "sentiment_compound": -0.128
        },
        {
            "id": "hytkh1q",
            "score": 5,
            "text": "I still keep seeing all the haters claiming how weak Biden is and how bad his foreign policy is…seems like he’s been pretty successful at uniting the world against Russia and crippling their economy",
            "title_similarity": "0.675872",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hytxlym",
            "score": 9,
            "text": "How is Tucker Carlson and the GOP going to get paid now?",
            "title_similarity": "0.37942755",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyskkrs",
            "score": 8,
            "text": "Hey, let’s not re-elect the Russian agent who will work to redo all of this stuff.",
            "title_similarity": "0.74241114",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysprtd",
            "score": 46,
            "text": "All these morons online talking about how Biden is fumbling this, how Trump would have handled it perfectly, meanwhile without sacrificing a single American life, we've been able to contribute heavily to an insane deterioration of their economy and currency.  Biden could end up playing this out masterfully and come out smelling like roses in the end.",
            "title_similarity": "0.6279751",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyt0v2y",
            "score": 10,
            "text": "Oh No!  There goes the GOP's biggest source of funding!",
            "title_similarity": "0.36698294",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt5ywq",
            "score": 9,
            "text": "Good job Biden. Keep up the pressure.",
            "title_similarity": "0.11409384",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hyt7uuw",
            "score": 11,
            "text": "GOP funding disappears in hours. Moscow Mitch is beside himself and Fucker Carlson is at a loss for words for once.",
            "title_similarity": "0.49476114",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hytzjju",
            "score": -12,
            "text": "Hey Biden get your head out of your ass and destroy Putin and all his supporters. End this massacre.",
            "title_similarity": "0.7150111",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hys58ss",
            "score": 157,
            "text": "Putler sending Russians to hell.",
            "title_similarity": "0.7000588",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hys52js",
            "score": 85,
            "text": "I like this… hmmm this makes me very happy… when do we start tracking the campaign funds???? Hmmm??? Track that shit and we would have less idiots running for positions",
            "title_similarity": "0.29079747",
            "sentiment_compound": -0.4696
        },
        {
            "id": "hysz7zt",
            "score": 14,
            "text": "It's clear Putin led the previous administration around like a puppy. This Administration, and it's far more than one person, has responded almost perfectly and has been a part of uniting other countries. Kosovo is now asking for a permanent base and I wouldn't be surprised to see Ukraine accelerate into NATO. Keep going strong Ukraine and at the same time I feel for the Russian people, none of this is their fault. Also, please don't take any aggressions out of any local Russian business here in the US. We've seen many negative altercations aimed at the Asian community...",
            "title_similarity": "0.60170627",
            "sentiment_compound": 0.8178
        },
        {
            "id": "hytbabd",
            "score": 14,
            "text": "Biden admin isn't getting enough credit for helping defeat Russia without putting boots on the ground.  People call him weak and all, but you have to admit these sanctions and supplying weapons is pretty effective.",
            "title_similarity": "0.5529668",
            "sentiment_compound": 0.5938
        },
        {
            "id": "hysdbn9",
            "score": 63,
            "text": "Here’s the negation. Full withdrawal from Ukraine with full payment for families and damages. Also Putin must walk from Moscow to The Hague and turn himself in.",
            "title_similarity": "0.77653646",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hysdbwf",
            "score": 14,
            "text": "next to BP pulling investment, the most substantive business/financial action taken to weaken the Putin regime",
            "title_similarity": "0.73681384",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hysbeuc",
            "score": 88,
            "text": "These sanctions need to continue well after the war in Ukraine. They need to stick until Putin is out of power and Russia starts disarming their nuclear arsenal.",
            "title_similarity": "0.6500282",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hysnyuy",
            "score": 20,
            "text": "An actual strong response to tyranny.\n\nEdit: Just noticed another new \"i HaTe BiDeN\" sub - he lives in their heads 24/7 for free while the rest of us go to work...",
            "title_similarity": "0.4478766",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyskpb0",
            "score": 22,
            "text": "The Venezuelan economy looks more promising than the Russian one at this point.",
            "title_similarity": "0.23452678",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hys7w8w",
            "score": 577,
            "text": "Probably need to stop buying their oil now too",
            "title_similarity": "0.5342236",
            "sentiment_compound": -0.296
        },
        {
            "id": "hysck55",
            "score": 166,
            "text": "r/russia seems to think the invasion is going well. They are claiming no casualties from the war, saying all those deaths are from covid.",
            "title_similarity": "0.43680236",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hysi1p3",
            "score": 31,
            "text": "Man with loses like that Putin should be the new face of portfolio loss porn on WSB.",
            "title_similarity": "0.6619059",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hys6ujo",
            "score": 148,
            "text": "\"It was at this moment he knew, he fucked up\"",
            "title_similarity": "0.3915665",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hys94r4",
            "score": 958,
            "text": "r/russia is going for the gold medal in mental gymnastics right now",
            "title_similarity": "0.36258593",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hysh3w9",
            "score": 43,
            "text": "This doesn’t end well for Putin at all. The whole world is against this dude. I feel for the Russian people who wanted no part of this and are now going to suffer as a third world economy for years on end now.",
            "title_similarity": "0.65076053",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hysl8ur",
            "score": 55,
            "text": "By this time next week Putin will be in charge of a nation populated by millions of unemployed, financially destroyed Russian citizens paying 50,000 Rubles for toilet paper. If he’s got two working brain cells ,he’d resign right the fuck now and tell his successor to Nope out of every decision Russias made in the last 90 days.",
            "title_similarity": "0.56495297",
            "sentiment_compound": -0.802
        },
        {
            "id": "hysp330",
            "score": 66,
            "text": "Now imagine if Putin still had his puppet president still at the helm here in the states? That would have been really really fucking bad",
            "title_similarity": "0.674145",
            "sentiment_compound": -0.6525
        },
        {
            "id": "hys58un",
            "score": 2947,
            "text": "Sad for the Russian people, but a smart move by the Biden Administration to counter efforts by Russia to outmaneuver sanctions.\n\nFuck Putin.",
            "title_similarity": "0.76505244",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hysbm6u",
            "score": 190,
            "text": "Now they need to revoke those \"golden passports\"",
            "title_similarity": "0.50411594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hys2wf5",
            "score": 993,
            "text": "Fucking Putin hard with these sanctions",
            "title_similarity": "0.6317532",
            "sentiment_compound": -0.1725
        },
        {
            "id": "hysaxzb",
            "score": 1187,
            "text": "The rest of the world should keep the sanctions on until Putin is gone.",
            "title_similarity": "0.5630936",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyshjmy",
            "score": 411,
            "text": "I don’t think Putin thought this through.",
            "title_similarity": "0.3920293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysgi8c",
            "score": 310,
            "text": "You know you're in trouble when *Switzerland* [adopts sanctions](https://www.newsweek.com/switzerland-adopts-eu-sanctions-against-russia-putin-freezes-assets-1683235).",
            "title_similarity": "0.73636395",
            "sentiment_compound": -0.25
        },
        {
            "id": "hys1b7e",
            "score": 6018,
            "text": "Do you hear that noise ? It sounds like the Russian economy nosediveing into oblivion...",
            "title_similarity": "0.7506528",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hysv7mo",
            "score": 181,
            "text": "The thing that blows my mind is that Russia SHOULD be a global power.  They have enormous amounts of natural resources and the largest land mass of any country in the world.  They have the ability to educate people, and strong science programs.  It's their fucking leadership that is constantly holding them back from greatness.",
            "title_similarity": "0.45105308",
            "sentiment_compound": 0.8107
        },
        {
            "id": "hysg606",
            "score": 190,
            "text": "This is a huge move, Russia has stockpiles of US currency that they can no longer access.",
            "title_similarity": "0.65457284",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hys0jvf",
            "score": 11279,
            "text": "The Russian Central Bank has raised interest rates to 20%, Russian currency is in free fall, oligarchs are losing billions, and Ukrainian Forces are holding up better than anticipated. This situation is devastating for Putin. A major unforced error. The world community is rallying behind Ukraine and there are even anti-Putin protests in Moscow.",
            "title_similarity": "0.6439262",
            "sentiment_compound": -0.3774
        },
        {
            "id": "hysonvs",
            "score": 1083,
            "text": "Putins next election is going to get ugly.  I bet he only gets about 90% of the vote.",
            "title_similarity": "0.4881041",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hyskg6c",
            "score": 4011,
            "text": "Cut Belarus off just as much. They're a co belligerent with Russia.",
            "title_similarity": "0.7669411",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hysgc14",
            "score": 392,
            "text": "I guess Russia just got a taste of what it feels like to be like North Korea.",
            "title_similarity": "0.4346017",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hysh47m",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.3200304"
        },
        {
            "id": "hyshlka",
            "score": 2,
            "text": "Holy fucking shit dude",
            "title_similarity": "0.21442327",
            "sentiment_compound": -0.5984
        },
        {
            "id": "hysisf0",
            "score": 3,
            "text": "It won't take long until Russian people gonna fucking his whole administration.",
            "title_similarity": "0.6664197",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyskcld",
            "score": 2,
            "text": "Better late than never. Putin seemingly wants to revive the USSR. Well the people and economy will sure be there.",
            "title_similarity": "0.5408074",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hyskh9j",
            "score": 1,
            "text": "The objectives successfully hit with terrorussian  pootin missiles:\n\n- international reputation\n\n- economy\n\n- currency\n\n- terrorussian army reputation \n\n- membership in any civilized unions\n\n- his own dignity",
            "title_similarity": "0.5712828",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyskidl",
            "score": 2,
            "text": "How long will these sanctions last?",
            "title_similarity": "0.274688",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyskoak",
            "score": 2,
            "text": "I'm American and my wife is Russian. I was able to send money to my wife's mother this morning. (she has nothing to do nor wants this war). She has a Sberbank account ... so I don't think the transaction cut off is in place yet since I was able to deposit using Xoom directly to her Sberbank card. \n\nIt will likely be cut off soon, but not yet.",
            "title_similarity": "0.54849166",
            "sentiment_compound": -0.601
        },
        {
            "id": "hyslf5i",
            "score": 2,
            "text": "Putin fucked around.\n\nAnd found out.\n\nFuck him.",
            "title_similarity": "0.6061019",
            "sentiment_compound": -0.836
        },
        {
            "id": "hysm7hs",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.32003033"
        },
        {
            "id": "hysmr0o",
            "score": 4,
            "text": "Call me when they put sanctions on Russian oil or NG",
            "title_similarity": "0.7837749",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysmsah",
            "score": 3,
            "text": "Man the world is changing so much. In the olden days it was always Germany that thought it could take on the entire world and win. But now it's  Russia.",
            "title_similarity": "0.6038833",
            "sentiment_compound": 0.34
        },
        {
            "id": "hysnh83",
            "score": 2,
            "text": "Dude...i know putin is smart and probably has a plan,the man ruled the KGB for 20 years, he is not stupid, but there is no way on earth he predicted and prepared for this, his army would win against the ukrainean army, but not against THAT people and not against this new formed alliiance,i think this is the 1st time in his life when he looks like an amateur politicial and that should scare us all, the dude has nukes and a bigger ego than trump",
            "title_similarity": "0.54818547",
            "sentiment_compound": 0.7534
        },
        {
            "id": "hyso24j",
            "score": 5,
            "text": "Haha fuck you Blyatamir Putin",
            "title_similarity": "0.59412473",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyso4ah",
            "score": 10,
            "text": "I hope the greedy are getting fucked but hope the innocent Russians who don't want war get out of this ok. They shouldn't have to suffer for this.",
            "title_similarity": "0.5882938",
            "sentiment_compound": 0.9218
        },
        {
            "id": "hysoagi",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.3200304"
        },
        {
            "id": "hysog82",
            "score": 2,
            "text": "Is there a ban on buying Russian debt?\n\n If not there should be because I'm sure some of our US oligarchs are getting tempted by a 20% interest rate.",
            "title_similarity": "0.59095407",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hysoi5x",
            "score": 8,
            "text": "Is it possible that U.S. politicians that are backed by Russian money will be exposed in the near future now that Russia is being heavily sanctioned?",
            "title_similarity": "0.70125353",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hysoioi",
            "score": 2,
            "text": "So much for the Rubble.",
            "title_similarity": "0.3185895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysonjw",
            "score": 4,
            "text": "Can someone who is way smarter than me explain to me how all these sanctions - and their effects - affect the citizens of Russia? I mean just the regular, want-to-live-their-lives, everyday Russians?",
            "title_similarity": "0.62506664",
            "sentiment_compound": 0.5204
        },
        {
            "id": "hysozil",
            "score": 2,
            "text": "The world has now effectively bent Putin over and is passing around the lube. Get absolutely fucked you dog",
            "title_similarity": "0.63868856",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hysp01w",
            "score": 2,
            "text": "Why don't the sanctions apply to energy companies?",
            "title_similarity": "0.49385256",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyspat9",
            "score": 20,
            "text": "With all these ways Russian money is being cutoff, I can't help but wonder how Tucker Carlson will feed his family.",
            "title_similarity": "0.65304875",
            "sentiment_compound": -0.1603
        },
        {
            "id": "hyspeqk",
            "score": 2,
            "text": "How will the Russian assets here get their next paycheck now?",
            "title_similarity": "0.5692527",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hyspr9z",
            "score": 42,
            "text": "I spoke to a Russian back in 2014 who went to my high school as a foreign exchange student in 2012-2013 back when Russia invaded Crimea. She was going to school and to study international relations, and interned for the the Kremlin, which was a super bizarre transformation from friend to Russian mouthpiece in (what was then) 2 years. Not sure what she's up to now, likely still working with the Kremlin, last I saw she was working at the Russian embassy in Israel.\n\nANYWAYS She basically had an essay ready about why Russians supported the Annexation of Crimea. I'm not gonna forward the Kremlins talking points but a younger more naive version of me bought into some of it. \n\nOne thing she mentioned which really stood out to me however wasn't prepped or scripted. She said when I asked why Russians still support Putin despite his corruption and dictatorial rule was that Russians don't oppose Putin because many of them lived thru the fall of the Soviet Union and the absolute hell of the Russian Economy of the 90's. The recovery and life in the late 2000s and early 2010s wasn't spectacular, but it's not as bad as the 90s. Putin was an authoritarian, but it wasn't as bad as the Soviet surveillance state. Times were tough, but not as bad as the 90s. Sure the elections are rigged, but they at least get to cast a vote and get the illusion of democracy. They'll cook the votes, but at least the powers that be will see the truth and use that to inform their decisions as rulers. \"True democracy would be nice, but why fix what isn't broken? Why upset the balance when this is the best life has ever been in Russia.\" Basically, so long as Putin keeps things stable and better than they were in the 90s, many people just put up with his rule. \n\nWith these sanctions, Russia's economy is about to be as bad as the 90s. People who were indifferent and tolerated the status Quo because at least they had shoes and at least there was food in their belly and at least they weren't at war won't have that to fall back on.  Putin was tolerated because he wasn't as bad as the last guy, and things weren't as bad as they were in the darkest times in living Russian memory (other than those who survived WWII.) Without having that cover, I wonder how stable Putin's hold on Russia will be.",
            "title_similarity": "0.5633502",
            "sentiment_compound": 0.9927
        },
        {
            "id": "hysps5v",
            "score": 2,
            "text": "Russia's dollar-denominated payments can be stopped by freezing its correspondent bank accounts in the US. This has already been done with the sanctions against North Korea. The problem is that the sanctioned countries can continue to trade with friendly countries in non-dollar settlements and earn foreign currency, so the effect is limited. Specifically, North Korea continues to trade with China in Chinese Yuan.",
            "title_similarity": "0.6864059",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyspwcm",
            "score": 4,
            "text": "Meme crypto is worth more than a Ruble.... lmao",
            "title_similarity": "0.24371663",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hysqh2c",
            "score": 18,
            "text": "What’s the point!? Cripple your country, your currency, lose the faith and trust of the people( who’s going to support you when we are loosing our money, travel opportunities, etc), and you make yourself look like a child— just for these actions in Ukraine? I cannot understand it.",
            "title_similarity": "0.6628406",
            "sentiment_compound": 0.8968
        },
        {
            "id": "hysqtyp",
            "score": 2,
            "text": "Okay now do oil and gas.",
            "title_similarity": "0.18887359",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hysrb9u",
            "score": 4,
            "text": "But who will fund the NRA?",
            "title_similarity": "0.2522324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysrem6",
            "score": 4,
            "text": "With Putins casual threats of nuclear war I’d much rather a seal team six visit him than having sanctions against him. Poor Russian people, having to deal with this idiot in charge.",
            "title_similarity": "0.69938076",
            "sentiment_compound": -0.9165
        },
        {
            "id": "hyss3iw",
            "score": 1,
            "text": "Isn’t China bank rolling them?",
            "title_similarity": "0.38823807",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyss6p1",
            "score": 1,
            "text": "Is this 'swift banking sanctions' that russia said  they would take as an act of aggression ?",
            "title_similarity": "0.80010116",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyssdqm",
            "score": 3,
            "text": "This should just be what war is for now on",
            "title_similarity": "0.36797547",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyssokt",
            "score": 2,
            "text": "One of the best chess matches, and Russia has no grandmaster. Brilliant!",
            "title_similarity": "0.3727356",
            "sentiment_compound": -0.0936
        },
        {
            "id": "hystdsa",
            "score": 4,
            "text": "Do these sanctions actually target Putin and the oligarchs/government that directly enacted the war? I’m probably missing something/haven’t researched yet but it sounds like we’re just screwing the average Russian citizen over while Putin and company don’t care that their billions of dollars are now a couple of billion less now after sanctions.",
            "title_similarity": "0.73015594",
            "sentiment_compound": 0.4854
        },
        {
            "id": "hystoit",
            "score": 1,
            "text": "I think there was an article today that the described the global actions regarding economic sanctions as unprecedented. \n\nSwitzerland in an astonishing move exempted itself from maintaining neutrality and joined sanctions on Russia and stipulated that would apply economic sanctions on specific high net worth individuals close to Putin by limiting access to the Swiss banking system to those individuals.\n\nPlus politicians are now saying the goal of the sanctions is to send the Russian economy backwards - making this economic war.\n\nGiven we are also starting to wage cyber warfare - anonymous, limitations on Facebook and Google, etc - these are not the same sanctions that were imposed on Iran and potentially much more devastating.\n\nBut at the same time justified. I support these actions as it means that we don’t need to actually put troops into combat… for now.\n\nBut to some commenters points, Russia once the pain is unbearable will revert with this being a full out declaration of war, and we may see war on a scale not seen for almost a century. May whatever we all have faith in protect us all.",
            "title_similarity": "0.77775943",
            "sentiment_compound": -0.8175
        },
        {
            "id": "hystygd",
            "score": 10,
            "text": "In todays episode of Its never sunny in mother russia, the gang craters the economy!",
            "title_similarity": "0.73606753",
            "sentiment_compound": -0.3867
        },
        {
            "id": "hysu05g",
            "score": 5,
            "text": "It was widely believed, at least for a while, that Putin had kompromat on many US leaders such as Trump and congressional members on both aisles. \n\nI wonder if any of that will be used or revealed during this conflict. I would think that disrupting US political process by revealing corruption would affect our ability to participate in the conflict. I would expect Putin to play that hand before nuclear attacks, right?",
            "title_similarity": "0.6440631",
            "sentiment_compound": 0.0194
        },
        {
            "id": "hysu9n4",
            "score": 2,
            "text": "Can someone eli5 how these sanctions work? tried Googling but wasn't dumbed down enough.",
            "title_similarity": "0.3141402",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hysuagm",
            "score": 2,
            "text": "Keep this up long enough and it’ll be like the international embargo South Africa and Rhodesia were under in the 80’s",
            "title_similarity": "0.44957173",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hysurpz",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.3200304"
        },
        {
            "id": "hysushp",
            "score": 1,
            "text": "Nice, Putin might actually kill himself!",
            "title_similarity": "0.5160233",
            "sentiment_compound": -0.4926
        },
        {
            "id": "hysvtz8",
            "score": 2,
            "text": "I think the best thing for ordinary Russian citizens at this point would be for Ukraine to annex Russia. Their lives in the long run would probably be a shit ton better.",
            "title_similarity": "0.5445789",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hyswffl",
            "score": 1,
            "text": "Toilet paper squares are now worth more then the ruple.",
            "title_similarity": "0.1988948",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyswkk3",
            "score": 2,
            "text": "That picture is great. Putin be like *I miss my lap doggie Donald*",
            "title_similarity": "0.2690649",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hyswl35",
            "score": 2,
            "text": "Russia is poor country. We would feel nothing if we 100% stopped doing business with them. The only reason not to cut them off completely is because is kleptocracy with criminal individuals in both sides.",
            "title_similarity": "0.6467724",
            "sentiment_compound": -0.764
        },
        {
            "id": "hyswtvi",
            "score": 2,
            "text": "Maybe someone here can explain it to me. \n\nPutin can't be that oblivious. He knew these steps would be taken eventually (or his advisors would have told him). What is so important about the Ukraine to be worth all the hassle he puts Russia through?",
            "title_similarity": "0.61062187",
            "sentiment_compound": 0.505
        },
        {
            "id": "hysxh50",
            "score": 2,
            "text": "The U.S. needs to do literally as much as it possibly can by means of sanctions. If there is an option on the table, do it. This needs to end before more needless death and suffering and certainly before Zelenskyy is assassinated.",
            "title_similarity": "0.6631408",
            "sentiment_compound": -0.7076
        },
        {
            "id": "hysxkge",
            "score": 1,
            "text": "Did they sanction the buying of fuel from them?  I heard something about that being left alone.",
            "title_similarity": "0.41366178",
            "sentiment_compound": -0.25
        },
        {
            "id": "hysxvq4",
            "score": 2,
            "text": "“I thought everyone would be so stoked on me for invading Ukraine!? 😭, I’m the general and no body notices’😭😭😭”\n\n-Putin aka cartman",
            "title_similarity": "0.65566087",
            "sentiment_compound": -0.9312
        },
        {
            "id": "hysy63y",
            "score": 2,
            "text": "If you wanna put yourself in Russian peoples shoes, just imagine Trump as Putin.",
            "title_similarity": "0.6375866",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysyfai",
            "score": 2,
            "text": "Are we literally heading towards ww3? His plans reminds me of Hitler",
            "title_similarity": "0.47942403",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysz51w",
            "score": 2,
            "text": "The strength of support will only get stronger as Ukrainians continues to fight.",
            "title_similarity": "0.3630809",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyszvqf",
            "score": 6,
            "text": "There is a group in the US that leans a certain way politically, criticizing the US response for not being ... Idk. Trump enough. \n\nBut let's be real. When a man behind a desk is told his soldiers died he doesn't feel it. Cut off the paychecks to them and they feel it. \n\nTaking their money works.",
            "title_similarity": "0.60694194",
            "sentiment_compound": -0.5763
        },
        {
            "id": "hyt0mt2",
            "score": 2,
            "text": "Still waiting for the sanctions that target Putin personally.",
            "title_similarity": "0.62318796",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt0ttq",
            "score": 1,
            "text": "What if/ what stops Russians from using bitcoin as currency to rebuts the inflation?",
            "title_similarity": "0.74742424",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyt1da0",
            "score": 3,
            "text": "The sanctions are finally having some teeth.",
            "title_similarity": "0.23191842",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt1kqv",
            "score": 1,
            "text": "Send in the A-10’s.  Brrrrrrrrrrrttt.",
            "title_similarity": "0.28025013",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt20ip",
            "score": 2,
            "text": "I wouldn't be surprised if the anti Putin riots in Moscow reach a breaking point soon",
            "title_similarity": "0.71556854",
            "sentiment_compound": -0.7324
        },
        {
            "id": "hyt2dt8",
            "score": 1,
            "text": "Invade another country they said, it’ll end well they said",
            "title_similarity": "0.4508028",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyt2kih",
            "score": 2,
            "text": "I hope the world cuts them off. Hurt Putin and oligarchs financially as much as possible",
            "title_similarity": "0.76157117",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyt2lof",
            "score": 1,
            "text": "That's cool. How about everybody stop buying Russian gas and coal?",
            "title_similarity": "0.6951252",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyt2ma3",
            "score": 1,
            "text": "I just hope everyone here is right and this leads to a regime change and not Putin launching nukes.",
            "title_similarity": "0.45236647",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyt2mnz",
            "score": 2,
            "text": "The good news keeps on coming.",
            "title_similarity": "-0.05553455",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyt2s01",
            "score": 3,
            "text": "Should send Putin to bed without dessert.",
            "title_similarity": "0.5446949",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt4a1l",
            "score": 2,
            "text": "Putin is a problem. \nI have to say that the Davos gang is a problem too. Because they are trying to sell you on fairness and hoping you don't notice their unbridled theft.",
            "title_similarity": "0.58729017",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hyt4yp8",
            "score": 6,
            "text": "Except for fuel and food. Everyone is dependent on that and so those Russian exports are unaffected.\n\nThis is the end of economic globalism. This is the best thing to happen to the world in a long time.",
            "title_similarity": "0.4667814",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyt5e09",
            "score": 5,
            "text": "To quote that random seinfeld episode. “THE UKRAINE IS STRONG!”",
            "title_similarity": "0.38419408",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt697s",
            "score": 2,
            "text": "All my homies hate Putin! Ukraine ftw!",
            "title_similarity": "0.59661484",
            "sentiment_compound": -0.3147
        },
        {
            "id": "hyt6rcp",
            "score": 2,
            "text": "Why didn’t we do this when he attacked our country?",
            "title_similarity": "0.6203562",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyt9n83",
            "score": 2,
            "text": "Is this impacting Russian citizens or just their government? I am curious if this is a good idea or not.",
            "title_similarity": "0.5974744",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyt9z9d",
            "score": 2,
            "text": "Why we didn't enact every possible sanction the instant they rolled the first piece of equipment into Ukraine is beyond my comprehension.",
            "title_similarity": "0.52441084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytaf7u",
            "score": 4,
            "text": "This isn’t gonna stop him",
            "title_similarity": "0.07476093",
            "sentiment_compound": -0.296
        },
        {
            "id": "hytb0nt",
            "score": 7,
            "text": "Watch china like a hawk too. We know the CCP will help Russia circumvent these sanctions.",
            "title_similarity": "0.60967857",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hytbdta",
            "score": 6,
            "text": "I really hope one of his officers gives Putin the old 9mm quiet pill instead of following orders when the nukes are called. I have no doubt Putin is going to try it but any Russian soldiers who ignore the call to bomb the world into the stone age will be regarded as an international hero to humanity as a whole.",
            "title_similarity": "0.6183276",
            "sentiment_compound": 0.0004
        },
        {
            "id": "hytcmqw",
            "score": 1,
            "text": "Putin just pulled a Godzilla Threshold on himself.",
            "title_similarity": "0.55176365",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytcv1a",
            "score": 2,
            "text": "How will this affect the GOP in the coming elections and next Presidential election?",
            "title_similarity": "0.49864808",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytdcuo",
            "score": 5,
            "text": "What about Belarus? Putin’s puppy dog!",
            "title_similarity": "0.38093323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytgnpg",
            "score": 1,
            "text": "this are good news right ?",
            "title_similarity": "-0.04794983",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hytgruj",
            "score": 1,
            "text": "Fuck you Putin.\n\nI support the Russian people!",
            "title_similarity": "0.5790269",
            "sentiment_compound": -0.2714
        },
        {
            "id": "hytgxfp",
            "score": 1,
            "text": "Let them all feel the squeeze. Drain them of EVERY SINGLE CENT...err...RUBLE.",
            "title_similarity": "0.49286693",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytgywd",
            "score": 1,
            "text": "Robux are worth more than Rubles now",
            "title_similarity": "0.19110554",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyth47z",
            "score": 2,
            "text": "https://www.reddit.com/r/Silverbugs/comments/t3no61/your_donations_for_silver_today_is_national_rare/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.32875866",
            "sentiment_compound": 0.0
        },
        {
            "id": "hythh2z",
            "score": 5,
            "text": "This war will cost Russia more than they have prepared to sacrifice. This will change Russia for long time. If somebody removes Putin from office then maybe for better, if not they will suffer and remember who brought them there. One thing is certain he has lost. He got cocky and overreached. There is no good outcome for Russia in any scenario.",
            "title_similarity": "0.66434956",
            "sentiment_compound": -0.0915
        },
        {
            "id": "hythvru",
            "score": 1,
            "text": "Russian gas and oil is still being sold to the EU. Wanna show you're serious. Sanction Russian energy",
            "title_similarity": "0.60530865",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyti1e1",
            "score": 1,
            "text": "Push ALL the buttons.\n\nStop dancing around like oh yea loloz here's one more thing. Shut. Them. Down. Completely. Shit already.",
            "title_similarity": "0.53470635",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hytit39",
            "score": 2,
            "text": "Putin means little bitch in spanish",
            "title_similarity": "0.40060025",
            "sentiment_compound": -0.5434
        },
        {
            "id": "hytmqk9",
            "score": 7,
            "text": "smart move, cutting off Russian bankroll one-way.  cutting off GOP bankroll going the other way.  EYOOOOO.",
            "title_similarity": "0.73400545",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hytnfoy",
            "score": 5,
            "text": "It’s so funny he’s screwing himself toward the end of his career. Nice legacy you’re gonna leave Putin….",
            "title_similarity": "0.533139",
            "sentiment_compound": 0.5617
        },
        {
            "id": "hytt6u1",
            "score": 1,
            "text": "Have we stopped buying oil from them?",
            "title_similarity": "0.4829362",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyttqre",
            "score": 1,
            "text": "They still have the energy sector working as before and oil and gas is not included in the swift ban nd russia gets a lot of money from oil now with the current crazy oil price.",
            "title_similarity": "0.53665173",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hytwesp",
            "score": 3,
            "text": "I didn't know if Sanctions were enough. But, with the Ukrainians being the Chuck Norris memes in real life and holding off the Russians like an 80s action hero, these Sanctions seem to be far more powerful than I imagined.",
            "title_similarity": "0.5872717",
            "sentiment_compound": 0.923
        },
        {
            "id": "hytxd8c",
            "score": 2,
            "text": "Putin looks like he was just crying",
            "title_similarity": "0.46275273",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hytz98k",
            "score": 1,
            "text": "Kill the war criminals",
            "title_similarity": "0.5924393",
            "sentiment_compound": -0.9231
        },
        {
            "id": "hytza37",
            "score": 11,
            "text": "What is frightening is that if Trump was still President he would be aiding his boyfriend Putin. He would be declaring Russia was simply doing the right thing..\n\nRemember the 450 million he withheld from Ukraine in an illegal attempt to coerce Zelensky to provide fraudulent evidence against Biden? \n\nThank God enough Americans had the critical thinking ability to fire Trump after one term.",
            "title_similarity": "0.6709949",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hytzb8j",
            "score": 1,
            "text": "These sanctions would hit a lot harder if ;\n\nRisks want basically self sufficient\nAnd\nThey included Russias largest export",
            "title_similarity": "0.57951504",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hyu2d5p",
            "score": 5,
            "text": "Say goodbye to GOP and Faux news bribery money.",
            "title_similarity": "0.5171977",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyu463c",
            "score": 3,
            "text": "All these sanctions. Absolutely brutal. I love it",
            "title_similarity": "0.3797893",
            "sentiment_compound": 0.0183
        },
        {
            "id": "hyu4fe8",
            "score": 1,
            "text": "Isolate them and increase the pressure from within",
            "title_similarity": "0.42427978",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hyu6pfn",
            "score": 3,
            "text": "I love how Russia is thoroughly being shit on.",
            "title_similarity": "0.43811893",
            "sentiment_compound": 0.0828
        },
        {
            "id": "hyu8jhf",
            "score": 1,
            "text": "Does this include not purchasing ridiculous amounts of oil from Putin and actively funding his war-machine?",
            "title_similarity": "0.60707843",
            "sentiment_compound": 0.5283
        },
        {
            "id": "hyubdl3",
            "score": 3,
            "text": "Weren’t people saying something about Putin and 3D chess last week 🤔",
            "title_similarity": "0.4265849",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuc0kt",
            "score": 4,
            "text": "NATO fights WW III with banks, not bombs.",
            "title_similarity": "0.49104846",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyudet2",
            "score": 1,
            "text": "And someone thought Putin was a genius.  He checkmated himself.",
            "title_similarity": "0.3436216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyukhjg",
            "score": 1,
            "text": "I don’t get why  the Russians didn’t think about moving the money BEFORE invading",
            "title_similarity": "0.6066443",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyungm8",
            "score": 1,
            "text": "Please bring an effective hammer down on this guy. A lunatic.",
            "title_similarity": "0.5058546",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyuobh7",
            "score": 1,
            "text": "Just full-stop embargo them already.",
            "title_similarity": "0.5830962",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyupfgj",
            "score": 1,
            "text": "I saw on CNN that Russia is keeping its stock market closed until 3/5! Wow",
            "title_similarity": "0.5813495",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hyuss16",
            "score": 1,
            "text": "Meanwhile Donnie has his CC declined at McD’s",
            "title_similarity": "0.40897945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyutsn6",
            "score": 2,
            "text": " What does he look like Jim in the office",
            "title_similarity": "0.21370564",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyutzzm",
            "score": 2,
            "text": "What will the republicans ever do?",
            "title_similarity": "0.1577287",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuwot5",
            "score": 1,
            "text": "Daaamnnnn. He ain’t playin",
            "title_similarity": "0.28308374",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuzaqo",
            "score": 2,
            "text": "For the duration of this sanction, I would be interested to see the comparison of data between people in politics with a sudden and noticeable lack of wages or \"talking fees\" and the disconnection of money from the channels of shell companies to these people which relied on the banks.",
            "title_similarity": "0.5871006",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hyv1uoj",
            "score": 2,
            "text": "Putins downfall was eventually himself! Bravo. Its like its never happend to like every crazy dictator in history of time.",
            "title_similarity": "0.5638517",
            "sentiment_compound": -0.3187
        },
        {
            "id": "hyv88fx",
            "score": 2,
            "text": "Oh no the RNC won’t be able to function.",
            "title_similarity": "0.32524958",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyvced8",
            "score": 2,
            "text": "If Belarus is an active belligerent to Ukraine, why not attack them? They’re not Russia. I believe it would be on par with Russia attacking Ukraine.",
            "title_similarity": "0.6773455",
            "sentiment_compound": 0.308
        },
        {
            "id": "hyvds7z",
            "score": 1,
            "text": "We need some liquid nitrogen, for their assets",
            "title_similarity": "0.3871575",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hyvuac2",
            "score": 2,
            "text": "Putin + Pistol + Bunker = The Solution",
            "title_similarity": "0.4118405",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hyvwxv8",
            "score": 5,
            "text": "Here's the thing with dictators: they always end as \"strong leaders\", even if they wind up hanging upside down and dead like Mussolini, shot with his wife in the palace gardens like Ceausescu, suicided in a bunker like Hitler, they were \"strong leaders\" right to the end.\n\nThere is a good chunk of America, even now, who think Putin is a \"strong leader\" and rate him higher than Biden.  I mean, Putin literally kills journalists who disagree with him, runs the media and has them put out clear lies and propaganda, and openly cheats in elections.  Yeah, sure, he's a \"strong leader\".  What does that mean to his people?  IS BIDEN KILLING AMERICAN SOLDIERS ON A FOOL'S ERRAND?  IS BIDEN THREATENING NUCLEAR WAR IF HE DOESN'T GET HIS WAY?  Damn.  I thought people were smarter than that.  No, really, I did.  Sorry about that.  I guess the fog of politics is at least as strong as the fog of war.",
            "title_similarity": "0.58427536",
            "sentiment_compound": -0.7652
        },
        {
            "id": "hyw7udk",
            "score": 2,
            "text": "With the international covered-support in material, freedom-figthers and equipment.. - it is possible to stop everyone of them and in the long run this war(-crime)..!\n\nSupport the Ukraine.. - Support Freedom!\n\nGodspeed abd good hunting!\n\n(Ps. This is not a bot-massage.. - I just want to express my deeply respect and support to the ukrainian people and this ongoing international effort.)",
            "title_similarity": "0.5401181",
            "sentiment_compound": 0.9573
        },
        {
            "id": "hywe1gl",
            "score": 1,
            "text": "Is there a chance Russia and Putin will now be world leaders in Cryptocurrency now that US has imposed sanctions?",
            "title_similarity": "0.68890417",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hywop3c",
            "score": 1,
            "text": "How about be atop buying their oil. Oil is traded with usd, not their currency.",
            "title_similarity": "0.4772603",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywoplu",
            "score": 2,
            "text": "This was definitely not what putin bitch expected, but his Napoleon complex and tRump like ego will not stop him. Until his demise that is.",
            "title_similarity": "0.5237164",
            "sentiment_compound": 0.816
        },
        {
            "id": "i19yfz4",
            "score": 1,
            "text": "Bitcoin Vs Central Banks\nhttps://youtu.be/9calyl00hho",
            "title_similarity": "0.5100217",
            "sentiment_compound": 0.0
        },
        {
            "id": "i1uy9us",
            "score": 2,
            "text": "Genuine question: How are they able to do this? Especially in the cases of yachts being confiscated. How are these countries able to just take the property of Russians?",
            "title_similarity": "0.72345",
            "sentiment_compound": 0.0
        }
    ]
}