{
    "Ukrainian president signs formal request to join EU\n": [
        {
            "id": "hyt00im",
            "score": 2,
            "text": "Thank God... Now the number of stars on all those flags will be correct again after brexit.",
            "title_similarity": "0.353318",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hyt1885",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.15237565"
        },
        {
            "id": "hytcvmf",
            "score": 2,
            "text": "Good, let these brave people into eu",
            "title_similarity": "0.5483018",
            "sentiment_compound": 0.743
        },
        {
            "id": "hytfis6",
            "score": -8,
            "text": "so brits... hows brexit >\\_>\n\nI'm sorry I will stop... my guys voted for trump I have no room to talk\n\n&#x200B;\n\nalso Brexit was totally promoted by Putins people yeah... they pushed that shit hard???",
            "title_similarity": "0.44681212",
            "sentiment_compound": -0.6055
        },
        {
            "id": "hytltew",
            "score": 2,
            "text": "What little shit Putin has left…is about to be lost",
            "title_similarity": "0.27909982",
            "sentiment_compound": -0.6815
        },
        {
            "id": "hyts50e",
            "score": 4,
            "text": "The Russian propaganda channel RT on YouTube is still up and spreading lies and propaganda. It cannot be allowed to go on. Putin and Kremlin, through the news channel RT, are claiming that Ukraine is committing genocide in their eastern Donbass region, and Russia is there to \"liberate the people from Ukrainian nazis\".\n\nPlease help sign petition to ban RT from YouTube:\n\n[https://www.change.org/p/google-inc-ban-rt-from-youtube](https://www.change.org/p/google-inc-ban-rt-from-youtube)\n\nThank you!",
            "title_similarity": "0.42333657",
            "sentiment_compound": -0.4389
        },
        {
            "id": "hytltxw",
            "score": 1,
            "text": "Oh my, shit is going down quite quickly. I wouldn't be surprised if Finland and Sweden decide to join NATO soon too.",
            "title_similarity": "0.50180984",
            "sentiment_compound": -0.4707
        },
        {
            "id": "hyv42rg",
            "score": 1,
            "text": "They had 8 years of civil war to sign a formal request to join, and they waited until now? Really?",
            "title_similarity": "0.3680354",
            "sentiment_compound": -0.4696
        },
        {
            "id": "hytbt3d",
            "score": 5,
            "text": "There is a fast-track option to EU provisional membership if Ukraine can position itself as a Western Balkan state. I expect Bulgaria, as a close ally of Ukraine and a ~~Baltic~~ Balkan State themselves, will be valuable in this process.\n\nEDIT: Talked about Balkan states but then accidentally referred to Bulgaria as a Baltic state when I meant Balkan. Just a typo.\n\nEDIT 2: For reference: https://ecfr.eu/article/commentary_why_ukraine_should_become_a_balkan_country/",
            "title_similarity": "0.53895426",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hyuj5vj",
            "score": 1,
            "text": "Well fat chance they’ll be let in. Unless they really want WWlll.",
            "title_similarity": "0.31086928",
            "sentiment_compound": 0.5709
        },
        {
            "id": "hyt2bmz",
            "score": 2,
            "text": "Hi up until this past week I knew nothing of how NATO or the EU works. If Ukraine is accepted into the EU what does it mean",
            "title_similarity": "0.5569114",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyt02ij",
            "score": 9,
            "text": "but all of this events, could cause the nuke war? (putin is lost a lot)",
            "title_similarity": "0.30706266",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hyuk8yh",
            "score": -7,
            "text": "Watching the Putin / trump family slaughter the women and children in Ukraine is sickening  !! FU Republican traitors",
            "title_similarity": "0.26763076",
            "sentiment_compound": -0.8864
        },
        {
            "id": "hyu9x8l",
            "score": -3,
            "text": "Terrible idea unless y'all like having your shitvpushed in.",
            "title_similarity": "0.20450151",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyto6ay",
            "score": 0,
            "text": "Congratulation, everyone in Russia is a billionaire now",
            "title_similarity": "0.4046133",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hytxcwu",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.15237565"
        },
        {
            "id": "hyu42s0",
            "score": 0,
            "text": "The Ukrainians: a great bunch of lads.\n\nI would welcome their membership in the EU. It’s clear they have a lot to teach us about self respect and civic duty. \n\nWe should support their self defense effort, it is a noble cause and their success will echo around the world.",
            "title_similarity": "0.53831685",
            "sentiment_compound": 0.9709
        },
        {
            "id": "hytojlg",
            "score": 0,
            "text": "I support Ukraine being in the EU",
            "title_similarity": "0.76886755",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyt0h8n",
            "score": -25,
            "text": "Hmmm.... Would that be wise? Having EU or NATO aligned countries at its borders has always made Russia nervous. And for good reason, it raises legitimate security concerns on Russia's part. It should of course be Ukraine's decision where they go from here, whether to stay neutral or not. But if Ukraine does join the EU, I can only see that antagonizing Russia even further. Russia started this, and appeasement is never the answer, but I don't see Ukrainian membership in the EU being the road to peace.",
            "title_similarity": "0.45555067",
            "sentiment_compound": 0.6858
        },
        {
            "id": "hyv0anf",
            "score": 1,
            "text": "Well it's a little late for that now dawg. Honestly these countries should have been doing this earlier. Joining the EU and/or NATO so they wouldn't be in this position to begin with.",
            "title_similarity": "0.4299969",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyvphbb",
            "score": -1,
            "text": " An attack on one is considered an attack on all members similar to NATO.",
            "title_similarity": "0.48640576",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hytijrn",
            "score": -15,
            "text": "EU still useless as ever",
            "title_similarity": "0.11503628",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyujm7i",
            "score": 0,
            "text": "Take him openly what a hero he is!",
            "title_similarity": "0.2679412",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hyvblq3",
            "score": 0,
            "text": "Ukraine has been closer to the west ever since the fall of the iron curtain. I remember in the early 90’s Nickelodeon Guts had kids from the Ukraine all the time.",
            "title_similarity": "0.39436823",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvoy5y",
            "score": 0,
            "text": "I dont believe this is going to happen. Main reason why the world did not care about Crimea and is all in now is because we simply dont want the russia to have borders with the EU. If the Ukraine is taken, that is what would happen. But if they join the EU, the result will be same.",
            "title_similarity": "0.47501177",
            "sentiment_compound": 0.2204
        },
        {
            "id": "hyvxw5p",
            "score": 0,
            "text": "Why can’t they join NATO?",
            "title_similarity": "0.52238065",
            "sentiment_compound": 0.296
        },
        {
            "id": "hytyaj9",
            "score": -8,
            "text": "This is a step in the opposite direct that we want. We want a neutral urkaine and peace. This will not achieve either.",
            "title_similarity": "0.22127801",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hyuoyti",
            "score": -3,
            "text": "Isn’t this a little … weird?\n\nLike either Ukraine didn’t want to be part of the EU but now joining it is their only options to survive or alternatively, Ukraine really wanted to join the EU and the EU didn’t want them, but now the EU has to accept them because of the outcries.  \n\nFor me, it’s a massive FU to putin, but it also devalues the EU because it says “if you are vulnerable you will join us, or it says, if you want to join us, you better be in pretty bad shape.  \n\nEither way, stop the bloody war.",
            "title_similarity": "0.4663121",
            "sentiment_compound": -0.7874
        },
        {
            "id": "hyuymku",
            "score": 4,
            "text": "Putin is just really pissed off because the USA and Ukraine both got rid of their Russian puppet Presidents.",
            "title_similarity": "0.39427006",
            "sentiment_compound": -0.6697
        },
        {
            "id": "hyvkqwm",
            "score": 3,
            "text": "So after we’re done standing in solidarity with Ukrainians can we do the same with Palestinians?",
            "title_similarity": "0.51448685",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyucqsq",
            "score": -6,
            "text": "LET UKRAINE INTO NATO NOW!\n\nI support Biden, but I can't help wishing for a  tough-minded president \n\n-- someone like Hilary Clinton",
            "title_similarity": "0.5676551",
            "sentiment_compound": 0.1295
        },
        {
            "id": "hytwo3f",
            "score": 12,
            "text": "There are two different issues here...one of which is nobody is talking about. \n\n1. Yes, NATO should be helping to defend this country, we should be supporting Ukraine's independence. \n2. This is / was a shitty corrupt government. Letting them into the EU just because they are be invaded is the wrong answer. Accountability should still be held on Ukrainian leadership. Lets not lose sight of that.",
            "title_similarity": "0.53683126",
            "sentiment_compound": 0.3309
        },
        {
            "id": "hyvuybj",
            "score": 3,
            "text": "What I love is seeing all the people that keep saying now that The Soviet Union is gone,\n\nWhy does NATO still exist \n\nUmm because Putin for one",
            "title_similarity": "0.46508858",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hyvdl95",
            "score": -5,
            "text": "I saw the same type of post o  FB and holly fuck  people are assholes, saying stuff like, dony let them join, we don't want war, they need to solve their own problems. Total dicks.",
            "title_similarity": "0.25640538",
            "sentiment_compound": -0.3769
        },
        {
            "id": "hyvohho",
            "score": -5,
            "text": "So they are basically signing for a world war?",
            "title_similarity": "0.5192666",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyu4wyr",
            "score": 3,
            "text": "So many people in this thread are acting like this is a brand new idea Ukraine just came up with / started doing today, but [The NY Times says, \"Ukraine took a first step to joining the European Union in early 2014\"](https://www.nytimes.com/2022/02/28/world/europe/ukraine-european-union-zelensky.html), whatever that means, so... what *does* that mean?",
            "title_similarity": "0.58957267",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hytkt4m",
            "score": -1,
            "text": "I hope them joining NATO would come with that.",
            "title_similarity": "0.6036872",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hytxcuy",
            "score": -1,
            "text": "It is too late for Ukraine, Russia will really push the conquest now. Occupy the entire country and form a pro Russian government in Ukraine which will reject EU membership. They should have done this so long ago, but they dangled this in front of Ukraine, the same with NATO membership.",
            "title_similarity": "0.48410088",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hyu0x1w",
            "score": 1,
            "text": "I don't understand why Putin didn't do this invasion under Trump when he was a joke to the internationally community every time he spoke at their meetings. Just goes to show they are both idiots in their own regards. Has Putin won in any aspect at this point?",
            "title_similarity": "0.30240133",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hyu103l",
            "score": 1,
            "text": "Give Russia Donbass, have the rest of Ukraine join EU and NATO. Problem is, that' a BIG loss for Putin so he won't have it.",
            "title_similarity": "0.5756851",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hyu2n92",
            "score": -1,
            "text": "I know there are pre requisites, but damn it this dude earned being a EU nation himself. And the Ukraine too",
            "title_similarity": "0.63246244",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hyuq0fp",
            "score": 1,
            "text": "F%#& me, World War III really might just happen",
            "title_similarity": "0.34087604",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyut8cv",
            "score": 1,
            "text": "This was a master move. The West had a vested interest in ceasefire\"negotiations\" succeeding. Ukraine has maintained a no concessions stance since the beginning. This removes any chance of negotiations, the West has to support it in some way, and Russia is on the clock to claim Kyiv. \n\nNext few days are going to be bad, but if they hold they win spectacularly.",
            "title_similarity": "0.41263288",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hyuvvrt",
            "score": 1,
            "text": " I think from a peacekeeping standpoint (on both sides)it was considered too provocative of a move against Russia and had been decided to be a bad idea, but since Russia has now already crossed that line, it doesn’t matter anymore. Russia considers Ukrainian to be their buffer zone against Europe, just like China has theirs with North Korea as well as the tense situation in Taiwan.\n\nRussia had been threatening to invade if they joined NATO. That’s been going on for awhile now.\n\n\nThis is just my objective take, trying to give benefit of doubt to all sides:\n\nTHEN AGAIN MAYBE RUSSIA found evidence it was about to happen before they invaded. You can’t trust anyone anymore, including NATO, and including almost all news outlets, so how would we really know? We’ve been thrown into hate mongering over and over , used as pawns in the name of profit and control of entire nations, and the entire world. It’s sad to say this but it’s very true. There is no trustworthy source anymore.",
            "title_similarity": "0.46652865",
            "sentiment_compound": -0.6119
        },
        {
            "id": "hyx2ls8",
            "score": -1,
            "text": "That president used to make anti corruption Institutions inside Ukraine very difficult to do their work properly.\nPoliticians are bare fist fighting each other in the Parliament. \nThe level of corruption in Bulgaria is a joke compared to Ukraine. We don't want Ukraine in the EU. It's a shithole.",
            "title_similarity": "0.30880946",
            "sentiment_compound": -0.6823
        },
        {
            "id": "hytwp56",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.15134288"
        },
        {
            "id": "hyt7q74",
            "score": -9,
            "text": "Ukraine joining the EU isn't going to happen in the next 15/20 years ofcourse.",
            "title_similarity": "0.43270463",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyt1nud",
            "score": 2,
            "text": "[Real Life Lore](https://www.youtube.com/watch?v=If61baWF4GE&t=1690s) has a good video on the possible reasons behind all this, and what Ukraine joining the EU would mean to Russia.",
            "title_similarity": "0.6681148",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hyv04t0",
            "score": 3,
            "text": "Zelensky will have trouble sitting in the chair with his massive fucking balls",
            "title_similarity": "0.15328246",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyvunvk",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.15237565"
        },
        {
            "id": "hyt2n0w",
            "score": 27,
            "text": "I'm old enough to remember Tienemin square. This is not gonna end well.",
            "title_similarity": "0.26631576",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hyt5jw6",
            "score": -1,
            "text": "I guess the talks with Russia didn’t go well enough",
            "title_similarity": "0.26211533",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hyu3lzs",
            "score": 4,
            "text": "^(No. We should absolutely not do something like this! This is absolutely crazy and would just make everything worse!)",
            "title_similarity": "0.17319813",
            "sentiment_compound": -0.817
        },
        {
            "id": "hyumng1",
            "score": 2,
            "text": "Zelensky knows to play his hand well.",
            "title_similarity": "0.18091403",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hyurw2g",
            "score": 2,
            "text": "So his invasion is achieving the opposite of its intended effect?",
            "title_similarity": "0.17694515",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv7mp3",
            "score": 2,
            "text": "Let's say a complete withdrawal of Ukraine happens and the EU actually entertains Zelenskyy's request. Does this mean a serious clean-up of Ukraine's politics? I've heard it's still quite corrupt (just like Belarus, Russia, and other countries of the former Soviet Union) and they're not a democracy.",
            "title_similarity": "0.48357603",
            "sentiment_compound": 0.7152
        },
        {
            "id": "hywb7bh",
            "score": -6,
            "text": "Can a nation join while actively at war? Seems like a quick way to ratchet up what's essentially a civil war into a war against super powers. Pretty sure I heard in hs something happened like that in the 20th century at the same spot on the globe.",
            "title_similarity": "0.41804013",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hytlwa2",
            "score": -3,
            "text": "So does Russia explode the second the request is approved or does it take a day?",
            "title_similarity": "0.4264707",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hytvxus",
            "score": -4,
            "text": "They must be crazy!  Russia's going to invade for sure now!",
            "title_similarity": "0.41083023",
            "sentiment_compound": -0.1739
        },
        {
            "id": "hytfsk8",
            "score": -12,
            "text": "Oh no. Don't stoop to that. Ukraine deserves better.",
            "title_similarity": "0.3761543",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hytl6g8",
            "score": 5,
            "text": "Wow, big balls. Long live 🇺🇦!",
            "title_similarity": "0.18897985",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hyu3wen",
            "score": 0,
            "text": "They can’t be worse than fucking Greece, let them join!",
            "title_similarity": "0.34090656",
            "sentiment_compound": -0.2942
        },
        {
            "id": "hyu4cd7",
            "score": 0,
            "text": "I could be wrong but I thought they already joined yrs ago?",
            "title_similarity": "0.32826948",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hyu4t36",
            "score": -4,
            "text": "Canadian here. If they turn him down, can we have them join North America? (At least the Americans won't question the geographical concerns)",
            "title_similarity": "0.4787644",
            "sentiment_compound": 0.296
        },
        {
            "id": "hyu7wpi",
            "score": 0,
            "text": "Hope you get it asap, Cheers from Denmark..\n\nSlava Ukraini!!",
            "title_similarity": "0.37837604",
            "sentiment_compound": 0.7639
        },
        {
            "id": "hyugncd",
            "score": 0,
            "text": "So EU avoided this so as to not antagonize Putin to war . But now he is killing innocent Ukrainian civilians . What’s stopping them from indicting Ukraine now? Let’s effing do it ?!",
            "title_similarity": "0.35679752",
            "sentiment_compound": -0.8443
        },
        {
            "id": "hyumodm",
            "score": 0,
            "text": "To me they're very welcome to join the EU, I really want to help them but other than donating money I can't really do much:(",
            "title_similarity": "0.4002238",
            "sentiment_compound": 0.6318
        },
        {
            "id": "hyuoyn5",
            "score": 0,
            "text": "Is it possible that America will or can intervene in the near future? Honestly I’m more curious to understand what kind of outcome this entire situation will bring to the world. Will these sanctions ever be lifted? Can both Ukraine and Russia recover optimistically for the future?",
            "title_similarity": "0.4559753",
            "sentiment_compound": 0.8494
        },
        {
            "id": "hywc7a2",
            "score": 0,
            "text": "Surely anything signed would be void due to it being signed under duress.",
            "title_similarity": "0.18607715",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hywpgx9",
            "score": -4,
            "text": "If the EU takes Ukraine, the EU is lost. That literally would mean World War 3",
            "title_similarity": "0.4687283",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hyue66n",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.15134288"
        },
        {
            "id": "hytrdrq",
            "score": 1,
            "text": "Give me liberty or give me death!",
            "title_similarity": "0.28480178",
            "sentiment_compound": -0.2003
        },
        {
            "id": "hyttp6k",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.15237565"
        },
        {
            "id": "hytze8g",
            "score": 1,
            "text": "r/fuckputininparticular",
            "title_similarity": "0.23987514",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyu6vxn",
            "score": 1,
            "text": "I would just like to say, at this point, war is inevitable",
            "title_similarity": "0.4425121",
            "sentiment_compound": -0.34
        },
        {
            "id": "hyubo7q",
            "score": 1,
            "text": "Mate if anyone fucking deserves it, it’s Ukraine.",
            "title_similarity": "0.5499323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyugqc1",
            "score": 1,
            "text": "Or if he **really** wants to piss Putin off, he could request statehood.",
            "title_similarity": "0.39950305",
            "sentiment_compound": -0.4522
        },
        {
            "id": "hyum1zn",
            "score": 1,
            "text": "So, fuck Russia and England then?",
            "title_similarity": "0.44615674",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hywlqp2",
            "score": 1,
            "text": "this will just make putin even more furious and he’ll rain down hell even more",
            "title_similarity": "0.24641597",
            "sentiment_compound": -0.8622
        },
        {
            "id": "hytj36t",
            "score": 24,
            "text": "Plot twist: Putin loves Code Geass and just wants to bring peace by becoming the ultimate evil",
            "title_similarity": "0.26583287",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hytwulk",
            "score": 8,
            "text": "He should know he's in deep when China tells him to fuck off.",
            "title_similarity": "0.39137042",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hytg1wn",
            "score": 2,
            "text": "Even better than joining NATO.  I hope the rest of the countries victimized by him join.",
            "title_similarity": "0.39630038",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hytnao2",
            "score": 2,
            "text": "Oooohhh, shiiieeeeeeeeeeet.",
            "title_similarity": "0.2634908",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytr0ls",
            "score": 2,
            "text": "Keep in mind even if he stops, this is just one more stress stress to democracy around the world.",
            "title_similarity": "0.3074289",
            "sentiment_compound": -0.7764
        },
        {
            "id": "hytwq87",
            "score": 2,
            "text": "Ukraine calls for aid!",
            "title_similarity": "0.6186395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyug9aq",
            "score": 2,
            "text": "It would be more incendiary, but I would rather have them in NATO.",
            "title_similarity": "0.32063672",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuge70",
            "score": 2,
            "text": "This feels like a Ukraine sending a massive middle finger to Putin. Ballsy move!",
            "title_similarity": "0.5258151",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hyuqqho",
            "score": 2,
            "text": "The UK left and then UK joined!",
            "title_similarity": "0.4993166",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywizw0",
            "score": 2,
            "text": "They won’t get in anyway.",
            "title_similarity": "0.12164627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytktzp",
            "score": 35,
            "text": "Oh shit.\n\nThe escalation of things is happening.\n\nPutin will start heavily waving his nukes like it's the only answer that the world would need to back down.\n\nAliens: step the fuck in already.",
            "title_similarity": "0.31567368",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hytpl6p",
            "score": 2,
            "text": "Well, Ukraine will have to copy paste a raft of anticorruption and anti discrimination legislation to pull that off.  That's probably the biggest roadblock, but given the current circumstances it's also probably a doable thing.  Nothing like a horrific crises to bring in the opportunity for sweeping legislation",
            "title_similarity": "0.40577224",
            "sentiment_compound": 0.7723
        },
        {
            "id": "hytqgpv",
            "score": 3,
            "text": "Путин - это зло. Глаза всего мира смотрят на него с отвращением. Ваши лидеры лгут вам. \nВаши дети убивают и умирают в Украине. Они совершают военные преступления по приказу Путина. Поднимитесь в знак протеста. Приведи Россию к новой славе и свободе. Свергнуть Путина. Убейте Путина.",
            "title_similarity": "0.39793086",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyu2vsn",
            "score": -2,
            "text": "Your badness will be the end of you and our goodness will be our triumph! Bad is bad! Good is good! Bad bad good bad! Good good bad good, bad! Good.",
            "title_similarity": "0.18324703",
            "sentiment_compound": -0.3111
        },
        {
            "id": "hyu4vuh",
            "score": 3,
            "text": "Waiting on Putin to point his little finger dramatically and whine, “See?  I told you!  NATO aggression!  Western aggression!”",
            "title_similarity": "0.45608103",
            "sentiment_compound": -0.6784
        },
        {
            "id": "hyujtgz",
            "score": 2,
            "text": "Oh that's just suicide",
            "title_similarity": "0.090985194",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hyunb55",
            "score": -3,
            "text": "NATO should roll into Ukraine at this point",
            "title_similarity": "0.71116173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytkzcx",
            "score": 11,
            "text": "This might cause Putin to lose his mind.",
            "title_similarity": "0.3053159",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hytjq9y",
            "score": 106,
            "text": "Since \"Brexit\"  was a thing, will this be called \"Ukrenter\"?",
            "title_similarity": "0.5242266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyu2z5j",
            "score": 13,
            "text": "Forget Brexit, it's all about that Ukrentry, baby",
            "title_similarity": "0.3898951",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyv2d7w",
            "score": 15,
            "text": "People are being too hopeful here.\n\nHere’s the reality:\n\nThis war is a contest of edging- who can push the boundaries of war in the 21st century and get away with it before tipping the scale into a total war involving a global superpower and other major powers.\n\nThe west is edging by “considering” giving Ukraine EU membership; this would be diplomatically short of declaring Ukraine a military ally by inducting it into NATO; but remember, there is no treaty bound obligation for member states of the EU to jump into defensive wars on behalf of a member state like article 5 as it exists in NATO, and the EU’s Defence policy has been intentionally vague so as to entice EU membership by lessening concerns of being involved in messy military engagements. \n\nThe threat of membership is just that: a threat. The west is hoping that open discussions on giving Ukraine EU membership will cow Russia into coming to the negotiating table, while avoiding the issue of automatic military entanglement should membership actually even be granted. While this may seem like a likely scenario considering all the bullshit hopeful articles out there about how the Russian army has stalled outside of Kyiv and how they’ve underestimated their enemy, consider this:\n\nRight now, the Russian army is actively engaging in day time only engagements because there is a reported shortage among those frontline units deployed to Ukraine of NVGs; a Russian soldier was captured carrying a printed out battle-plan, and reports on captured armored vehicles suggest that the Russian forces do not possess any vehicles with GPS- hence the printed out battle plans with maps on them.\n\nIn other words, Putin, for whatever reason, has sent some conscripts and Cold War era equipped soldiers into Ukraine, a country which has received almost a billion dollars in military aid and modern equipment from dozens of countries, yet the Russian army has still successfully reached the outskirts of the Ukrainian capital within 5 days; and now, satellite images suggest that 2/3 of all Russian troops amassed at the Ukrainian border have been deployed. Meaning that the rest of Russia’s troops are still waiting in reserve- why? \n\nWhat this suggests, is that all these articles are fucking bullshit. The media knows about as much as we do about what’s going on, and that’s fuck-all.\n\nThe articles coming out now are hooahing about the fantastic results of the sanctions and all this other nonsense, but half-assed sanctions which do not completely cut off Moscow from SWIFT are not going to stop Russian military aggression, just like sanctions did not stop Iran from engaging in covert military interventionism in the Middle East during the wars against ISIS. \n\nIt took 3 weeks for the awesome military might of the United States to take Baghdad in the invasion of Iraq, even with total air superiority, there is nothing to laugh at the Russians about for the distance they’ve covered in 5 days. \n\nPeople need to be more realistic about the horror that’s unfolding here. Zelensky is not going to be celebrating to a crowd of jubilant Ukrainians in the war battered Kyiv with a “Mission Accomplished” banner flying above the city within a few more days.\n\nRussian troops being stalled outside of Kyiv does not mean the Russians bit off more than they could chew; the last Putin would want is to send the bulk of his army which has remained 19km outside the city to engage in urban combat that could easily devolve into a meat grinder.",
            "title_similarity": "0.538641",
            "sentiment_compound": -0.7787
        },
        {
            "id": "hytvf4e",
            "score": 15,
            "text": "Russia will also apply later this year with its new president.",
            "title_similarity": "0.40846324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv7sa2",
            "score": -14,
            "text": "Maybe this was actually Trump’s plan all along.",
            "title_similarity": "0.34876293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyto9r5",
            "score": 6,
            "text": "Theater!\n\nSeriously, why didn't this get done in 2014? Or in 2019 when he got elected?",
            "title_similarity": "0.39017594",
            "sentiment_compound": -0.3296
        },
        {
            "id": "hytqin9",
            "score": 6,
            "text": "Here's the end problem. Ukraine will get swallowed up by Russia. Russia   \nwill put it a puppet government. Will the word recognize Ukraine as   \nUkraine or as Russia? Now, how do you deal with sanctions?",
            "title_similarity": "0.5050818",
            "sentiment_compound": -0.4696
        },
        {
            "id": "hytqshu",
            "score": 4,
            "text": "\"Sure, after your current situation is all resolved. No sense in starting WWIII.\"",
            "title_similarity": "0.35062486",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hyvmotu",
            "score": 4,
            "text": "Let them join and protect them from Putin’s aggression",
            "title_similarity": "0.50869244",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyt0u9g",
            "score": -16,
            "text": "[removed]",
            "title_similarity": "0.15134288"
        },
        {
            "id": "hytn173",
            "score": -5,
            "text": "This is exactly the opposite of what should have happened, no? I thought it was safest for everyone if Ukraine remained neutral, i.e. not joining EU? This means Russia now shares a large border with EU a.k.a. the west-like-minded group of countries/democracies. Won’t this make everything worse?",
            "title_similarity": "0.5066873",
            "sentiment_compound": 0.327
        },
        {
            "id": "hytnul8",
            "score": -5,
            "text": "The race is on. Can Zelensky get this approved before Russia fully takes Kyiv? We'll see. Even though Russia is incompetent, they have more than enough bullet shields to push the offensive.",
            "title_similarity": "0.41106293",
            "sentiment_compound": -0.431
        },
        {
            "id": "hytq1ao",
            "score": 6,
            "text": "I’m guessing with sanctions Swiss and Finland are closer to proposing to join NATO as well.",
            "title_similarity": "0.5280895",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyu06f2",
            "score": 6,
            "text": "Balls of fucking steel. Fight in any way you can. Support Ukraine in any way you can.",
            "title_similarity": "0.44680247",
            "sentiment_compound": -0.046
        },
        {
            "id": "hyu8qq4",
            "score": 5,
            "text": "This seems highly unlikely to happen anytime soon tho. Europe actually intervening in Ukraine, I mean not just sending resources and some “volunteers” but I mean actually intervening with soldiers and tanks under their flag would cause a direct war between Europe and Russia, thus nato vs Russia and that’s pretty much ww3 and an extremely likely nuclear event. \n\nThat would honestly be a catastrophe and with all due respect to the Ukrainians I would rather that not happen. We can help the Ukrainians with equipment, resources, intelligence, sanctions on Russia and so on but ww3 no thanks.",
            "title_similarity": "0.45331463",
            "sentiment_compound": 0.6799
        },
        {
            "id": "hyvy9lt",
            "score": 5,
            "text": "They should immediately be accepted to the EU with 0 delay and stipulations. Russia won’t do shit lmao",
            "title_similarity": "0.5657553",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hyvbjk9",
            "score": 6,
            "text": "He's just trolling Putin at this point.",
            "title_similarity": "0.43111283",
            "sentiment_compound": 0.0
        },
        {
            "id": "hythxo9",
            "score": 200,
            "text": "Wonder what the clowns at r/russia will make of this\n\nedit: just headed over there again to see what they're talking about. They've judged Zelensky to be a war criminal and discussing where his trial will be. Kool aid drinking lunatics.",
            "title_similarity": "0.30755383",
            "sentiment_compound": -0.872
        },
        {
            "id": "hytvi9e",
            "score": 22,
            "text": "There's more strategy in these comments than what's coming out of Russia.",
            "title_similarity": "0.25018775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyvk8dk",
            "score": -7,
            "text": "“This charter you’ve made is a child’s note. The EU once a third of the world is now dead. You’ve only helped distinguish Britannia on a map, from the rest of the pitiful dirt.”\n\nEdit: it’s anime fools",
            "title_similarity": "0.30630705",
            "sentiment_compound": -0.8934
        },
        {
            "id": "hyvs6xz",
            "score": -7,
            "text": "EU will said NO. F*** EU",
            "title_similarity": "0.3378029",
            "sentiment_compound": 0.0
        },
        {
            "id": "hythxt3",
            "score": 41,
            "text": "This just gives Ukraine leverage in peace talks. They can make withdrawal from this application an offering/\"win\" for russia.",
            "title_similarity": "0.59468806",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hytw09z",
            "score": 62,
            "text": "Quite ironic he wanted to leave behind a known legacy, but rather gave world-wide legend status to President Zelensky",
            "title_similarity": "0.3955434",
            "sentiment_compound": -0.1272
        },
        {
            "id": "hytr3ci",
            "score": 7,
            "text": "Most likely will be denied, Ukraine absolutely does not meet the requirements.",
            "title_similarity": "0.2714093",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hyu8svg",
            "score": 8,
            "text": "Although I think the West should admit Ukraine into the EU/NATO in the near future, doing so now would be tantamount to war with the entirety of the EU against Russia (which would inevitably lead to WW). \n\nSo I doubt this option would be seriously considered.",
            "title_similarity": "0.57122815",
            "sentiment_compound": -0.7635
        },
        {
            "id": "hyt1svf",
            "score": 68,
            "text": "Putins like that friend you can hype up to do something dumb. Looks like he bought into all that praise he was getting and the memes depicting him as the manliest man to ever man.",
            "title_similarity": "0.24900089",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hytj7xo",
            "score": 27,
            "text": "Instant EU gas fields.",
            "title_similarity": "0.5267232",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytj9ln",
            "score": 8,
            "text": "Good lesson to all procrastinators out there.",
            "title_similarity": "0.28804988",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hytreeg",
            "score": 9,
            "text": "Serious but cynical question: why would the EU or NATO actually want to accept a country who is likely to continue to be attacked by Russia? It seems the right thing to do but it also seems like a very risky move, akin to Taiwan becoming a state of the US.",
            "title_similarity": "0.42346168",
            "sentiment_compound": -0.4748
        },
        {
            "id": "hyt0wmx",
            "score": 1978,
            "text": "I just fear that we have pushed Putin so far into a corner (the world now hates him, even his own people) that he just says screw it and takes us all out. “If I can’t win, then you can’t either” mentality",
            "title_similarity": "0.2631978",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyt8c1g",
            "score": 174,
            "text": "  I guess when you are that deep into war, shoving a country's own shit back in their face is a normal course of action.  Well done President Zelenskiy.  Anthony Clement McAuliffe was the US general in WWII that replied \"Nuts\" to a German demand for surrender.  I believe Mr Zelenskiy just Nutted Putin.",
            "title_similarity": "0.43628612",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hysxuqu",
            "score": 338,
            "text": "Deep down Putin really wanted to be a hero, so he stepped it up became the heel of the world with the goal of uniting the world to stop him",
            "title_similarity": "0.3898022",
            "sentiment_compound": 0.34
        },
        {
            "id": "hyssqgw",
            "score": 2658,
            "text": "Putin clearly hasn’t planned to the end with this one.",
            "title_similarity": "0.3086661",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hytv3ha",
            "score": 357,
            "text": "One UK leaves, another enters",
            "title_similarity": "0.41264743",
            "sentiment_compound": 0.0
        },
        {
            "id": "hysxy6t",
            "score": 1037,
            "text": "I’d be surprised if this transitions into the EU accepting their application. Especially since it would mean they’d need to fast track it.\n\nBecause my understanding is that it would require them to become involved in the war beyond nations sending Ukraine weapons and I don’t think the EU really wants to get involved in a war with a nation that is only applying because it’s under attack by a stronger foe.",
            "title_similarity": "0.44817764",
            "sentiment_compound": -0.891
        },
        {
            "id": "hysyu0e",
            "score": 855,
            "text": "Isn't this something Putin was trying to avoid with this invasion?",
            "title_similarity": "0.3853668",
            "sentiment_compound": -0.296
        },
        {
            "id": "hystxl4",
            "score": 1891,
            "text": "Someone a lot more familiar with the EU, is this possible?\n\nEdit: \nOkay really, it's about 50/50 with the answers.  I withdraw the question.",
            "title_similarity": "0.45218068",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hystczg",
            "score": 4789,
            "text": "Seems to show Peace Talks went well today.",
            "title_similarity": "0.207016",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hystnnd",
            "score": 14902,
            "text": "Putin bringing everyone together, just like he planned",
            "title_similarity": "0.44678175",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hytel78",
            "score": 891,
            "text": "Does joining the EU give any military benefits?",
            "title_similarity": "0.5852685",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyt8fgn",
            "score": 1,
            "text": "How does this compare to NATO? could this be an option instead of Ukraine joining NAtO?",
            "title_similarity": "0.61439633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytggqc",
            "score": 3,
            "text": "So I'm just wondering. If the west backs Russia into a corner and completely destabilises it (this has pretty much already happened), I don't think Putin will just cross his arms and admit defeat will he? Like aren't we just pushing him to the point of him swinging back with nukes? Surely he won't just accept Russia becoming a third world country. It does scare me that nukes are the only option we'll leave him with",
            "title_similarity": "0.3659476",
            "sentiment_compound": 0.2444
        },
        {
            "id": "hytjngd",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.15237565"
        },
        {
            "id": "hytkdi8",
            "score": 1,
            "text": "What exactly does this achieve?  If/when Putin controls the entire country...what then?  If he doesn't, what benefits do the Eurozone provide that would really help in a war-torn country that couldn't be accounted for otherwise?  \n\nThis really seems like more show than substance.  But I'd love to be corrected because I don't really know.",
            "title_similarity": "0.45826423",
            "sentiment_compound": 0.8636
        },
        {
            "id": "hytlrin",
            "score": 2,
            "text": "1. how fast could this realisticly take to become EU member?\n2. what‘s the consequences?",
            "title_similarity": "0.49468148",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytn39j",
            "score": 4,
            "text": "If I’m not mistaken, this was after Russian/Ukrainian peace talks had concluded. This might give some insight into how those talks went.",
            "title_similarity": "0.54140604",
            "sentiment_compound": 0.6818
        },
        {
            "id": "hytnpxq",
            "score": 2,
            "text": "EUs biggest problem since Brexit has been the budget the last thing it needs is another net drain in Eastern Europe.",
            "title_similarity": "0.4252862",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyto2nu",
            "score": 1,
            "text": "Does anyone know what the alliance relationship in the EU is like? If Ukraine does join now then what does that mean in terms of EU intervention in the current war (which isn't already part of NATO intervention)?",
            "title_similarity": "0.7075614",
            "sentiment_compound": -0.1431
        },
        {
            "id": "hytofv0",
            "score": 3,
            "text": "Considering all the requirments i would be suprised if it was accepted. But i would be fore nato approving to preserve democrocy and a nation under threat of extermination. \n\nCall it a charity case or a peoject for nato i dont care  lst them in.",
            "title_similarity": "0.43205604",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hytp1ts",
            "score": 3,
            "text": "And know we have a self-fulfilling prophecy!",
            "title_similarity": "0.34538233",
            "sentiment_compound": 0.0
        },
        {
            "id": "hytp9as",
            "score": 3,
            "text": "This will get ugly. If Russia pushes the defenders from the 2 cities, they will still fight on.",
            "title_similarity": "0.28901672",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hytpl9h",
            "score": 3,
            "text": "Several countries are still waiting to join, so I don't see this happening quick at all, otherwise I'd be pissed if I was the likes of Turkey.",
            "title_similarity": "0.2722173",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hytpu8a",
            "score": 1,
            "text": "Does joining the EU automatically make you a member of NATO? As in if that happens will the states be pulled into the conflict more directly?",
            "title_similarity": "0.7079256",
            "sentiment_compound": -0.3939
        },
        {
            "id": "hytrcnw",
            "score": 1,
            "text": "He’s been trying to join EU for days, they just aren’t listening.",
            "title_similarity": "0.2603554",
            "sentiment_compound": 0.296
        },
        {
            "id": "hytrtno",
            "score": 3,
            "text": "Oh, r/historymemes will be a banger in 20 years",
            "title_similarity": "0.3010381",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyts1wp",
            "score": 1,
            "text": "does that mean the EU will respond with force? will they protect one another or just financialy.",
            "title_similarity": "0.4691342",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hyts40g",
            "score": 3,
            "text": "If these attacks continue I’m gonna have to intervene",
            "title_similarity": "0.34580737",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hytsj5n",
            "score": 1,
            "text": "So if the EU accepts, and Ukrane becomes a member state, what exactly would that mean? That is to say would the rest of the EU join in the war?",
            "title_similarity": "0.6589905",
            "sentiment_compound": -0.1926
        },
        {
            "id": "hytty48",
            "score": 5,
            "text": "Once they join does the EU have to send troops?",
            "title_similarity": "0.6139475",
            "sentiment_compound": 0.296
        },
        {
            "id": "hytvehg",
            "score": 4,
            "text": "Would this mean that Europe joins the war?",
            "title_similarity": "0.5217713",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hytzp9f",
            "score": 1,
            "text": "At this rate I'm surprised he hasn't been Knighted by the Queen yet...",
            "title_similarity": "0.2590495",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hyu0kkp",
            "score": 3,
            "text": "Are EU nations pledged to help one another in case of war? I've literally never thought about it until now",
            "title_similarity": "0.5375267",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyu0kov",
            "score": 6,
            "text": "Why would the EU let in a country literally at war?",
            "title_similarity": "0.51451486",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyu20ew",
            "score": 1,
            "text": "Well I can’t see how they will make Russia happy",
            "title_similarity": "0.31416035",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hyu2ybj",
            "score": 1,
            "text": "https://youtu.be/Ppib8wfhOaA",
            "title_similarity": "0.36941385",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyu3xme",
            "score": 3,
            "text": "If this request is pushed through, does that mean EU will need to send in forces to defend the EU? That seems like an escalation to a potential deadlier war?",
            "title_similarity": "0.4813648",
            "sentiment_compound": -0.4137
        },
        {
            "id": "hyu3ytj",
            "score": 1,
            "text": "Now this is getting real",
            "title_similarity": "0.18155691",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyu6oq6",
            "score": 3,
            "text": "I wish, but damn if that wouldn't start WW3 right then and there.",
            "title_similarity": "0.3402752",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyu7pg9",
            "score": 3,
            "text": "seems kinda like a desperation move.  Should've joined before...",
            "title_similarity": "0.27529177",
            "sentiment_compound": -0.1354
        },
        {
            "id": "hyu7z46",
            "score": 3,
            "text": "Ironic to use a ‘no war’ sign as the picture for an article about what exactly could cause WWIII",
            "title_similarity": "0.37845886",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyu8pqj",
            "score": 3,
            "text": "They ain't getting in, it's too much of a liability, even if there's no defense agreement like in NATO.",
            "title_similarity": "0.22725308",
            "sentiment_compound": -0.3178
        },
        {
            "id": "hyu8qhd",
            "score": 6,
            "text": "Using an invasion to get fast track membership in the EU isn't going to be so simple. The EU can support Ukraine's defense efforts but letting it into it's little walled garden is something they just won't do on a whim.\n\nEven if the EU by some manner DID attempt to start the process, Putin would just increase his aggression and take as much as he can before attempting any kind of peace process after the lines the drawn again.",
            "title_similarity": "0.43807712",
            "sentiment_compound": 0.7622
        },
        {
            "id": "hyua4dx",
            "score": 3,
            "text": "How does this help?  Is there more protection for Ukraine once he joins or is it more financial in nature?",
            "title_similarity": "0.47246164",
            "sentiment_compound": 0.54
        },
        {
            "id": "hyuayru",
            "score": 6,
            "text": "Doesn't the EU have rules that keep prove in active wars from joining them?",
            "title_similarity": "0.4596126",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyubec9",
            "score": 1,
            "text": "Hf sitting in the waiting room for 10+ years.\n\nI hope they find a way to speed this shit up but a lot of it is necessary.",
            "title_similarity": "0.23231962",
            "sentiment_compound": -0.1717
        },
        {
            "id": "hyubopo",
            "score": 1,
            "text": "\nWell this is my take on it now.  As I don't believe in coincdence:\n\n1 Von der Layen says Ukraine is European, one of us, they will be welcomed\n\n2. Von de leyen and Zelenskyy have a phone call the same evening also to discuss the EU member ship\n\n3. The next day he sends application  for EU member ship\n\n4. The EU has lately been abandoning their normal rigid rules ( which were made to protect old and new members, so they are good). BUT\n\n5. The situation in UKraine was hot and now it's complete war& invasion . So it has escalated already, and trying to be  too carefull doesn't matter too much anymore : even more EU must be more resolute.\n\n6 And Europe has stated to deliver weapons, money, planes food etc. So it has committed  itself to a Ukraine. Breaking thei Europeans custom to be carefull and changing rules.\n\n7. I would not be surprised if Ukraine becomes a candidate member much sooner than anyone anticipated,.But there must be some kind of almost unanimous vote to circumvent the normal rule. It's not unlikely that this might exactly happen.",
            "title_similarity": "0.5830384",
            "sentiment_compound": -0.4754
        },
        {
            "id": "hyuclao",
            "score": 1,
            "text": "Well don’t forget that no one sane would accept country which is by all means in war to any group, even in case Russia would left rest of the country the Krym is still taken as a warzone, by accepting country with existing problems you are promising help or solution. We will see how this ends…",
            "title_similarity": "0.4198444",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyud49f",
            "score": 1,
            "text": "Essential Rules for Civilian Refugees Evacuating\n\nRule 1.)\n\nDIRECTION - Both Russia and Belarus are attacking from the Sumy, Chernihiv, Luhansk, Odessa, Chernihiv Region's and Highways (especially those that run North to South).\n\nAvoid these highways if you are close to their borders:\n\nNorth of Kyiv - E95, E373, P02, P13, P28, P56, P65, P69.\n\nSouth of Xepcoh - E97, E105, M14, P37, P47, P57,\n\nEast of Dnipro - E50, H20, M03, N15, P66, T0406, T0428, T0504, T0515\n\nNorth East of Poltava (Around Kahkiv) - E105, M03, M18, P46, P78, P79, T2103, T2104, T2106, T2111, T2113\n\nEvacuate South West towards Moldova, Romania, and Poland if you can do so Safely.\n\n(The Sun rises on the East and Sets on the West.)\n\nAvoid! the North Border with Belarus, the South East near Odessa and Crimea, and East Towards Russia.\n\nAvoid! the Highways especially neay Kyiv and routes with large amounts of traffic.\n\nAvoid! the Traveling at night, you can be suspected of being Russian infantry and fired upon by accident.\n\nAvoid! splitting up any friends or family members. Always! maintain a visual and hearing distance.\n\nRule 2.)\n\nPERSONAL NEEDS - Pack all of the following in this order;\n\nNon-Perishable Foods (Granola Bars, Canned Goods, Cereal), Heating and Firestarters such as (Matches and Lighters / Papers and Books ), and Clothing for \"at Minimum\" of Five Days\n\nCan-Opener and/or Knife, Prescription Drugs, Toiletries (Soap, Hand Sanitizer, Toilet Paper, Towels), and First Aid Kits\n\nCivilian Identification Papers (Birth Certificates, Drivers Licenses, Blood Type, Passports, Child Documents, Etc.), Compasses, and Maps\n\nBatteries, Power Cords, Flashlights\n\nEntertainment (Playing Cards and Dice)\n\nEasy rule of thumb to follow, 6 Liters of Water per Person is enough for 24 hours.\n\n1 liter for breakfast (0.5 to drink, 0.5 to boil for your food) 1 liter for lunch 1 liter for dinner 1 liter extra for sanitation (washing hands) or if you get extra thirsty.\n\nBoil Water for at least 1 to 5 minutes to kill most contaminants.\n\nRule 3.)\n\nLOCATION - Do not visit or stop for non essential or untrustworthy locations, if it's too good to be true, it probably is!\n\nThis includes Banks and Strangers Homes (Anyone that can easily overpower you and your families).\n\nRule 4.)\n\nELECTRONICS - Sooner or later your Internet or Electronics will Fail, usually in this order. Alleviate any chance of disaster by downloading Google Maps and Translate Offline and or using Paper Maps.\n\nWrite down necessary information including Blood Type, Phone Numbers, Addresses, and Directions before your Electronics fail and Write down necessary information in multiple safe locations.\n\nAvoid! Using important electronic devices for unnecessary activities such as Entertainment, you want your Cell Phone / Radio usage at a Minimum.\n\nPlease share this Comment’s Link! This is important and crucial information for anyone within or evacuating Ukraine!\n\nhttps://www.reddit.com/r/ukraine/comments/t05nkx/essential_rules_for_civilian_refugees_evacuating/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nRough Ukrainian Translation of this Post with Google Translate:\n\nhttps://www.reddit.com/r/Ukraine_UA/comments/t06lc4/основні_правила_для_евакуації_цивільних_біженців/?utm_source=share&utm_medium=web2x&context=3",
            "title_similarity": "0.4229989",
            "sentiment_compound": -0.3866
        },
        {
            "id": "hyudl18",
            "score": 1,
            "text": "Sorry for being dumb but what will this accomplish?  Will that force other European nations to join the fight like a NATO deal would?",
            "title_similarity": "0.5041092",
            "sentiment_compound": 0.7257
        },
        {
            "id": "hyudl6p",
            "score": 2,
            "text": "How likely is this happening?",
            "title_similarity": "0.2278577",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyudpz0",
            "score": 1,
            "text": "No idea how this is vs joining NATO but at least it isn't to NATO and maybe the people are better here.\n\n\n\nNext up, addressing Yemen and how the US needs to stop their involvement.",
            "title_similarity": "0.40047985",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hyudt69",
            "score": 27,
            "text": "[deleted]",
            "title_similarity": "0.15237565"
        },
        {
            "id": "hyuewwe",
            "score": 1,
            "text": "Ukraine unfortunately doesn’t currently qualify because of the border disputes (which one of the reasons Putin was/is in eastern Ukraine). This move is about putting the west on the spot.",
            "title_similarity": "0.45747527",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hyuf7km",
            "score": 5,
            "text": "It’s like getting car insurance after the accident.",
            "title_similarity": "0.4241594",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hyufvba",
            "score": 1,
            "text": "If they said yes, would this just literally end the world?",
            "title_similarity": "0.31457734",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyugqbu",
            "score": 1,
            "text": "Oh shit, shits about to hit the fan !",
            "title_similarity": "0.30636084",
            "sentiment_compound": -0.69
        },
        {
            "id": "hyuhicy",
            "score": 1,
            "text": "Seems to show Peace Talks went well today.",
            "title_similarity": "0.207016",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hyuhm5a",
            "score": 1,
            "text": "so what does this mean for the war?",
            "title_similarity": "0.37487358",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyuhu4y",
            "score": 1,
            "text": "Genuine question\n\nWhy would he not have done this before being in a war situation?",
            "title_similarity": "0.33780256",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyui3ji",
            "score": 1,
            "text": "Well after seeing comments I can see it’s 50/50 on happening but what are the implications if approved? I assume that makes it where russia is attacking the *EU* over attacking Ukraine.",
            "title_similarity": "0.6042856",
            "sentiment_compound": -0.5789
        },
        {
            "id": "hyujc54",
            "score": 1,
            "text": "Wouldn’t that mean that the EU would actively have to help Ukraine with their war by actually sending in troops? Or is that just a NATO thing? But if it is wouldn’t that escalate tension between Russia and the EU?",
            "title_similarity": "0.57210886",
            "sentiment_compound": -0.533
        },
        {
            "id": "hyuns85",
            "score": 1,
            "text": "How is joining the EU different than joining NATO?",
            "title_similarity": "0.52752566",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyuqtyc",
            "score": 4,
            "text": "You can't join an alliance when you're in the middle of a war. Haven't they played Europa Universalis?",
            "title_similarity": "0.38156915",
            "sentiment_compound": -0.7798
        },
        {
            "id": "hyuufl1",
            "score": 1,
            "text": "I mean Ukraine's almost certainly not going to be let in but good on him for trying",
            "title_similarity": "0.38403293",
            "sentiment_compound": 0.6601
        },
        {
            "id": "hyuvlq4",
            "score": 2,
            "text": "But like joining AAA he has to wait a week to use it.",
            "title_similarity": "0.3082872",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hyuycf0",
            "score": 1,
            "text": "Saying one thing and doing another is now pulling a “Putin”",
            "title_similarity": "0.48996216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyv6rk8",
            "score": 5,
            "text": "Would Ukraine be let into EU right now though ? If they join and Russia doesn't stop the invasion, wouldn't this start WW3 ? Would Putin really accept defeat just like that ? Other countries want to avoid total war, so the most they'd be willing to do is send artillery, money, etc. to Ukraine, no ? Are they going to play mind games with Putin and risk having Ukraine join EU with the hope in mind that Putin will back off ?",
            "title_similarity": "0.49435797",
            "sentiment_compound": 0.5056
        },
        {
            "id": "hyvjd0p",
            "score": 1,
            "text": "According to the European Union’s article 42.7 one EU countries beef is everybody’s beef similar to NATO’s article 5. Will this still cause problems if Ukraine gains membership?",
            "title_similarity": "0.52151585",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyw2vmk",
            "score": 1,
            "text": "It's a little late isn't it?",
            "title_similarity": "0.09172006",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywcer8",
            "score": 1,
            "text": "So that means putin allowed",
            "title_similarity": "0.51631236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywi9am",
            "score": 3,
            "text": "This will result in more people dying.",
            "title_similarity": "0.17857075",
            "sentiment_compound": 0.0
        },
        {
            "id": "hywkd6z",
            "score": 2,
            "text": "So any day now, EU and NATO could join the fight against Ukraine.",
            "title_similarity": "0.62443006",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hyx1hjy",
            "score": 1,
            "text": "And the UK Leavers are like that John Travolta gif in Pulp Fiction where he's looking around cluelessly.",
            "title_similarity": "0.2566838",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyxhiwe",
            "score": 1,
            "text": "Does anyone have a good guess on how much time it might take to get accepted into EU? Normally it takes years, right?",
            "title_similarity": "0.38930988",
            "sentiment_compound": 0.6553
        },
        {
            "id": "hyyfi57",
            "score": 1,
            "text": "This would basically be the EU declaring war on Russia if they sign it.",
            "title_similarity": "0.57121736",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hyypvx1",
            "score": 2,
            "text": "Can someone explain to me why this wasn't done back when Crimea was taken?",
            "title_similarity": "0.45963058",
            "sentiment_compound": 0.0
        }
    ]
}