{
    "Trucker convoy protest in Washington DC flops as no-one shows up\n": [
        {
            "id": "hz1wbza",
            "score": 12,
            "text": "Someone missed the memo because these guys just held a rally by my town.  Lots of trump flags (eye roll). Apparently, they're heading to DC and should be there by Saturday? I just hope everyone has a fun road trip and takes lots ot pictures.",
            "title_similarity": "0.5510558",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hz241ro",
            "score": 14,
            "text": "What do Russian Convoys and Nazi Trucker Convoys have in common?\n\n*Apparently a lot...*",
            "title_similarity": "0.25853708",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz27a5x",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.27146727"
        },
        {
            "id": "hz1t2cn",
            "score": 19,
            "text": "probably realized the small dick energy they gave off when contrasted to a literal invasion of fascists half a world away",
            "title_similarity": "0.3161944",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hz1tiy1",
            "score": 4,
            "text": "Every single trucker protest has been this way. \n\n\nRemember the big shut down a few months ago? The one that all the trucks were going to stop for one day and show…I don’t even know…that one was going to be all across the US and it was a big deal in the trucker community. Truck stops were empty by 8am. It’s just what you get when every trucker gets a CB and nothing but time in their hands.",
            "title_similarity": "0.6771495",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz1zpow",
            "score": -46,
            "text": "[removed]",
            "title_similarity": "0.27146727"
        },
        {
            "id": "hz24u2q",
            "score": 19,
            "text": "This is gonna get me destroyed here, but as someone that was in favor of the Canadian protests and a lot of the other ones throughout the world i didn't really see the point of the US one. The Supreme Court already struck down the vax mandate and there are very few states that have any real COVID restrictions anymore. Just seemed like a waste of time to me and energy that could have been better used elsewhere",
            "title_similarity": "0.6082527",
            "sentiment_compound": 0.8608
        },
        {
            "id": "hz1zv98",
            "score": -47,
            "text": "Maybe they were all there?  You know, just like the millions of invisible illegals who always vote Dem?",
            "title_similarity": "0.46934348",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hz28hot",
            "score": 27,
            "text": "Well...its hard for a protest to flop, when the convoy hasn't even reached DC yet.\n\nPeoplesconvoy.org has the itinerary. They're still eastbound, and stopping in Indiana tonight.",
            "title_similarity": "0.519209",
            "sentiment_compound": -0.6904
        },
        {
            "id": "hz1xrap",
            "score": 5,
            "text": "The “organizers” are having trouble reaching their stooges on social media lately.",
            "title_similarity": "0.5144707",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hz22sep",
            "score": -2,
            "text": "Yet they had to call in the national guard because they were in danger. /s",
            "title_similarity": "0.40123373",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hz24e0s",
            "score": -35,
            "text": "This is a non-news item, meant to be a pot-shot at conservatives. People don’t show up to the Presidential Inauguration? That’s a story. People don’t show up to a protest, because the thing being protested actually ended before the event? That’s… not a story.",
            "title_similarity": "0.79313254",
            "sentiment_compound": -0.4329
        },
        {
            "id": "hz25rsc",
            "score": -3,
            "text": "“Where are the trucks?”\n\nYou're old news.  No one cares.",
            "title_similarity": "0.6484517",
            "sentiment_compound": -0.569
        },
        {
            "id": "hz1xnsa",
            "score": 15,
            "text": "[deleted]",
            "title_similarity": "0.30789217"
        },
        {
            "id": "hz26035",
            "score": -16,
            "text": "Why is this a news story? Reporting on rumors not happening isn't news. It's noise.",
            "title_similarity": "0.58845186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2dmje",
            "score": 5,
            "text": "They are arriving March 5th you can look up their route online",
            "title_similarity": "0.14539243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1yoo2",
            "score": -1,
            "text": "They are on the beltway",
            "title_similarity": "0.14163977",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz25s1e",
            "score": -3,
            "text": "As I said here last week and got downvoted...this protest was never going to get the same level of popular support that the Canadian protest did because most states have dropped almost all covid protocols. \n\nWhen the Canadian convoy got started none of our levels of government were even presenting a plan or timeframe for removing restrictions. We were sitting at home watching the rest of the world move on and return to public life, and we were bringing restrictions BACK and imposing them on EVERYONE regardless of vaccination status.",
            "title_similarity": "0.6642887",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz26acr",
            "score": -8,
            "text": "Fucking idiots. Look at the Ukraine. Look at North America. These are not the same.",
            "title_similarity": "0.5141239",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1yhrm",
            "score": 15,
            "text": "The convoy that passed through St Louis yesterday was pretty pathetic too.\n\nThe local station interviewed some of the people who showed up on an overpass to show support and they looked exactly like you'd expect these people to look like.",
            "title_similarity": "0.6087057",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hz3o1f0",
            "score": 0,
            "text": "I've had my CDL since '94, and this \"protest\" was just stupid. Not surprised no one showed up.  \nFirst, most drivers in the US are company drivers, it's not like they can just take their truck and drive across the country. They'd be fired within 24 hours.  \nSecond, the owner operators out there have bills, huge bills. $5000/month truck payments, insurance, taxes, fuel costs, house payments, car payments, and all the other household bills.  \nMost Owner Operators are riding the line between solvency and bankruptcy.  \nIf they did try to take a month off, or even a few weeks, they would lose their contracts with shippers and then they are bankrupt as well.  \nThird, any covid restrictions really don't affect us. Most truckers spend the majority of the day alone in their truck, and no one is checking them for vaccines. I don't think their is a single company that has required vaccines from their drivers.  \n  \nThis whole thing was dead from the start, no one was coming or even cared about it. Yes, a lot of us supported the Canadians because their restrictions were much worse, their jobs were being threatened due to Trudeau's policies. Here in the US, we weren't.",
            "title_similarity": "0.5977689",
            "sentiment_compound": -0.9684
        },
        {
            "id": "hz46c4k",
            "score": 0,
            "text": "There are multiple convoys. 2 from California, one from Maine, and one from Texas. There may be more. None have reached DC yet. They will by the beginning of next week. Maybe the Ghost of Kiev will stop them.",
            "title_similarity": "0.5849396",
            "sentiment_compound": -0.6199
        },
        {
            "id": "hz22nxh",
            "score": 2,
            "text": "Because all the Russian gopnicks are currently in uniform getting killed in Ukraine. No time to rabble rouse on the internet.",
            "title_similarity": "0.5349172",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hz33dbb",
            "score": 1,
            "text": "Mmm. They’re in Illinois and in route. What’s with this bs article?",
            "title_similarity": "0.18690452",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2hs7s",
            "score": -5,
            "text": "When a possible WW3 knocking on all of our doors, woke crap and misinformation start to fall into oblivion.",
            "title_similarity": "0.597066",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz211et",
            "score": 9,
            "text": "This is pretty terrible reporting. There were two convoys, the Freedom Convoy and The People’s Convoy. One got absorbed into the other. The absorbed one had plans to show up yesterday but now have dramatically adjusted their timeline but also grown in numbers. \n\nI’m not an expert here but @coolfacejane on Twitter is a doctoral researcher in online communication and has been following this every step of the way. People who know what’s going on are not remotely surprised this happened and momentum is still building around this convoy crap.",
            "title_similarity": "0.4358899",
            "sentiment_compound": -0.4116
        },
        {
            "id": "hz29lqh",
            "score": 14,
            "text": "It's not scheduled in DC today lol\n\nhttps://thepeoplesconvoy.org/",
            "title_similarity": "0.6855004",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz27fo5",
            "score": 0,
            "text": "These fools realized that they are federally licensed. CDL’s are a pain in the ass and it would be so easy to just revoke it and your job is gone. Besides, gtf to work.",
            "title_similarity": "0.395903",
            "sentiment_compound": -0.7398
        },
        {
            "id": "hz27jzv",
            "score": 0,
            "text": "They realized they had bills to pay",
            "title_similarity": "0.09751326",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hz29bho",
            "score": 0,
            "text": "Lazy freeloaders just want to get paid to not work! /s",
            "title_similarity": "0.3780875",
            "sentiment_compound": -0.3802
        },
        {
            "id": "hz2agho",
            "score": 0,
            "text": "Well considering Covid is magically over they don’t really have anything to protest do they?",
            "title_similarity": "0.35133272",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz29meb",
            "score": -5,
            "text": "I think when Putin decided to wage war during a pandemic, people figured there’s no more pandemic going on, and especially after that cringe skit on SNL, Covid in general is not a hot subject anymore.",
            "title_similarity": "0.611498",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hz2etfm",
            "score": -7,
            "text": "I meaaaan they’re rolling back COVID restrictions (election year lmao) but there’s no need to protest now. 🙄",
            "title_similarity": "0.4662633",
            "sentiment_compound": -0.431
        },
        {
            "id": "hz25217",
            "score": -11,
            "text": "Comparing a trucker protest to January 6th lmao 🤣",
            "title_similarity": "0.5371814",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hz26y6l",
            "score": 1,
            "text": "Doesn't this imply that the protest was never a thing to begin with?  Why was the news ever reporting on twitter hashtags (which aren't real) in the first place?",
            "title_similarity": "0.64152694",
            "sentiment_compound": -0.3313
        },
        {
            "id": "hz550nu",
            "score": -2,
            "text": "Fake news.\n\nThe convoy is still moving and hasn't made it to DC yet. They're scheduled to get to Lebanon, TN tomorrow.\n\n[Source](https://www.wkrn.com/news/local-news/trucker-convoy-to-camp-in-wilson-county/)",
            "title_similarity": "0.65496135",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz1xre6",
            "score": 5,
            "text": "Yeah all these guys that want freedom as long as they don't have to get out of their lawn chair, and they can still get it through the drive-thru. Long gone are the days of white picket fences .",
            "title_similarity": "0.44265693",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hz2jvey",
            "score": -5,
            "text": "Or it was completely overblown by our national security state so they can justify wasting more of our money.",
            "title_similarity": "0.37238207",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz210lw",
            "score": 21,
            "text": "Russia gets cut off the internet, and suddenly the support for this bullshit disappears. Social media trends shifted practically overnight.\n\nHmmmm, I wonder if there's a link.",
            "title_similarity": "0.5778575",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hz1t77t",
            "score": -72,
            "text": "[deleted]",
            "title_similarity": "0.30789217"
        },
        {
            "id": "hz21pxg",
            "score": -3,
            "text": "Helped that the mandates are all being lifted. Timing??",
            "title_similarity": "0.099354655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz25pam",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.3078922"
        },
        {
            "id": "hz286y7",
            "score": 2,
            "text": "Maybe they turned on the news and saw there are people in the world with real problems.",
            "title_similarity": "0.31534153",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz2fi4s",
            "score": 3,
            "text": "They aren't due until the 4th. I live in D.C.",
            "title_similarity": "0.3817733",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2z36v",
            "score": 4,
            "text": "Lol. March 5 is the date for the protests. Nice try tho. 🤡",
            "title_similarity": "0.31342655",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hz37zfa",
            "score": -4,
            "text": "Then there’s no convoy ffs what’s the problem? They were mad they were gonna be there now they mad they not there lol. I swear yall some jackasses just needing something to complain about",
            "title_similarity": "0.6053177",
            "sentiment_compound": -0.9438
        },
        {
            "id": "hz1t7mn",
            "score": 27,
            "text": ">Several trucker convoys are still on their way to DC, to oppose Covid mandates, at a time when most restrictions have been been removed by US states.\n\nThis line captures two important points: one, that the mandates are... over?  So what are they protesting?  But also that there are still convoys, at least one them them huge, that are still moving to DC.  So it's not really fair to call this a flop yet.",
            "title_similarity": "0.6157178",
            "sentiment_compound": -0.5829
        },
        {
            "id": "hz1vyo0",
            "score": 26,
            "text": "Amazing what happens when Putin isn’t funding American dissent anymore.",
            "title_similarity": "0.48866087",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz23by7",
            "score": 1,
            "text": "Comments are making me lose all my brain cells",
            "title_similarity": "0.32494956",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz2h7hj",
            "score": -1,
            "text": "Still a win. We got them to waste their time putting that fence up. I see that as an absolute win.",
            "title_similarity": "0.21078238",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hz2j0f2",
            "score": 1,
            "text": "The organizers got distracted with their invasion of Ukraine",
            "title_similarity": "0.4802031",
            "sentiment_compound": -0.34
        },
        {
            "id": "hz2jjyg",
            "score": -1,
            "text": "Those lazy basement dwelling libruls cant event astroturf any more 🤣🤣",
            "title_similarity": "0.57281375",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hz2kvl4",
            "score": 1,
            "text": "And these clowns think they can win a Civil War....",
            "title_similarity": "0.29820144",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hz2oekl",
            "score": 1,
            "text": "I think the \"freezing of all your assets if we don't like your protest\" is a good deterrent",
            "title_similarity": "0.34918594",
            "sentiment_compound": 0.4272
        },
        {
            "id": "hz2ohfd",
            "score": 1,
            "text": "They all died of COVID",
            "title_similarity": "0.44417635",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hz41l1n",
            "score": 1,
            "text": "Covid flopped also I see. No need.",
            "title_similarity": "0.48749337",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz29mmq",
            "score": 4,
            "text": "In light of subsequent events I’ve become convinced the organizers of that debacle in Canada were probably on the payroll of Russian intelligence",
            "title_similarity": "0.33285457",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hz2eszg",
            "score": -3,
            "text": "Trudeau has got them all sitting in solitary confinement",
            "title_similarity": "0.42273328",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz27pk8",
            "score": 7,
            "text": "Russian assets go fuck yourself",
            "title_similarity": "0.42683262",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz1vbxh",
            "score": 25,
            "text": "Yeah, of course. Russia is too busy with a an illegitimate invasion, to sit back and organize this one properly.",
            "title_similarity": "0.5263586",
            "sentiment_compound": 0.296
        },
        {
            "id": "hz24hh9",
            "score": 2,
            "text": "They had a trucker convoy come through my Indiana town yesterday and a few people showed up. It's awful funny to me that I'm positive a lot of these people were the same saying that BLM protestors that blocked traffic should just be ran over.",
            "title_similarity": "0.54777503",
            "sentiment_compound": 0.34
        },
        {
            "id": "hz285q5",
            "score": -2,
            "text": "Thank god. Let the Canadian’s have their moment of crazy without us.",
            "title_similarity": "0.45002028",
            "sentiment_compound": 0.296
        },
        {
            "id": "hz2dqkv",
            "score": -1,
            "text": "But the peoplesconvoy planned to be in town on the 11th. Its posted on their .org\n\nJust pointing it out that this was a premature article to the large convoy in Illinois at this moment",
            "title_similarity": "0.5343023",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2h2uk",
            "score": -2,
            "text": "How is this news? Someone explain to me how no one showing up warrants an article",
            "title_similarity": "0.66280353",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz2jy9l",
            "score": -2,
            "text": "Maybe it flopped because US truckers are currently on the road delivering goods and supplies to Americans.  Maybe...",
            "title_similarity": "0.6294054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2kf9b",
            "score": 2,
            "text": "I don't condone any of this.. but this was a small side convoy. The People's Convoy is still going pretty strong from what I can tell and is headed to DC on March 5th.\n\nThis is a nothing story.",
            "title_similarity": "0.6329755",
            "sentiment_compound": 0.8674
        },
        {
            "id": "hz4n9d9",
            "score": -1,
            "text": "That's because rhey are not due to be in DC till the 5th....",
            "title_similarity": "0.46400124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz20j28",
            "score": -49,
            "text": "The protesters won. The government capitulated. \n\nDid you notice how quickly the mandates dropped off once Canadian truckers started protesting?\n\nThe lucky politicians just got out ahead of the protestors this time.",
            "title_similarity": "0.5022627",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz28gqf",
            "score": 7,
            "text": "isn't the convoy in missouri now? \n\nhttps://fox2now.com/news/missouri/hundreds-show-support-as-trucker-convoy-rolls-through-missouri/",
            "title_similarity": "0.41342396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2eisa",
            "score": -11,
            "text": "Y'all are so full of horseshit they won't be there until like March 5th",
            "title_similarity": "0.5159942",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz1tvzp",
            "score": 35,
            "text": "The Russian money dried up!",
            "title_similarity": "0.45038104",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1w4gy",
            "score": -25,
            "text": "I feel the American trucker protest was mostly just showing support for Canada and they figured might as well protest too either way funny AF to see the feds deploy national guard at the Capitol for no reason at all .",
            "title_similarity": "0.5908247",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz26ina",
            "score": 5,
            "text": "ROTFLMAO And guess what? They made a TON of money from morons contributing to their inane cause.",
            "title_similarity": "0.32070112",
            "sentiment_compound": 0.4995
        },
        {
            "id": "hz27kdl",
            "score": 0,
            "text": "Or maybe they couldn’t get to DC because the trucks were blocking the roads. Sounds pretty successful to me. /s",
            "title_similarity": "0.6051835",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hz29a9z",
            "score": 0,
            "text": "Looks like big money to set up a large protest…",
            "title_similarity": "0.23495124",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz2enc9",
            "score": 0,
            "text": "I’m confused. I see news articles from Monday 1 March 2022 that says the trucker convoy was passing through Illinois on its way to DC. Is there more than one rally?",
            "title_similarity": "0.56441027",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz2hvjh",
            "score": 0,
            "text": "Isn't there a much larger convoy on the way? I feel like they were passing through Oklahoma yesterday?",
            "title_similarity": "0.34835064",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hz2ohz1",
            "score": 0,
            "text": "That guy bitching that he was on the phone for 20 hours trying to get permits, when in the past it was only a couple of hours. Yeah dumbass, did you see what happened last year from you nit wits on Jan. 6th?  Do you think the authorities are just gonna welcome you with open arms?  You people really do live in your own little world, don’t you?",
            "title_similarity": "0.54570144",
            "sentiment_compound": -0.2593
        },
        {
            "id": "hz2w5vj",
            "score": 0,
            "text": "Well to me a this whole thing looked like a setup. So I’m sure other’s felt the same.",
            "title_similarity": "0.027675193",
            "sentiment_compound": 0.7334
        },
        {
            "id": "hz39kcb",
            "score": 0,
            "text": "The amazing(ly predictable) part was the breathless non-stop media ‘coverage’ of this bullshit.",
            "title_similarity": "0.2817369",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hz3d3c7",
            "score": 0,
            "text": "Lol hey now that I think about it I havnt heard shit about covid and mandates since the Russian Ukraine thing. Maybe the protest was a success?",
            "title_similarity": "0.42407578",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hz3r0ma",
            "score": 0,
            "text": "According to \"the only real news\" ([gab.com](https://gab.com)) it is miles and miles long and is going to take this country back.  \n\nI don't know what to believe any more.\n\nForgot my /s, sorry",
            "title_similarity": "0.42586634",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz3sn38",
            "score": 0,
            "text": "No one is going to spends thousands of dollars driving their truck to DC for nothing.",
            "title_similarity": "0.67560434",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz3w43m",
            "score": 0,
            "text": "Oh is that why I saw a guy with a support the truckers sign yesterday?",
            "title_similarity": "0.45907634",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz3ylsy",
            "score": 0,
            "text": "They aren’t there yet? 🤦‍♂️",
            "title_similarity": "0.3091048",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3z2pg",
            "score": 0,
            "text": "I’d say it’s got something to do with all the Ukraine stuff. No one gives two shits about a trucker convoy when there are convoys trying to invade Kyiv. The entire west is uniting over this stuff. It’s quite impressive. I think the statistic was that 76% of the US agrees that the invasion of Ukraine is awful.",
            "title_similarity": "0.5327978",
            "sentiment_compound": -0.4417
        },
        {
            "id": "hz41lqu",
            "score": 0,
            "text": "People are slowly becoming de radicalized from the Trump years. Good sign.",
            "title_similarity": "0.40103385",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz41m39",
            "score": 0,
            "text": "so not newsworthy then is it?  If they're not relevant don't give them attention.",
            "title_similarity": "0.39659965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz459v2",
            "score": 0,
            "text": "Then where are those trucks heading through Missouri going? Just asking.",
            "title_similarity": "0.4343005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz54lyh",
            "score": 0,
            "text": "Just 2600 views of the video be posted 9 days ago\n\nhttps://youtu.be/by1HkK4pw18\n\nAlso of course he’s an mma fighter.",
            "title_similarity": "0.38113853",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hz21yvw",
            "score": 10,
            "text": "Psssst. Hey trucker-tards. There are no mask mandates/lockdowns anymore. What in the actual fuck are you protesting?",
            "title_similarity": "0.6974071",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hz27wbx",
            "score": -10,
            "text": "This is fake news. People were trying but all the roads leading into DC were blocked off.",
            "title_similarity": "0.70274794",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hz1wg0m",
            "score": 16,
            "text": "because their finacier Putin is broke.  none of them are resl truckers. domestic terrorists and chickens too.",
            "title_similarity": "0.7077235",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hz1v7l9",
            "score": 27,
            "text": "Clearly they planned generate some footage of God Faring Free Republicans being beaten and trampled by the Fascists Dems. To force Biden to use emergency powers like Trudeau did.\n\nBut Ukrainians are living the EXACT situation that the right wing has been fantasizing about for decades, Mom and Pop having to pick up small arms to defend the nation against Big Brother etc.\n\nAccept the American right has been positioned AGAINST the Ukrainian people, Trump Sold them out.\n\nMaybe a few Right wing Republicans are actually realizing that they have essentially been working for Putin for the past 6 years. \n\nSo good luck looking like the oppressed freedom loving martyrs, while YOUR president compliments Putin for conducting a murderous unprovoked attack on a free Democratic nation.",
            "title_similarity": "0.44258916",
            "sentiment_compound": 0.9762
        },
        {
            "id": "hz201eq",
            "score": -27,
            "text": "Yeah except there’s a 30 mile long convoy",
            "title_similarity": "0.2516017",
            "sentiment_compound": 0.296
        },
        {
            "id": "hz1smq5",
            "score": 6,
            "text": "Rally against covid mandates? The CDC effectively ended all public mandates last week.",
            "title_similarity": "0.6699904",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz28bsb",
            "score": 6,
            "text": "Covid numbers go way down ->\n\nCDC recommends removing most mask mandates ->\n\nThese fukin tards: \"SeE iT wAs AlL pOlItIcAl\"",
            "title_similarity": "0.5153148",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hz2es1w",
            "score": -13,
            "text": "Have none of you been following this? There are serveral convoys happening.one is the people's convoy and last I saw (yesterday) they were passing through Missouri and we're planning on arriving around March tenth. The one that was still planning on being at the State of the Union fizzled out 2 days in. That one was called 'freedom convoy usa 2022' \n\nY'all need to show more support for the truckers it's about more than mask mandates. You'll lawd over blm as they loot and burn things but peaceful truckers y'all hate. Do your own research instead of getting it all from Reddit. Have a wonderful day.\n\n\nEdit: it'd be cool if any of y'all actually wanted to have a civil discussion.",
            "title_similarity": "0.63599646",
            "sentiment_compound": 0.8967
        },
        {
            "id": "hz25vtn",
            "score": 1,
            "text": "It’s almost as if whatever was driving it just suddenly wasn’t available any more",
            "title_similarity": "0.4158358",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz28ofm",
            "score": 1,
            "text": "I believe there was a blockade before their destination. I am an OTR truck driver myself and saw quite a good number of them in Illinois on my way down yesterday afternoon.",
            "title_similarity": "0.45802054",
            "sentiment_compound": 0.5778
        },
        {
            "id": "hz28uc4",
            "score": -1,
            "text": "https://12ft.io/proxy?q=https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Famericas%2Ftrucker-convoy-washington-dc-protest-b2026209.html\n\nAccount wall removed",
            "title_similarity": "0.54809153",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz29ktp",
            "score": 1,
            "text": "I guess Russia has more pressing matters than arranging this",
            "title_similarity": "0.28340212",
            "sentiment_compound": 0.0972
        },
        {
            "id": "hz29l3o",
            "score": -1,
            "text": "Haha shit got real really quick all of sudden, got better things to do I suppose and hope.",
            "title_similarity": "0.03935514",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hz2bnvi",
            "score": -1,
            "text": "Saw  a good number of warnings about the DC affair - a put up job. I guess people listened.",
            "title_similarity": "0.2971321",
            "sentiment_compound": 0.25
        },
        {
            "id": "hz2bq2f",
            "score": 1,
            "text": "What this doesn't explain up front is it was just one of the convoys, not the big one.",
            "title_similarity": "0.50969446",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2cg6h",
            "score": -1,
            "text": "There's a truck convoy coming through my city today in Montana.  The police are saying they expect 300 vehicles to utterly clog up an already bad rush hour freeway exit.",
            "title_similarity": "0.6305409",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hz2dawp",
            "score": -1,
            "text": "Clearly Biden popularly is non existent with protesters. And why is no one talking about the even worse turnout of counter protesters. Literally no one supports Biden in this context. (Anyway I could use up more red yarn on this but I think I’ve made my point) /s",
            "title_similarity": "0.6765643",
            "sentiment_compound": -0.4506
        },
        {
            "id": "hz357j8",
            "score": 1,
            "text": "Sometimes its hard to pretend to be that stupid, even for morons!",
            "title_similarity": "0.30071253",
            "sentiment_compound": -0.7777
        },
        {
            "id": "hz3aq5b",
            "score": 1,
            "text": "\"I got an exception from driving big rigs because of my bone spurs,\" said Donald Trump while also pretending he was a big boy and blew the air horn.",
            "title_similarity": "0.31428385",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hz3kv90",
            "score": 1,
            "text": "Americans have no reason to protest their government's response to COVID-19... unless they're protesting the absolute *lack* of restrictions which has caused their infection rates to be the highest in the world. This is coming from a Canadian who fully supports the Freedom Convoy, and anyone who does not want to get the vaccine for any personal, religious, philosophical, or even ignorant reasons.",
            "title_similarity": "0.4463253",
            "sentiment_compound": -0.3325
        },
        {
            "id": "hz3njlw",
            "score": 1,
            "text": "This is misleading; there are still other convoys inbound.\n\nThe organizer is the same guy who organized the other convoy that just...died in Las Vegas with only 5 trucks after leaving California. This convoy was itself competing with a much bigger convoy that had already left California before and was organized by someone else.\n\nThis guy is either a total idiot or a scammer. He collected like $8k in donations for that convoy. I have no idea why he would show up in DC because he already cancelled the whole thing when it reached Vegas. And surely he should have known how many trucks would reach Vegas based on how many left California. Trucks obey conservation of mass. They do not magically appear along the way.",
            "title_similarity": "0.60540956",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hz3y3hq",
            "score": -1,
            "text": "It hasn’t started yet and it’s not going to be downtown",
            "title_similarity": "0.57802236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz40gg2",
            "score": 1,
            "text": "“We’re too busy WORKING to protest”\n~ Conservative who make up whatever they want to for a narrative",
            "title_similarity": "0.43694574",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz41m0a",
            "score": 1,
            "text": "Probably because it’s not even there yet.",
            "title_similarity": "0.40370718",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz43jef",
            "score": -1,
            "text": "because they lifted most of the bullshit before they got there, surprise surprise",
            "title_similarity": "0.33084208",
            "sentiment_compound": -0.2177
        },
        {
            "id": "hz43wya",
            "score": 1,
            "text": "Probably because all the would be protesters died from Covid.",
            "title_similarity": "0.52065635",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hz232ff",
            "score": 7,
            "text": "The number 1 job among MAGA today is Trucker. In a generation when trucking is fully autonomous, the number 1 job among MAGA will be unemployment; moving up from it's current 2nd place slot.",
            "title_similarity": "0.34084004",
            "sentiment_compound": -0.2585
        },
        {
            "id": "hz23s39",
            "score": 7,
            "text": "Well yeah, all the Russian money funding all this nonsense has dried up.",
            "title_similarity": "0.5179192",
            "sentiment_compound": 0.0451
        },
        {
            "id": "hz1qwo8",
            "score": 36,
            "text": "Kind of got the rug pulled out from under them with restrictions being lifted already.  I'm sure general public opinion hasn't helped, either. Hilarious to see ever since Trump showed he was a size queen.",
            "title_similarity": "0.5120755",
            "sentiment_compound": 0.0108
        },
        {
            "id": "hz1yqm2",
            "score": 38,
            "text": "This is a false headline, according to another source there were 20 people. And don’t forget, 1 person = 100 million people, so really there were essentially 2B people protesting.\n\nI’m trying to get a job as a republican spin doctor, how’d I do?",
            "title_similarity": "0.42021573",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hz29dzd",
            "score": -8,
            "text": "😂 Biden destroyed Covid all by himself.  They saw the trap from Canadian Freesom Convoy.  A lot of support on the highways across America.",
            "title_similarity": "0.5409457",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz21t9x",
            "score": -2,
            "text": "The news articles I've seen say the convoy moving right now is currently in Indiana.",
            "title_similarity": "0.2936929",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz23fbs",
            "score": -2,
            "text": "They didn't do very good recon on this one.  They would have had to wait in traffic to get to the spot to slow down traffic.",
            "title_similarity": "0.5593208",
            "sentiment_compound": -0.3865
        },
        {
            "id": "hz23rho",
            "score": 2,
            "text": "Well, they just lots all their russian backers, so not surprised, they're not getting paid anymore.",
            "title_similarity": "0.51208",
            "sentiment_compound": 0.0402
        },
        {
            "id": "hz24bn6",
            "score": 2,
            "text": "If they want to be useful, then they should go to Europe and help truck materials to Ukraine",
            "title_similarity": "0.21664068",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hz26ga9",
            "score": -2,
            "text": "I’m pretty sure no trucker in the US would think parking your truck and honking all day wont lead to their body becoming Swiss cheese.",
            "title_similarity": "0.6424297",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hz26o73",
            "score": 2,
            "text": "May I propose a different name for these clowns?  \"Trucker\" convoy is insulting to the vast, vast majority of truckers who want nothing to do with these jackasses.\n\nPerhaps \"facist\" convoy?",
            "title_similarity": "0.6100642",
            "sentiment_compound": -0.7941
        },
        {
            "id": "hz271xe",
            "score": 2,
            "text": "When there are bigger problems in the world and you just look like the idiot for complaining about something stupid",
            "title_similarity": "0.44148138",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hz27iqm",
            "score": 2,
            "text": "Protesting? You mean angry at everything and flailing about like a child?",
            "title_similarity": "0.36186934",
            "sentiment_compound": -0.6072
        },
        {
            "id": "hz27qge",
            "score": 2,
            "text": "Nothing to protest. Mask mandates got removed and the corps themselves admitted recently the children vaccine didn't do much",
            "title_similarity": "0.55033237",
            "sentiment_compound": 0.2824
        },
        {
            "id": "hz27u0w",
            "score": 2,
            "text": "A protest as involved as what happened in Canada would require some serious lost wages. Americans live paycheck to paycheck with very little real support.\n\n<Taps head> They can't protest if they can't afford to.",
            "title_similarity": "0.5821904",
            "sentiment_compound": -0.045
        },
        {
            "id": "hz27wzr",
            "score": 2,
            "text": "One can not live on cheeseburgers and energy drinks alone.",
            "title_similarity": "0.3712718",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz281s5",
            "score": 2,
            "text": "Trucker….freedom…convoy…😐",
            "title_similarity": "0.27537113",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz28dcv",
            "score": 2,
            "text": "Yeah no one cares about pandemic restrictions anymore so there isn't much to protest beyond gas being expensive which is now oddly unpatriotic.",
            "title_similarity": "0.56424177",
            "sentiment_compound": -0.1877
        },
        {
            "id": "hz28dlc",
            "score": 2,
            "text": "Thank God. This shit was so annoying for so many weeks.",
            "title_similarity": "0.3974064",
            "sentiment_compound": -0.4576
        },
        {
            "id": "hz28laf",
            "score": 2,
            "text": "Awww are the Ukrainians stealing the spotlight from you? You can't get any attention so you're just gonna stay home and pour? Poor insecure little babies!",
            "title_similarity": "0.58138597",
            "sentiment_compound": -0.8821
        },
        {
            "id": "hz28uma",
            "score": 2,
            "text": "hmmm, could it be that the financiers are a: distracted and b: cannot provide said finances?\n\n&#x200B;\n\nedit: also, nothing left to protest lol",
            "title_similarity": "0.55200064",
            "sentiment_compound": 0.2824
        },
        {
            "id": "hz28zs1",
            "score": 2,
            "text": "What a bunch of limp dick fat fucks. Go back home and park your truck next to your single wide.",
            "title_similarity": "0.5147847",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hz291em",
            "score": 2,
            "text": "Maybe they have learned what real oppression looks like.  J/k these JOs have no empathy to understand anything not directly impacting them.",
            "title_similarity": "0.53798735",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz295o1",
            "score": 2,
            "text": "Go join the foreign league if you want to fight for freedom. 🇺🇦",
            "title_similarity": "0.20968008",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hz29gxw",
            "score": 2,
            "text": "GQP voters don’t have a clue🤪😆😂💯🇺🇸",
            "title_similarity": "0.5494746",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hz29i5y",
            "score": 2,
            "text": "These dumb fucks don't even know what they are protesting for other than throwing around the word \"freedom\"",
            "title_similarity": "0.59955037",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hz29ijt",
            "score": 2,
            "text": "Huh, I guess they were right… no one wants to work anymore hahaha what a bunch of soft “web warrior” complainers",
            "title_similarity": "0.50184053",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz2a42e",
            "score": 2,
            "text": "When did protests become discount copypastas?",
            "title_similarity": "0.336195",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hz2c304",
            "score": -2,
            "text": "So sad. I thought this event was gonna glow.",
            "title_similarity": "0.13306603",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hz2ctwm",
            "score": 2,
            "text": "Pretty sure the main convoy was schedule to show up on the 6th of March. Only a few smaller ones had any plans earlier. \n\nThough after the 180 Biden did on policy talks during the State of the Union, who knows what will happen. It'll be all on if people trust Biden on his word.",
            "title_similarity": "0.3384323",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hz2ey1a",
            "score": -2,
            "text": "Can someone explain to me where and why this would all be related to Russia?",
            "title_similarity": "0.17951153",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2f4fg",
            "score": 2,
            "text": "well they lost their funding, so that’s expected.",
            "title_similarity": "0.48705328",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hz2f5qt",
            "score": 2,
            "text": "Idiots probably all drove to Washington state",
            "title_similarity": "0.582509",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2feuh",
            "score": 2,
            "text": "They are all busy at the flat earthers convention",
            "title_similarity": "0.3527173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2ifnc",
            "score": 2,
            "text": "Lol good.  Russian right wing support is too busy pumping out anti Ukraine propaganda...",
            "title_similarity": "0.3815295",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hz2k6up",
            "score": -2,
            "text": "I my opinion it’s kinda validates the Canadians protest a little.",
            "title_similarity": "0.23484235",
            "sentiment_compound": 0.0276
        },
        {
            "id": "hz2lnvf",
            "score": 2,
            "text": "I’m guessing once they looked at Ukraine and saw what real problems looked like, they felt foolish as hell and sat down.",
            "title_similarity": "0.4307538",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hz2m61f",
            "score": 2,
            "text": "It's tough to pay for fuel when your Russian funding dries up.",
            "title_similarity": "0.41504818",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hz2meda",
            "score": 2,
            "text": "We're here to protest the mandates.\n\nWhat mandates?\n\nThe ones that ended weeks ago.",
            "title_similarity": "0.5349969",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz2mlk0",
            "score": 2,
            "text": "Cue the world’s smallest violin",
            "title_similarity": "0.2453947",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2mskd",
            "score": 2,
            "text": "Lol. Because there are ACTUAL PATRIOTS fighting in Ukraine.",
            "title_similarity": "0.29139286",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz2scax",
            "score": 2,
            "text": "There was a point to the Canadian one. There's no need for it in DC so it's not surprising this was a dud.\n\nIt would be like one of these being started here in the UK despite there being no mandates at all.",
            "title_similarity": "0.54911387",
            "sentiment_compound": -0.2239
        },
        {
            "id": "hz2t7cl",
            "score": 2,
            "text": "republicans hate America",
            "title_similarity": "0.5475358",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hz34nuq",
            "score": 2,
            "text": "Bunch of whiney little cupcakes. The whole MAGA loving lot of them. Grow a pair.",
            "title_similarity": "0.08062512",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hz3uf4o",
            "score": 2,
            "text": "The propaganda machine is too busy losing a war, that's why",
            "title_similarity": "0.54374796",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hz3y44t",
            "score": 2,
            "text": "Anyone who participates in these really shows how anti-work they really are. They sit out there not working themselves, and then block hard working people who just want to provide for their families.",
            "title_similarity": "0.5745164",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hz4117k",
            "score": 2,
            "text": "Bahahahahahahahahahahahaha from a blue collar, truck driving licence holding car mechanic in Southern Alberta. Exactly the person these assholes claimed to have behind them. \n\nI enjoyed the hell out of this",
            "title_similarity": "0.2626209",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hz43yzu",
            "score": 2,
            "text": "These losers are really something else… Not sure what they are even « protesting.» I don’t see the mask or vaccine mandates they are fighting against. Plus, CDC just relaxed masking recommandations this week.",
            "title_similarity": "0.63971496",
            "sentiment_compound": -0.5664
        },
        {
            "id": "hz49kbm",
            "score": 2,
            "text": "Because there's nothing to protest anymore lmao, mandates are being lifted",
            "title_similarity": "0.3288316",
            "sentiment_compound": 0.6848
        },
        {
            "id": "hz7u9lg",
            "score": 2,
            "text": "Looks like the Russian funding for far-right American causes dries up this week.",
            "title_similarity": "0.37215722",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz2frvi",
            "score": -9,
            "text": "Trucker Convoy are on their way. Late apparently?\n\nThere is a vaccine mandate at the border.\n\nhttps://www.dhs.gov/news/2022/01/20/dhs-require-non-us-individual-travelers-entering-united-states-land-ports-entry-and\n\nSo, to Freedom lovijg Americans, this is worth protesting in my opinion, and they have my support.\n\nMay the Lord Jesus Christ have Mercy on us.\n\nThe Peace of the Lord be on you.",
            "title_similarity": "0.5030386",
            "sentiment_compound": 0.9001
        },
        {
            "id": "hz1w5hk",
            "score": 2,
            "text": "There's still one driving around the country, seemingly aimlessly. Something about freedom convoy in the name. Dumbasses. (Edited- the convoy is the dumbasses, not yall.)",
            "title_similarity": "0.5442976",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hz23z33",
            "score": 3,
            "text": "It was never going to work anyway. You can't block traffic if traffic is already blocked. Welcome to DC.",
            "title_similarity": "0.6869627",
            "sentiment_compound": 0.5116
        },
        {
            "id": "hz24mc8",
            "score": 4,
            "text": "Convoy: Freederums!!\n\nShut up convoy we’re busy.",
            "title_similarity": "0.42997873",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz24th7",
            "score": 2,
            "text": "Long way for a convoy that nobody cares about. What were they protesting? Plant based burgers?",
            "title_similarity": "0.5892372",
            "sentiment_compound": 0.1431
        },
        {
            "id": "hz250kl",
            "score": 2,
            "text": "So disabling or crippling the Russki banking system has inadvertently cut off the money supply to the faketriots? Awesome!",
            "title_similarity": "0.47800547",
            "sentiment_compound": -0.1742
        },
        {
            "id": "hz25ffm",
            "score": 3,
            "text": "I read this headline out loud to my husband and couldn’t do it without bursting into laughter",
            "title_similarity": "0.22332239",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hz25hmq",
            "score": 2,
            "text": "Funny that they can't afford to show up after Daddy Vlad's gas card got turned off.",
            "title_similarity": "0.65733635",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz25of3",
            "score": 4,
            "text": "What are people going to complain about now that mask restrictions have been lifted?!?",
            "title_similarity": "0.30665225",
            "sentiment_compound": -0.4857
        },
        {
            "id": "hz26qhu",
            "score": 3,
            "text": "Russian checks fucking bounced",
            "title_similarity": "0.33272377",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz26vk2",
            "score": 3,
            "text": "Most redditors obviously don't even open the article, but in this case I highly recommend you do. There's a one hour video of the host giving a speech to literally nobody. There's maybe 3-5 \"protestors\" at any given time, with about a dozen or so press members who were there to cover the \"protest\"\n\nYes, the press actually greatly outnumbers the number of protestors. 10/10 video, highly recommend.",
            "title_similarity": "0.5738654",
            "sentiment_compound": 0.9242
        },
        {
            "id": "hz273ed",
            "score": 4,
            "text": "Russian finding dried up.",
            "title_similarity": "0.42761907",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz27f6g",
            "score": 3,
            "text": "Trucker convoy would do better to protest the slave wages, deplorable working conditions and draconian policies in the trucking industry. One step up from being a coal miner.",
            "title_similarity": "0.5034057",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hz27ioz",
            "score": 4,
            "text": "Looks like the Russian conspiracy money dried up.",
            "title_similarity": "0.4480608",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hz28qdo",
            "score": 3,
            "text": "The “silent majority” ladies and gentlemen. Its almost as if the world is looking at *actual* oppression right now and so no one is going to be sympathetic to your temper tantrums, not like they were beforehand but especially so now.",
            "title_similarity": "0.59775794",
            "sentiment_compound": -0.4567
        },
        {
            "id": "hz2b4er",
            "score": 3,
            "text": "Wonder if Ukraine actually being oppressed gave these fucking morons some perspective. Doubt it though.",
            "title_similarity": "0.4123289",
            "sentiment_compound": -0.8016
        },
        {
            "id": "hz2b8ih",
            "score": 4,
            "text": "Weird how that happens after Russian banks are sanctioned.",
            "title_similarity": "0.36934736",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hz2d047",
            "score": -2,
            "text": "Given the convoy is in Indiana, it would be hard for them to be in DC today.",
            "title_similarity": "0.45303398",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hz2dv1m",
            "score": 3,
            "text": "“Where are the trucks? I know the ones that I had planned coming that are local friends and family, I know they’re not even allowed in because they need a commercial license and have proof of a checkoff today because of the checkpoints so they weren’t even able to stage and make it look cool here.”\n\nYou can’t drive a semi without a commercial license. So if your people don’t have commercial licenses, they def *should not* be driving a commercial truck.",
            "title_similarity": "0.6824136",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hz2e5gd",
            "score": 3,
            "text": "Maybe because everyone's focus is on the war... I'll nonetheless take the time to say this: Fuck you all that support the truck convoy, wherever you are.",
            "title_similarity": "0.41167057",
            "sentiment_compound": -0.745
        },
        {
            "id": "hz2fdhv",
            "score": 3,
            "text": "I guess the remaining Koch brother is getting sloppy and didn't pay enough people to do this",
            "title_similarity": "0.58298206",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hz2ivky",
            "score": 2,
            "text": "Pretty hard to drum up support for “masks are tyranny” while everyone is checking their phones for updates on an impending WWIII with an *actual* genocidal dictator.",
            "title_similarity": "0.46821323",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hz2j2qx",
            "score": -4,
            "text": "Without truckers we’ll see how long people last. God bless them",
            "title_similarity": "0.41778165",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hz2t3k6",
            "score": 2,
            "text": "Now comes the part where we throw our heads back and laugh.\n\nReady?\n\nReady!\n\nAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA!",
            "title_similarity": "0.046749122",
            "sentiment_compound": 0.8475
        },
        {
            "id": "hz35rpz",
            "score": 2,
            "text": "Unvaccinated idiots fail to realize they’re only 10% of the country. There’s a reason why you’re such a small minority, it’s because you’re the only stupid ones left.",
            "title_similarity": "0.43540478",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hz38r7q",
            "score": -3,
            "text": "the convoy was called off about a week ago after the last few states and the feds in DC ended the mask and vaxx mandates - essentially giving the truckers everything they had planned on protesting for. Biden was probably nervous after seeing the success of the canadian trucker protest. they even built a wall / fence around the capital (which probably cost millions knowing the government) which will now have to be dismantled. another huge waste of money and resources that should be spent on the ghetto that surrounded DC government buildings.",
            "title_similarity": "0.6749579",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz3akpw",
            "score": 3,
            "text": "My father in law today said he doesn’t think the government should tell him what to do. I waited until he was leaving and said “make sure you buckle up and drive the speed limit. It’s the law!”",
            "title_similarity": "0.6210837",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hz41k03",
            "score": 3,
            "text": "One of the organizers of the Canadian convoy is begging not to be held in jail - because he is afraid of catching COVID \n\n[Pat King worries about catching COVID-19 in an overcrowded jail]\n\n(https://www.stalberttoday.ca/beyond-local/pat-king-worries-about-catching-covid-19-in-an-overcrowded-jail-5111212?utm_source=Email_Share&utm_medium=Email_Share&utm_campaign=Email_Share)",
            "title_similarity": "0.61227286",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz429el",
            "score": 2,
            "text": "Why no show? No Russian money. They can’t pay for propaganda outside their borders anymore.",
            "title_similarity": "0.68607837",
            "sentiment_compound": -0.4043
        },
        {
            "id": "hz42c5l",
            "score": 3,
            "text": "How did they go from “stuck in traffic” to literally nobody showing up at all. Lmao",
            "title_similarity": "0.7265843",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hz1xkso",
            "score": -26,
            "text": "Well yeah restrictions are gone now and Biden backed off his vaccine mandate. 1 month after the supposed \"winter of severe illness and death\". Funny how quick that got reversed into \"jk everythings fine now no more masks or vaccines required.\"",
            "title_similarity": "0.6052573",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hz1xo4v",
            "score": 14,
            "text": "Amazing how hard it becomes to organize right-wing events without Russian access to social media. Almost like there could be a connection…",
            "title_similarity": "0.42698646",
            "sentiment_compound": 0.6815
        },
        {
            "id": "hz22xxy",
            "score": 4,
            "text": "The “Freedom Convoy” is a political stunt being organized and promoted by a PR firm,  carrying water for TrumPutin, and paid for by the same saps donating to Trump’s lifestyle and legal fees.",
            "title_similarity": "0.35647386",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hz23nw4",
            "score": 4,
            "text": "The Russian shills/coordinators a little busy right now.",
            "title_similarity": "0.17422959",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz23rvp",
            "score": 3,
            "text": "Lost all their funding from Russia.",
            "title_similarity": "0.55293983",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz25en8",
            "score": 3,
            "text": "Russian money gets cut off from US. Convoy stops. Coincidence? I think Nyet.",
            "title_similarity": "0.5330054",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz275t5",
            "score": 4,
            "text": "Lol surprise surprise. It’s cus all of the organizers are busy trying to invade Ukraine.",
            "title_similarity": "0.4127834",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hz282o3",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.30789217"
        },
        {
            "id": "hz295x0",
            "score": 4,
            "text": "Russia is too busy to organize it for them this time.",
            "title_similarity": "0.47337377",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz296p5",
            "score": 5,
            "text": "when you're late to the party that no one in this country is having for you.",
            "title_similarity": "0.67060107",
            "sentiment_compound": 0.128
        },
        {
            "id": "hz2exd0",
            "score": -4,
            "text": "Covid went away because we have to focus our attention on the new enemy, Russia. \n\nDuhhhh.",
            "title_similarity": "0.41559398",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz2fjbz",
            "score": 4,
            "text": "In Canada the Freedumb convoy members were proven by their own words, interviews, 5th Estate documentary, and TikTok’s etc that most have very limited intelligence and zero critical thinking skills.  Fools are easily fooled to believe conspiracy theories and propaganda and unfortunately they have become sheeple. History won’t be kind to these halfwits.",
            "title_similarity": "0.57581306",
            "sentiment_compound": -0.8008
        },
        {
            "id": "hz2xhsz",
            "score": -4,
            "text": "Probably because they didnt want their bank accounts frozen like the Canadians for voicing an opinion that should be protected.  They can track down truckers and find out their info, but nothing on Epstein's clients...",
            "title_similarity": "0.6439266",
            "sentiment_compound": 0.3796
        },
        {
            "id": "hz43ws0",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.30789217"
        },
        {
            "id": "hz4mtcw",
            "score": 5,
            "text": "Yeah, Canada had almost no real truckers show up too. Mostly want-a-b’s and shit disturbers of low class. Embarrassment to all Canadians but accomplished “sweet tweet”!",
            "title_similarity": "0.61411595",
            "sentiment_compound": -0.2836
        },
        {
            "id": "hz1vd72",
            "score": -45,
            "text": "You mean the FBI/CIA lead trucker protest? Yeah I wouldn’t show up either.",
            "title_similarity": "0.7421991",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hz1ts5c",
            "score": 314,
            "text": "Well when you’re a Russia funded protest and Russia suddenly doesn’t have money that’ll happen",
            "title_similarity": "0.60063314",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz28qqe",
            "score": 7,
            "text": "They're not getting paid to show up anymore thanks to a certain country's SWIFT payments being denied, so go figure",
            "title_similarity": "0.6503464",
            "sentiment_compound": 0.5622
        },
        {
            "id": "hz298ai",
            "score": 6,
            "text": "Money from Russia not flowing anymore and the Rusky brain behind these are reallocating its resources.",
            "title_similarity": "0.4805247",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4vnht",
            "score": -7,
            "text": "The tyrannical government's made it very clear if you disagree with them they will freeze your bank accounts and ruin your livelihood",
            "title_similarity": "0.5664838",
            "sentiment_compound": -0.3626
        },
        {
            "id": "hz1vwmy",
            "score": 57,
            "text": "Once Russian banks got frozen, they lost their funding.",
            "title_similarity": "0.5693445",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz1ufyn",
            "score": 45,
            "text": "Yeah, Washington DC won't be as chill as Canada. They will get their trucks towed and their ass in jail.",
            "title_similarity": "0.49138618",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz1y2z9",
            "score": 8,
            "text": "I'm surprised this didn't work.  Everyone is saying there are no mandates to protest but the truth is that the Canadian protest was not really about mandates but who won the federal election.  Mandates are managed by provinces and the convoy went to the federal capitol.  It was strictly a lollapalooza for crazy right wingers who had nothing to do for 3 weeks.\nThe US has so many of these types...like MILLIONS.",
            "title_similarity": "0.6347857",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hz1y5zy",
            "score": 9,
            "text": "its almost like it was a vocal minority or something.",
            "title_similarity": "0.17103104",
            "sentiment_compound": 0.2975
        },
        {
            "id": "hz27as5",
            "score": 9,
            "text": "Trucker's do not support these far right paid for ops.  Can confirm, am trucker.",
            "title_similarity": "0.6005825",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hz27csr",
            "score": -8,
            "text": "Because they caught wind of feds trying to infiltrate.",
            "title_similarity": "0.21344838",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz28aim",
            "score": 8,
            "text": "I got stuck in the middle of the convoy on my way back from a work trip with a car full of Trump supporters yesterday. I asked multiple times what they were even protesting and how Trump had anything to do with mask mandates and supposed vaccine mandates, and no one could give me a direct answer. They are just toddlers who want to stomp their feet and whine.",
            "title_similarity": "0.6779138",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hz28wg6",
            "score": -8,
            "text": "Which makes sense because the majority of the country has been opened if not in an official capacity then an unofficial one with barely anyone obeying draconian and pointless mandates.\n\nEdit: Downvote away, but you know it's true.",
            "title_similarity": "0.3217234",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hz1sp7n",
            "score": 28,
            "text": "But still they're the silent \"majority\"..",
            "title_similarity": "0.19627014",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1wpbo",
            "score": 9,
            "text": "lol. When you can't even organize a protest...smh.",
            "title_similarity": "0.5408906",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz222ws",
            "score": 10,
            "text": "This wouldn’t happen with autonomous trucks.",
            "title_similarity": "0.5621372",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4duao",
            "score": -9,
            "text": "Good, I frickin hate protests and any kind of organized show of unique thought opposing the government, they always know what’s best and aren’t the source of almost all evil in this world",
            "title_similarity": "0.5930898",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hz24o8h",
            "score": -10,
            "text": "[deleted]",
            "title_similarity": "0.3078922"
        },
        {
            "id": "hz5hd13",
            "score": -10,
            "text": "Crazy how that worked out eh? Except not really. It's no conspiracy or yet another Russian hoax. It probably has something to do with even the most corrupt bankrupt states like New York that now look and feel like east Berlin under The USSR have rescinded their bs mask mandates for the most part. We don't have the same problems they have with Castro Jr. We also have the largest economy on earth that's struggling to get upto speed with demands that are stressing manpower to its limits in industries like trucking. Drivers understand people will be ready and willing to take their place in the same way the writers strike yrs ago found the strikers without jobs and no real meaningful gains for the strike itself. And lastly truck driving is not the lawless speed freak lifestyle Kris Kristopherson made famous. Most drivers don't own their own truck. Driving a company truck to a protest in on of the most dangerous cities in the US is not only stupid but a violation of several state and federal laws like Grand Larceny, Grand Theft Auto probably fraud. But yeah it was the Russians behind it all and their checks started bouncing so it got squashed..... yeah that is what happened. Putin needed a distraction from his attack on the puppet government of Neo Nazies Obama ushered into power and Bidens meth smoking foot hooker pornstar son did his fine admiral work that his dad had no part of",
            "title_similarity": "0.5151583",
            "sentiment_compound": -0.6146
        },
        {
            "id": "hz28t88",
            "score": 11,
            "text": "After Russia was cut off from social media and international finances there's been a lot less anti-vaxx and convoy people brawling in the social media.\n\nMakes one think.",
            "title_similarity": "0.5851215",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hz2ad7a",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.27146727"
        },
        {
            "id": "hz2i4tm",
            "score": -12,
            "text": "Is it possible that no one showed up because all of their demands are finally making progress? The deomocrat party has done an entire 180 trying to distance themselves from the covid policy they have been pushing for the last two years as quickly as they can.",
            "title_similarity": "0.54935455",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hz23nv3",
            "score": 14,
            "text": "Their Kremlin propaganda allowance just ran dry.",
            "title_similarity": "0.5265813",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz27wtv",
            "score": -14,
            "text": "Unlike Antifa they like going to work and having a job.",
            "title_similarity": "0.06879834",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz1w8h9",
            "score": 856,
            "text": "Amazing that as Russian money dries up, an extreme right wing backed event flops.",
            "title_similarity": "0.41495603",
            "sentiment_compound": 0.4144
        },
        {
            "id": "hz1th06",
            "score": 16,
            "text": "This is the equivalent of “what if we had a war but nobody showed up”. This is one of the best examples of an unworthy cause I’ve seen.",
            "title_similarity": "0.39540806",
            "sentiment_compound": 0.09
        },
        {
            "id": "hz1qgyd",
            "score": 5808,
            "text": "Amazing what doesn’t happen in this country when Russia propaganda machines and money are tied up elsewhere.",
            "title_similarity": "0.5805271",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz1raey",
            "score": 281,
            "text": "Because what would they be protesting exactly?? \n\nMask and vaccine mandates in the USA are almost non existent and the few that were around are being dropped as omicron diminishes. \n\nA few fringe people trying to raise a stink over something no one is actually doing. Generally this formula works for the right wing extremists but I guess this one is just a bit too fringe even for the wackadoodles.",
            "title_similarity": "0.57798004",
            "sentiment_compound": -0.5733
        },
        {
            "id": "hz1wdgh",
            "score": 826,
            "text": "That’s what happens when Russia is preoccupied with something else..",
            "title_similarity": "0.16994956",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1u4m8",
            "score": 19,
            "text": "Well duh...it's because Americans know they're American vs Canadians acting like Americans trying to be American.\n\nI'd be laughing even harder at this if it wasn't for the fact I reside in Ottawa.",
            "title_similarity": "0.30405983",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hz1xqrn",
            "score": 94,
            "text": "Get fucked Russian shills",
            "title_similarity": "0.32002598",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hz221tf",
            "score": 61,
            "text": "Looks like Russian internet trollls are busy elsewhere.",
            "title_similarity": "0.34436828",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz1wrgw",
            "score": 2241,
            "text": "[deleted]",
            "title_similarity": "0.3078922"
        },
        {
            "id": "hz23rp6",
            "score": 418,
            "text": "There’s a war going on and self entitled truckers want to protest masks.\n\nHas anyone addressed that truckers spend 99% of their day alone in their trucks? They don’t need to wear a mask for that entire time. This is people who desperately need a hobby.",
            "title_similarity": "0.62911856",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hz1s7u1",
            "score": 3223,
            "text": "Funding must have dried up for some reason, da?",
            "title_similarity": "0.4074824",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1x2zs",
            "score": 184,
            "text": "I feel like they lost a bunch of their financiers over the past week...",
            "title_similarity": "0.5035099",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hz1w3y1",
            "score": 61,
            "text": "Well, this is an interesting turn of events. \n\n<Nelson_haha.jpg> \n\nIt seems like events have overtaken this half-baked, ginned-up, grift-a-thon of a copycat “movement” weeks after it lost any relevance it might have once had.",
            "title_similarity": "0.40866882",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hz1xktd",
            "score": 155,
            "text": "Its almost as if without Russian funding and social media hype, they don't have a real movement.",
            "title_similarity": "0.35159189",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1wm1g",
            "score": 65,
            "text": "The vast majority of truckers in the US don’t own their own trucks.",
            "title_similarity": "0.58815944",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1qmtf",
            "score": 12925,
            "text": "Well yeah, they are protesting non existent mask and vaccine mandates and lockdowns. They are about a year late on the mandates and 2 years late on the lockdowns.",
            "title_similarity": "0.60200286",
            "sentiment_compound": 0.128
        },
        {
            "id": "hz1xu91",
            "score": 1695,
            "text": "For the love of everything pure and holy .. what are you protesting??",
            "title_similarity": "0.16812518",
            "sentiment_compound": 0.4137
        },
        {
            "id": "hz1qryo",
            "score": 190,
            "text": "I'm sure they'll find something else constructive to do.\n\n\\\\s",
            "title_similarity": "-0.0057279333",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz2deiu",
            "score": 198,
            "text": "Watched a few minutes of the guy’s speech - I’m sure others have noticed this but people who tend to fall into the trump/anti-mask crowd all talk about the constitution and bill of rights as if they’ve just discovered these things for the first time (which they probably have). It usually sounds like a 3rd grader giving a oral presentation on “how the government works”. Always just a little wrong but man are they impressed with themselves for reading",
            "title_similarity": "0.3955661",
            "sentiment_compound": 0.8146
        },
        {
            "id": "hz1qr6d",
            "score": 324,
            "text": "In the words of the great Nelson Muntz: \"Haw-haw!\"",
            "title_similarity": "0.078026645",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hz20hnx",
            "score": 89,
            "text": "That whole lot of freedom truck nonsense and foolishness fell apart as soon as Russian funds were trapped in Russia.\n\nWeird coincidence.",
            "title_similarity": "0.52338713",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hz21rzc",
            "score": 382,
            "text": "Pretty hard to look tough and patriotic while the world is watching the President of Ukraine actually be tough and patriotic! Probably has taken down a lot of the incentive for these people to act like jerks when they realize how they look compared to true heroes and Patriots that are fighting for their lives right now.",
            "title_similarity": "0.47021592",
            "sentiment_compound": 0.8221
        },
        {
            "id": "hz1wdxp",
            "score": 4146,
            "text": "It's like that part in Old School where \"everybody's going streaking!\" But it's actually just a drunk Will Farrell running down the boulevard naked.",
            "title_similarity": "0.58444774",
            "sentiment_compound": -0.3903
        },
        {
            "id": "hz1u84m",
            "score": 5410,
            "text": "“Where are the trucks?” organiser Kyle Sefcik asked during his speech.\n\nThen he continues to make excuses for his local friends that couldn’t show up because they were “not allowed in without commercial license”  and says “they couldn’t even stage to make it look cool here.” Whelp. This dude is a child.",
            "title_similarity": "0.6647075",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hz1u4ii",
            "score": 2,
            "text": "Looks like they mistimed their drive, they drove through St Louis yesterday. 😂",
            "title_similarity": "0.5913222",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hz1upjw",
            "score": 11,
            "text": "I kept seeing post about them coming through our area yesterday, but all ended up just asking where the were and when they’d come through. Didn’t even impact rush hour traffic from\nWhat I could tell.",
            "title_similarity": "0.57745075",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1vr73",
            "score": 5,
            "text": "I guess it was a supply chain issue?",
            "title_similarity": "0.21815833",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1xf2u",
            "score": 1,
            "text": "I'm here all by myself, the buffet is all mine!",
            "title_similarity": "0.36955178",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1xhwf",
            "score": 2,
            "text": "The prospect of world war does help to provide some perspective.",
            "title_similarity": "0.121800095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1xpvd",
            "score": 2,
            "text": "This reminds me of Peter Brady's party when nobody came.  Poor Peter.",
            "title_similarity": "0.55457115",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hz1y6xz",
            "score": 4,
            "text": "They must have all been FedEx drivers",
            "title_similarity": "0.27249157",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1yfcv",
            "score": 2,
            "text": "Without a funding source this died, huh.",
            "title_similarity": "0.4314235",
            "sentiment_compound": -0.6428
        },
        {
            "id": "hz1ynn9",
            "score": 1,
            "text": "I we sure this wasn’t organized by russian trolls?",
            "title_similarity": "0.49202043",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz1yvwj",
            "score": 1,
            "text": "You love to see it...\n\nOr not see it",
            "title_similarity": "-0.07044554",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hz1zfja",
            "score": 1,
            "text": "That's because the organizer is in jail.",
            "title_similarity": "0.3272552",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz1zgud",
            "score": 1,
            "text": "The video of some dude on a stage ranting into his mic with like 4 people milling around is almost sad if it wasn't so funny.\n\nDude looked like he was wearing old fashioned red jumper underwear with the shitter flap in the back.",
            "title_similarity": "0.3519187",
            "sentiment_compound": -0.2109
        },
        {
            "id": "hz1zhqf",
            "score": 2,
            "text": "I just thought it was me. I didn’t know what they were protesting, but I’m in a red state",
            "title_similarity": "0.3334406",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hz1zyl4",
            "score": 2,
            "text": "It’s as if their funding just disappeared. Like someone sanctioned their benefactors.",
            "title_similarity": "0.39490587",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hz20h58",
            "score": 1,
            "text": "It's funny how we aren't putting together that Russia has been at war with the US without them making it apparent.",
            "title_similarity": "0.4723254",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz20hj3",
            "score": 1,
            "text": "I don't know much about trucking but something always seemed odd about these trucker protests. With the current trucker shortage and backups at ports, aren't truckers getting higher pay and bonuses now? If so, you would have a hard time getting me to a protest under those conditions.",
            "title_similarity": "0.58168775",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hz20j3t",
            "score": 1,
            "text": "Truckers as a whole aren't a very political group. They aren't going to show up and protest against some abstract political idea. If there aren't mandates on them, why would they bother?",
            "title_similarity": "0.60140705",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hz20lpw",
            "score": 2,
            "text": "Hope that’s foreshadowing their election participation in 2022",
            "title_similarity": "0.15535066",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz20nl0",
            "score": 9,
            "text": "The title should have included: “however, traffic jams appear to have formed anyway.”\n\nProtesting by forming a traffic jam in northern VA is like protesting the zoo by giving away free tickets you bought.",
            "title_similarity": "0.44754142",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hz20pke",
            "score": 2,
            "text": "Damn, I guess they all have to go back to work now.",
            "title_similarity": "0.31889057",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz20rze",
            "score": 3,
            "text": "Their rubes for supporters won't think twice and still call it a win. Then they are on to the next grift-inspired political stunt that makes them feel relevant despite no political platform.",
            "title_similarity": "0.32023755",
            "sentiment_compound": 0.8219
        },
        {
            "id": "hz20u1i",
            "score": 2,
            "text": ">  I know the ones that I had planned coming that are local friends and family, I know they’re not even allowed in because they need a commercial license\n\nhahahahahahahahahah.,... Fkin jerk... Just because you show up in a rig that you BORROWED AND CAN'T LEAGLY DRIVE does not make you a 'trucker'.",
            "title_similarity": "0.67533",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hz20z53",
            "score": 2,
            "text": "Russia cant support these idiots anymore with their black money threw swift!!! Plain and simple...just shows how bad these russian are!",
            "title_similarity": "0.5363225",
            "sentiment_compound": -0.7291
        },
        {
            "id": "hz212xs",
            "score": 4,
            "text": "No one said conservatives were smart or not acting solely on Russian misinformation",
            "title_similarity": "0.5556954",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hz21825",
            "score": 2,
            "text": "Of course. With the Ukraine conflict I think a lot of these dopes have found out who the silent majority is.",
            "title_similarity": "0.25388098",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz2187r",
            "score": 4,
            "text": "Trucker convoy used to mean something. I’m not sure what but it definitely meant something.",
            "title_similarity": "0.30630374",
            "sentiment_compound": 0.4712
        },
        {
            "id": "hz21cxu",
            "score": 2,
            "text": "Lower turnout than a Trump rally!",
            "title_similarity": "0.50341344",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hz21e7o",
            "score": 1,
            "text": "I would have been shocked if this happened. These guys are making more money now than they ever have in their careers. They've more leverage on choosing, what, when, where, and how they carry. They know that this won't last forever and they're cashing in while they can. Taking a few weeks off to protest something that doesn't exist anymore wasn't going to happen.",
            "title_similarity": "0.3550194",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hz21tzk",
            "score": 2,
            "text": "What on earth could they possibly have to protest? I got covid in 2020, and all the government told me was \"Please stay indoors if you'd like!\"",
            "title_similarity": "0.39396933",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hz21uhj",
            "score": 4,
            "text": "I guess they were not getting the promised money. Banking problems perhaps?",
            "title_similarity": "0.4853203",
            "sentiment_compound": -0.5873
        },
        {
            "id": "hz22acp",
            "score": 3,
            "text": "shitty remake of \"Convoy\", demanded money back",
            "title_similarity": "0.4171303",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hz22dze",
            "score": 2,
            "text": "There is no right wing protest too small that the media will not cover it.",
            "title_similarity": "0.50205743",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hz22e3m",
            "score": 4,
            "text": "I thought the restrictions or at least most of the restrictions have gone away.",
            "title_similarity": "0.26591623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz22i9o",
            "score": 20,
            "text": "Their funding has been cut",
            "title_similarity": "0.3484261",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hz22r9d",
            "score": 8,
            "text": "This is like thinking because the guy in the porn film you're watching can get it up that you can. What's happening online isn't real, but they don't realize that. They go out and it goes limp. It's sad. The self-loathing, the pathos, the personal ridiculousness of all of this is almost too absurd.",
            "title_similarity": "0.45491457",
            "sentiment_compound": -0.7227
        },
        {
            "id": "hz22tr4",
            "score": 2,
            "text": "Fake outrage strikes again",
            "title_similarity": "0.1954436",
            "sentiment_compound": -0.836
        },
        {
            "id": "hz232j6",
            "score": 5,
            "text": "They lost their sponsors.",
            "title_similarity": "0.46986705",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz235fu",
            "score": 3,
            "text": "Supply line fell apart. Fuel costs money. 8 mpg for a tractor is a real cost. Guess is return on investment wasn't worth it.",
            "title_similarity": "0.5383638",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hz238yt",
            "score": 4,
            "text": "That isn't surprising. Theres effectively no restrictions surrounding covid anymore, what are they even protesting now?",
            "title_similarity": "0.4581197",
            "sentiment_compound": -0.8031
        },
        {
            "id": "hz23cmu",
            "score": 2,
            "text": "But the freedom convoy 22 subreddit had a drone shot of like TWENTY different card and trucks going to DC, did they not make it?",
            "title_similarity": "0.5452844",
            "sentiment_compound": 0.8765
        },
        {
            "id": "hz23i0w",
            "score": 2,
            "text": "Some of these outrage things were financed by Russia, and they seem to be otherwise occupied.",
            "title_similarity": "0.2414167",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hz23ksr",
            "score": 4,
            "text": "Lmfao those losers! Of course it fell apart! All of their funding is currently getting the shit sanctioned out of it.",
            "title_similarity": "0.45212543",
            "sentiment_compound": 0.6892
        },
        {
            "id": "hz23tw5",
            "score": 2,
            "text": "There's supposed to be a convoy coming through Middle Tennessee tomorrow/Friday. People on Facebook trying to recruit. Like why? I'm sure the turnout will be a bit pathetic. The reasons for the convoy is so dumb.",
            "title_similarity": "0.5936233",
            "sentiment_compound": -0.6299
        },
        {
            "id": "hz23ybj",
            "score": 2,
            "text": "I wonder if given the war in Ukraine some of them put 2+2 together as to what fighting for freedom actually looks like vs. being the sucker stuck in the convoy traffic jam just gumming up the works when no one wants you there anyway.",
            "title_similarity": "0.5747943",
            "sentiment_compound": -0.743
        },
        {
            "id": "hz23zng",
            "score": 1,
            "text": "So much for freedumbs I guess.",
            "title_similarity": "0.03954732",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz243bn",
            "score": 1,
            "text": "Real people need to work for a living and don’t have the time for such nonsense.",
            "title_similarity": "0.4258358",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz243vs",
            "score": 2,
            "text": "when you realize all your fellow online trucker friends were Russian psyops workers.... \n\ndumbasses lol",
            "title_similarity": "0.45570675",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hz244rq",
            "score": 4,
            "text": "So the post yesterday from one of my dim-witted trumper friends on FB claiming there was a 30-40km long convoy heading to DC ...was fake news?",
            "title_similarity": "0.59371686",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz245ip",
            "score": 1,
            "text": "> \"so they weren’t even able to stage and make it look cool here.\"\n\nI think we've come to the heart of this particular protest movement.",
            "title_similarity": "0.6824351",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hz245xd",
            "score": 1,
            "text": "I thought they were going to take America back?",
            "title_similarity": "0.22476655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz247t6",
            "score": 1,
            "text": "They don't care if no one is watching lol.",
            "title_similarity": "0.4499967",
            "sentiment_compound": 0.264
        },
        {
            "id": "hz249ib",
            "score": 1,
            "text": "So time for Tucker Carlson to start investigating why Biden is trying to prevent Putin from getting Hunter's laptop which is currently in Ukraine?",
            "title_similarity": "0.43365175",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz249qr",
            "score": 2,
            "text": "Lol…the truckers he knew couldn’t come because they needed cdl licenses…wtf kind of trucker doesn’t have a cdl??",
            "title_similarity": "0.678022",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz24e2h",
            "score": 1,
            "text": "A little too late for the party I guess….",
            "title_similarity": "0.39235622",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz24eay",
            "score": 11,
            "text": "Everyone is watching people fight against real tyranny instead of a bunch of whiny ass bitches and their freedumbs crying they are forced into receiving a life saving vaccine. The hypocrisy is so thick with that crowd.",
            "title_similarity": "0.41793498",
            "sentiment_compound": -0.9442
        },
        {
            "id": "hz24r7o",
            "score": 2,
            "text": "Of course, the people that were helping fund it are currently invading Ukraine",
            "title_similarity": "0.3553706",
            "sentiment_compound": 0.296
        },
        {
            "id": "hz24u18",
            "score": 6,
            "text": "Now is the moment to exactly see what was important to Russian money and disinformation ops and what disinformation is being funded by rich Americans/Oligarchs/right wing churches.",
            "title_similarity": "0.24209361",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hz24zf7",
            "score": 1,
            "text": "That was for their own good. Honking 24/7 in an area where everyone has weapons would have been hazardous to their health.",
            "title_similarity": "0.5345223",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz24zzq",
            "score": 3,
            "text": "What are they even bitching about at this point?",
            "title_similarity": "0.37916744",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hz251hn",
            "score": 5,
            "text": "What are they protesting again? Trump’s support of Putin? I can’t seem to remember……..",
            "title_similarity": "0.4783376",
            "sentiment_compound": -0.1179
        },
        {
            "id": "hz2533x",
            "score": 1,
            "text": "*one of the convoys.  There’s another that should be in the dc area saturday(only the beltway- apparently made a deal to not go into dc proper) that’s raised like $1million.  And it has quite a few vehicles I think.  I don’t support- just keeping track of it since my work is in dc and could be affected.",
            "title_similarity": "0.5526525",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hz254nv",
            "score": 12,
            "text": "I hope these dipshit trumpers are enjoying the astroturfing and Russian disinformation that's been targeted at them the last year and a half. Serves them right.",
            "title_similarity": "0.30138627",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hz259pn",
            "score": 2,
            "text": "I got second hand embarrassment from the organizer on the stage speaking to 10 people. Oof",
            "title_similarity": "0.4489523",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz25if0",
            "score": 1,
            "text": "Honestly, best way this could have ended. I can think of a LOT of different scenarios that could have played out here. This ain't Canada dumbfucks, you will get shot here.",
            "title_similarity": "0.19262938",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hz25ikl",
            "score": 8,
            "text": "It's almost like their funding was suddenly cut off....",
            "title_similarity": "0.36555004",
            "sentiment_compound": 0.0276
        },
        {
            "id": "hz25m5e",
            "score": 2,
            "text": "I wish the same could’ve been said for Ottawa, smh",
            "title_similarity": "0.20225401",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hz25ruy",
            "score": 8,
            "text": "What the fuck are they protesting? There are no COVID restrictions anymore.",
            "title_similarity": "0.5105746",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hz26198",
            "score": 1,
            "text": "\"I am talking for people listening at home\". \nWe're all laughing.",
            "title_similarity": "0.0717639",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hz266h1",
            "score": 2,
            "text": "Their \"grassroots\" movement may be dying out, but the spirit of Balcony Guy lives on in our hearts.\n\nhttps://twitter.com/mijustin/status/1494106335280910342",
            "title_similarity": "0.25570193",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hz26956",
            "score": 1,
            "text": "I think they are just late to show up. I got stuck in the convoy yesterday in Missouri. They were going 40 mph.  Making it hard for people trying to get on the highway from the ramp. About 2 miles long and crazy people hanging out over bridges and side of the highway with flags. First thing I thought was this is really late to do now.",
            "title_similarity": "0.5916896",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hz26b00",
            "score": 2,
            "text": "Don't they know covid is sooo 2 months ago?",
            "title_similarity": "0.30853656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz26c01",
            "score": 2,
            "text": "Fascism doing it's thing.",
            "title_similarity": "0.14200059",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz26dp7",
            "score": 2,
            "text": "Great job making the feds spend money senselessly because of your stupid “protest”. For the right wanting to spend less money on government, they sure are good at finding ways for us to spend it uselessly.",
            "title_similarity": "0.37581754",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hz26nh8",
            "score": 1,
            "text": "They were stuck in traffic",
            "title_similarity": "0.45425934",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz26t1s",
            "score": 1,
            "text": "When are they scheduling the next parade?",
            "title_similarity": "0.31304651",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz26u18",
            "score": 2,
            "text": "Truck convoys..fuck off",
            "title_similarity": "0.515453",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz26vsv",
            "score": 1,
            "text": "They're all in Canada...",
            "title_similarity": "0.20911136",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz26w2j",
            "score": 1,
            "text": "The freedumb cunt convoys.",
            "title_similarity": "0.144789",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hz26z5q",
            "score": 1,
            "text": "their russian organizers stopped getting paid.",
            "title_similarity": "0.5711057",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hz2701m",
            "score": 1,
            "text": "Trucker?! I don’t even know her!",
            "title_similarity": "0.59280205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz276vf",
            "score": 1,
            "text": "Not enough money for diesel?",
            "title_similarity": "0.46020314",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz27dab",
            "score": 3,
            "text": "No OnE wAnTs To WoRk AnYmOrE",
            "title_similarity": "0.6260561",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz27puz",
            "score": 2,
            "text": "This is wrong I’m sure that they said there going to be there on the 5th.",
            "title_similarity": "0.2264459",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hz27pvc",
            "score": 2,
            "text": "They sure were clogging up the highway here in Missouri a few days ago. Wonder what happened.",
            "title_similarity": "0.53579783",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz27snl",
            "score": 1,
            "text": "There is supposedly one happening in MA right now, out of Cape Cod, high on that sweet Cape meth, lead truck has a rejection sticker on it...",
            "title_similarity": "0.39868844",
            "sentiment_compound": -0.128
        },
        {
            "id": "hz286va",
            "score": 3,
            "text": "Can you literally even call it a protest if there was no protest?? Lol",
            "title_similarity": "0.4381372",
            "sentiment_compound": -0.4501
        },
        {
            "id": "hz29tyv",
            "score": 1,
            "text": "Like I would want to stay away from home any longer than I’d have to.",
            "title_similarity": "0.42359138",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz2a615",
            "score": 3,
            "text": "DC native here. I kinda forgot about them, to be honest.",
            "title_similarity": "0.4881261",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hz2a96q",
            "score": 1,
            "text": "Russia doesn't have any money to pay the traitors",
            "title_similarity": "0.64086616",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hz2ad5r",
            "score": 2,
            "text": "This is the real RightWing. The numbers of people who continue to fall for their propaganda has dwindled to a tiny percentage of the Trump years. We are over the hump. Most people are tired of the bullshit and don't want anything to do with these people regardless of how loud Right-Wing media yells...its almost over.",
            "title_similarity": "0.5581924",
            "sentiment_compound": -0.8476
        },
        {
            "id": "hz2af41",
            "score": 1,
            "text": "Further proof that they are the minority",
            "title_similarity": "0.1817938",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2aig0",
            "score": 1,
            "text": "I was wondering what all the cop cars at every highway exit was about",
            "title_similarity": "0.4370274",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2ais2",
            "score": 2,
            "text": "Funds must’ve gone away wonder why…",
            "title_similarity": "0.401651",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2ajsq",
            "score": 6,
            "text": "Donald Trump: “it was the biggest protest of all time”",
            "title_similarity": "0.4048583",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz2alk2",
            "score": 3,
            "text": "Can these truckers go protest Putin?\n\nThat’d be helpful. And exciting!",
            "title_similarity": "0.31136554",
            "sentiment_compound": 0.6476
        },
        {
            "id": "hz2ao0r",
            "score": 3,
            "text": "Was this protest organized by ~~Ted Mosby~~ Doctor X?",
            "title_similarity": "0.35442516",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz2aof5",
            "score": 3,
            "text": "I guess their Russian ~~overlords~~ organizers got kinda busy recently...",
            "title_similarity": "0.30521655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2arth",
            "score": 2,
            "text": "I wonder. Could it be these fucks realized that GoFundMe won't support donations for them? That they won't get paid for time protesting?",
            "title_similarity": "0.6286821",
            "sentiment_compound": -0.8185
        },
        {
            "id": "hz2auv8",
            "score": 2,
            "text": "American propaganda efforts won over Russian ones so this is not surprising.",
            "title_similarity": "0.15266868",
            "sentiment_compound": 0.223
        },
        {
            "id": "hz2av77",
            "score": 9,
            "text": "Saw a post on r/conspiracy the other day claiming there are thousands of truckers marching to Washington. Lol they must have gotten lost on the way there :D.",
            "title_similarity": "0.7283517",
            "sentiment_compound": 0.128
        },
        {
            "id": "hz2b33h",
            "score": 3,
            "text": "Probably because they are so oppressed..../s",
            "title_similarity": "0.27254093",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2b37r",
            "score": 3,
            "text": "What are they even supposed to be protesting at this point?",
            "title_similarity": "0.39486682",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz2b39t",
            "score": 1,
            "text": "The sign that says \"Stage of Freedom\" isn't wrong. There's lot of room with freedom to roam about.",
            "title_similarity": "0.014748026",
            "sentiment_compound": 0.8991
        },
        {
            "id": "hz2b3li",
            "score": 2,
            "text": "“Where are the trucks? I know the ones that I had planned coming that are local friends and family, I know they’re not even allowed in because they need a commercial license and have proof of a checkoff today because of the checkpoints **so they weren’t even able to stage and make it look cool here.**\"\n\nlol",
            "title_similarity": "0.7366435",
            "sentiment_compound": 0.802
        },
        {
            "id": "hz2b852",
            "score": 1,
            "text": "Amazing to see these people upset, crying about being persecuted and tyrannized all over mandates that started during the Trump administration, no one ever followed anyway, and were ended under Biden.\n\nBut it's perfectly in line with what conservatives are doing on every issue. I still see conservatives adamant that Biden is 'paying people to stay at home.' Another thing that started under Trump and ended under Biden. I would argue we need to reinstate the pandemic assistance.\n\nOf course, these are the same people that have decided that the Fed printing money and causing inflation all happened under Biden, which is obviously wrong again. And that gas prices are somehow Biden's fault when they were even higher under that last GOP president, when $4/gallon was even more of a sting to consumers.",
            "title_similarity": "0.5401684",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hz2b8u8",
            "score": 2,
            "text": "There were some hillbillies above 294 by Chicago yesterday. There was like four of them and no one honked.",
            "title_similarity": "0.5204792",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hz2baly",
            "score": 12,
            "text": "If it's the same ['convoy'](https://imgur.com/a/4r2DFFG) that passed through Chicago, then I am not surprised at all. These people aren't exactly dealing with a full deck.",
            "title_similarity": "0.45469135",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hz2bcuj",
            "score": 2,
            "text": "Massively overblown conservative show of \"resistance\" in Canada is exposed, flops.\n\nAlso, non-starter in US. Maybe the dummies value their jobs more than we previously thought.",
            "title_similarity": "0.42259768",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz2bn74",
            "score": 2,
            "text": "It's almost as if there are more important things in the world other then their \"freedumbs\"",
            "title_similarity": "0.12794812",
            "sentiment_compound": 0.2716
        },
        {
            "id": "hz2bnr3",
            "score": 1,
            "text": "Waste of time they should of protested for the ELD logs to be removed lower diesel prices & higher pay rates for loads and more truck parking around the USA",
            "title_similarity": "0.5556567",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hz2bofh",
            "score": 3,
            "text": "If r/conspiracy was actually still about conspiracy theories and not just right wing nut jobs, they’d have a field day with this. Was it the Russians all along and it stopped because the money stopped?  Was there ever a convoy?  Did the government take em out?  Was it all foreign bad faith actors?  WHERES JIMMY HOFFA?\n\nBut nah it’s just fake doctors saying masks cause autism and gay leprosy or something now.",
            "title_similarity": "0.52161634",
            "sentiment_compound": -0.8796
        },
        {
            "id": "hz2bplt",
            "score": 1,
            "text": "i'm OOTL, what is even happening with the truckers and this convoy?",
            "title_similarity": "0.5944276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2brnr",
            "score": 1,
            "text": "Stage of Freedom?  That stage sure does seem pretty free.  Not a whole lot going on there.",
            "title_similarity": "0.17117055",
            "sentiment_compound": 0.9186
        },
        {
            "id": "hz2buuy",
            "score": 3,
            "text": "If it’s anything like here in Ottawa, they’ll say 50k showed up lmao",
            "title_similarity": "0.12872827",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hz2bvjx",
            "score": 3,
            "text": "Aren't they all.in Ukraine fighting the Ukrainians",
            "title_similarity": "0.31867808",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hz2bvqv",
            "score": 1,
            "text": "What a poor representation of MD",
            "title_similarity": "0.32838693",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz2bxyg",
            "score": 3,
            "text": "No more Russian bots to rile them up",
            "title_similarity": "0.58361506",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz2byus",
            "score": 3,
            "text": "There were more reporters there than protesters.",
            "title_similarity": "0.13576217",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hz2bz39",
            "score": 5,
            "text": "It's totally a coincidence that roubles aren't worth as much currently",
            "title_similarity": "0.43059838",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hz2c0ce",
            "score": 1,
            "text": "losers continue to lose news at 11!",
            "title_similarity": "0.5187926",
            "sentiment_compound": -0.75
        },
        {
            "id": "hz2c2on",
            "score": 6,
            "text": "Give them time \n\nThey are transitioning over to protesting Ukraine, since Ukraine is where the Deep State is now (and trafficking children, manufacturing cocaine, and other conspiracy stuff)",
            "title_similarity": "0.34035853",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hz2c3z7",
            "score": 4,
            "text": "I haven't HAD to wear a mask in almost half a year now, why are they starting this shit now?\n\nAttempted super spreader events for what? Is Russia just playing us?",
            "title_similarity": "0.458714",
            "sentiment_compound": 0.2477
        },
        {
            "id": "hz2c7c4",
            "score": 1,
            "text": "I knew this was a bad idea for them because with ukraine, the media does not need to fill news time with anything else.",
            "title_similarity": "0.55084723",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz2cb35",
            "score": 1,
            "text": "At this point it's like protesting beepers.",
            "title_similarity": "0.30924118",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz2cb7k",
            "score": 3,
            "text": "The Russians are busy right now",
            "title_similarity": "0.16802442",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2cfo0",
            "score": 2,
            "text": "Next up...a protest against the Volstead Act!  Who's with me?  /s",
            "title_similarity": "0.4758063",
            "sentiment_compound": -0.3164
        },
        {
            "id": "hz2cfut",
            "score": 2,
            "text": "Guess big conductor from the Red Square is currently having some problems of his own to support their diesel carnival of hollow skulls.",
            "title_similarity": "0.48822853",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2cgmb",
            "score": 3,
            "text": "Pretty funny this alt right wing forum has been talking about it everyday.  Now it’s know where to be seen.  But also same time as Russia is falling.  The bots maybe less now.",
            "title_similarity": "0.35778123",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hz2ciyp",
            "score": 3,
            "text": "Well, what do you expect when a bunch of uneducated hicks get together?",
            "title_similarity": "0.33440652",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz2cmz9",
            "score": 2,
            "text": "all talk and no follow through in Washington DC….SHOCKING",
            "title_similarity": "0.7865782",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz2cser",
            "score": 5,
            "text": "Russia just can't win with their convoys, recently.",
            "title_similarity": "0.5774243",
            "sentiment_compound": -0.4717
        },
        {
            "id": "hz2cu1y",
            "score": 2,
            "text": "they're trying to recreate the whole tea party movement but even dumber",
            "title_similarity": "0.3788894",
            "sentiment_compound": -0.34
        },
        {
            "id": "hz2cwqy",
            "score": 1,
            "text": "LOL the fringe minority. Throw these imbecile’s into Ukrainian as meat shields",
            "title_similarity": "0.338319",
            "sentiment_compound": 0.5473
        },
        {
            "id": "hz2cx8e",
            "score": 79,
            "text": "Ruble collapses and so do a whole buncha \"grassroots\" conservative movements.",
            "title_similarity": "0.5249237",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz2cz00",
            "score": 3,
            "text": "Sudden loss of Russian funding.",
            "title_similarity": "0.45452645",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz2czxo",
            "score": 3,
            "text": "When the Russian funding dries up….",
            "title_similarity": "0.16826302",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2d51a",
            "score": 6,
            "text": "Yeah, well Russia can’t pay their organizers anymore soooooo….",
            "title_similarity": "0.5873891",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz2d6wa",
            "score": 3,
            "text": "The crowd was easily TENS of people.",
            "title_similarity": "0.0153720565",
            "sentiment_compound": 0.34
        },
        {
            "id": "hz2d775",
            "score": 2,
            "text": "\"Stage of Freedom\" jesus fuck these people are morons. Just how stupid do you have to be to fall for this con?",
            "title_similarity": "0.4275123",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hz2d9ht",
            "score": 1,
            "text": "Yet we called in the national guard?!",
            "title_similarity": "0.28175175",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2dbxq",
            "score": 2,
            "text": "Of course, the russians have enough to do at home right now.",
            "title_similarity": "0.0964227",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2dcfa",
            "score": 3,
            "text": "Looking like fascist morons is going out of fashion.",
            "title_similarity": "0.5488423",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hz2dcye",
            "score": 3,
            "text": "Why would anyone show up? We have no vaccine, mask mandates nor any real lockdowns?\n\nIf you are a trucker, it makes more sense to drive and make big $$$ (as pay is pretty good for them now because of the shortage) than driving to protest something that is nonexistent.",
            "title_similarity": "0.56197894",
            "sentiment_compound": 0.2168
        },
        {
            "id": "hz2ddnl",
            "score": 1,
            "text": "I fucking hate those trucks with the rebuild that Obama rules prohibited and which Trump then allowed.  I don’t give a shit if the plastics don’t get delivered to dollar stores, and I am willing to pay more for goods delivered in a more sustainable way, be that better trucks or simply more reforms to regulation of trucking.",
            "title_similarity": "0.4926889",
            "sentiment_compound": -0.7264
        },
        {
            "id": "hz2dguj",
            "score": 2,
            "text": "Now that nobody is paying the troll farms somehow people forgot about this, be it online or IRL, coincidence?",
            "title_similarity": "0.6928452",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2dgzh",
            "score": 3,
            "text": "Did they not listen to the State of the Union last night? It was made clear that we can now go mask free and that life should get back to normal. So what exactly are they protesting?",
            "title_similarity": "0.52346706",
            "sentiment_compound": 0.5362
        },
        {
            "id": "hz2diot",
            "score": 1,
            "text": "Really hard to protest tyranny and “much freedoms” when Russia is going full CCCP and censorship right now.",
            "title_similarity": "0.43972933",
            "sentiment_compound": -0.4509
        },
        {
            "id": "hz2dlxq",
            "score": 3,
            "text": "It's almost like crying about a piece of cloth that the government itself isn't telling you that you have to wear doesn't hold a candle to real issues",
            "title_similarity": "0.5923965",
            "sentiment_compound": -0.1567
        },
        {
            "id": "hz2dn10",
            "score": 1,
            "text": "Looks like Bill Gates turned on their microchip…",
            "title_similarity": "0.26587713",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz2dpjy",
            "score": 3,
            "text": "I got stuck in the middle of these assholes on I-40 in New Mexico just past Albuquerque. Driving in both lanes of traffic, going 55-60 MPH. Fuck them.",
            "title_similarity": "0.5061699",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hz2dulv",
            "score": 3,
            "text": "Must have interfered with the Crybaby Caravan’s nap time",
            "title_similarity": "0.46245638",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2e07p",
            "score": 4,
            "text": "Everybody is working and doesn't have time for this shit.\nBesides, this is all wrapping up now. No more political hay to rake.",
            "title_similarity": "0.5952656",
            "sentiment_compound": -0.7543
        },
        {
            "id": "hz2e4qw",
            "score": 1,
            "text": "Some group was the news in Indiana doing this. Not sure if it’s related but they were in Monrovia Indiana.",
            "title_similarity": "0.27422938",
            "sentiment_compound": -0.1232
        },
        {
            "id": "hz2e5ka",
            "score": 2,
            "text": "What...you mean to say Uncle T and his minions Marge Taylor Green, D'santis et al didn't show up? LOL",
            "title_similarity": "0.61423427",
            "sentiment_compound": -0.4356
        },
        {
            "id": "hz2e9w9",
            "score": 2,
            "text": "what restrictions are they protesting? theres like a millimeter above the bare minimum being done.",
            "title_similarity": "0.26439512",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz2ebtz",
            "score": 1,
            "text": "America is poised to bounce back from the Covid years. I got high hopes for the state of everything.",
            "title_similarity": "0.17114574",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz2ed3n",
            "score": 5,
            "text": "Guess the Russia funding got cut off",
            "title_similarity": "0.4804265",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hz2edyx",
            "score": 9,
            "text": "All the magas are too busy watching tv and fantasizing about putin taking over ukraine",
            "title_similarity": "0.40497386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2eqyc",
            "score": 1,
            "text": "I wish that's how it happened in Canada",
            "title_similarity": "0.21445769",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz2etfe",
            "score": 2,
            "text": "It's amazing what a little perspective will do.",
            "title_similarity": "-0.12930766",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz2evz1",
            "score": 2,
            "text": ">Mr Sefcik is an MMA fighter\n\nHis 1-2 record hardly makes this a noteworthy point.\n\nI bet he thought he was going to have a legion of gushing followers hanging on his word.",
            "title_similarity": "0.44957262",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hz2f6wi",
            "score": 6,
            "text": "Virgin “freedom” convoy trucker vs. chad Ukrainian freedom fighter",
            "title_similarity": "0.4412734",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hz2f86n",
            "score": 1,
            "text": "Should have printed more pamphlets.",
            "title_similarity": "0.13136935",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2f93e",
            "score": 2,
            "text": "It’s hard to protest mask mandates when none exist",
            "title_similarity": "0.479016",
            "sentiment_compound": -0.34
        },
        {
            "id": "hz2fczg",
            "score": 1,
            "text": "why is this happening when every mandate was lifted? if youre working for a company who mandated the vaccine quit",
            "title_similarity": "0.50624776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2fdqw",
            "score": 8,
            "text": "They had one in my town on Saturday, no truckers showed up, a couple lifted trucks and a half dozen cars, they just drove around the Walmart honking their horns with the word \"freedom\" drawn on their vehicles with dry erase marker.   Hilarious and Pathetic.",
            "title_similarity": "0.7139089",
            "sentiment_compound": 0.25
        },
        {
            "id": "hz2fm8y",
            "score": 6,
            "text": "Well, at least they all can go to the next Trump rally.",
            "title_similarity": "0.27555552",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz2fp20",
            "score": 5,
            "text": "Good.  No one has time for their shit right now.",
            "title_similarity": "0.46185952",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hz2fuji",
            "score": 2,
            "text": "Hahahahaha total failures just like their lord and master",
            "title_similarity": "0.49539298",
            "sentiment_compound": -0.1354
        },
        {
            "id": "hz2fv1b",
            "score": 8,
            "text": "They couldn’t afford to take a day off due to medical bills.",
            "title_similarity": "0.5477897",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2fvi9",
            "score": 4,
            "text": "After seeing Ukrainian freedom fighters, these cowards have nothing to bitch about",
            "title_similarity": "0.4133565",
            "sentiment_compound": 0.7948
        },
        {
            "id": "hz2fy16",
            "score": 8,
            "text": "\"Several trucker convoys are still on their way to DC, to oppose Covid mandates, at a time when most restrictions have been been removed by US states.\"\n\nMy favorite take from the article!",
            "title_similarity": "0.5916478",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hz2fyou",
            "score": 6,
            "text": "The Russian money dried up so nobody went",
            "title_similarity": "0.67821443",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2fzn6",
            "score": 3,
            "text": "Maybe even the crazies got some perspective now?",
            "title_similarity": "-0.02663502",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2g1oq",
            "score": 7,
            "text": "As someone from Ottawa  Hahahahahahahahha!",
            "title_similarity": "0.110256635",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2g1zp",
            "score": 5,
            "text": "Lmao. what to expect from these \"patriots\" that were waiting from trump's inaguration in the last election. How stupid can you be to believe such bullshit? These \"patriots\" are the main customers of russian and chinese misinformation, but even if you try to explain certain realities and its like their world gets shattered and turn violent .",
            "title_similarity": "0.4782631",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hz2g2wx",
            "score": 6,
            "text": "Covid numbers are really low. Between vaccination and natural infection, we have to be near or at herd immunity, mask and vaccine mandates expired. It's just kind of embarrassing to watch them protest something that doesn't exist anymore. \n\nThey just wanted to play the victim one last time before going back to work I guess.",
            "title_similarity": "0.5041607",
            "sentiment_compound": -0.5402
        },
        {
            "id": "hz2g31t",
            "score": 9,
            "text": "Now they get to go home and whine about the cost of fuel after wasting what was in their tanks. Morons.",
            "title_similarity": "0.50921685",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hz2g58m",
            "score": 5,
            "text": "They're home, sick with Covid.",
            "title_similarity": "0.35454476",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hz2g79c",
            "score": 10,
            "text": "Russia got distracted so they couldn’t control the narrative and low and behold the alt-right crazy’s fizzled away.",
            "title_similarity": "0.56277335",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz2g8w6",
            "score": 9,
            "text": "AHAHAHAHAHHAHAHAHAAHAHH (Deep breath) HAHAHAHHAAHAHHAAHAHA",
            "title_similarity": "-0.029011596",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2gff7",
            "score": 10,
            "text": "I watched an interview with one of these guys who claimed one of the things they were protesting was rising gas prices... by driving their gas-guzzling trucks across the country...🤔",
            "title_similarity": "0.44616783",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz2gfwp",
            "score": 1,
            "text": "The Independent website is a mess.",
            "title_similarity": "0.44415802",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hz2gh4k",
            "score": 2,
            "text": "Only convoy doing worse than the Russian one",
            "title_similarity": "0.41796994",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz2gkbi",
            "score": 1,
            "text": "Have you people had enough evil and hate yet?",
            "title_similarity": "0.27207834",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hz2glvh",
            "score": 5,
            "text": "guess nobody gives two trucks",
            "title_similarity": "0.66066337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2gni1",
            "score": 2,
            "text": "We’re too busy to give a fuck",
            "title_similarity": "0.4648919",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz2go5j",
            "score": 4,
            "text": "The lost their Russian funding.",
            "title_similarity": "0.4920013",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz2gq29",
            "score": 4,
            "text": "Russian Funding dried up probably",
            "title_similarity": "0.41468117",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2grqu",
            "score": 2,
            "text": "Kinda hard to keep vaccines and mask mandates on the agenda when there’s war in Europe going on lmao.",
            "title_similarity": "0.48333138",
            "sentiment_compound": -0.0276
        },
        {
            "id": "hz2gs6h",
            "score": 3,
            "text": "Russians are occupied with other stuff right now.",
            "title_similarity": "0.15802364",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2gtx6",
            "score": 3,
            "text": "The traffic jams discouraged most of them :/",
            "title_similarity": "0.43193156",
            "sentiment_compound": -0.6557
        },
        {
            "id": "hz2gw8r",
            "score": 3,
            "text": "Sorry everyone who matters is kinda busy with something else atm k bye ttyl",
            "title_similarity": "0.37908667",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hz2gxtc",
            "score": 1,
            "text": "“Register for free to continue reading”\n\nNo, I don’t think I will…",
            "title_similarity": "0.2562613",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hz2gxwf",
            "score": 3,
            "text": "Ohh well.\n\n*::sarcastic jerk off motion::*",
            "title_similarity": "0.19933224",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz2gyf3",
            "score": 3,
            "text": "****more pressing matters at hand",
            "title_similarity": "0.14479026",
            "sentiment_compound": 0.5542
        },
        {
            "id": "hz2gzl2",
            "score": 3,
            "text": "\"Ain't nobody got time for that!!\"\n\n- Sweet Brown",
            "title_similarity": "0.13157037",
            "sentiment_compound": 0.555
        },
        {
            "id": "hz2h0aa",
            "score": 7,
            "text": "weird how the right wing noise machine loses momentum when Russia is busy committing war crimes",
            "title_similarity": "0.50429136",
            "sentiment_compound": -0.765
        },
        {
            "id": "hz2h0z1",
            "score": 3,
            "text": "Guess a lot of the funds from the backers got frozen?",
            "title_similarity": "0.3881319",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2h5o6",
            "score": 1,
            "text": "It’s almost like Canada has all the hillbillies already near Ottawa 😂😂",
            "title_similarity": "0.29104853",
            "sentiment_compound": 0.791
        },
        {
            "id": "hz2h5wr",
            "score": 3,
            "text": "Hehhehhheh, I guess the organizers ran out of rubles.",
            "title_similarity": "0.48598856",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2h8to",
            "score": 3,
            "text": "Lol pathetic, there's like 5 people there. If only the organizer was self aware enough to realize no one gives a shit, but sadly that didn't stop him from rambling on for 45 minutes to an audience of none.",
            "title_similarity": "0.5709312",
            "sentiment_compound": -0.6083
        },
        {
            "id": "hz2hb6w",
            "score": 4,
            "text": "Convoy. You keep using that word. I don’t think it means what you think it means.",
            "title_similarity": "0.4655273",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2hf1y",
            "score": 2,
            "text": "There isn’t room in this world for all that hate.",
            "title_similarity": "0.5655117",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hz2hglh",
            "score": 4,
            "text": "Well you know Russians assets are frozen . I'm not working for free .",
            "title_similarity": "0.5935156",
            "sentiment_compound": 0.0253
        },
        {
            "id": "hz2hguv",
            "score": 1,
            "text": "Whomp whomppppp",
            "title_similarity": "0.020646945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2hiju",
            "score": 2,
            "text": "They quit just as fast as all the people crying about no one wearing mask or not getting the vaccine. Very refreshing",
            "title_similarity": "0.5425736",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hz2hl7w",
            "score": 2,
            "text": "That's strange, I thought I read somewhere about a russian supported army convoy was stalled 20 miles outside the capital?",
            "title_similarity": "0.5469192",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz2hlh5",
            "score": 1,
            "text": "https://www.youtube.com/watch?v=4OfUxLtI7BI",
            "title_similarity": "0.097744",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2hmlc",
            "score": 1,
            "text": "😆 haven't heard 🤔 😷 not needed 😂",
            "title_similarity": "0.44865993",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hz2hogk",
            "score": 3,
            "text": "We got places to be and shit to deliver.",
            "title_similarity": "0.06732186",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hz2hpl2",
            "score": 2,
            "text": "2 sentences surrounded by 20 ads isn't an article.\n\nJournalism really is dead isn't it.",
            "title_similarity": "0.60080844",
            "sentiment_compound": -0.6573
        },
        {
            "id": "hz2hs76",
            "score": 2,
            "text": "What would they be protesting anyway? Just trying to copy Canada? Kinda late, I guess.",
            "title_similarity": "0.45088458",
            "sentiment_compound": -0.4871
        },
        {
            "id": "hz2i0np",
            "score": 1,
            "text": "Yeah, they probably don’t want to come up against American police squads. Far less polite than the RCMP or whatever cops Canada has in my experience.",
            "title_similarity": "0.5921841",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz2i0vu",
            "score": 1,
            "text": "[My response to the 'convoy'](https://www.youtube.com/watch?v=T1XgFsitnQw)",
            "title_similarity": "0.14749485",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2i5v7",
            "score": 3,
            "text": "It may not be a \"trucker convoy\" but there was a convoy of duped trump supporters rolling through StL yesterday. What a sad joke.",
            "title_similarity": "0.6937624",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz2i83n",
            "score": 3,
            "text": "Looks like US truckers have more gray matter in their brain than the lazy bum Canadians",
            "title_similarity": "0.27724203",
            "sentiment_compound": 0.0972
        },
        {
            "id": "hz2ifnf",
            "score": 1,
            "text": "Uhh if you'll recall a tonne of mandates and restrictions were lifted this week because of changing science and not midterm polls/state of the union.\n\nSo if the protest is about lifting restrictions and they are lifted across the country prior, how is this surprising news?",
            "title_similarity": "0.51812613",
            "sentiment_compound": 0.0287
        },
        {
            "id": "hz2ihmb",
            "score": 18,
            "text": "And no trucks were given that day",
            "title_similarity": "0.6717372",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz2il5b",
            "score": 2,
            "text": "Evidence of the purely partisan nature of their grievances. They are just desperately trying to find other things to protest about at this point. LMAO we all know what the Fox News talking points will be..",
            "title_similarity": "0.374024",
            "sentiment_compound": -0.1197
        },
        {
            "id": "hz2imid",
            "score": 1,
            "text": "It didn't happen cuz it was somebody else's fault. Typical Murica \"victim\".",
            "title_similarity": "0.52059233",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hz2ipbr",
            "score": 2,
            "text": "The CDC beat them to the punch.   If these truckers would listen to the news they would have save a lot of diesel.",
            "title_similarity": "0.36336985",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hz2iu37",
            "score": 3,
            "text": "I like how OP had to link https://www.independent.co.uk/ because apparently this non-event wasn't even news in the US? ;)",
            "title_similarity": "0.40583944",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hz2izm0",
            "score": 2,
            "text": "keep on trucking that willful ignorance",
            "title_similarity": "0.4150011",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hz2j11e",
            "score": 1,
            "text": "I wonder if it’s because Ukraine is in the news? When legitimately bad, scary things are happening in the world, it seems that people stress less about imaginary bullshit",
            "title_similarity": "0.43122023",
            "sentiment_compound": -0.9191
        },
        {
            "id": "hz2j252",
            "score": 1,
            "text": "Wasn't this the outcome of the last one too.",
            "title_similarity": "0.06739383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2j404",
            "score": 3,
            "text": "Well of course. It made some sense in Canada. It makes no sense in the US. What exactly are you protesting in a country without mandates?",
            "title_similarity": "0.49795425",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hz2j5j0",
            "score": 1,
            "text": "I think I speak for everyone when I say\n\nLOL… amazing.",
            "title_similarity": "-0.026530342",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz2j8wg",
            "score": 2,
            "text": "Because the demands were stupid and they were just ripping off the Canadian convoy. Morons.",
            "title_similarity": "0.5490973",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hz2jesc",
            "score": 3,
            "text": "Couldn't get the attention they so desperately wanted... losers",
            "title_similarity": "0.41879052",
            "sentiment_compound": -0.7923
        },
        {
            "id": "hz2jggi",
            "score": 1,
            "text": "So they failed just like the orange cult leader?",
            "title_similarity": "0.51913756",
            "sentiment_compound": -0.2682
        },
        {
            "id": "hz2jngi",
            "score": 4,
            "text": "Russian funding dried up.",
            "title_similarity": "0.4797529",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2jns1",
            "score": 1,
            "text": "I can reject russia too",
            "title_similarity": "0.26616317",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz2jnsi",
            "score": 1,
            "text": "Well, I guess these people don't care about freedumb.",
            "title_similarity": "0.53671604",
            "sentiment_compound": -0.1351
        },
        {
            "id": "hz2jq7f",
            "score": 1,
            "text": "I don't know about Washington DC, but there was a huge ass convoy that drove through Indiana on I70 yesterday. I was really confused because I thought I had fizzled out, but there were people on multiple overpasses with American and Gadsden flags. Same with the trucks.",
            "title_similarity": "0.55304813",
            "sentiment_compound": -0.7343
        },
        {
            "id": "hz2jq9f",
            "score": 1,
            "text": "Ahhhh so they protested the protest! Brilliant absolutely brilliant",
            "title_similarity": "0.24910903",
            "sentiment_compound": 0.7511
        },
        {
            "id": "hz2jrrr",
            "score": 1,
            "text": "Comfortable and can’t put their money where their mouth is.",
            "title_similarity": "0.3685407",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hz2jrxt",
            "score": 2,
            "text": "Was pretty pointless in the US since it’s not nearly at the level of Canada",
            "title_similarity": "0.5547167",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hz2jwxw",
            "score": 1,
            "text": "“These colors don’t run!” and “country strong!” And “come and take it!” Is actually…”nah dude, I don’t got no gas money…and I’m i got this other thing, you know”",
            "title_similarity": "0.50213397",
            "sentiment_compound": -0.4724
        },
        {
            "id": "hz2jyqk",
            "score": 1,
            "text": "Truckers second guessing now that the price of gas is going up.",
            "title_similarity": "0.32904893",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2jyt1",
            "score": 3,
            "text": "This is what happens when all of your “knowledge” is Russian bot propaganda… nice job morons.",
            "title_similarity": "0.22718632",
            "sentiment_compound": 0.128
        },
        {
            "id": "hz2k00i",
            "score": 1,
            "text": "What happened to that 30mile long truck convoy that was in Texas? Did that all fall apart already lol. They had their own sub for it",
            "title_similarity": "0.5073883",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hz2k09i",
            "score": 1,
            "text": "2022 is rough and rocky soil  for this level of optimism but maybe they all just came to their senses?",
            "title_similarity": "0.32417828",
            "sentiment_compound": 0.3071
        },
        {
            "id": "hz2k0ws",
            "score": 2,
            "text": "Poor babies, so persecuted.",
            "title_similarity": "0.24233443",
            "sentiment_compound": -0.6901
        },
        {
            "id": "hz2k1wl",
            "score": 3,
            "text": "They know better than to bring that shit to the US. People will steal the parts off the truck while it’s parked.",
            "title_similarity": "0.567546",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz2k6cb",
            "score": 1,
            "text": "What are they protesting. I thought it was fairly close to a free for all in the US",
            "title_similarity": "0.30581337",
            "sentiment_compound": 0.128
        },
        {
            "id": "hz2k9yx",
            "score": 3,
            "text": "There was no interest because Fox News and the puppet masters on social media got distracted with Ukraine and put down the swinging pocket watch momentarily.",
            "title_similarity": "0.6504803",
            "sentiment_compound": -0.5967
        },
        {
            "id": "hz2kbak",
            "score": 1,
            "text": "Is it even a protest unless the mercers are involved. Am I right?",
            "title_similarity": "0.36279726",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz2kbfo",
            "score": 2,
            "text": "They probably got tired while they were going 25 mph on the capital beltway",
            "title_similarity": "0.37831038",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hz2kbwc",
            "score": 1,
            "text": "I’m thinking this looming world war has really put things into perspective",
            "title_similarity": "0.15429947",
            "sentiment_compound": -0.6731
        },
        {
            "id": "hz2kd5r",
            "score": 1,
            "text": "Lauren Southern dragged Destiny's ass to DC for this event. What a shit show!",
            "title_similarity": "0.5489383",
            "sentiment_compound": -0.8221
        },
        {
            "id": "hz2kdqc",
            "score": 3,
            "text": "Those freedom loving truckers with their deeply held beliefs have all put their money where their mouth is and gone to Ukraine to protect actual freedom from actual tyranny. I 100% guarantee it.\n\n\n\n/s, obvs.",
            "title_similarity": "0.31410027",
            "sentiment_compound": 0.9509
        },
        {
            "id": "hz2kif5",
            "score": 1,
            "text": "Pretty sure current events with Putin and Ukraine made the pro-testers cause pointless with the state of current events and the chance of WW3.",
            "title_similarity": "0.5804735",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hz2kisv",
            "score": 2,
            "text": "They were too busy being Putin apologists.",
            "title_similarity": "0.39151484",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2knnw",
            "score": 1,
            "text": "Kind of sounds like the media is hyping up a big nothingburger",
            "title_similarity": "0.5115049",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hz2kqab",
            "score": 4,
            "text": "My cynical brain has to question if the truckers ran out of money due to the Russian bank sanctions.",
            "title_similarity": "0.56775004",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz2krvx",
            "score": 1,
            "text": "Don’t think they’re supposed to be there until the 5th",
            "title_similarity": "0.26685908",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2ks6p",
            "score": 3,
            "text": "Russian \"news\" sources have been too busy degrading Ukraine to soon up hype for the trucker convoy. \n\nNot surprised there was low attendance.",
            "title_similarity": "0.62484694",
            "sentiment_compound": -0.7626
        },
        {
            "id": "hz2kv9x",
            "score": 1,
            "text": "Thank you American Truckers!",
            "title_similarity": "0.26132512",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hz2l1fu",
            "score": 2,
            "text": "Biden’s OSHA vaccine mandate isn’t in effect because it’s caught up in the courts. The CDC’s mask recommendations are being uplifted. Literally everything that truck convoy represents is being dissolved in real time, proving they’re crying for no reason.\n\nWhy go when you’re protest isn’t for anything actually happening?",
            "title_similarity": "0.6363149",
            "sentiment_compound": -0.743
        },
        {
            "id": "hz2l1lu",
            "score": 2,
            "text": "Probably because truckers are making bank in the USA right now",
            "title_similarity": "0.47534776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2m8kw",
            "score": 2,
            "text": "Who even wants to drive in DC? I'm pretty sure they would get arrested pretty quickly if they actually managed to shut down any major roads, if you want to protest you can stand on the sidewalks. If you want to protest by blocking the street, do not use big trucks, nobody is that worried about the moral or legal rights of your giant truck.",
            "title_similarity": "0.72105855",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hz2mf0g",
            "score": 1,
            "text": "The schedule got messed up so they are currently in Indianapolis",
            "title_similarity": "0.49980015",
            "sentiment_compound": -0.34
        },
        {
            "id": "hz2n1me",
            "score": 2,
            "text": "They’re all worried about WWIII now instead.",
            "title_similarity": "0.42784518",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz2n8hn",
            "score": 2,
            "text": "This makes me so happy.",
            "title_similarity": "-0.15037692",
            "sentiment_compound": 0.6948
        },
        {
            "id": "hz2nas3",
            "score": 3,
            "text": "whilst an actual war is going on and people are protesting and fighting the oppressor,\n\nyou’ve had truckers being little bitches crying about how they are so oppressed by a mere inconvenience in canada. not good timing huh",
            "title_similarity": "0.5532278",
            "sentiment_compound": -0.9736
        },
        {
            "id": "hz2nd96",
            "score": 5,
            "text": "Not enough Russian bots to help organize",
            "title_similarity": "0.57162726",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz2nebh",
            "score": 1,
            "text": "This is the one time I wish I was American instead of Canadian… 😂😂",
            "title_similarity": "0.30929792",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hz2ng5n",
            "score": 3,
            "text": "Truckers are not allowed in DC which is why they are not their. DC has strict laws on which commercial vehicles can enter and a semi-truck is not one of them unless authorities authorized it.",
            "title_similarity": "0.7340415",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2nh1u",
            "score": 2,
            "text": "Thank god, traffic up here doesn’t need any help.",
            "title_similarity": "0.39257354",
            "sentiment_compound": 0.743
        },
        {
            "id": "hz2nsja",
            "score": 2,
            "text": "could it have something to do with them noticing there's no lockdowns?",
            "title_similarity": "0.43599695",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz2nvab",
            "score": 4,
            "text": "Hard to get the message out without Russian amplification, isn’t it?",
            "title_similarity": "0.3267582",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hz2nx07",
            "score": 2,
            "text": "Making the kessel run in less than twelve parsecs?",
            "title_similarity": "0.27449027",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2nzfo",
            "score": 1,
            "text": "in the end there was more press and police at the event than protesters",
            "title_similarity": "0.29978594",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hz2o1gq",
            "score": 3,
            "text": "that's what happens when your russian backers suddenly find their assets frozen.",
            "title_similarity": "0.43426853",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hz2o2bt",
            "score": 1,
            "text": "Lol I love it when this shit happens. Fuckin clowns.",
            "title_similarity": "0.06937601",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hz2o3wc",
            "score": 1,
            "text": "I thought the convoy wasn’t supposed to get to DC until March 9th or something? I work in logistics and we were all prepping for the trouble this convoy might cause as it moves up through the mid west.",
            "title_similarity": "0.559264",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz2oa79",
            "score": 1,
            "text": "How is it a flop if no one shows. 3 sad people with signs convoy and protest imply people without people you have neither lol",
            "title_similarity": "0.7061019",
            "sentiment_compound": -0.8759
        },
        {
            "id": "hz2oc8h",
            "score": 4,
            "text": "Well the Russians can't make payments anymore",
            "title_similarity": "0.6249298",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz2octz",
            "score": 4,
            "text": "Theres nothing to protest . Supreme court struck down vaccine mandate. Mask mandate pretty much lifted anywhere. why would anyone be surprised no one showing up for this.",
            "title_similarity": "0.5196386",
            "sentiment_compound": 0.7383
        },
        {
            "id": "hz2opgc",
            "score": 3,
            "text": "I mean they are lifting mandates so not sure what they would be arguing tbh. Plus this Russia Ukraine situation will cover up any exposure it would've got. Too late to protest it",
            "title_similarity": "0.44089168",
            "sentiment_compound": -0.7384
        },
        {
            "id": "hz2osb0",
            "score": 3,
            "text": "I wonder if this has anything to do with all those Russian bank accounts that got frozen this week.  Hmmm.",
            "title_similarity": "0.5507965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2p0iu",
            "score": 1,
            "text": "Lol and we thought the Americans were dumb not like us Canadians, CLASSIC",
            "title_similarity": "0.52525556",
            "sentiment_compound": -0.3839
        },
        {
            "id": "hz2p658",
            "score": 1,
            "text": "But my freedums!!! Why don’t you listen to me… crickets",
            "title_similarity": "0.18325344",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2pj2w",
            "score": 1,
            "text": "It’s almost as if they’re 2 years too late…",
            "title_similarity": "0.28015625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2ploc",
            "score": 1,
            "text": "This is why we cannot trust the news outlets. They could not get it right; it was supposed to be in the Metaverse not IRL sigh.  /s",
            "title_similarity": "0.6094426",
            "sentiment_compound": -0.4168
        },
        {
            "id": "hz2pmom",
            "score": 1,
            "text": "Almost as if there where something more important than your gripes over minor inconvenience going on....",
            "title_similarity": "0.14003423",
            "sentiment_compound": -0.1045
        },
        {
            "id": "hz2pr3e",
            "score": 1,
            "text": "And yet again something canadians can do better than americans.",
            "title_similarity": "0.113027036",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz2ptqd",
            "score": 1,
            "text": "So you mean redditors are just a crappy local minority?",
            "title_similarity": "0.47200558",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hz2pyh2",
            "score": 1,
            "text": "[DC Trucker Battle theme](https://www.youtube.com/watch?v=CQeezCdF4mk)",
            "title_similarity": "0.40057248",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hz2pz0c",
            "score": 2,
            "text": "Don't know what they're even protesting anymore",
            "title_similarity": "0.50378317",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz2q5di",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.3078922"
        },
        {
            "id": "hz2r68c",
            "score": 1,
            "text": "All the biggest goons that would do this are already facing charges.",
            "title_similarity": "0.2874117",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hz2rom1",
            "score": 1,
            "text": "Go home losers. Help your families, and quit acting like you're f*cling special.",
            "title_similarity": "0.50216174",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hz2rqzf",
            "score": 1,
            "text": "These bozos sent out an email for money to pay for gas. I think it went up to $5k to pay an entire trip for one truck. Hope no one was stupid enough to send any money.",
            "title_similarity": "0.45089018",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hz2sa5p",
            "score": 1,
            "text": "I assume everyone from the last protest is still sitting in Canadian jail and any US truckers are vaxxed and at work :p",
            "title_similarity": "0.4608949",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2sbie",
            "score": 2,
            "text": "Huh, maybe some sort of funding from an international source dried up or something. That’s weird. Probably totally unrelated to other world events.",
            "title_similarity": "0.5656097",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hz2shng",
            "score": 3,
            "text": "Weird. Almost like all those yelling voices on Facebook disappear once Russian money was stopped.",
            "title_similarity": "0.61496145",
            "sentiment_compound": -0.3167
        },
        {
            "id": "hz2sju2",
            "score": 2,
            "text": "In other news, man yells at sun for being too bright.",
            "title_similarity": "0.39391956",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz2sk9b",
            "score": 1,
            "text": "They found that their \"support\" was being paid in NFTs ...",
            "title_similarity": "0.056229778",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz2sxvp",
            "score": 1,
            "text": "Where people? *cricket sounds*",
            "title_similarity": "0.112842105",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2syir",
            "score": 5,
            "text": "My husband and I had a conversation about this the other week. He was waiting for the US to attempt a trucker convoy. \n\nMy theory was, it would never happen here. Health insurance is usually tied to employment, and most Americans are just a couple missed paychecks away from homelessness. Many states don’t provide the social safety net that Canada enjoys. To participate in a long term protest would mean losing income, access to health care, and shelter. The policies these people pushed to be in place are now crippling them from being able to protest in the way they would like to.",
            "title_similarity": "0.69102025",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hz2t9l0",
            "score": 2,
            "text": "I needed a good laugh this morning",
            "title_similarity": "0.09144335",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hz2tf9w",
            "score": 2,
            "text": "Random protests in Union Square attract more people",
            "title_similarity": "0.37299514",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hz2tfe2",
            "score": 6,
            "text": "Truckers are in high demand right now making more money than they have in years. Most truckers are working, not crying about masks and vaccines.",
            "title_similarity": "0.27767187",
            "sentiment_compound": 0.2626
        },
        {
            "id": "hz2toy0",
            "score": 1,
            "text": "Wow, what a big surprise!",
            "title_similarity": "0.016559731",
            "sentiment_compound": 0.7345
        },
        {
            "id": "hz2tp3c",
            "score": 1,
            "text": "It was a gambit.  They are rushing Area 51 as we speak...",
            "title_similarity": "0.21924707",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2tziy",
            "score": 1,
            "text": "The truckers in Canada at least started with a very specific grievance (vaccine mandate for border crossing). \n\nThis DC one would’ve been stupid AF",
            "title_similarity": "0.5219389",
            "sentiment_compound": -0.7769
        },
        {
            "id": "hz2ujth",
            "score": 1,
            "text": "oh man I'm jealous as a Canadian.",
            "title_similarity": "0.23858921",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hz2ukiz",
            "score": 2,
            "text": "I teach in Maryland, and we have an early dismissal on Friday due to this thing. So, unless everyone is mistaken, something is rolling through to the beltway on Friday.",
            "title_similarity": "0.5016997",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hz2uoqi",
            "score": 2,
            "text": "As a DC resident, I promise you no one gave this any serious thought, whatsoever.",
            "title_similarity": "0.6664319",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hz2uvwb",
            "score": 1,
            "text": "Protest COVID? Is this 2021??",
            "title_similarity": "0.28363246",
            "sentiment_compound": -0.3695
        },
        {
            "id": "hz2v627",
            "score": 1,
            "text": "Hey PIgpen, this here's the rubber duck, you got yer ears on?",
            "title_similarity": "0.103896864",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2v6tl",
            "score": 1,
            "text": "Isnt the convoy out in full force elsewhere though?",
            "title_similarity": "0.27332494",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2v8qh",
            "score": 1,
            "text": "Surprise, they knew they might face actual consequences if they tried it in DC and they cowardly backed down.  \n\n\nThe true face of the 'movement' ladies and gentleman.",
            "title_similarity": "0.502349",
            "sentiment_compound": 0.34
        },
        {
            "id": "hz2vbez",
            "score": 1,
            "text": "Good choice, they approved the National Guard to come in weeks before it lmao",
            "title_similarity": "0.28381374",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hz2vfut",
            "score": 1,
            "text": "They all crashed in Oklahoma on the turnpike.",
            "title_similarity": "0.5351255",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2vh1h",
            "score": 3,
            "text": "Well, the Ruble shit the bed. How are the organizers and instigators gonna get paid from their overlord?",
            "title_similarity": "0.41795754",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hz2vkdz",
            "score": 2,
            "text": "Stuck in traffic @64km convoy north of Kyiv currently, starving.",
            "title_similarity": "0.5781261",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hz2wfrw",
            "score": 1,
            "text": "They need to get back to work this isn’t the time.",
            "title_similarity": "0.39750493",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2wmp1",
            "score": 1,
            "text": "Infants stomping their feet.",
            "title_similarity": "-0.017819494",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2wu5e",
            "score": 1,
            "text": "Sad part is that as numbers naturally go down and mandates are lifted, these snotty assholes will try to take credit for the mandates expiring",
            "title_similarity": "0.3673771",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hz2wuq4",
            "score": 2,
            "text": "Dammit my over sized flag is on back order!! I swear I woulda shown up otherwise",
            "title_similarity": "0.29307824",
            "sentiment_compound": -0.1984
        },
        {
            "id": "hz2x2f0",
            "score": 2,
            "text": "it just goes to show how stupid and pointless the protest is compared to the Ukraine war. A bunch of grown men scared of a little needle",
            "title_similarity": "0.58969975",
            "sentiment_compound": -0.9042
        },
        {
            "id": "hz2xbku",
            "score": 2,
            "text": "Finally some heart warming news.",
            "title_similarity": "-0.006062423",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hz2xlya",
            "score": 3,
            "text": "This makes me unreasonably happy\n\nEdit; also, fuck how embarrassing!",
            "title_similarity": "0.07433774",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hz2xnu5",
            "score": 2,
            "text": "Meh. We got bigger issues to deal with on a global scale and a national scale. A truck convoy isn't going to change that.",
            "title_similarity": "0.4143015",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz2y7yg",
            "score": 1,
            "text": "Good that means we're on the same page.",
            "title_similarity": "-0.07521243",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz2yhv2",
            "score": 3,
            "text": "Wait a minute! You mean to tell me all those truckers that came through Oklahoma the other day, stopping to collect donations from the MAGA crowd were nothing more than grifters that never made it to D.C.? Say it ain't so...",
            "title_similarity": "0.7043414",
            "sentiment_compound": -0.2244
        },
        {
            "id": "hz2yi1q",
            "score": 2,
            "text": "Well, Russia and Ukraine brought reality back into the picture and people realize complaining about stupid bullshit isn't as important as it seemed a week ago. Perspective does wonders. Too bad it takes shit like this to bring morons back down to earth.",
            "title_similarity": "0.3861658",
            "sentiment_compound": -0.937
        },
        {
            "id": "hz2yis9",
            "score": 1,
            "text": "Bigger fish to fry now. COVID is yesterday’s news.",
            "title_similarity": "0.24322614",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz2z1fl",
            "score": 1,
            "text": "Well well well, who is surprised???",
            "title_similarity": "0.12905462",
            "sentiment_compound": 0.7744
        },
        {
            "id": "hz2z206",
            "score": 1,
            "text": "I bet Rand Paul, tucker and the \"Go Fund Me\" grifters are Uber pissed",
            "title_similarity": "0.37716454",
            "sentiment_compound": -0.6697
        },
        {
            "id": "hz2zbm8",
            "score": 3,
            "text": "The vast majority of covid mandates in the US have been lifted, even in Democratic states, not a lot to protest here. Ukraine is the new big thing",
            "title_similarity": "0.33069116",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz2ztjd",
            "score": 8,
            "text": "Damn.  The whole world was really looking forward to hearing about the brutal oppression and tyranny these people were experiencing when they've been asked to... wear masks if they aren't going to get a vaccine.  Or get a free, safe, vaccine that's been given billions of times if they are crossing international borders. \n\nBrutal!  The world needs to understand their plight!",
            "title_similarity": "0.3891462",
            "sentiment_compound": -0.7418
        },
        {
            "id": "hz30i96",
            "score": 2,
            "text": "LMFAO! I guess the Russian PAC's money ran dry!",
            "title_similarity": "0.444719",
            "sentiment_compound": 0.7019
        },
        {
            "id": "hz30txu",
            "score": 1,
            "text": "So like that Super Bowl convoy that never happened.",
            "title_similarity": "0.67575955",
            "sentiment_compound": 0.788
        },
        {
            "id": "hz30v1h",
            "score": 1,
            "text": "Why would anyone show up? What are you protesting? Mandates that are lifting? Pretty sure that was planned before you showed up lol",
            "title_similarity": "0.48827946",
            "sentiment_compound": 0.7219
        },
        {
            "id": "hz318m6",
            "score": 4,
            "text": "I mean, does anyone really care what Truckers have to say about their freedumb?",
            "title_similarity": "0.5465102",
            "sentiment_compound": 0.5413
        },
        {
            "id": "hz31as0",
            "score": 3,
            "text": "I wanted them to try that shit in DC so badly. I was gonna go watch.",
            "title_similarity": "0.2162134",
            "sentiment_compound": -0.822
        },
        {
            "id": "hz31kmh",
            "score": 2,
            "text": "Haha... Read the room!",
            "title_similarity": "-0.005766386",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hz31vox",
            "score": 1,
            "text": "I avoided going downtown for nothing, apparently.",
            "title_similarity": "0.6571897",
            "sentiment_compound": -0.34
        },
        {
            "id": "hz3271t",
            "score": 3,
            "text": "We are all JFK jr on this beautiful day",
            "title_similarity": "0.20250507",
            "sentiment_compound": 0.6833
        },
        {
            "id": "hz32y6f",
            "score": 2,
            "text": "They are just now passing through Illinois. Going to be a few more days.",
            "title_similarity": "0.2733053",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz32ydw",
            "score": 2,
            "text": "The guy at the event in washington DC was probably wayyyy too early.  if the truckers are in missouri as of 3/1/2022, there's no way the truckers would have driven 925 miles in one night to be there.  for reference, from los angeles to las vegas is 270 miles which is a 4-5 hour drive by car at 65-70mph.  a truck gets significantly worse gas mileage and it doesn't seem like they are in a real hurry to arrive to DC.  Scheduled protest was doomed by logistics.\n\nthis trucking group seem irrational / maga kool-aid drinkers.",
            "title_similarity": "0.72620934",
            "sentiment_compound": -0.9326
        },
        {
            "id": "hz331ok",
            "score": 1,
            "text": "The classic term is rubes.",
            "title_similarity": "-0.050640658",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz339qj",
            "score": 2,
            "text": "What did they expect? DC votes 90+% democratic",
            "title_similarity": "0.3314888",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz33n3i",
            "score": 2,
            "text": "As Nelson would say, \"HA HAH!\"",
            "title_similarity": "0.05906451",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz33tlc",
            "score": 1,
            "text": "Just a bunch of gaslighting. At least the National Guard showed up.",
            "title_similarity": "0.35027945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz33tz8",
            "score": 5,
            "text": "The Russians were too busy to keep feeding the propaganda and their bullshit parade died out?",
            "title_similarity": "0.6783501",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hz33zfj",
            "score": 5,
            "text": "\"those trucks are not going to drive themselves\".... Yupp not YET buddy.... Not YET..... Well some right now.....",
            "title_similarity": "0.6430329",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hz34dz3",
            "score": 2,
            "text": "Guess Russia was busy with something else this week",
            "title_similarity": "0.3804899",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz34ljr",
            "score": 2,
            "text": "This convoy was like an 8 on the Boebert stupidity scale.",
            "title_similarity": "0.32239616",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hz34mzs",
            "score": 3,
            "text": "Maybe people couldn't afford the time off work because of: low wages, low vacation, poor healthcare system. Those far right policies hurt their own protesters.",
            "title_similarity": "0.52328384",
            "sentiment_compound": -0.891
        },
        {
            "id": "hz35ene",
            "score": 3,
            "text": "What are they protesting? My city just dropped vaccine and mask mandates. Cases are down almost 80% in my state. Lowest point since last July. Shit is cashed, find something new to cry about",
            "title_similarity": "0.62494576",
            "sentiment_compound": -0.9022
        },
        {
            "id": "hz35u4n",
            "score": 1,
            "text": "Can't make money off a convoy.",
            "title_similarity": "0.6016364",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz36xxc",
            "score": 1,
            "text": "No surprise, Russia cant pay anybody anymore.",
            "title_similarity": "0.6198303",
            "sentiment_compound": -0.1326
        },
        {
            "id": "hz37hvj",
            "score": 2,
            "text": "The missing element is this.  It was a scam.  The plan was not for trucks to show up in DC.  The plan was to make people *believe* trucks were going to DC, so that others would donate crowdsourced dollars to the truckers to cover the gas.  All that “gas money” is now in the pockets of the scam artists who architected the scam and likely not a single dollar ever made it to a trucker, and was never meant to.  The few truckers that did head out are the victims of the scam, believing the donations were ever going to make it them.",
            "title_similarity": "0.68912125",
            "sentiment_compound": -0.9601
        },
        {
            "id": "hz382o1",
            "score": 1,
            "text": "You're welcome America",
            "title_similarity": "0.025270019",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hz386ux",
            "score": 2,
            "text": "Oops. Guess the funding got cut after the sanctions hit.",
            "title_similarity": "0.4305989",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hz38ai6",
            "score": 3,
            "text": "The first one only happened because outside organizers hired actors to be placed there with trucks that nobody actually owned\n\nNo honest truck driver could afford to park their trucks for weeks without pay, they’d lose everything.",
            "title_similarity": "0.61999273",
            "sentiment_compound": -0.0382
        },
        {
            "id": "hz38bhi",
            "score": 1,
            "text": "Just turn it into a \"pro-Putin\" trucker rally, I bet we see record crowds (rolleyes)",
            "title_similarity": "0.41570804",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz38sjm",
            "score": 2,
            "text": "Well their funding dried up when sanctions went I to effect.",
            "title_similarity": "0.4777214",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz38tls",
            "score": 3,
            "text": "These people might have realized how stupid it is to protest for being \"shamed\" for not wearing a mask while Ukrainians are literally dying to protect their actual freedom",
            "title_similarity": "0.40278167",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz38za5",
            "score": 1,
            "text": "What did the leftovers even think to accomplish in D.C.? Did they demand to lift the lifted mandates? A polling firm did it already. Did they want an apology? That’s not how politics works. They’re just wasting gasoline that is going on $4 / gal.",
            "title_similarity": "0.6128448",
            "sentiment_compound": 0.163
        },
        {
            "id": "hz39gap",
            "score": 1,
            "text": "I heard this was gonna be epic? Epic failure, I guess 😉",
            "title_similarity": "0.3483883",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hz39uad",
            "score": 2,
            "text": "Awww come on guys...we're sooooo opressed!",
            "title_similarity": "0.24190675",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3abby",
            "score": 1,
            "text": "Oh no . All the big trucks, it was going to be beautiful, is what many people where saying.",
            "title_similarity": "0.30546987",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz3av2m",
            "score": 3,
            "text": "I’m pretty sure the truckers were either afraid they’d lose their licenses or they were afraid of looking like pathetic fools next to all of the images of those brave Ukrainians.",
            "title_similarity": "0.56450486",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hz3b7ak",
            "score": 4,
            "text": ">Mr Sefcik is an MMA fighter \n\nuh....he was [1-2](https://www.sherdog.com/fighter/Kyle-Sefcik-83321), hasnt fought in almost 10 years, and only fought in local promos. this dude is just a bum",
            "title_similarity": "0.5407562",
            "sentiment_compound": 0.0675
        },
        {
            "id": "hz3bait",
            "score": 3,
            "text": "They're on their way to Russia.",
            "title_similarity": "0.23149292",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3com5",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.30789217"
        },
        {
            "id": "hz3cslb",
            "score": 4,
            "text": "There's no way to get money from Russia to America and all of a sudden all of these conservative trumpist events are failing miserably? What a shocking coincidence.",
            "title_similarity": "0.6533104",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hz3dr2a",
            "score": 1,
            "text": "Someone let OP know we are on Russian/Ukraine\n\nThe Covid mandate thing is over",
            "title_similarity": "0.2817578",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3dtei",
            "score": 5,
            "text": "Funny how Russia's funds get frozen and these jackasses start to go home.",
            "title_similarity": "0.54360604",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hz3e3g9",
            "score": 2,
            "text": "They ran out of fuel on the way to DC.",
            "title_similarity": "0.6910317",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3enuj",
            "score": 2,
            "text": "Kind of hard to get sympathy for being repressed about wearing a mask when real repression is happening on your TV every minute of every day.",
            "title_similarity": "0.50047123",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz3eosa",
            "score": 1,
            "text": "Ukraine saving the world right now!",
            "title_similarity": "0.1447206",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3ep7s",
            "score": 2,
            "text": "The coordination on this was awful.  Some \"convoys\" left last week, only to realize no one else showed up so theyve gone home.  Some were supposed to be there today, and then of the two big ones from California, only the one made it past Nevada.  The other one is supposed to be there this Saturday.  It started out at 100 trucks, and now everyone in town is all excited because its now 10,000 trucks strong and they are stopping in the town I work.  10,000 my ass, I'll wait and see but I'm betting its real close to the 100 instead of thousands.\n\nMaybe if they had coordinated it mightve been a decent protest, but the last time these idiots protested in DC they tried to over throw the government.  Now they are protesting non-existent mandates because most areas have lifted any mandates.",
            "title_similarity": "0.56909",
            "sentiment_compound": -0.775
        },
        {
            "id": "hz3fi91",
            "score": 3,
            "text": "They probably found out the bouncy castle was booked.",
            "title_similarity": "0.14300287",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3gbp3",
            "score": 3,
            "text": "Glad these idiots gave up the charade.",
            "title_similarity": "0.3743468",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hz3gdn3",
            "score": 1,
            "text": "There were more new reporters than there were MAGA clowns.",
            "title_similarity": "0.1827411",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3gm5g",
            "score": 1,
            "text": "Big shocker. In the US few own their trucks and want to get paid and you don’t mKe money driving in  convoy.",
            "title_similarity": "0.62994075",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hz3h07l",
            "score": 4,
            "text": "Well that makes sense since all the movers and shakers behind these demonstrations are busy invading Ukraine right now",
            "title_similarity": "0.37417048",
            "sentiment_compound": 0.34
        },
        {
            "id": "hz3h1ck",
            "score": 4,
            "text": "Amazing what happens when all the Russian bots can't access their Twitter accounts",
            "title_similarity": "0.6335673",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hz3hp4a",
            "score": 1,
            "text": "it’s next week and if it doesn’t happen then refer back to this message next week.",
            "title_similarity": "0.25013733",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3hr9f",
            "score": 1,
            "text": "It's too bad for the convoy members, they'd finally found a cause they could beat their chests about and wax poetic without actually having to inconvenience themselves.  In the end, it was just too long a drive.  I mean, beliefs are important, but gas is over $4/gallon.  Nobody can be expected to protest under those conditions.  /s",
            "title_similarity": "0.41675764",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hz3j6xe",
            "score": 2,
            "text": "Guess they realized there is nothing to protest?",
            "title_similarity": "0.2551968",
            "sentiment_compound": 0.1877
        },
        {
            "id": "hz3j7ft",
            "score": 1,
            "text": "Are the sanctions going to inadvertently stop the flow of funding to dissidents in NA?",
            "title_similarity": "0.48841435",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz3jjd6",
            "score": 3,
            "text": "part of me is convinced that when Russian funds stopped coming in, these truckers lost all their external income outside of the GoFundMe or some shit",
            "title_similarity": "0.62198675",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hz3jkqm",
            "score": 1,
            "text": "When you find out you’re just a pawn in a political game 😂 They will probably try again on a smaller scale to make it look large.",
            "title_similarity": "0.2978302",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hz3jlot",
            "score": 1,
            "text": "They didn't have the thousands in conservative astroturfing to use because those are considered \"handouts\" and they have to keep their cool with that in America.",
            "title_similarity": "0.58942974",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz3kbrj",
            "score": 1,
            "text": "They arent getting the free advertising from the Russian troll farms...harder to get the word out",
            "title_similarity": "0.6230452",
            "sentiment_compound": -0.4023
        },
        {
            "id": "hz3l3fz",
            "score": 2,
            "text": "Russian money has all dried up. \n\nOne thing about the invasion I was thinking is that with Russia distracted republicans will probably get a lot fewer donations and have less trolls working to spread their bullshit. \n\nI know Putin can multi task but you gotta imagine his disinformation campaign will take a hit from this.",
            "title_similarity": "0.4599577",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz3lk8i",
            "score": 1,
            "text": "His stand up needs a lot of work.",
            "title_similarity": "0.14279477",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3lrlk",
            "score": 1,
            "text": "Pathetically hilarious.",
            "title_similarity": "0.091375865",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hz3lvy0",
            "score": 2,
            "text": "We ride for Freedom! Wait, gas is $4.00/gallon? We go home!",
            "title_similarity": "0.2946946",
            "sentiment_compound": 0.6988
        },
        {
            "id": "hz3m22l",
            "score": 1,
            "text": "A bunch of trucks and cars drove by the other day in Missouri with trump and gadsen flags. What happen?",
            "title_similarity": "0.51462233",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3mn5p",
            "score": 1,
            "text": "They all showed up at White House Painting and Landscaping.",
            "title_similarity": "0.22782731",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3n0e4",
            "score": 1,
            "text": "When all else fails... play the victim. Silly little FREEDUMB hounds.",
            "title_similarity": "0.14296506",
            "sentiment_compound": -0.34
        },
        {
            "id": "hz3n9id",
            "score": 1,
            "text": "I’m pretty sure I saw some of them on the Interstate yesterday or Monday. They had flags all over. I had no idea what they represented or where they were going. Now I know. And I don’t care. Lol.",
            "title_similarity": "0.57767737",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hz3ng0a",
            "score": 2,
            "text": "<insert sad trombone noise here>",
            "title_similarity": "0.26615813",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hz3o9o6",
            "score": 2,
            "text": ">I know they’re not even allowed in because they need a commercial license and have proof of a checkoff today because of the checkpoints\n\nSo they failed to follow the law?",
            "title_similarity": "0.73830986",
            "sentiment_compound": -0.5542
        },
        {
            "id": "hz3ojq8",
            "score": 2,
            "text": "Tough to bitch getting 6 figures a year to drive truck",
            "title_similarity": "0.4496075",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hz3pe2q",
            "score": 2,
            "text": "With the price of gasoline being what it is, why would drivers bother?",
            "title_similarity": "0.40691304",
            "sentiment_compound": -0.34
        },
        {
            "id": "hz3pz73",
            "score": 3,
            "text": "Maybe they should get back to work instead of Lolly gagging around now.",
            "title_similarity": "0.34722656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3qink",
            "score": 2,
            "text": "The Russian money dried up when the sanctions hit.  \n\n\nThe anger from the truckers is real enough I'm sure, but it would be a slow boil and reasonable curses under their breath if it weren't for some foreign interference amping it up on FB and Twitter.",
            "title_similarity": "0.48774293",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hz3rair",
            "score": 1,
            "text": "What’s the saying “all bark, no bite”",
            "title_similarity": "0.39765567",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz3rxn5",
            "score": 1,
            "text": "But america already got rid of most restrictions, unlike canada. So this convoy had no purpose",
            "title_similarity": "0.53678644",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hz3s4rv",
            "score": 4,
            "text": "Not surprised at all: they had the dumbest \"demands\" of all time. Nothing regarding wages or working conditions.",
            "title_similarity": "0.5468963",
            "sentiment_compound": -0.608
        },
        {
            "id": "hz3t7h8",
            "score": 3,
            "text": "Anyone want to show up to these with hot wheels and Tonka trucks and just play on the sidewalk?",
            "title_similarity": "0.264602",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hz3tjf0",
            "score": 2,
            "text": "So are the guys in DC already calling it off?  I follow a twitch streaming news reporter who is following a tiny little convoy of about 100 vehicles that is near Indiana and heading towards D.C. now.     \n\nAre they not going to make it in time?   \n\nI just want to watch the disappointment of either being turned away at D.C., or calling it off midway.    Its a bit of a guilty pleasure.",
            "title_similarity": "0.5828995",
            "sentiment_compound": -0.3527
        },
        {
            "id": "hz3trc7",
            "score": 1,
            "text": "Maybe they ran out of gas",
            "title_similarity": "0.43185088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3u26f",
            "score": 3,
            "text": "Because it was Russia funded. The US is about to get a heavy dose of disorganization between Russian assets as they swallow themselves up.",
            "title_similarity": "0.3974805",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hz3u88c",
            "score": 6,
            "text": "My mother-in-law volunteered to be a \"lead escort\"  starting with them in Cali. She only lasted 8 hours and came home.",
            "title_similarity": "0.43841526",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3umi3",
            "score": 5,
            "text": "It's much harder for them to get media attention when Russia is focused elsewhere.\n\nGo figure...",
            "title_similarity": "0.43797296",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hz3uvin",
            "score": 1,
            "text": "Ummn shouldn't they have waited for the actual Freedom Convoy to get there first? Last I checked the major groups were laying over in Indianapolis, IN.",
            "title_similarity": "0.42300436",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hz3vdly",
            "score": 2,
            "text": "i apoligize, sorry, i was being a dick, -trucker in Canada",
            "title_similarity": "0.49458113",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hz3wnr0",
            "score": 3,
            "text": "I saw a tweet last week that noted something along the lines of \"Ukrainians calling themselves patriots are throwing Molotov cocktails at tanks.  Americans calling themselves patriots are whining about wearing masks and getting a free vaccine.\"  A little bit of perspective - and, as others have noted, the lack of active Russian propaganda in the US - does wonders.",
            "title_similarity": "0.4920218",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hz3x0tx",
            "score": 2,
            "text": "I highly recommend watching the video in the article (about a minute). This guy is ranting alone, in front of about a dozen people who are all media and looking at their watches. It's hilarious as hell!",
            "title_similarity": "0.356911",
            "sentiment_compound": -0.3397
        },
        {
            "id": "hz3x7ec",
            "score": 3,
            "text": "Everyone that I have spoken with is over the high school dropouts ,Republicans,and the GED wanna be's having anything to do with having a say in - science- education- government..  Maga Morons -- fox propaganda needs to be shut down!",
            "title_similarity": "0.49437642",
            "sentiment_compound": -0.5562
        },
        {
            "id": "hz3xjhn",
            "score": 1,
            "text": "Fools shouting at the wind",
            "title_similarity": "0.39264244",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hz3xtr3",
            "score": 7,
            "text": "That's because our vaccinated asses are hauling foods and products for the nation",
            "title_similarity": "0.3217885",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz3xw7p",
            "score": 3,
            "text": "Does this mean Canada has to acknowledge that we apparently have way more wing nuts than 'Merica?",
            "title_similarity": "0.27024025",
            "sentiment_compound": -0.3774
        },
        {
            "id": "hz3y8kc",
            "score": 1,
            "text": "I love the 2 minutes of our rally leader complaining how \"They didnt want us here, so thats why nobody showed up. Its not me, Im an organizer, just look at my credentials\" AHAHAHAHAHA. So the few people that made it are there to listen to a guy talk about how its not his fault there arent more people. Its amazing where this movement has gone",
            "title_similarity": "0.59908307",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hz40rjz",
            "score": 1,
            "text": "That $10M war chest they had for the cause seemed to vanish when sanctions kicked in 🤔",
            "title_similarity": "0.4795998",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz40x0w",
            "score": 1,
            "text": "Don’t need to, they got Marge and Bo Bo in Congress.",
            "title_similarity": "0.35990584",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz417zz",
            "score": 1,
            "text": "May be they had truck trouble 🤷‍♀️",
            "title_similarity": "0.40325084",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz423it",
            "score": 1,
            "text": "Schedule say DC on March 5",
            "title_similarity": "0.17695934",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz42x2t",
            "score": 3,
            "text": "oh no\n\n🧐🍷\n\nare they ok",
            "title_similarity": "0.07222087",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz433u4",
            "score": 2,
            "text": "Propaganda because they don't want thier cushy lives threatened",
            "title_similarity": "0.4036801",
            "sentiment_compound": -0.6395
        },
        {
            "id": "hz437sb",
            "score": 1,
            "text": "Well their timing is a bit off when there are people in the world really fighting for \"freedom\".  Canadians only got away with it because it was a month earlier.  They wouldn't get away with their snivelling now either.",
            "title_similarity": "0.5570977",
            "sentiment_compound": 0.5818
        },
        {
            "id": "hz43abo",
            "score": 1,
            "text": "Saw a lot of trucks heading south from Connecticut around 3pm today. Maybe they got the day wrong.\n\nLots of convoy supporters on the bridges above the highway too.",
            "title_similarity": "0.5819433",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hz43jy4",
            "score": 3,
            "text": "Lol. I wanted to see those truckers sitting in traffic on the beltway and regretting their actions.",
            "title_similarity": "0.51582104",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hz43ln9",
            "score": 3,
            "text": "There is supposed to be a truck convoy coming through Gillette Wyoming tomorrow. The town issued permits and everything and is welcoming the increase in revenue at local gas stations and restaurants. \n\nI don’t understand what they are protesting but non of the honest hardworking truck drivers I know are participating.",
            "title_similarity": "0.5002369",
            "sentiment_compound": 0.7311
        },
        {
            "id": "hz44jyj",
            "score": 2,
            "text": "i do not support it, but i am pretty sure i heard it was supposed to be in DC on the 5th, not the 2nd",
            "title_similarity": "0.41757274",
            "sentiment_compound": 0.7664
        },
        {
            "id": "hz44k9c",
            "score": 1,
            "text": "You need to actually be able to drive in DC for a trucker convoy",
            "title_similarity": "0.49060762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz44kei",
            "score": 2,
            "text": "Even right wing nutjobs understand that in light of resent events their call for freedom is kinda ridiculous.",
            "title_similarity": "0.37063682",
            "sentiment_compound": 0.3167
        },
        {
            "id": "hz451qm",
            "score": 2,
            "text": "Shit, y'all seen the cost of fuel lately?? Why do I not have a surprised feeling.....",
            "title_similarity": "0.37964103",
            "sentiment_compound": -0.6281
        },
        {
            "id": "hz45jrn",
            "score": 3,
            "text": "Did anybody tell them about the bigger issues people are focused on right now?",
            "title_similarity": "0.21685559",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hz45wdg",
            "score": 3,
            "text": "Because all the Americans who were gonna go are stuck in Ontario",
            "title_similarity": "0.55202174",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz45wsl",
            "score": 2,
            "text": "Too busy trying to get out of debt from Covid medical bills in the US.",
            "title_similarity": "0.5238419",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hz46hx3",
            "score": 4,
            "text": "Maybe they realized their freedoms were not actually being taken away after seeing what Ukraine is going through.",
            "title_similarity": "0.2947246",
            "sentiment_compound": 0.296
        },
        {
            "id": "hz46u7v",
            "score": 3,
            "text": "Putin’s too busy with the war.",
            "title_similarity": "0.519369",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hz4782a",
            "score": 2,
            "text": "As a Canadian,  fuck yeah it did! 🤣🤣🤣",
            "title_similarity": "0.15631762",
            "sentiment_compound": 0.8221
        },
        {
            "id": "hz47jzw",
            "score": 6,
            "text": "LOL!  Glad these fools drove across the country with fuel costs at an all time high to protest something nobody gives a damn about.  🤣",
            "title_similarity": "0.556066",
            "sentiment_compound": 0.481
        },
        {
            "id": "hz48f91",
            "score": 4,
            "text": "All those patriots who would have showed up weren't there because they went to Ukraine to fight for democracy!  /s",
            "title_similarity": "0.58172214",
            "sentiment_compound": -0.4389
        },
        {
            "id": "hz48ksw",
            "score": 3,
            "text": "What are they even trying to protest now? Is it the green M&M? I've lost track.",
            "title_similarity": "0.4957183",
            "sentiment_compound": -0.5661
        },
        {
            "id": "hz49gve",
            "score": 6,
            "text": "Nobody showed up because there’s an incredible amount of freight to move and it’s paying the best prices in decades. There’s nothing to bitch about",
            "title_similarity": "0.4531534",
            "sentiment_compound": 0.8059
        },
        {
            "id": "hz49hkr",
            "score": 8,
            "text": "its about time Trumpers shut the FUCK UP.  i hope in wake of Ukraine America wakes up and see absolutely dangerous lies and propaganda really are.  Cant believe we almost let this man basically try to overthrow our own government just as Putin is trying to do to Ukraine.  Even if there is \"no collusion\" there is beyond a doubt of a parallel",
            "title_similarity": "0.49506998",
            "sentiment_compound": -0.9063
        },
        {
            "id": "hz4a4ee",
            "score": 7,
            "text": "Tragically Hip never made it in America either.",
            "title_similarity": "0.692002",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hz4a4gz",
            "score": 1,
            "text": "Gee I dunno, maybe people are actually WORKING instead of protesting something that is pretty much going away.\n\nHell, with the price of fuel who the hell is going to drive across country in a big ass truck for no real reason.",
            "title_similarity": "0.5922955",
            "sentiment_compound": -0.9382
        },
        {
            "id": "hz4bwxb",
            "score": 1,
            "text": "well you see... ummm .. wha wha happend was...",
            "title_similarity": "0.011700964",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hz4bzcn",
            "score": 12,
            "text": "Huh Russia money dry up?",
            "title_similarity": "0.35877633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4csaz",
            "score": 9,
            "text": "Hopefully now they’ll all shut the fuck up. Tired of this shit",
            "title_similarity": "0.38933623",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hz4g3qv",
            "score": 5,
            "text": "What… were they planning to protest against? The mandates never went through on the federal level.",
            "title_similarity": "0.69622105",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz4jj52",
            "score": 5,
            "text": "A couple of days ago my hospital sent out an email saying that the convoy plans to pass near us and that it might cause delays and to plan ahead. They said the local police would be available to make things flow as smoothly as possible (which is ironic since I assumed most of the police officers would be busy being in the convoy). Nevertheless, the fated day came and gone and no one noticed.",
            "title_similarity": "0.63916117",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz4sq7p",
            "score": 3,
            "text": "Lmao More people showed up for the josh fight mid-pandemic.",
            "title_similarity": "0.36923373",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz4tm02",
            "score": 3,
            "text": "Maybe they all just already collected their HCA’s.",
            "title_similarity": "0.17450142",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz4wrvs",
            "score": 2,
            "text": "Eh. Weird Canadians were saying they were gunna \"block the superbowl\" and a bunch of other random shit lol",
            "title_similarity": "0.4636978",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hz4xo3h",
            "score": 3,
            "text": "Did the convoy last at least 1 mooch?",
            "title_similarity": "0.27705273",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hz522d1",
            "score": 1,
            "text": "Where they not in OK like 2 days ago? Not sure how long the drive is from there.",
            "title_similarity": "0.45376045",
            "sentiment_compound": -0.6707
        },
        {
            "id": "hz54ppp",
            "score": 1,
            "text": "There's a truck driver shortage",
            "title_similarity": "0.5152439",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz5ab6p",
            "score": 1,
            "text": "They can't afford gas",
            "title_similarity": "0.5424528",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz5bqce",
            "score": 1,
            "text": "As a Canadian I’m jealous",
            "title_similarity": "0.18792562",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hz5d2aa",
            "score": 4,
            "text": "That’s what happens when Russian Bot money dries up to fan the flames.",
            "title_similarity": "0.2802779",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hz5eua5",
            "score": 5,
            "text": "The Russian bots are occupied elsewhere. They have no time for this.",
            "title_similarity": "0.54596835",
            "sentiment_compound": -0.296
        },
        {
            "id": "hz5f4dy",
            "score": 1,
            "text": "Don't these assholes know there is a war on?",
            "title_similarity": "0.353678",
            "sentiment_compound": -0.2091
        },
        {
            "id": "hz5gn81",
            "score": 2,
            "text": "Now they can take down the walls and send home the troops…",
            "title_similarity": "0.2782864",
            "sentiment_compound": 0.0
        },
        {
            "id": "hz5juns",
            "score": 3,
            "text": "Good.\n\nDon't wanna wear a mask?\n\nFine.\n\nSTFU about it",
            "title_similarity": "0.30768144",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hz5rkwh",
            "score": 6,
            "text": "Maybe a lack of funding now that Russian banks are off the menu?",
            "title_similarity": "0.5900127",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz62hbh",
            "score": 2,
            "text": "This is my favorite news story this year",
            "title_similarity": "0.18787238",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hz63gqw",
            "score": 1,
            "text": "\"What if we gave a bore, and nobody came?\"",
            "title_similarity": "0.49302107",
            "sentiment_compound": -0.25
        },
        {
            "id": "hz6hdf8",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.27146727"
        },
        {
            "id": "hz6ibpm",
            "score": 4,
            "text": "Maybe that 40km traffic jam north of Kyiv is Freedum Truckers who got confused when Ukrainians switched direction signs.",
            "title_similarity": "0.5944352",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hz6lpax",
            "score": 2,
            "text": "I'm no fan of these privileged idiots wasting everyone's time with their petty whining, but this story is pretty dishonest. The convoy hasn't even reached DC yet.",
            "title_similarity": "0.6434891",
            "sentiment_compound": -0.5307
        },
        {
            "id": "hz76hdl",
            "score": 5,
            "text": "They must have accidentally went to  Washington DC Total Landscaping",
            "title_similarity": "0.56540585",
            "sentiment_compound": -0.34
        },
        {
            "id": "hzadein",
            "score": 2,
            "text": "did their funding suddenly run out?",
            "title_similarity": "0.35867572",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzcuebw",
            "score": 1,
            "text": "They at least made it to Indiana. I saw some when I noticed a bunch of Canadian flags flying when I was at the park with my kid. Then the next day, my wife got stuck in traffic in Indianapolis when she was the people's convoy going through. She had no idea of it and got really confused at a huge number of trucks going 30 in a 55-65mph zone.",
            "title_similarity": "0.62471014",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hzs8abp",
            "score": 1,
            "text": "Seriously though - what are they protesting ? \nThere are no vaccine mandates anywhere in the US? \nIt’s just so crazy.",
            "title_similarity": "0.6999756",
            "sentiment_compound": -0.8472
        }
    ]
}