{
    "Family of Emmett Till want woman who made false accusation to be charged with murder for 1955 lynching\n": [
        {
            "id": "i0ewa2h",
            "score": 1,
            "text": "This issue generates a lot of passion and anger, but calls for violence -- even in response to other violence -- are against the rules of the subreddit. This thread has been locked.",
            "title_similarity": "0.41633725",
            "sentiment_compound": -0.928
        },
        {
            "id": "i0ddu47",
            "score": -2,
            "text": "I wish. The fact that she actually admitted to it boggles the mind. She fucking KNOWS that no one in her vile white supremacist community will ever think badly of her. Makes me wish I believed in hell.",
            "title_similarity": "0.53810334",
            "sentiment_compound": -0.8387
        },
        {
            "id": "i0dbhfw",
            "score": 6,
            "text": "I fully support this message.",
            "title_similarity": "-0.1482713",
            "sentiment_compound": 0.4576
        },
        {
            "id": "i0dcjyt",
            "score": -25,
            "text": "I agree with this. She needs to be charged with SOMETHING.\n\nWhat IS it with this Western world allowing false accusers to go free with no repercussions?!",
            "title_similarity": "0.36775178",
            "sentiment_compound": 0.4753
        },
        {
            "id": "i0dsomj",
            "score": 2,
            "text": "The amount of excuses and attitude of \"oh she's just an old lady\" and \"well she didn't *actually* assault Emmett Till\" is absolutely vomit inducing.\n\nI have had it with racists and willfully ignorant people.",
            "title_similarity": "0.617092",
            "sentiment_compound": -0.1098
        },
        {
            "id": "i0db62p",
            "score": 22,
            "text": "Yeah fuck that rotten old bitch who caused it.",
            "title_similarity": "0.49314332",
            "sentiment_compound": -0.8555
        },
        {
            "id": "i0ddmx8",
            "score": 26,
            "text": "This nasty woman who caused the death of a 14-year-old boy who had so much to live for definitely needs to be charged for making that false accusation. I don't care if she is an elderly person, that old dirtbag needs to be punished",
            "title_similarity": "0.7164228",
            "sentiment_compound": -0.9221
        },
        {
            "id": "i0dpf9t",
            "score": 3,
            "text": "Rightly so. She’s a racist liar who caused the death of a child.",
            "title_similarity": "0.6495781",
            "sentiment_compound": -0.9042
        },
        {
            "id": "i0deqin",
            "score": 64,
            "text": "This is no different than when someone finds an old man quietly living out his days on some remote farm. And you learn he was a guard at a nazi death camp. I don’t care if he’s 90, nearly blind, and trembling with age and weakness, he must face justice.\n\nSame applies to Emmet Till’s accuser.",
            "title_similarity": "0.48384124",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i0dd8s0",
            "score": -12,
            "text": "I'm really of two minds on this one first and foremost one should always be held accountable for ones actions\n\nbut\n\nIt's thought that due to his apparent lack of remorse and general behavior to everyone that Roy Bryant was a psychopath. If this is true it makes me question the idea of blaming her.\n\nThinking on that women in the 50's really didn't have much recourse in dealing with this type of person and murder has to have an intent to kill. If her intent was self preservation would it be murder? I don't think it would be.\n\nWhat do you guys think?",
            "title_similarity": "0.6770147",
            "sentiment_compound": -0.9837
        },
        {
            "id": "i0dkz4o",
            "score": -3,
            "text": "She told a lie back then. But she didn't commit the murder.",
            "title_similarity": "0.4188524",
            "sentiment_compound": 0.5824
        },
        {
            "id": "i0dchu8",
            "score": 37,
            "text": "Absolutely. ANYONE who makes false accusations about rape, sexual assault, hate crimes, etc needs to be held to the same maximum penalty the accused faced. Fuck em. This is the only way this nonsense stops.",
            "title_similarity": "0.5322541",
            "sentiment_compound": -0.9797
        },
        {
            "id": "i0dg55i",
            "score": 12,
            "text": "This woman is a monster",
            "title_similarity": "0.41797632",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dhpg3",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.01834043"
        },
        {
            "id": "i0di42h",
            "score": -5,
            "text": "Racist bitch should be in prison.",
            "title_similarity": "0.5979303",
            "sentiment_compound": -0.9022
        },
        {
            "id": "i0e8okg",
            "score": -2,
            "text": "Sad, but I wouldn’t charge her with murder.  This may just be a publicity stunt from the Till family.",
            "title_similarity": "0.43285933",
            "sentiment_compound": -0.8625
        },
        {
            "id": "i0drk26",
            "score": 0,
            "text": "Did she kill him? No. So it’s not murder. You can charge her with false accusations. She can share a cell with Jussi",
            "title_similarity": "0.5963673",
            "sentiment_compound": -0.2019
        },
        {
            "id": "i0dp5y3",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.01834043"
        },
        {
            "id": "i0ekba4",
            "score": -1,
            "text": "Many of you have no concept of the Statute of Limitations. Or Ex Post Facto law. \n\nWishing for something to be true does not make it factual.",
            "title_similarity": "0.1721676",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i0en6bq",
            "score": 0,
            "text": "I don't know the story but considering it was the 1950s, I doubt she was the ring leader. Its like blaming the young girls for the Salem witch trials. Might as well put the US government on trial too.",
            "title_similarity": "0.7636026",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i0dbwvb",
            "score": 62,
            "text": "Morally, she was guilty of murder.  She absolutely must have known what would happen if she said Emmett Till flirted with her. But legally?  I’m not so sure.\n\nShe told a lie that other people acted on.  She wasn’t in charge of them.  She didn’t  pay them. \n\nI think you’d have a good civil case for wrongful death. But for a criminal case I think you’d need her to do more than lie.  She’d have to be the one “ordering the hit”\n\nBut what do I know?  I’m not a lawyer, I just watch them on TV.",
            "title_similarity": "0.7280918",
            "sentiment_compound": -0.9384
        },
        {
            "id": "i0dpcbr",
            "score": 3,
            "text": "The Salem witch trials were one of our first indications that due process was needed in our justice system. It’s appalling that over two centuries later we still can’t get that right. This family deserves justice.",
            "title_similarity": "0.55318224",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i0dort7",
            "score": 1,
            "text": "This is way overdue. The two perps were let go in the 50s by an all-white jury. American women have known for generations that if they want to get rid of a black man all they have to do is make up a complaint. This typically results in lynching. In modern times, the police fulfill that function.",
            "title_similarity": "0.75866157",
            "sentiment_compound": 0.25
        },
        {
            "id": "i0dsqx6",
            "score": -2,
            "text": "I learned about this in school it's horrible but it happend 67 years ago.  And the people involved are probably dead why can't people move one.",
            "title_similarity": "0.58224916",
            "sentiment_compound": -0.8481
        },
        {
            "id": "i0dcsxn",
            "score": 34,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0dl1fe",
            "score": 0,
            "text": "That bitch is still alive?   I thought she died a few years ago.",
            "title_similarity": "0.40019733",
            "sentiment_compound": -0.7003
        },
        {
            "id": "i0emhr3",
            "score": -1,
            "text": "The racist scumbags we think are gone are still here I guess",
            "title_similarity": "0.2971362",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i0dg8b7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0doeq9",
            "score": 9,
            "text": "Imagine being a such subhuman pierce of shit to advocate to hang a 14 year old.",
            "title_similarity": "0.59954935",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i0dd8py",
            "score": 10,
            "text": "I thought she was dead, and made a deathbed confession about her false accusation. Am I mixing something up?",
            "title_similarity": "0.6748408",
            "sentiment_compound": -0.743
        },
        {
            "id": "i0dnskf",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0e92ss",
            "score": 1,
            "text": "The fact she never has even after admitting to lying is an insult to his family. She just got to live her life as if she didn't cause this child to die.\n\nThey want justice because they never got it.",
            "title_similarity": "0.46864346",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i0eem5p",
            "score": 2,
            "text": "Every picture of Emmett Till is a grainy ass black and white picture that looks like it was during the Civil War.\n\nThey want us to believe this is ancient history. It’s not.",
            "title_similarity": "0.5025645",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i0epedf",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0dgysq",
            "score": -5,
            "text": "Shouldn't that be the people who lynched him? She should get a charge for false police report.",
            "title_similarity": "0.7388971",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dig04",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0dpqvx",
            "score": -3,
            "text": "Good. fuck her. Murderous asshole",
            "title_similarity": "0.36629778",
            "sentiment_compound": -0.7003
        },
        {
            "id": "i0dqeml",
            "score": -5,
            "text": "While we’re at it let’s charge all the other women lying about shit to ruin a man’s life.",
            "title_similarity": "0.6364986",
            "sentiment_compound": -0.8957
        },
        {
            "id": "i0dfmdl",
            "score": -5,
            "text": "I hope that justice will be served.",
            "title_similarity": "0.048362575",
            "sentiment_compound": 0.743
        },
        {
            "id": "i0diouj",
            "score": 15,
            "text": "False accusations need to be taken more seriously... My ex falsely accused me of Domestic Violence (I realize the murder is a bigger deal) AND GOT CAUGHT in the interview before trial, and nothing bad happened to her.\n\nI now have to attend DV classes even though she got caught and it's been two years and it's still effecting me in my life, trust with relationships, financially, mentally. I feel like I'm in a box and nobody will listen to me.",
            "title_similarity": "0.68912435",
            "sentiment_compound": -0.7679
        },
        {
            "id": "i0e4x7w",
            "score": 0,
            "text": "Unpopular opinion our society needs to understand women are also capable of committing crimes.",
            "title_similarity": "0.62621",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i0ea2u9",
            "score": 1,
            "text": "I'm fine with this, I hope it sets precedence in the court that if you make a false accusation you're punished hard for it.  Jussie Smolett tried to ruin the lives of two men and will spend 90 days in some country-club.   #MeToo makes false accusations with zero reprocutions.\n\n&#x200B;\n\nI say let's go.  You bear false witness?  Drop the hammer",
            "title_similarity": "0.62821907",
            "sentiment_compound": -0.836
        },
        {
            "id": "i0elnzn",
            "score": -3,
            "text": "They locked up Jessie Smulet ., so yea bust her . Ain’t no statue of limitations on murder.",
            "title_similarity": "0.63759273",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i0emwv9",
            "score": -3,
            "text": "I agree fuck their whole racist bloodline.",
            "title_similarity": "0.44145718",
            "sentiment_compound": -0.7184
        },
        {
            "id": "i0etjnw",
            "score": 2,
            "text": "I want that too, where do I sign?",
            "title_similarity": "0.052656367",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i0dm1sn",
            "score": 3,
            "text": "So… prison and cops ARE justice, now? Hmm",
            "title_similarity": "0.24341115",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i0ejhf5",
            "score": -1,
            "text": "Emmett Till deserves JUSTICE. Even 67 years later, fuck Carolyn Bryant and her entire bloodline",
            "title_similarity": "0.37503606",
            "sentiment_compound": 0.1613
        },
        {
            "id": "i0dtfq4",
            "score": -7,
            "text": "Yes. Please. I think about Emmett Till everyday. I cry for the loss of his life. He and his family need justice.  Hold white lady's who weaponize their white femininity to get innocent children murdered accountable. \n\nHe deserved better\nHis family deserves justice",
            "title_similarity": "0.6880733",
            "sentiment_compound": 0.743
        },
        {
            "id": "i0dgqub",
            "score": 6,
            "text": "Accountability for lying has such a low and at times almost non existence.",
            "title_similarity": "0.10145793",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i0dufvs",
            "score": 13,
            "text": "This is why all these southern states want to ban CRT. Because a lot of these motherfuckers are still alive.",
            "title_similarity": "0.38851827",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i0dgsp3",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0dpvrx",
            "score": 6,
            "text": "She's 88 years old...  I ummm....  I am not sure what this would do?  Vengence?",
            "title_similarity": "0.2213678",
            "sentiment_compound": -0.323
        },
        {
            "id": "i0duozh",
            "score": -2,
            "text": "Old Nazi guards are still put away, so why not this bitch?  She’s had to live with what she did for nearly 70 years.",
            "title_similarity": "0.52184",
            "sentiment_compound": 0.5559
        },
        {
            "id": "i0djqtn",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0dlunn",
            "score": 0,
            "text": "Sounds reasonable to me!",
            "title_similarity": "-0.168659",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dm357",
            "score": 0,
            "text": "Reading the story really made me sick. I hope she pays for it",
            "title_similarity": "0.49317813",
            "sentiment_compound": -0.1689
        },
        {
            "id": "i0e8ope",
            "score": 0,
            "text": "It really took all this time? This is just another example of you know the justice system. It still goes on today",
            "title_similarity": "0.16428508",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i0ea5kn",
            "score": 0,
            "text": "Prosecuting a woman for making accusations she couldn't prove? I'm sure that won't have adverse consequences.",
            "title_similarity": "0.41534048",
            "sentiment_compound": -0.2851
        },
        {
            "id": "i0eg8id",
            "score": 0,
            "text": "The fact that it took until 2021 to make lynching an actual hate crime is pretty disgusting.",
            "title_similarity": "0.5208048",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i0diho6",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0dllu7",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0dilrp",
            "score": 0,
            "text": "True rapists deserve the worst. People who accuse people of the worst deserve even worse. It hurts the people they accuse it hurts future women looking to come forward it hurts the system… she did this in the middle of one of the worst time for racism in the country. She had an idea this COULD happen and she did it anyways to hide herself and blame someone else. She deserves worse then she got…\n\n\nOn the other hand she’s almost dead. Put her face in history books. Make her an example of how racism stick around after slavery",
            "title_similarity": "0.6973449",
            "sentiment_compound": -0.9942
        },
        {
            "id": "i0dwuf8",
            "score": 0,
            "text": "Why she isn’t in jail already?",
            "title_similarity": "0.24728298",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0emrpn",
            "score": 0,
            "text": "Obviously putting something into the history books (even if they’ll be burned) is incredibly important. This would be amazing.",
            "title_similarity": "0.33193594",
            "sentiment_compound": 0.7089
        },
        {
            "id": "i0dja3e",
            "score": 25,
            "text": "She wasn't the one who killed him, so it would be a waste of time and resources.\n\nAnd no one wants to hear it but she was clearly being abused by her husband, the one who actually participated in the killing. That doesn't mean he manipulated her into making the accusation, or that she made it under duress, but it's possible.",
            "title_similarity": "0.5247378",
            "sentiment_compound": -0.9181
        },
        {
            "id": "i0dks69",
            "score": 58,
            "text": "ITT: A bunch of bloodthirsty, enraged individuals hellbent on revenge on someone they're sure deserves just what they're gonna get.\n\nThe wheel goes 'round and 'round.",
            "title_similarity": "0.5692486",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i0e1mpn",
            "score": 5,
            "text": "I feel that every person who ever participated in a lynching to be charged with murder. No exceptions, no excuses.",
            "title_similarity": "0.68957824",
            "sentiment_compound": -0.779
        },
        {
            "id": "i0erxh4",
            "score": 7,
            "text": "fuck that old bitch hope she rots in hell",
            "title_similarity": "0.4985255",
            "sentiment_compound": -0.875
        },
        {
            "id": "i0dllad",
            "score": 12,
            "text": "Is there really enough truthful evidence to spend court time on this?\n\nWhat is justice here? The recognition is important. I'd love for a concrete story to be recognized and this tragedy further validated but what kind of justice can be enacted on an 88 year old woman?\n\nYou going to fine her? Spend the rest of her life in jail instead of at home? Seems cruel. Revenge cruelty is still cruelty. \n\n100% fuck thus lady but the likelihood of her dying before the court case even ends is pretty high. Then what?\n\nComplicated situation",
            "title_similarity": "0.64413166",
            "sentiment_compound": -0.9421
        },
        {
            "id": "i0dkg0a",
            "score": -7,
            "text": "I’d support this measure.\n\nNo necessarily related, but something I’ve been thinking about the last few days:\n\nWith all the videos of PoC getting the cops called on them out of the blue, I’ve noticed it’s usually a white woman calling 911 and telling them ‘there’s a strange black man across the street from my house/car/etc… I feel unsafe.’ I feel like a lot of men wouldn’t make that call, more of a ‘if he directly bothers me I’ll deal with it, otherwise idgaf’ approach.\n\nFrom what I can tell, white women instigate a lot of negative interactions between cops and PoC. My parents definitely told me that was the case growing up, but I didn’t think much about it.\n\nIt’s not a big surprise, but I find it interesting that  in the huge dialogue about race, racial profiling, etc in our country rn this isn’t really acknowledged. I often find the conversation framed as ‘white men’ (cops, white supremacists) abusing PoC. But the role white women play in the day-to-day oppression of PoC as instigators is largely ignored. It just seems like a big gaping hole in the overall discussion. Fortunately I think it’s mostly older people who act this way.",
            "title_similarity": "0.6081454",
            "sentiment_compound": 0.2093
        },
        {
            "id": "i0e90yh",
            "score": 5,
            "text": "Yea fuck that old racist bitch",
            "title_similarity": "0.4555012",
            "sentiment_compound": -0.9062
        },
        {
            "id": "i0dd9xo",
            "score": -15,
            "text": "people who are worried about the jussie smollet case are sure silent on this...",
            "title_similarity": "0.25397015",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i0deove",
            "score": -14,
            "text": "remember this the next time you see someone roll out the old \"women don't lie about rape\" line.",
            "title_similarity": "0.47709954",
            "sentiment_compound": 0.5773
        },
        {
            "id": "i0dkt6t",
            "score": -13,
            "text": "This is the shit CRT critics are trying to suppress.",
            "title_similarity": "0.35471487",
            "sentiment_compound": 0.8402
        },
        {
            "id": "i0ds39a",
            "score": -5,
            "text": "100% should be. Massacred a child for false accusations, the men and mens family that did that to him should also be charged.",
            "title_similarity": "0.66588795",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i0duiw8",
            "score": -6,
            "text": "I would absolutely support people being charged with the crime they falsely accused others of.",
            "title_similarity": "0.46297362",
            "sentiment_compound": -0.5434
        },
        {
            "id": "i0en96u",
            "score": -5,
            "text": "I don’t see what good that will do to argue to charge her with murder. Seems pretty obvious that she ordered her husband to do it. Even if that makes her culpable, there is still no direct evidence of her involvement which is, ya know, how the legal system works. You need evidence. Even with evidence in this case there wouldn’t be enough to charge her with murder.\n\nTo go even further, I don’t see how charging a non-murderer with murder would make sense when the crime happened at a time that is closer to 1889 than it is to today.",
            "title_similarity": "0.6155448",
            "sentiment_compound": -0.9485
        },
        {
            "id": "i0dsvt9",
            "score": -3,
            "text": "Lock that old bitch up",
            "title_similarity": "0.4519476",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i0dww8u",
            "score": -2,
            "text": "I’ve always thought she should be convicted and in prison! She admitted to it!",
            "title_similarity": "0.57714707",
            "sentiment_compound": -0.5399
        },
        {
            "id": "i0dhhiy",
            "score": -6,
            "text": "This woman is not a monster but a product of her time her actions aren’t that of a monster that implies that it’s beastial in nature. \nWhat she did her actions and the subsequent silence was an act of pure evil, there is no other way to explain it.",
            "title_similarity": "0.34543794",
            "sentiment_compound": -0.872
        },
        {
            "id": "i0dg0gf",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.01834043"
        },
        {
            "id": "i0dd82b",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.01834043"
        },
        {
            "id": "i0dk8nc",
            "score": -3,
            "text": "Shocking that charges haven’t been laid against this woman after so much time has past.",
            "title_similarity": "0.33761573",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i0e7611",
            "score": -4,
            "text": "100% this needs to happen. All people who falsely accuse need to be charged from now on.",
            "title_similarity": "0.40149885",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i0e4iv2",
            "score": 1,
            "text": "Better late than never. It's a shame she has gotten to live so much time without facing repercussion for being directly responsible for the death a 14 year old boy.",
            "title_similarity": "0.4895801",
            "sentiment_compound": 0.4318
        },
        {
            "id": "i0ecae0",
            "score": 2,
            "text": "She is foul, and I have no doubt that if there is a hell she will burn in it, but I don’t see how she could be convicted of anything at this point. A grand jury already declined to charge her 15 years ago.  \n\nMy guess is this: she was scared shitless of her obviously violent husband. He asks her if this happened. (By most reports, she is not the one who told him about the incident, whatever it entailed, but he heard about it from a third party.) Or it’s entirely possible that she knew and didn’t care, or supported her husband’s actions entirely. Perhaps any initial reluctance to tell him it was out of concerned that he might get into trouble with the law.  \n\nBut at a rate, either she’s okay with this, or she’s not smart enough or brave enough to deny it, or refuse to identify Emmett, or warn his family or go to the cops. And it’s very possible that in that day and age, none of those would have made a difference.\n\nSo she tells him what happened, maybe hoping he’s just going to scare the crap out of Emmett, or beat him. (In an interview with Look, the men involved basically indicated that was their original intent, but Emmett wouldn’t back down and didn’t “know his place.”) Or again, maybe she was fine with lynching. \n\nInstead, her husband kills this child, and then instead of it just going away like all the other lynchings, it ends up on the national news and then her husband is on trial for murder. She is worried about her reputation or her future or her husband, it all three, and she doesn’t have the character to say that her husband did it, or to tell the truth about the whole thing, so she plays along and still hopes it will go away. And it does, kind of, when he’s acquitted. \n\nIt is not in any way defensible, but it is imaginable that a 21 year old woman in what was likely an abusive marriage decided to sacrifice Emmett to save her own ass. Or maybe she’s a monster. \n\nIn any event, she’s also had decades to apologize and to tell the full story and has refused to do that as well. And that is very literally the least she could’ve done.",
            "title_similarity": "0.6667267",
            "sentiment_compound": -0.748
        },
        {
            "id": "i0ei51k",
            "score": 2,
            "text": "That fucking cunt is still breathing?",
            "title_similarity": "0.0037377654",
            "sentiment_compound": -0.5413
        },
        {
            "id": "i0dwlcf",
            "score": 8,
            "text": "As sad as this story is, I think that trying that woman for murder would be an example of retribution divorced from justice. \n\nWomen in her day had little input over what men in their lives did. I have a hard time laying responsibility for his death on her feet - though she was arguably indirectly responsible. I say this because there are other people who are directly responsible, and it is likely that they acted on their own prejudices and insecurities rather than at her will. \n\nI don't think anyone is going to feel any better with a 90 year old woman being put away, even if they think they might now. \n\nCondolences to the family. I hope they find peace in the impact that Emmett's death had on the world and continue to lead lives filled with whatever happiness they can cultivate now and for generations to come.",
            "title_similarity": "0.6958579",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i0dbfwi",
            "score": -22,
            "text": "[removed]",
            "title_similarity": "0.01834043"
        },
        {
            "id": "i0dcuat",
            "score": -8,
            "text": "I would also like to see this.",
            "title_similarity": "-0.047835097",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i0df1dn",
            "score": -8,
            "text": "That’s reasonable in my opinion, she did kill him.",
            "title_similarity": "0.52909124",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i0dfd7g",
            "score": -11,
            "text": "That sounds perfectly reasonable.",
            "title_similarity": "-0.21871907",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i0dh63b",
            "score": -9,
            "text": "Charge them all and her, too.",
            "title_similarity": "0.22456285",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0diriy",
            "score": -9,
            "text": "Women can do dumb shit for attention.  So can men of course, but my experience that’s related to this is with women.\n\nFor the longest time my wife would tell me all these various stories of guys telling her how pretty she is or hitting on her.  It was nearly every day. I never really believed them because it was so frequent.  And though she is very pretty, it just didn’t make sense.\n\nWhen we were young and in high school together I think she would say these things to get me riled up about another guy.\n\nShe also has a huge self esteem problem and can’t get enough confirmation from me.  So figured that’s where it came from.  I never fed into it, even as a youngster.\n\nI noticed it went away after she started seeing a psychologist.",
            "title_similarity": "0.5481192",
            "sentiment_compound": 0.7175
        },
        {
            "id": "i0dkql8",
            "score": -8,
            "text": "Woman lying about men doing things to them, I guess nothing change . This is what makes “believe all woman” skeptical . We need to always have proof instead of believing someone because of their gender.",
            "title_similarity": "0.53028995",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i0ds17x",
            "score": 4,
            "text": "How about instead of the woman, charge the men who actually did the murdering?",
            "title_similarity": "0.66677636",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i0dn5dv",
            "score": 2,
            "text": "Don’t think she should be charged with murder but definitely some kind of serious charge",
            "title_similarity": "0.475659",
            "sentiment_compound": -0.1505
        },
        {
            "id": "i0dq7d8",
            "score": 0,
            "text": "Hey, if it brings them peace, I don’t see why not?",
            "title_similarity": "-0.013555266",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i0dvezl",
            "score": 0,
            "text": "Lady should’ve been charged with lying to police and perjury long ago, but statue of limitations have long expired\n\nHowever, I don’t see how you can charge her with murder",
            "title_similarity": "0.6951712",
            "sentiment_compound": -0.9022
        },
        {
            "id": "i0dvu71",
            "score": 1,
            "text": "Yeah, obviously. Give me news when she is actually convicted.",
            "title_similarity": "0.5431633",
            "sentiment_compound": 0.296
        },
        {
            "id": "i0e3tak",
            "score": 0,
            "text": "I think it's wildly disgusting that she hasn't been charged yet. She's just as guilty of murdering that child as the men that laid hands on him.",
            "title_similarity": "0.70367223",
            "sentiment_compound": -0.8723
        },
        {
            "id": "i0e44od",
            "score": 2,
            "text": "Why not. The FBI still digs around for Hoffa. Nazi  camp guards are still charged. She needs to be charged no matter how old the case is.",
            "title_similarity": "0.63472235",
            "sentiment_compound": -0.3968
        },
        {
            "id": "i0e50oy",
            "score": -1,
            "text": "As she should. She is a murderer. Even if she was dead she should be. Justice needs to be served",
            "title_similarity": "0.6288992",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i0e5z0t",
            "score": 0,
            "text": "This isn't even going to be justice.   That miserable bitch got to live a full life and didnt even care her husband brutally murdered a 14 year old kid",
            "title_similarity": "0.6410004",
            "sentiment_compound": -0.9396
        },
        {
            "id": "i0e6h5m",
            "score": 0,
            "text": "She should be. That false accusation led directly to the atrocity which was Emmett Tills death.",
            "title_similarity": "0.6034461",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i0e7ei7",
            "score": -1,
            "text": "Why was she never charged all this time? Did KKK protect her?",
            "title_similarity": "0.25108933",
            "sentiment_compound": 0.5502
        },
        {
            "id": "i0ebs1e",
            "score": 3,
            "text": "A beautiful young boy was killed in a horrific way. It is a tragedy. But this woman did not kill him. Which is why is was investigate three times and no charges were filed.",
            "title_similarity": "0.54592395",
            "sentiment_compound": 0.3875
        },
        {
            "id": "i0ect37",
            "score": 1,
            "text": "Anybody who makes up a criminal accusation that gets somebody arrested or killed should automatically get the same punishment.",
            "title_similarity": "0.52022433",
            "sentiment_compound": -0.9451
        },
        {
            "id": "i0elvwr",
            "score": 1,
            "text": "I’ll sign off on that",
            "title_similarity": "-0.06339038",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dovou",
            "score": 7,
            "text": "The story and timeline of events are a mess. My theory is some kind of whistling happened outside the store and Bryant got all worked up about it initially. Perhaps she told a few people about what happened or there were other white bystanders who fueled the outrage. Till's doom was not determined immediately. It is said she did not tell her husband of the incident immediately out of fear he would kill Till. \n\nI think this was the town rumor mill working overdrive over four days. The racists also worked themselves into a frenzy and determined that something had to happen. \n\nIn her trial testimony, I believe Bryant lied about having been touched by Till to fuel a certain narrative (Till's father had problems with abusing women which ultimately may have led to his execution during WW2).",
            "title_similarity": "0.6989578",
            "sentiment_compound": -0.9799
        },
        {
            "id": "i0dnkt4",
            "score": -7,
            "text": "The penalty for false accusation should be *twice as bad* as the penalty for committing the crime.",
            "title_similarity": "0.5010128",
            "sentiment_compound": -0.9287
        },
        {
            "id": "i0dothb",
            "score": 0,
            "text": "There are no words to describe what the devil should do with her soul.",
            "title_similarity": "0.33625358",
            "sentiment_compound": -0.765
        },
        {
            "id": "i0dro1q",
            "score": 0,
            "text": "Anyone that falsely accuses anyone of serious crime is utter, utter pathetic scum.",
            "title_similarity": "0.41835308",
            "sentiment_compound": -0.8878
        },
        {
            "id": "i0e65bi",
            "score": 0,
            "text": "The bitch is still alive!??",
            "title_similarity": "0.036685154",
            "sentiment_compound": -0.4314
        },
        {
            "id": "i0e88p9",
            "score": 0,
            "text": "She will never be charged. I don't know why anyone is entertaining this.",
            "title_similarity": "0.1090818",
            "sentiment_compound": 0.5411
        },
        {
            "id": "i0dliew",
            "score": 22,
            "text": "Ever since I was a child I have always thought this....knowing what we know now why have these people not have been identified charged or atleast pointed out and confronted like \"we know who you are\" kind of fashion! Civil RIGHTS AND HIS STORY WERE MANDITORY TO KNOW INSIDE AND OUT IN MY HOUSE. AND MRS TILL IS PROBABLY ONE OF THE STRONGEST AND SMARTEST PEOPLE IN CIVIL RIGHTS HISTORY FOR DOING WHAT SHE DID! in most situations where a person is disfigured to the point Emmitt was a closed casket is almost forced by funeral homes and tradition. But by her saying NO! Open the casket and show everyone what they did to my boy she became a catalyst in the Civil Rights Movement. That way they could not put a neat lid on the situation and sweep it under the rug. Know your history. And please stand against the people who want to remove Emmett Till's story and any other events from history books teachings or curriculum because it might make any such people \"uncomfortable\".",
            "title_similarity": "0.57860315",
            "sentiment_compound": -0.3474
        },
        {
            "id": "i0e1ecy",
            "score": -3,
            "text": "That lady deserves to rot in jail. What she did was pure evil.",
            "title_similarity": "0.5755005",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i0ek73c",
            "score": 3,
            "text": "I’ve seen below in the comments others asking how can grown men do this. This is how: through identity politics. \n\nPrimarily seeing what group someone is apart of, rather than realizing the sovereign individual that is there before your eyes. Identity politics emphasizes separateness, and Otherness. It is insanity, because we are all One. \n\nIn our modern era we are closer to identity politics than ever. It is at the heart of the culture war.",
            "title_similarity": "0.38729247",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i0dto28",
            "score": -7,
            "text": "Mad assholes in these comments, the women admitted to lying about it years later this was a child stripped of his life and brutally beat because of A LIE. That’s a fucked up thing. Imagine someone lying about your kid doing something and then going through what he did and then 70 years later the person trying to “make things right” in their death bed admitting that they made that shit up regardless of how long ago that was that would reopen the wounds of your pain. SHE SHOULD BE CHARGED.",
            "title_similarity": "0.71614933",
            "sentiment_compound": -0.9883
        },
        {
            "id": "i0dl2st",
            "score": 9,
            "text": "As a Mississippian I agree. People act like this is ancient history. \n\nThese people are still alive.",
            "title_similarity": "0.12783767",
            "sentiment_compound": 0.765
        },
        {
            "id": "i0e0rlh",
            "score": 12,
            "text": "So all she did was lie about the flirting (probably) and her husband did everything else on his own?\n\nSorry, there is no world in which that's even a lesser charge, let alone murder.\n\nCan't bend the rules of the justice system just because someone is a disgusting person. Being evil is not inherently illegal.",
            "title_similarity": "0.50244963",
            "sentiment_compound": -0.8713
        },
        {
            "id": "i0di0ew",
            "score": -1,
            "text": "There should be a #themtoo movement where people who caused the death of someone due to their casual racism are properly taken to task",
            "title_similarity": "0.5800716",
            "sentiment_compound": -0.802
        },
        {
            "id": "i0e04qb",
            "score": 3,
            "text": "Assuming she's still alive (which from the article seems to be in question) she's pushing ninety.  She should have been convicted for what she did years ago, but I'm not sure there's much point now.  Justice?  There's no justice to be had here, not anymore.  He's dead and she lived her life as a free woman.   That was unjust and it can't be changed.  Revenge on an octogenarian for something that happened so long ago, she probably doesn't even remember the true events anymore?  Seems hollow, and I don't really want the law to be in the business of revenge anyway.  Public safety?  It seems unlikely that she needs to be restrained to prevent a repeat incident.  Calling public attention to how unjust what happened to him was?  Normally I'd agree with this one, but... it's 2022, I suspect the story would get buried.\n\nI don't know what kind of prison you put an 87 year old woman in, but it's probably not much different from a cheap nursing home.  (Except that it's expensive, and paid for by the state.)  If Till's family wants her there, I'm not going to object, she deserves it.  But I think we're long past the point where it would truly matter.",
            "title_similarity": "0.5691947",
            "sentiment_compound": 0.7895
        },
        {
            "id": "i0e8sa1",
            "score": 3,
            "text": "Murder doesnt seem appropriate. She should certainly be punished for her role but murders an over reach. Maybe some degree of manslaughter? Pretty much anything else is beyond statutory limitations.",
            "title_similarity": "0.660995",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i0ebgif",
            "score": 1,
            "text": "Well, she’s white so… I wonder how many other black people have been murdered due to the words of white women and their daddies.",
            "title_similarity": "0.6803586",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i0ec0ln",
            "score": 2,
            "text": "That woman, Carolyn Bryant, is 87 and still living. Meanwhile Emmett Till died 66 years ago but would be  80 if he were still alive. If we can hunt down the last remaining Nazi war criminals and bring them to justice, we should be able to bring Carolyn Bryant to justice as well. Hopefully she gets a taste of the horror and trauma inflicted on Emmett Till and his family and spends the last days of her life in a prison cell.",
            "title_similarity": "0.63899744",
            "sentiment_compound": -0.8442
        },
        {
            "id": "i0dlw88",
            "score": -6,
            "text": "She should be. No statute of limitations on murder and she herself admits she made the whole thing up",
            "title_similarity": "0.39343613",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i0dvei2",
            "score": -4,
            "text": "that woman was and is a monster",
            "title_similarity": "0.4677648",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0e084h",
            "score": -4,
            "text": "Bitch still alive? Fuck it no voting for people over 75 unless you can prove you weren't a racist lead paint eating piece of shit.",
            "title_similarity": "0.533043",
            "sentiment_compound": -0.8063
        },
        {
            "id": "i0dy3z9",
            "score": 17,
            "text": "She's guilty of ~~filing a false police report~~ making false statements but she's not responsible for his lynching. That's on the men that performed the lynching.",
            "title_similarity": "0.63652533",
            "sentiment_compound": -0.5176
        },
        {
            "id": "i0doi0e",
            "score": 20,
            "text": "[removed]",
            "title_similarity": "0.01834043"
        },
        {
            "id": "i0esqc8",
            "score": 16,
            "text": "There is no statute of limitations on murder, and this woman helped to cause one. She should already be in jail.",
            "title_similarity": "0.46927813",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i0ew8y0",
            "score": 19,
            "text": "All people proven false accusers should have the same sentence the falsely accused could have/was given plus a charge of false imprisonment.",
            "title_similarity": "0.45638925",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i0dgbrd",
            "score": -10,
            "text": "She, and all the other co-conspirators, should *all* be charged with first degree murder.",
            "title_similarity": "0.7686613",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i0ervxy",
            "score": 8,
            "text": "Why did they wait this long, they should have done this at least 15 years ago. Well it never too late for justice.",
            "title_similarity": "0.30257732",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i0dek7n",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.07452115"
        },
        {
            "id": "i0dd1kt",
            "score": 4,
            "text": "To Kill A Mockingbird :(",
            "title_similarity": "0.56219864",
            "sentiment_compound": -0.8225
        },
        {
            "id": "i0dku7g",
            "score": -6,
            "text": "I totally agree.  She should be charged with murder and those around her should be charged as accomplices.",
            "title_similarity": "0.68896925",
            "sentiment_compound": -0.6712
        },
        {
            "id": "i0dp9r2",
            "score": -5,
            "text": "Every person who knowingly makes a false claim against someone should go to prison for the maximum amount of time that their victim could have.",
            "title_similarity": "0.52942705",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i0epzkv",
            "score": 7,
            "text": "She owes some money to that family too.",
            "title_similarity": "0.34934783",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dhmsf",
            "score": -8,
            "text": "She’s still alive? Yea, let her die in prison",
            "title_similarity": "0.34479403",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i0dl4kp",
            "score": 5,
            "text": "Source that she made a false accusation? Not challenging it but I think it would be an interesting read. I want to see how likely she'll be convicted if this case goes on trial.",
            "title_similarity": "0.54541314",
            "sentiment_compound": 0.507
        },
        {
            "id": "i0dn8a8",
            "score": 1,
            "text": "Learnt about this story from Dave Chappelle\n\nIt's crazy how inhumane humans can really be",
            "title_similarity": "0.37401378",
            "sentiment_compound": -0.34
        },
        {
            "id": "i0dq7qz",
            "score": -1,
            "text": "Arrest her like the hiding n zis",
            "title_similarity": "0.5618847",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i0dtrgg",
            "score": -1,
            "text": "I wonder what r/conservative thinks about this",
            "title_similarity": "0.19321077",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dvym2",
            "score": -1,
            "text": "She should be in jail.",
            "title_similarity": "0.403309",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dwdb1",
            "score": 1,
            "text": "Good on them\nI hope they bleed that family dry",
            "title_similarity": "0.38222402",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i0dwfnu",
            "score": 1,
            "text": "As well she fucking should be, the rotten fucking bitch.",
            "title_similarity": "0.43293476",
            "sentiment_compound": -0.7425
        },
        {
            "id": "i0e29n8",
            "score": 1,
            "text": "I’m not opposed to her going to jail but I would really like know know why it would be a benefit. She is 88 years old, and will likely croak soon. I’m just under the impression that putting a nearly 90 year old woman in prison would be a waste of money on all ends. Maybe a psych ward would be better",
            "title_similarity": "0.5429522",
            "sentiment_compound": 0.6946
        },
        {
            "id": "i0e2zft",
            "score": 1,
            "text": "Well shes almost dead anyways. Whats charging an 81 year old gonna do. Tax our legal system more. Pay for her Retirement home and save her family money",
            "title_similarity": "0.5581838",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i0e4v2a",
            "score": -1,
            "text": "This bug eyed POS was quite clearly lying to cover for something else.",
            "title_similarity": "0.3070863",
            "sentiment_compound": -0.1742
        },
        {
            "id": "i0e6eqt",
            "score": -1,
            "text": "That old fucking lady should spend the rest of her unearned life in a cell and their family should be forced to pay restitution to Till’s family. They stole a young boys life and ADMITTED to it. I lose my mind every time this story comes up.",
            "title_similarity": "0.6395912",
            "sentiment_compound": -0.6081
        },
        {
            "id": "i0e8iux",
            "score": 1,
            "text": "Let her die in prison.",
            "title_similarity": "0.420416",
            "sentiment_compound": -0.802
        },
        {
            "id": "i0e9lvi",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0ea6jn",
            "score": -1,
            "text": "Yep, totally agree. She made a false accusation that led to a murder",
            "title_similarity": "0.6922933",
            "sentiment_compound": -0.4033
        },
        {
            "id": "i0eab3c",
            "score": 1,
            "text": "This is this the conservative history that conservatives want to hide.",
            "title_similarity": "0.34596428",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i0efcl0",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0ek6v6",
            "score": 1,
            "text": "Get the monster a wheelchair and bring her ass to court.",
            "title_similarity": "0.5699122",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i0esvlj",
            "score": 1,
            "text": "Anyone here that knows the law to address if this is even possible or the likelihood?  Not just a murder charge (though that seems unlikely?) but any charges this long after a closed case? I didn't see anything in the article.",
            "title_similarity": "0.44124576",
            "sentiment_compound": -0.2074
        },
        {
            "id": "i0e46fy",
            "score": 26,
            "text": "People in this thread who actually think she's legally guilty of this are braindead.",
            "title_similarity": "0.5197769",
            "sentiment_compound": -0.34
        },
        {
            "id": "i0do6ul",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0enh0j",
            "score": 14,
            "text": "If we can charge concentration camp guards in their 80s and 90s, this doesn’t seem unreasonable.",
            "title_similarity": "0.24551299",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0eryiz",
            "score": 13,
            "text": "Good. Put that awful piece of shit and jail and send her to hell for dessert.",
            "title_similarity": "0.5493448",
            "sentiment_compound": -0.8519
        },
        {
            "id": "i0dia4u",
            "score": -4,
            "text": "This should 100% happen.",
            "title_similarity": "-0.06628263",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dikc0",
            "score": -2,
            "text": "Let us line up to hit her face with a bag of quarters.",
            "title_similarity": "0.39819196",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0djwsh",
            "score": -4,
            "text": "I think she might be dead.\n\nWhat they should do is dig up their bodies and toss them in the ocean.  They *admitted* they were guilty after the jury let them off.\n\nPeople like that don't deserve a respectable grave.  They get tossed in the ocean and forgotten about",
            "title_similarity": "0.61642957",
            "sentiment_compound": -0.8781
        },
        {
            "id": "i0drwdl",
            "score": -5,
            "text": "Good she should be charged, she got a child killed so I have no problem with her having no peace for what remains of her life",
            "title_similarity": "0.64123213",
            "sentiment_compound": -0.5759
        },
        {
            "id": "i0dunxv",
            "score": -3,
            "text": "I read enough of the article to see what was going on.\n\nShe told her boyfriend Emmett Till grabbed her and made sexual advances.\n\nI do not think that constitutes grounds for convicting her of anything let alone murder. We all lie for all kinds of reasons. Hers sounds like an especially vile lie designed to get a black guy beat up by her boyfriend. Which her boyfriend then did. So, maybe I was wrong, complicit in assault. At best.\n\nLater Emmett was lynched and killed. I didn't read the details of it. I didn't want to.\n\n&#x200B;\n\nSo while this lady sounds morally repugnant I don't think she committed any crime. Except maybe accessory to assault if that even is a thing.\n\n&#x200B;\n\nP.S. This is the world that Trump and his kind are trying to return us to. Vote in every election you can and do your part to stop it.",
            "title_similarity": "0.7234894",
            "sentiment_compound": -0.9748
        },
        {
            "id": "i0dncn2",
            "score": 11,
            "text": "How about something realistic instead?",
            "title_similarity": "-0.08998595",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0en0la",
            "score": 8,
            "text": "I mean she didn’t murder him, not in the legal sense. This would be a huge waste of money, she would be acquitted in ten minutes.",
            "title_similarity": "0.46868593",
            "sentiment_compound": -0.6778
        },
        {
            "id": "i0djg5t",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0dfzvb",
            "score": -4,
            "text": "Is anyone else pleasantly surprised at how far humanity has come in just a few decades? Seriously, racism like this has been around for centuries and it's being addressed & will be overcome within decades.\n\nNow if we could only stop puppy mills, especially in the number one puppy mill state of Missouri ..",
            "title_similarity": "0.53636473",
            "sentiment_compound": 0.0164
        },
        {
            "id": "i0dhhpv",
            "score": -4,
            "text": "It’s the very least of what she deserves",
            "title_similarity": "0.11316753",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dhqm4",
            "score": -6,
            "text": "I’ve always been flummoxed as to why they let her skate after muttering that the accusations weren’t true. Who GAF if she’s 90?",
            "title_similarity": "0.48546016",
            "sentiment_compound": 0.128
        },
        {
            "id": "i0di6mq",
            "score": -5,
            "text": "Why hasn't she been charged",
            "title_similarity": "0.24455601",
            "sentiment_compound": 0.1511
        },
        {
            "id": "i0erqv5",
            "score": 4,
            "text": "As she should have been",
            "title_similarity": "0.062474735",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0diwhx",
            "score": 0,
            "text": "I'm here for it. Everyone still alive who played a role or assisted with this getting muddied up should be held accountable.",
            "title_similarity": "0.22123247",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i0dkw57",
            "score": 0,
            "text": "I want the woman charged as well",
            "title_similarity": "0.33836216",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i0dmht1",
            "score": 3,
            "text": "Would be more symbolic than anything else seeing as she’s 88 years old now. There wouldn’t really be any sense of justice seeing as she’s probably going to die soon anyways. You’d also have a hard time pinning her for murder for a false allegation. The people who did the lynching, sure. At best she’s an accessory to murder as she didn’t do any of the killing herself",
            "title_similarity": "0.6747513",
            "sentiment_compound": -0.8807
        },
        {
            "id": "i0dnjnu",
            "score": -3,
            "text": "I’m so tired of this story. Was shown the picture in middle school by a teacher… so traumatizing. Just to be an adult now w/ NO updates to the case.",
            "title_similarity": "0.5255132",
            "sentiment_compound": -0.8851
        },
        {
            "id": "i0dnpr0",
            "score": -2,
            "text": "Seems like a no-brainer. Try her up.",
            "title_similarity": "0.15557128",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i0do28t",
            "score": -3,
            "text": "Do it.  If your lies are getting people killed there should be SEVERE consequences.",
            "title_similarity": "0.5271387",
            "sentiment_compound": -0.8918
        },
        {
            "id": "i0drzph",
            "score": -2,
            "text": "I agree send that old bitch to jail.",
            "title_similarity": "0.5507047",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i0ds3gm",
            "score": 1,
            "text": "And the fact that this is still being done today...",
            "title_similarity": "-0.13495848",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0e2s6q",
            "score": 1,
            "text": "FINALLY!!!!! Carolyn Bryant or whatever she is currently named needs to directly atone for her role in Emmett Till’s violent violent murder. I do t even care what criminal conviction might happen, I just want this woman to be forced out of hiding and to defend her actions to the Till family and the public at large. Let the world understand how “ordinary” nice women can simultaneously be racist monsters.",
            "title_similarity": "0.7527009",
            "sentiment_compound": -0.9681
        },
        {
            "id": "i0e4gxi",
            "score": 3,
            "text": "I’m late for the crocodile tears and how she is sorry and will get off with nothing?",
            "title_similarity": "0.47372055",
            "sentiment_compound": -0.296
        },
        {
            "id": "i0e5gob",
            "score": -1,
            "text": "My take is she cheated on her husband and made this story up to cover up the infidelity. She has no shame",
            "title_similarity": "0.6501063",
            "sentiment_compound": -0.1891
        },
        {
            "id": "i0e636b",
            "score": 3,
            "text": "How would you charge her with murder? Did she even tell her husband to kill him or just told him that he flirted with her?",
            "title_similarity": "0.7798734",
            "sentiment_compound": -0.8992
        },
        {
            "id": "i0e9w40",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0ec7ms",
            "score": 2,
            "text": "Myself I don't think from what all I just read in that article that it was premeditated so murder itself for her I can't feasibily see. The ones that committed it definitely they should be charged with murder. Her tho I can see manslaughter charge sticking beings again I don't see premeditation",
            "title_similarity": "0.7709769",
            "sentiment_compound": -0.8655
        },
        {
            "id": "i0ek1pe",
            "score": 1,
            "text": "Charge her. Make her face public scrutiny..",
            "title_similarity": "0.38185394",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0ekwbi",
            "score": 3,
            "text": "Fuck yeah she should be charged with murder",
            "title_similarity": "0.6978112",
            "sentiment_compound": -0.8316
        },
        {
            "id": "i0e7i2n",
            "score": 35,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0dl125",
            "score": 7,
            "text": "And she should be, shame that the men responsible died of old age without being brought to justice.",
            "title_similarity": "0.5144025",
            "sentiment_compound": -0.25
        },
        {
            "id": "i0drqae",
            "score": -6,
            "text": "Uh she's probably like 80 or something now.\nThis is ludicrous.  Unfortunate it happened,  but those were the times back then.",
            "title_similarity": "0.2856085",
            "sentiment_compound": -0.25
        },
        {
            "id": "i0dwefb",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.074521124"
        },
        {
            "id": "i0ek07r",
            "score": 5,
            "text": "The worst part about this? The two pieces of shit who did it, actually blamed Till for ruining their lives when they weren’t accepted into society after what they did. \n\nShe deserves to be charged if you’ve watched any of the videos. She was clearly not innocent or coerced/forced by her husband.",
            "title_similarity": "0.63725436",
            "sentiment_compound": -0.8965
        },
        {
            "id": "i0ekpto",
            "score": 6,
            "text": "So nobody faced any charges from this shit? Usually I feel for old people… but that bitch and her brother and husband(?) Can spend their last few years of life in jail honestly.",
            "title_similarity": "0.48849785",
            "sentiment_compound": -0.6608
        },
        {
            "id": "i0dyti3",
            "score": 18,
            "text": "Yeah, never going to happen. It was despicable that she lied and horrible that it led to his being brutally murdered, but there is no chance of her getting charged for it, 66 years later. Arguably, there is nothing to be gained from this, either.",
            "title_similarity": "0.5399193",
            "sentiment_compound": -0.9251
        },
        {
            "id": "i0dchnc",
            "score": -26,
            "text": "[removed]",
            "title_similarity": "0.01834043"
        },
        {
            "id": "i0etoxm",
            "score": 24,
            "text": "I don’t see why not we do it all the time with 90+ year old Nazis",
            "title_similarity": "0.30756766",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dm9cs",
            "score": 3,
            "text": "Is this the story of the kid that supposedly wolf whistled at a girl? Or am I wrong",
            "title_similarity": "0.603541",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i0dy7b6",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.07452115"
        },
        {
            "id": "i0ekem0",
            "score": 3,
            "text": "Ruby Bridges is only 65. She was 5 when she had to escorted to school. All the other kids in her class left. She was taught alone all year long.",
            "title_similarity": "0.4757032",
            "sentiment_compound": -0.25
        },
        {
            "id": "i0emi6v",
            "score": 3,
            "text": "Show the actual picture.   That would go a long way to making that happen.",
            "title_similarity": "0.028918592",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dhvuh",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.07452115"
        },
        {
            "id": "i0dkufu",
            "score": 44,
            "text": "Good fucking luck with that. 18 U.S.C. 1038 - False information and hoaxes(which includes resulting in death) wasn't even written until 2004 and the 2 that were charged for it were found not guilty. \n\nLook this is a shit stain on America just as much as Mississippi has always been, but nothing will ever be done about it. No prosecutor in the world would touch this one as this has waaaayyyy to many loopholes and other shit which this woman wouldn't be alive to see. Statue of limitations for her Crimes have long passed. As much as I would say \"fuck yea\" it will never happen. \n\nHis story just needs to be told as much as possible to let future generations know exactly how far we have gone.",
            "title_similarity": "0.5945817",
            "sentiment_compound": -0.9486
        },
        {
            "id": "i0dqg1w",
            "score": -13,
            "text": "This is what we’re coming to? What good does this teach younger people - other than to hold onto things that occurred 70 years ago. \nAnd the family trying to benefit from it is equally as gross.",
            "title_similarity": "0.37136427",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i0et91w",
            "score": 22,
            "text": "That old ho is still alive?",
            "title_similarity": "-0.13031861",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i0df0we",
            "score": -6,
            "text": "So does every other sane person. This is why we can't have nice things, America.",
            "title_similarity": "0.39942732",
            "sentiment_compound": -0.3252
        },
        {
            "id": "i0dgumg",
            "score": 0,
            "text": "Not going to happen because of Ex Post Facto.  \n\nSomebody should dedicate a website to her for how nasty she is though.",
            "title_similarity": "0.49901444",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i0ditri",
            "score": 0,
            "text": "They are god awful pieces of shit all of them.  But you cant charge someone with murder for a false accusation.  You have to charge the murderers.  This is something the FBI could potentially do.",
            "title_similarity": "0.6608708",
            "sentiment_compound": -0.9568
        },
        {
            "id": "i0dixwr",
            "score": 0,
            "text": "That's funny, so do I.",
            "title_similarity": "-0.050186906",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i0dk7i4",
            "score": 3,
            "text": "Damn is she still living???",
            "title_similarity": "0.07822904",
            "sentiment_compound": -0.5007
        },
        {
            "id": "i0dlsji",
            "score": 0,
            "text": "I thought the lady died a couple years ago of some illness, she’s still alive?",
            "title_similarity": "0.41504234",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i0dnxuf",
            "score": 0,
            "text": "That would be actual justice. We don't do that here in America.",
            "title_similarity": "0.15891874",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i0do0ba",
            "score": 0,
            "text": "Hell yes she should be.",
            "title_similarity": "0.011206311",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i0dr3fe",
            "score": 0,
            "text": "Seems perfectly reasonable.",
            "title_similarity": "-0.21633157",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i0drljj",
            "score": 0,
            "text": "Should charge the whole government",
            "title_similarity": "0.3297946",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0drpwv",
            "score": 0,
            "text": "I hate reading this over and over. It sickens me that im related to the killer.",
            "title_similarity": "0.53880733",
            "sentiment_compound": -0.9001
        },
        {
            "id": "i0dtgcb",
            "score": 0,
            "text": "Is this woman still alive? If she is then she can’t have long left",
            "title_similarity": "0.15301836",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i0du4b0",
            "score": 0,
            "text": "I think that’s fair. She shouldn’t have waited so long tho.",
            "title_similarity": "0.18403083",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i0duk8o",
            "score": 0,
            "text": "Why is this even a debate?",
            "title_similarity": "0.04894703",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dvxu3",
            "score": 0,
            "text": "I've read some far right forums (usually gamer ones), and they actually sided with the Emmett Till killers.   Claimed he wasn't a child, and probably was sexually harassing her.    I think we're doomed :*(",
            "title_similarity": "0.61588675",
            "sentiment_compound": -0.9186
        },
        {
            "id": "i0dw591",
            "score": 0,
            "text": "https://www.reddit.com/r/Documentaries/comments/ryhiiu/lynching_postcards_token_of_a_great_day_2021/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.22328347",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dx52l",
            "score": 0,
            "text": "This would be great if could happen.\n\nBut, could it truly be prosecuted in a success manner? \n\nAs it happened so long ago and I don’t believe there is much evidence in this case (of course because it was just lies and racism from beginning), could she been proved in a court of law beyond a reasonable doubt on these charges?\n\nIt has been a while since I read up on this horrible crime, but I just wonder how it could be proven.",
            "title_similarity": "0.5253154",
            "sentiment_compound": -0.9638
        },
        {
            "id": "i0dzhgr",
            "score": 0,
            "text": "I thought that lady died though",
            "title_similarity": "0.42721754",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i0dzmty",
            "score": 0,
            "text": "People can forget that many those on the wrong side of this part of history are still very much alive today",
            "title_similarity": "0.09422682",
            "sentiment_compound": -0.2782
        },
        {
            "id": "i0e28l5",
            "score": 0,
            "text": "Our country doesn’t charge women for making false accusations.",
            "title_similarity": "0.2265588",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i0e51vg",
            "score": 0,
            "text": "I thought she died already?",
            "title_similarity": "0.38986677",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i0e6mov",
            "score": 4,
            "text": "I hate how these articles often don’t use Carolyn Bryant Donham’s name when mentioning her involvement  in his death.\n\nHer whole life they’ve tried to keep her reputation intact.\n\nYou don’t normally find her name in a history book either. It’s just “a woman”.",
            "title_similarity": "0.5402541",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i0e6ru4",
            "score": 0,
            "text": "‘But it was a different time.’ -Evangelicals",
            "title_similarity": "0.09677565",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0ea5kg",
            "score": 0,
            "text": "That bitch Carolyn Bryant 88 years old approximately, yeah it’s said that….. “But roughly 60 years after the incident took place, Tim Tyson, author of the book The Blood Of Emmett Till, revealed that Carolyn recanted her testimony during a memoir.”\n\n“She confessed that the accusations that Till touched, threatened, or harassed her were \"not true\".”\n\nShe later added: “Nothing that boy did could ever justify what happened to him.”",
            "title_similarity": "0.6233889",
            "sentiment_compound": -0.886
        },
        {
            "id": "i0ea9ep",
            "score": 0,
            "text": "Not sure who she is, but i dont like her. Charge her ass",
            "title_similarity": "0.38028783",
            "sentiment_compound": -0.8358
        },
        {
            "id": "i0eagto",
            "score": 0,
            "text": "I can never forgot of Emmett since I’ve heard of the story. Horrible. Heard the old woman is a recluse in her home and that when media would show up her son(or nephew) would shoo people off the property while the woman stayed inside.",
            "title_similarity": "0.6618887",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i0eavs1",
            "score": 0,
            "text": "I thought she died and confessed to lying on her death bed.",
            "title_similarity": "0.5256156",
            "sentiment_compound": -0.8979
        },
        {
            "id": "i0ebaco",
            "score": 0,
            "text": "Lock her ass up. Emmett Till wouldn’t have died had she not lied about what happened. She’s complicit in his murder.",
            "title_similarity": "0.7661824",
            "sentiment_compound": -0.8914
        },
        {
            "id": "i0ebc6o",
            "score": 0,
            "text": "I must be mixing my stories up, but wasn’t there an old racist lady on her death bed saying she lied about\nSomething like this?",
            "title_similarity": "0.6822594",
            "sentiment_compound": -0.9186
        },
        {
            "id": "i0ebf8x",
            "score": 0,
            "text": "Living in New Zealand, I had never heard about Emmett Till. I didn't know about this until I heard Kanye West rap about it in 'Through the Wire' \n\nSo disgusting, man",
            "title_similarity": "0.37404817",
            "sentiment_compound": -0.656
        },
        {
            "id": "i0ebguf",
            "score": 0,
            "text": "Yes! Don't let them get away with murder just cuz they're old buddies now. Let them suffer before death like Emmett",
            "title_similarity": "0.49993658",
            "sentiment_compound": -0.8478
        },
        {
            "id": "i0dkxkj",
            "score": 15,
            "text": "I understand the sentiment, but legally I don't see how she could be charged with anything.",
            "title_similarity": "0.20506135",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i0dptk5",
            "score": 7,
            "text": "Oh, what was the other case of a black child receiving the death penalty, after being falsely accused?",
            "title_similarity": "0.73236454",
            "sentiment_compound": -0.8442
        },
        {
            "id": "i0dufzw",
            "score": 5,
            "text": "The two killers made money off their story. May they rot in hell.",
            "title_similarity": "0.5644281",
            "sentiment_compound": -0.872
        },
        {
            "id": "i0env6h",
            "score": 5,
            "text": "Makes sense to me.\n\nFalse testimony leading to the death of another person.\n\nThere should be a price to pay for that.",
            "title_similarity": "0.53483677",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i0eo9tv",
            "score": 5,
            "text": "Family + everyone else. If that woman wasn’t jailed, I’m shocked she hasn’t been killed.",
            "title_similarity": "0.49365005",
            "sentiment_compound": -0.875
        },
        {
            "id": "i0dp9zz",
            "score": 52,
            "text": "Unlikely.  Maybe conspiracy to commit murder. Unlike Manson, she didn't order his death, she told the lie that facilitated it. Milam and Bryant were acquitted so, double jeopardy applies. Unfortunate, but realistic.",
            "title_similarity": "0.66794384",
            "sentiment_compound": -0.6029
        },
        {
            "id": "i0e0it6",
            "score": 18,
            "text": "What crime could the lady be charged with? It’s not a crime to lie to people unless it’s an FBI agent or under oath",
            "title_similarity": "0.47479594",
            "sentiment_compound": -0.3506
        },
        {
            "id": "i0db4gv",
            "score": -13,
            "text": "In cases such as this, is it better to sentence these people for their crimes, or to finally let the truth be known?",
            "title_similarity": "0.512945",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i0epbs3",
            "score": 10,
            "text": "That bitch is still alive ?",
            "title_similarity": "0.10111927",
            "sentiment_compound": -0.296
        },
        {
            "id": "i0detid",
            "score": 1066,
            "text": "I always point to this case when people ignorantly say that racism is a thing of the past like it's been 1000s of years. Emmett would be in his 80s today. The woman who accused him is still alive.",
            "title_similarity": "0.38075477",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i0dfm6y",
            "score": -8,
            "text": "I wonder what would of happened to society if this incident never occurred? Would minorities in the USA still be facing social injustice? Would it be at a lower or deeper level? Just makes me wonder.",
            "title_similarity": "0.46680284",
            "sentiment_compound": -0.7536
        },
        {
            "id": "i0ek90r",
            "score": 5,
            "text": "I just spent a couple of hours reading about Emmett Till, and it was gut wrenching. It made me sad, angry and disgusted at the same time. Roy Bryant and his half brother Milam deserved to go straight to hell. Can you believe they didn't get charged for even kidnapping after they admitted to it? The two or three black guys who helped them kidnap Emmett deserved long jail sentences. Who would help 2 white guys kidnap another African American back in those days in Mississippi? A 14 year old kid no less. They must have known he'd get a bad beating at the very best, and at worst, killed. Willie Reed and the others who heard the beating outside the shed and did nothing should feel ashamed of themselves. Although, Reed redeemed himself by having the courage to testify. With Carolyn Bryant? I'm not a hundred percent convinced she is responsible though.\n\nIt seems like a sad case of neighborhood gossips combined with a racist and overzealous husband.  Roy Bryant didn't find out about the encounter between Emmett and Carolyn from her, he found out by hearing people talking about it. She actually tried to avoid telling her husband because she was afraid that he might do something stupid. Her supposed confession that she lied about Emmett whistling at and touching her was coming from a historian/reporter, Timothy Tyson, who put it in his book published in 2017. The interview happened in 2008, but he didn't say anything about until his book came out. So there could possibly be a financial motive for Tyson. Also the person who was with Carolyn during the interview (her daughter, Marsha) also corroborated with her that she never said it, and Tyson can't produce any evidence she admitted to it even though he was voice recording the interview. She also said \"Nothing that boy did could ever justify what happened to him\".\n\nI guess we'd never know what happened inside Carolyn's store when Emmett till was in there, and what caused her to go and fetch her gun immediately after he left. And even if she did lie (I'm not saying she did or did not), it was in court after Emmett got brutally murdered, to protect her husband. So I don't think she was responsible for his death. You can argue she was still a shitty person for lying in court to cover up such an incredibly heinous crime (if she did lie), and maybe for fetching her gun with the intent to intimidate a minor, but I really don't think she was responsible at all for Emmett Till's death.",
            "title_similarity": "0.69685537",
            "sentiment_compound": -0.9954
        },
        {
            "id": "i0dcdzt",
            "score": 192,
            "text": "Murder generally requires proving intent to cause injury or death to the victim.  This would've been difficult even back in 1955.  What chance is there now, with memories faded and various witnesses having long since died, of proving intent beyond a reasonable doubt?  Manslaughter is conceivable if she knew or should have known that making the accusation would lead to him being lynched, but it would still be a tricky case.  I understand where the family is coming from, but legally this seems like a longshot.",
            "title_similarity": "0.76212955",
            "sentiment_compound": -0.8225
        },
        {
            "id": "i0dckn1",
            "score": 1350,
            "text": "I understand the sentiment, I wrote my term paper on Emmitt Till, but there's no way to interpret what she did as murder from a legal standpoint. If this somehow went to trial (it wouldn't), she'd absolutely be acquitted.",
            "title_similarity": "0.6336138",
            "sentiment_compound": -0.7706
        },
        {
            "id": "i0dhue1",
            "score": 1,
            "text": "Wait i still don’t  know how those people tracked him down or how people just stood and let them take him",
            "title_similarity": "0.399926",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dist4",
            "score": 1,
            "text": "There was this evergreen in my mothers backyard. It looked from the outside to be big and full of nice shiny green nettles, but once you pushed past the surface layer you could see that everything behind it was dead. One large branch of the tree that had previously been in the back where there was less sunlight had wrapped itself around to the front of the tree and chocked the life out of the other limps. All the successive limbs that grew making the tree appear to be full were all just offshoots from this one errant branch that was throwing the whole tree into imbalance. So? I cut the arm off, and all it’s successive limbs and branches with it, and I burned them all in the fire and used the ashes to make fertilizer. Now the tree grows as originally intended.",
            "title_similarity": "0.47953802",
            "sentiment_compound": -0.7579
        },
        {
            "id": "i0dkm80",
            "score": 1,
            "text": "This bitch is alive and well",
            "title_similarity": "0.0060006967",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i0dkms9",
            "score": 1,
            "text": "And as well she should",
            "title_similarity": "0.015018602",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i0dkoie",
            "score": 1,
            "text": "If this goes forward, it will have interesting downstream effects on false rape accusations. Obviously these are awful and should be punished but so far we have said that harshly punishing folks for false accusations has a chilling effect on victims coming forward.\n\nI am in the punish people in accordance with how their actions effect their victims so I say go for it.",
            "title_similarity": "0.5967264",
            "sentiment_compound": -0.9754
        },
        {
            "id": "i0dlgez",
            "score": -1,
            "text": "Fucking Nuremberg them.",
            "title_similarity": "0.17471081",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dns5z",
            "score": -1,
            "text": "Yeah that lady should be exposed and burn for her racism.",
            "title_similarity": "0.55339754",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i0dp1bk",
            "score": 1,
            "text": "That woman must be dead right?",
            "title_similarity": "0.4758529",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i0drn5t",
            "score": 1,
            "text": "Did you know hunting licenses and poaching laws were a major part of Jim Crow, specifically designed to prevent freed slaves from simply living off the land?",
            "title_similarity": "0.6046361",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i0dve1t",
            "score": 1,
            "text": "Who could blame them for still wanting justice after all of these years?",
            "title_similarity": "0.26596048",
            "sentiment_compound": 0.25
        },
        {
            "id": "i0dyjak",
            "score": -1,
            "text": "Charge he with almost anything with a jail sentence that you can get a jury to convict for. At her age, even a misdemeanor will likely be a life sentence.",
            "title_similarity": "0.52072775",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i0dzq42",
            "score": 1,
            "text": "I remember reading the mother's book only with a couple others. One of the most heartbreaking stories I've ever heard of, the actions of that woman and her family were dreadful",
            "title_similarity": "0.61828315",
            "sentiment_compound": -0.7346
        },
        {
            "id": "i0e0irh",
            "score": 1,
            "text": "Research the previous governor, Phil Bryant, and you’ll see exactly how closely related top tier MS political figures still are to this case. There will be no justice here.",
            "title_similarity": "0.44885767",
            "sentiment_compound": -0.2444
        },
        {
            "id": "i0e2d5v",
            "score": 1,
            "text": "Good! She needs to be! If you make up false accusations that's a crime too. If I do it right now in 2022 I would get in trouble (filing false report etc)",
            "title_similarity": "0.5685589",
            "sentiment_compound": -0.7339
        },
        {
            "id": "i0e35r0",
            "score": 1,
            "text": "That bitch needs to be punished with the full extent of the law, idc how old she is",
            "title_similarity": "0.5750584",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i0e50c4",
            "score": 1,
            "text": "I wish people would look past the color of skin and see the person underneath.",
            "title_similarity": "0.20345621",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i0e5rai",
            "score": 1,
            "text": "Should have been done decades ago. If she's still alive - do it.",
            "title_similarity": "0.3020015",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i0e5rk4",
            "score": 1,
            "text": "Even if she's never even charged, I think she should know that history will look at her with contempt before she dies.",
            "title_similarity": "0.502866",
            "sentiment_compound": -0.4953
        },
        {
            "id": "i0e71yd",
            "score": 1,
            "text": "Terrifying to think it wasn't even 100 years ago this happened. His mom was an absolute queen to show his open casket to people while going through a parent's worst nightmare to prove a point about this disgusting injustice.",
            "title_similarity": "0.70614254",
            "sentiment_compound": -0.9477
        },
        {
            "id": "i0e758t",
            "score": 1,
            "text": "Linked in this article \"Emmett Till investigation closed by the justice department\". American justice fucking fails again.",
            "title_similarity": "0.5147323",
            "sentiment_compound": 0.5729
        },
        {
            "id": "i0eawf0",
            "score": 1,
            "text": "Hear! Hear! At least accessory to murder.",
            "title_similarity": "0.5440038",
            "sentiment_compound": -0.7418
        },
        {
            "id": "i0eelfw",
            "score": 1,
            "text": "Either way, she’s going to have an *interesting* afterlife.",
            "title_similarity": "0.14350712",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i0ef87c",
            "score": 1,
            "text": "That poor kid :( she really is the spawn of the devil I hope she rots in hell for an eternity but I’m also glad we as a society view poorly for her but I would like her punished for it show the country that we DONT TOLERATE THAT SHIT And we will punish every one no matter what",
            "title_similarity": "0.6096066",
            "sentiment_compound": -0.5125
        },
        {
            "id": "i0ehpdb",
            "score": 1,
            "text": "I agree she should be charged for a false accusation. I don’t care how old she is she needs to pay for her actions.",
            "title_similarity": "0.56008166",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i0dslxd",
            "score": 210,
            "text": "All the old racist fuckers that did this are geriatric by now.\n\nI hope the memory of what they did follow them for eternity and can never find rest in the afterlife.",
            "title_similarity": "0.51915705",
            "sentiment_compound": -0.7184
        },
        {
            "id": "i0ddcxk",
            "score": -16,
            "text": "[deleted]",
            "title_similarity": "0.074521124"
        },
        {
            "id": "i0dt2pz",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0dh9fy",
            "score": 96,
            "text": "\"Twas down in Mississippi. Not SoOooo long ago.\n\nWhen a young boy from Chicago town stepped through a Southern door.... \"\n\nGo listen to \"The Death of Emmett Till\" by Bob Dylan. This kid was only 14 years old.",
            "title_similarity": "0.32056957",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i0esnnh",
            "score": 18,
            "text": "It only seems fair, to be honest. It shouldn't matter how long ago you did something wrong, you should have to face justice if it's possible.",
            "title_similarity": "0.19921929",
            "sentiment_compound": 0.7028
        },
        {
            "id": "i0dc2vv",
            "score": 2209,
            "text": "Any remaining men that participated in the lynching should be right there with her. Make them all co-defendants.",
            "title_similarity": "0.62037873",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dk3ue",
            "score": 89,
            "text": "It’s very difficult to build a case for murder based entirely on hearsay evidence.",
            "title_similarity": "0.47600478",
            "sentiment_compound": -0.8173
        },
        {
            "id": "i0en5dx",
            "score": 10,
            "text": "His father was actually killed while serving in Paris for a similar claim. So I hope justice is served for the Till family because this story still horrified when I read it.",
            "title_similarity": "0.6607038",
            "sentiment_compound": -0.2865
        },
        {
            "id": "i0dmfb9",
            "score": -2,
            "text": "Isnt the woman who lied dead?",
            "title_similarity": "0.53788614",
            "sentiment_compound": -0.7845
        },
        {
            "id": "i0drx6a",
            "score": -2,
            "text": "I hope she shitting her pants rn",
            "title_similarity": "0.42116648",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i0dtd9l",
            "score": -2,
            "text": "Lmao, I mean a little too late now",
            "title_similarity": "0.05826534",
            "sentiment_compound": 0.5994
        },
        {
            "id": "i0dwgqt",
            "score": 2,
            "text": "This. I’d rather see this 100x than a bunch of sad sacks talking about a subway sandwich artist on heroin.",
            "title_similarity": "0.46516564",
            "sentiment_compound": -0.743
        },
        {
            "id": "i0e3tok",
            "score": 2,
            "text": "Add me to the long list of people who want to see that happen",
            "title_similarity": "0.15417778",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i0e6mou",
            "score": -2,
            "text": "Why go after her instead of going after ex presidents that encouraged racist women like her",
            "title_similarity": "0.6505048",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0e877d",
            "score": 2,
            "text": "I made the mistake of clicking on a link about Emmett years ago. The photo of what they did to that little boy is awful.",
            "title_similarity": "0.5807736",
            "sentiment_compound": -0.6293
        },
        {
            "id": "i0eb40y",
            "score": 2,
            "text": "“False allegations—particularly about Black men being rapists—have been reinforced over and over again in our history. While shameful, America embraced the allegation a century ago, and America embraces the allegation today. It is imperative to know that the allegation is rooted in history to fully understand how ingrained it truly is in our society.\n\nWhether it’s a woman in Michigan falsely claiming that a group of Black men kidnapped, beat and raped her; another woman claiming a Black man kidnapped her 3-year-old and 14-month-old sons (whom she actually killed); the infamous Amanda Knox accusing a Black man of the heinous murder she was initially convicted of; or even a man claiming that Black men stabbed his wife to death (whom he actually killed),” Martenzie Johnson wrote in an article for The Undefeated. “In each instance, the initial story was believable because of the troubling belief that a Black man is capable of such a thing. It’s because we’ve always been told this is what black men do.”\n\nhttps://mtinnocenceproject.org/innocent-black-people-significantly-more-likely-to-be-wrongfully-convicted-of-sexual-assault/",
            "title_similarity": "0.74242324",
            "sentiment_compound": -0.9764
        },
        {
            "id": "i0ebvsc",
            "score": 2,
            "text": "I don't care how old she is.  The accuser needs to be held accountable and even punished.  Shpuld have happened the moment she recanted her story.  I don't believe in Hell, but hope she burns.",
            "title_similarity": "0.5936654",
            "sentiment_compound": 0.5216
        },
        {
            "id": "i0ec269",
            "score": 2,
            "text": "I agree that this woman sounds horrible, is bad, remorseless, evil; I agree that this boy was murdered, but she didn’t murder him by any definition of the word, unfortunately.",
            "title_similarity": "0.6642287",
            "sentiment_compound": -0.9595
        },
        {
            "id": "i0edkp0",
            "score": 2,
            "text": "Seems super hard to get a conviction here, since they'd have to prove she knew that making these false claims would lead to his death. What kind of evidence do they have to back that up? I understand that people want her punished, but after all this time it's next to impossible.",
            "title_similarity": "0.61233735",
            "sentiment_compound": -0.2617
        },
        {
            "id": "i0eepxf",
            "score": 2,
            "text": "If this were to happen, I wonder if that would set a precedent for charging people for hurting others with false accusations.",
            "title_similarity": "0.4970369",
            "sentiment_compound": -0.6124
        },
        {
            "id": "i0eeu49",
            "score": 2,
            "text": "Carolyn Donham is the name of our OG racist who had a boy killed for no reason.",
            "title_similarity": "0.63623387",
            "sentiment_compound": -0.8934
        },
        {
            "id": "i0ehqpt",
            "score": 2,
            "text": "Crazy to think that this wasnt even that long ago...",
            "title_similarity": "0.095754504",
            "sentiment_compound": -0.34
        },
        {
            "id": "i0eit7h",
            "score": 2,
            "text": "if there is evidence, and a winnable case - they should. otherwise it's a waste of time.",
            "title_similarity": "0.13605501",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0ej626",
            "score": 2,
            "text": "Criminal charges will be hard. I’m fine suing her into oblivion, take her for what little she’s worth.",
            "title_similarity": "0.4955256",
            "sentiment_compound": -0.6786
        },
        {
            "id": "i0ejg4d",
            "score": 2,
            "text": "She currently has a one way ticket to hell.",
            "title_similarity": "0.20289767",
            "sentiment_compound": -0.6808
        },
        {
            "id": "i0ekh88",
            "score": 2,
            "text": "Aaand this is why I'm massively offended by depictions of lynchings used as \"shock media\". It wasn't that long ago.",
            "title_similarity": "0.5280489",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i0eqcmv",
            "score": 10,
            "text": "I remember learning about this when i was 12 in school. Fucking monsters",
            "title_similarity": "0.4105559",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0e6k8c",
            "score": 10,
            "text": "Legally, why would the woman get charged of murder? It’s not her who committed the crime, but her husband and his brother.",
            "title_similarity": "0.75741446",
            "sentiment_compound": -0.6915
        },
        {
            "id": "i0dltkr",
            "score": -3,
            "text": "Didn’t the lady die, what are you trying to prove at that point",
            "title_similarity": "0.4563344",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i0dlxq5",
            "score": 3,
            "text": "I watched that documentary in class when I was in 5th grade. Although it’s an extremely important case and everyone should learn about it, I don’t know why my teacher thought it’d be a good idea to show that to a bunch of 10 year olds, definitely traumatizing. It still makes me feel sick thinking about the evil things those animals did to him.",
            "title_similarity": "0.6096141",
            "sentiment_compound": -0.6494
        },
        {
            "id": "i0dmzan",
            "score": 3,
            "text": "Me too. I don’t care how old she is.",
            "title_similarity": "0.086788304",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i0drnq4",
            "score": -4,
            "text": "I thought she was dead.  Definitely charge this woman!  \n\n>Timothy Tyson’s book on Emmett Till became a bestseller thanks to the bombshell quote he attributed to Carolyn Bryant Donham — that she lied when she testified about Till accosting her.\n\n>Donham’s daughter-in-law, Marsha Bryant, who was present for the two tape-recorded interviews Tyson did with Donham, said her mother-in-law “never recanted.”\n\n>Adding to the intrigue is the fact the quote Tyson attributed to Donham isn’t on the recordings.\n\n\n>Bryant said people unfortunately believe the 84-year-old played a role in Till’s murder when “she had nothing to do with it.\n\nHer lies were literally the reason it happened!  Whitewashing your own past to make yourself out to not be a piece of shit and absolve yourself of all blame like that.  Just wow.",
            "title_similarity": "0.68591934",
            "sentiment_compound": -0.8353
        },
        {
            "id": "i0e6vj3",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.074521124"
        },
        {
            "id": "i0ehw7q",
            "score": 3,
            "text": "Her nephew was the governor of Mississippi until a few years ago. He was a piece of shit too.",
            "title_similarity": "0.55402267",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i0ejk6n",
            "score": -3,
            "text": "I don’t think she’s alive.",
            "title_similarity": "0.06969296",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i0ekzyw",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0dtx8m",
            "score": 199,
            "text": "I’m originally from Mississippi, and while I didn’t grow up around where this happened and I now live 1400 miles away, I still keep pretty up to date on news there. \n\nThe other day it was discussed placing a memorial statue at the scene of his murder, and I swear to y’all, the number of people mad in the comments was astronomical, all because they took down the confederate statues and now want to put up one for him.\n\n\nWhile Mississippi does have some fine people who live there, it saddens me how far behind it is sometimes.",
            "title_similarity": "0.60009134",
            "sentiment_compound": -0.7506
        },
        {
            "id": "i0dv6wb",
            "score": 5,
            "text": "Also, since we’re on the topic, please also explore the horrible event that transpired in America which is also being slowly removed from the mainstream history.\n   [Tulsa Massacre](https://en.m.wikipedia.org/wiki/Tulsa_race_massacre)",
            "title_similarity": "0.55812025",
            "sentiment_compound": -0.296
        },
        {
            "id": "i0ec11u",
            "score": 4,
            "text": "Accessory to murder would probably stick more.",
            "title_similarity": "0.42430276",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i0eiidt",
            "score": 5,
            "text": "I think the the journalist that spined the story about the lady lying, backtracked.",
            "title_similarity": "0.5693339",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i0dqhde",
            "score": 188,
            "text": "If you are interested in this story. Bob Dylan wrote a gut wrenching song about these horrors called \"The Death Of Emmett Till\".",
            "title_similarity": "0.5297903",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i0dw5uq",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0e3cqy",
            "score": -4,
            "text": "Jussie smollet was just charged for lying. And his lie was harmless! Why shouldnt she be charged",
            "title_similarity": "0.4700589",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i0e35ns",
            "score": 19,
            "text": "Uh, I doubt that will happen.  You'd have a 90 year old woman who has dementia standing trial for a crime in which all of the physical evidence deteriorated 70 years ago, on top of the obvious fact that all she did was make a statement about his conduct and she wasn't at all a part of the violence against him.",
            "title_similarity": "0.60024154",
            "sentiment_compound": -0.8519
        },
        {
            "id": "i0er8ea",
            "score": 17,
            "text": "Everyone is talking about murder charges, I don't think it works that way. The law is very specific regarding murder. \n\nLook at the Aaron Hernandez murder trial. There were three people involved. The prosecution needed to prove that it was Hernandez that pulled the trigger and not the other two men. The prosecution was able to prove that Hernandez pulled the trigger, and therefore guilty of murder. The other two men were charged with accessory to murder. \n\nI'm not saying that Carolyn Donham shouldn't be held accountable for the roll she played in Tills murder. I just don't think she can be charged for murder. I'm not a lawyer, I'm not an expert in law, I'm just thinking about many other cases I've seen and read about and how the law is written and applied. \n\nIf anyone has any insight I'd like to hear it.",
            "title_similarity": "0.7243928",
            "sentiment_compound": -0.9928
        },
        {
            "id": "i0dzo51",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0e5911",
            "score": 6,
            "text": "I’m writing about the press coverage of this case for a class. The way the papers described the killers is absolutely horrendous. Entirely too kind.",
            "title_similarity": "0.50978625",
            "sentiment_compound": -0.6922
        },
        {
            "id": "i0eho6h",
            "score": 5,
            "text": "Please pursue justice in all cases. For me I want justice for my grandparents. Who suffered and died in and because of Indian residential schools",
            "title_similarity": "0.55592537",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i0eof7t",
            "score": 5,
            "text": "I think Dave Chapelle was talki about this in his last special",
            "title_similarity": "0.20970072",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i0dgztq",
            "score": 342,
            "text": "This is the most important story to teach. The saddest thing is the memorial kept getting shot at so they had to make it bullet proof! [link](https://www.nytimes.com/2019/10/20/us/emmett-till-bulletproof-sign.html)",
            "title_similarity": "0.54935235",
            "sentiment_compound": -0.4937
        },
        {
            "id": "i0dwng0",
            "score": 8,
            "text": "She’s 88 years old. Cognitive decline if not outright dementia.  Good luck with that.",
            "title_similarity": "0.25863284",
            "sentiment_compound": 0.1516
        },
        {
            "id": "i0duhsp",
            "score": 31,
            "text": "I've read and saw pictures of a lot of disgusting and horrific things, but what happened to Emmet Till is probably one of the most brutal and disgusting thing's I've ever read about.\n\nHow the fuck could anyone do that to someone.",
            "title_similarity": "0.58262205",
            "sentiment_compound": -0.971
        },
        {
            "id": "i0dfaei",
            "score": 980,
            "text": "As horrible and wrong as his murder was, it's widely recognized as the event that shocked the civil rights movement into existence. His mother insisted on an open-casket funeral to let the world see what had been done to her son.",
            "title_similarity": "0.7435902",
            "sentiment_compound": -0.9442
        },
        {
            "id": "i0d7yin",
            "score": 6190,
            "text": "I’d like to see this too. Old SS guards are brought to trial 70 years later after their crimes.",
            "title_similarity": "0.57737255",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i0dla4h",
            "score": 56,
            "text": "Thought she never recanted?",
            "title_similarity": "0.19627894",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dowui",
            "score": 12,
            "text": "These stories, while absolutely essential to read and understand, are so hard (traumatic) to read. Why are people so evil?!?",
            "title_similarity": "0.38728178",
            "sentiment_compound": -0.9203
        },
        {
            "id": "i0enw18",
            "score": 11,
            "text": "It baffles me that there are people out there that feel what happened to that poor boy was justified. How can people be that hateful?",
            "title_similarity": "0.40651888",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i0echcf",
            "score": 152,
            "text": "To everyone surprised that she's still alive, remember that the Civil Rights Movement was more recent than you think. For example, Ruby Bridges is only 67 years old.",
            "title_similarity": "0.3094656",
            "sentiment_compound": 0.5423
        },
        {
            "id": "i0divgw",
            "score": 906,
            "text": "To give you an idea of how inhumane and desensitized these people were, try to find footage of the press conference after the men were acquitted and watch how aggressively he makes out with her in celebration of the verdict. It’s… graphic.",
            "title_similarity": "0.621686",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i0d80tm",
            "score": 6642,
            "text": "On August 28, 1955, 14-year-old Emmett Till, an African American from Chicago, is murdered for allegedly flirting with a white woman four days earlier.\n\nHis assailants—the white woman’s husband and his brother—made Emmett carry a 75-pound cotton gin fan to the bank of the Tallahatchie River and ordered him to take off his clothes. The two men then beat him nearly to death, gouged out his eye, shot him in the head and then threw his body, tied to the cotton gin fan with barbed wire, into the river.\n\nThree days later, his corpse was recovered but was so disfigured that people could only identify it by an initialed ring.\n\n&#x200B;\n\nIs Carolyn Bryant still alive? It's believed Carolyn is still alive today, and if so, she would be 88 years old. Details of her life and her whereabouts have been kept private by her family, though it's been said that Carolyn was in poor health prior to the publishing of Timothy Tyson's book.",
            "title_similarity": "0.73076326",
            "sentiment_compound": -0.2846
        },
        {
            "id": "i0da0se",
            "score": 11677,
            "text": "I remember feeling sick after reading this story. How can grown men do this time a 14 year old boy?",
            "title_similarity": "0.44138682",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i0dw85p",
            "score": 5064,
            "text": "Emmit’s mother was the one who demanded Emmit’s casket be open so that the entire world could see what they did to her baby. One of the flames that lit the civil rights movement",
            "title_similarity": "0.6648675",
            "sentiment_compound": -0.2263
        },
        {
            "id": "i0dl3bn",
            "score": 13865,
            "text": "I can't believe she's still alive. History is closer to us than we think",
            "title_similarity": "0.18889773",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i0djgdj",
            "score": 1,
            "text": "Sad that I literally had to watch a shitty comedy-horror movie to learn about this",
            "title_similarity": "0.5517003",
            "sentiment_compound": -0.7717
        },
        {
            "id": "i0dkftn",
            "score": 1,
            "text": "Is she even still alive?",
            "title_similarity": "0.03536854",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i0drgfn",
            "score": 1,
            "text": "Does the statute of limitations not apply here unfortunately? Not American btw",
            "title_similarity": "0.16059059",
            "sentiment_compound": 0.2584
        },
        {
            "id": "i0ds32j",
            "score": 1,
            "text": "Well fucking yeah. How has this not already happened?",
            "title_similarity": "-0.016309189",
            "sentiment_compound": 0.5563
        },
        {
            "id": "i0dtdx7",
            "score": 1,
            "text": "Didn’t they already put her on trial awhile back?",
            "title_similarity": "0.45997673",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dvezh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.018340375"
        },
        {
            "id": "i0dvjxy",
            "score": 1,
            "text": "They aren’t the only ones.",
            "title_similarity": "-0.15466924",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0dxp7w",
            "score": 1,
            "text": "“on the plane scared as hell that her guy look like Emmett Till…”",
            "title_similarity": "0.53798807",
            "sentiment_compound": -0.7184
        },
        {
            "id": "i0dxyhz",
            "score": 1,
            "text": "\n\nWhat was her motivation for saying such a thing?",
            "title_similarity": "0.20495537",
            "sentiment_compound": 0.34
        },
        {
            "id": "i0dya7n",
            "score": 1,
            "text": "Didn't she write a letter explaining herself but it is not allowed to be read/published until like 2036?",
            "title_similarity": "0.40283713",
            "sentiment_compound": 0.5023
        },
        {
            "id": "i0e0jvf",
            "score": 1,
            "text": "While they should be charged isn’t it double jeopardy? Or is there something I’m missing.",
            "title_similarity": "0.31218845",
            "sentiment_compound": -0.7269
        },
        {
            "id": "i0e0tfk",
            "score": 1,
            "text": "Houston riot of 1917 was also around this time.",
            "title_similarity": "0.42708153",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i0e324x",
            "score": 1,
            "text": "It makes sense that the law doesn’t work that way, but I’ve always tried to think of a reasonable consequence that feel right in every scenario where a person’s lies don’t break the law, but absolutely destroy lives. \n\nFor example, if a young woman lies (not to police) about being raped by a fellow studentz\n\nScenario 1: Her uncle murders the accused young man. I think her name / character should get dragged through the mud in the media, but the murderer should receive 100% of the legal consequences.\n\nScenario 2: the accused young man is removed from school, publicly humiliated in the media, unable to work, and constantly in fear for the rest of his life. I’m pretty sure it ends there without consequences for the person that did the wrong thing, because police done investigate someone telling a terrible lie, unless they lie to police.\n\nThe only reasonable thing to do here is for society as a whole to not give in to our emotional tribal urges, and presume innocence until it’s gone through the legal system.\n\nSure, believe women, but to the point where you’re only bringing support and positivity to the world. If you know a man that’s been accused and denies it, believe him too. He too may be going though the most horrible and traumatising thing in his life.\n\nBut for fuck’s sake, leave the negativity and big consequences to legal system. Wait for the verdict in court before you’re outraged.",
            "title_similarity": "0.7108135",
            "sentiment_compound": -0.9954
        },
        {
            "id": "i0e6yey",
            "score": 1,
            "text": "Yes please.... set that legal precedents...",
            "title_similarity": "0.041247938",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i0e6ynv",
            "score": 1,
            "text": "I’m onboard with that",
            "title_similarity": "-0.17168088",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0e8fnx",
            "score": 2,
            "text": "Damn I could have sworn she died already.",
            "title_similarity": "0.4012505",
            "sentiment_compound": -0.743
        },
        {
            "id": "i0e9pr0",
            "score": 1,
            "text": "I agree. She should be charged.",
            "title_similarity": "0.2476143",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i0ea0h7",
            "score": 2,
            "text": "I met Emmett Till's cousin. Really nice guy. He was meant to go on the same trip as Emmett but his parents forbade him from going.",
            "title_similarity": "0.42177355",
            "sentiment_compound": 0.2609
        },
        {
            "id": "i0eaaq6",
            "score": 1,
            "text": "All for her getting charged but wouldnt it be a conspiracy charge as opposed to just first degree murder? Genuinely curious",
            "title_similarity": "0.6260521",
            "sentiment_compound": -0.891
        },
        {
            "id": "i0eacmh",
            "score": 1,
            "text": "The woman that did this to Emmett is a Horrible person. Murderer.",
            "title_similarity": "0.641353",
            "sentiment_compound": -0.8442
        },
        {
            "id": "i0eamas",
            "score": 1,
            "text": "I don't know if they could convict her on murder. I wonder what the highest crime she could be convicted of is?",
            "title_similarity": "0.6499253",
            "sentiment_compound": -0.8481
        },
        {
            "id": "i0eb1ng",
            "score": 1,
            "text": "These type of false allegations are more common than we realise. I’m from the UK, there’s an infamous case of Stefan Kiszko, who was arrested for and convicted of murder after a group of girls made false allegations about him. When asked if they owed him an apology, they said they didn’t. This case is why I don’t support the death penalty.",
            "title_similarity": "0.7296437",
            "sentiment_compound": -0.9153
        },
        {
            "id": "i0eb1zt",
            "score": 1,
            "text": "As they should. Emmett didn’t deserve any of that.",
            "title_similarity": "0.13598791",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0ebn5s",
            "score": 1,
            "text": "This is weird timing as I just watched a documentary about his murder called Let The World See. \n\nI also thought she died a few years back.",
            "title_similarity": "0.72210383",
            "sentiment_compound": -0.875
        },
        {
            "id": "i0eczoh",
            "score": 2,
            "text": "Dang she’s still alive? 1955, honestly it doesn’t seem too long ago. But it’s almost 70 years",
            "title_similarity": "0.22160539",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i0ed6zp",
            "score": 1,
            "text": "Emmet Till is finally getting justice",
            "title_similarity": "0.07905065",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i0ee8i0",
            "score": 1,
            "text": "I love all the trivia geniuses jumping in every other comment talking about the open casket like they forgot to mention it.",
            "title_similarity": "0.32977253",
            "sentiment_compound": 0.7717
        },
        {
            "id": "i0eee26",
            "score": 2,
            "text": "Getting fired would be the anonymous. Thanks.",
            "title_similarity": "0.30711383",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i0eft08",
            "score": 1,
            "text": "If the lady is still alive. Let’s at least see her face.",
            "title_similarity": "0.09940551",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i0ejh7v",
            "score": 3,
            "text": "I just started a forensics project in my science class last week and the topic I chose was Emmett till's murder. I had to make a survey for anyone in the world to take and see what they think of it. One of the questions was do you think the woman should've been charged along with the men? So far almost everyone said yes.",
            "title_similarity": "0.70423615",
            "sentiment_compound": -0.6204
        },
        {
            "id": "i0ejpv6",
            "score": 2,
            "text": "I remember having to do a report on this in high school and shit stuck with me hard. just absolutely sickening to think about",
            "title_similarity": "0.48344988",
            "sentiment_compound": -0.8655
        },
        {
            "id": "i0ekmwh",
            "score": 1,
            "text": "Post haste\nBut they are probably gone",
            "title_similarity": "0.11253425",
            "sentiment_compound": 0.0
        },
        {
            "id": "i0el0bp",
            "score": 1,
            "text": "I misread and thought that it said her family was being charged and I was like whaaat",
            "title_similarity": "0.5889836",
            "sentiment_compound": -0.1027
        }
    ]
}