{
    "Colorado now guarantees the right to abortion in state law\n": [
        {
            "id": "i3f2vl5",
            "score": 1,
            "text": "Wow. Isn't it interesting to see how many new and shell accounts are popping up in this thread to express their objection to this new law. If you are a real user, then use your main account. If you are astroturfing, then get better at it.",
            "title_similarity": "0.40288636",
            "sentiment_compound": 0.6643
        },
        {
            "id": "i3fe5uu",
            "score": 5,
            "text": "Perfect everyone has a right to do as they wish!  Go Democrats fuck racist religious zealots!",
            "title_similarity": "0.43351156",
            "sentiment_compound": -0.5399
        },
        {
            "id": "i3er7r7",
            "score": 63,
            "text": "It’s amazing that this has to happen - who do white GOP men think they are in controlling what a woman does with her body - it’s certainly not about the child otherwise why would the GOP not support better education and social programs - it’s always been about controlling women - good for Colorado to ensure a woman can do with her body as she pleases when it comes to choice",
            "title_similarity": "0.5579697",
            "sentiment_compound": 0.8669
        },
        {
            "id": "i3emrwu",
            "score": 61,
            "text": "It’s a shame the Republicans don’t get it. This should be done im every Democratic state while they have the chance.",
            "title_similarity": "0.5189026",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i3ej8lu",
            "score": 37,
            "text": "Never understood this issue behind it! Good job Co!",
            "title_similarity": "0.18929555",
            "sentiment_compound": 0.5399
        },
        {
            "id": "i3fgx1c",
            "score": 2,
            "text": "wonderful wonderful news\n\nslava colorado!",
            "title_similarity": "0.5403539",
            "sentiment_compound": 0.8268
        },
        {
            "id": "i3ejud6",
            "score": 66,
            "text": "God damn it feels good to be proud of my state",
            "title_similarity": "0.38593167",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i3esva2",
            "score": 33,
            "text": "I'm the furthest thing from what the average person would consider a liberal, but I've never understood why it's my business what a mother does to her pregnancy. Yeah, I think it's murder, but I think the child, and the mother, would suffer more if the abortion didn't happen and it was carried through with a mother that didn't want the child... Seems like an abortion would result in less net suffering in the long run for everyone involved.",
            "title_similarity": "0.46846882",
            "sentiment_compound": -0.9065
        },
        {
            "id": "i3emkka",
            "score": 29,
            "text": "this is the best news i’ve heard in a while :)",
            "title_similarity": "0.326731",
            "sentiment_compound": 0.802
        },
        {
            "id": "i3etm4y",
            "score": 0,
            "text": "“I hate that everyone’s moving here!”    Shitty people that live in Colorado",
            "title_similarity": "0.23448344",
            "sentiment_compound": -0.8221
        },
        {
            "id": "i3emhp5",
            "score": 164,
            "text": "Good.  I’m entirely sick and tired of the MINORITY of people in this country making material changes in what the MAJORITY of us want in this country.  You religious right people are free to do as you want as long as it DOESN’T AFFECT ANYONE ELSE.  \n\nKEEP YOUR FUCKING RELIGION AND BELIEFS TO YOURSELF.   The rest of us - and we are the overwhelming majority - aren’t at all  interested in hearing about your religion or beliefs.",
            "title_similarity": "0.31275883",
            "sentiment_compound": 0.4105
        },
        {
            "id": "i3ey0fk",
            "score": 10,
            "text": "This is good. I'm a Catholic Christian who is very much against abortion, but I believe the answer to that is outreach, not a federal ban. I would like to see more \"pro lifers\" actually putting their money where their mouth is by volunteering and offering NON-POLITICAL services to young women to explain and assist with adoption, education, prenatal care and NFP. Using the federal law to restrict abortion is a bad idea: the issue is too sensitiv/personal and the exceptions are too common for a straight federal ban.",
            "title_similarity": "0.53472275",
            "sentiment_compound": 0.5165
        },
        {
            "id": "i3ejtt5",
            "score": 42,
            "text": "[removed]",
            "title_similarity": "0.08413527"
        },
        {
            "id": "i3ei29f",
            "score": 48,
            "text": "It's amazing how many states, including blue ones, never bothered to protect abortion after Roe v Wade in their state laws. This at least gives Texans another option beside New Mexico if they need to terminate a pregnancy. Not to mention all the red states around Colorado. \n\nGood stuff nevertheless.",
            "title_similarity": "0.59591645",
            "sentiment_compound": 0.7564
        },
        {
            "id": "i3efb8v",
            "score": 78,
            "text": "Yay freedom for women!",
            "title_similarity": "0.38621503",
            "sentiment_compound": 0.8356
        },
        {
            "id": "i3fd7rb",
            "score": 3,
            "text": "This is fantastic news. but watch - Colorado will probbably get more attention by the lunatics who will try to undo this.",
            "title_similarity": "0.47445413",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i3ehqvm",
            "score": 154,
            "text": "Society is better this way - People who don’t want/need abortions don’t have to get them. Religious psychos can scream and discriminate but that’s their choice. The world population is like 8 billion people!",
            "title_similarity": "0.4781863",
            "sentiment_compound": 0.5635
        },
        {
            "id": "i3ety5u",
            "score": 2,
            "text": "I'm a man I want to move to colorado. Nothing is stopping me. ok I'll just do it",
            "title_similarity": "0.5828818",
            "sentiment_compound": 0.4486
        },
        {
            "id": "i3ej1lh",
            "score": 63,
            "text": "Cue the cOloRaDo hAtEs bABIEs crowd. Also the same crowd that votes against child tax credits.",
            "title_similarity": "0.4255072",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i3fdzxs",
            "score": 10,
            "text": "At the risk of getting bombarded I’m gonna say: \n\nGet owned pro-lifer’s",
            "title_similarity": "0.47694683",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i3ffayy",
            "score": 10,
            "text": "I fell into a whole tiktok rabbit hole about this last night, fucking people blocking off clinics whilst chanting/praying etc. A lot of men involved for some reason.\n\nReal sad stuff, IQ's of a slug at best",
            "title_similarity": "0.16490784",
            "sentiment_compound": -0.197
        },
        {
            "id": "i3fk97s",
            "score": -11,
            "text": "[deleted]",
            "title_similarity": "0.08480234"
        },
        {
            "id": "i3epkws",
            "score": 27,
            "text": "It's really sad that this still has to be a headline in 2022. Fuck sake.",
            "title_similarity": "0.2515207",
            "sentiment_compound": -0.7841
        },
        {
            "id": "i3fqlfh",
            "score": 1,
            "text": "With all of the bad laws getting enacted in red states and the migration because of it, we are going to have states with a population of 100 people and 2 are senators.",
            "title_similarity": "0.40560445",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i3hcjzf",
            "score": 0,
            "text": "*miscarriage* rates are going to skyrocket in this country",
            "title_similarity": "0.29927978",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3epiq0",
            "score": 13,
            "text": "I'm so glad live in colorado. Sometimes I feel like the last bastion of sanity in a growing sea of crazy all around me.",
            "title_similarity": "0.46341985",
            "sentiment_compound": 0.624
        },
        {
            "id": "i3euwtq",
            "score": 18,
            "text": "This news will upset the white Taliban",
            "title_similarity": "0.32128417",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i3eudwz",
            "score": 22,
            "text": "If only Colorado wasn't so damn cold. Legal weed and basic human rights seem so tempting",
            "title_similarity": "0.6184591",
            "sentiment_compound": 0.5584
        },
        {
            "id": "i3fnmru",
            "score": -9,
            "text": "Hell yeah,  scoop em out.",
            "title_similarity": "0.22133009",
            "sentiment_compound": -0.4215
        },
        {
            "id": "i3exg6j",
            "score": 13,
            "text": "German here, why are questions of basic human rights ruled differently in all your states instead of being in nation-wide law/ jurisdiction",
            "title_similarity": "0.40709645",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fngkd",
            "score": 2,
            "text": "Good for Colorado. As a woman, Texas is now out of the running for me as a state to move to for work, even with their great job market. They have a lot going for them, but the far right stance is making it the opposite of California, which I guess is what they’re going for. \nI’d rather not have such a strong sided stance in whatever state I’m in, personally.",
            "title_similarity": "0.5718354",
            "sentiment_compound": 0.8381
        },
        {
            "id": "i3fr39c",
            "score": 1,
            "text": "Colorado is THE independent rights state. It's a blessing and a curse.",
            "title_similarity": "0.61887366",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i3g3xrk",
            "score": 4,
            "text": "It's your body, your life. No government or law should be able to tell you what to do with it.",
            "title_similarity": "0.33693093",
            "sentiment_compound": -0.296
        },
        {
            "id": "i3gg579",
            "score": 3,
            "text": "The only logical conclusion.  And it makes the other proposed laws look stupid.  Good all the way around.",
            "title_similarity": "0.3555455",
            "sentiment_compound": -0.128
        },
        {
            "id": "i3fejfu",
            "score": 16,
            "text": "Hell yeah. Eat shit, conservatives. Your archaic and cruel beliefs are slowly being chipped away by logic, reason, and empathy. Let’s hope we can live in a future where 13 year old rape victims aren’t forced to keep a pregnancy that might kill them.",
            "title_similarity": "0.39954138",
            "sentiment_compound": -0.9738
        },
        {
            "id": "i3f5y8v",
            "score": 20,
            "text": "Abortions are an essential health care service. As well as essential to maintaining peoples right to bodily autonomy. It’s sad that this self evident truth needs to be specifically enshrined in law, but such is the price we pay for allowing religion to influence our laws.",
            "title_similarity": "0.57799184",
            "sentiment_compound": 0.1655
        },
        {
            "id": "i3hbsne",
            "score": -9,
            "text": "25% of pregnancies end with the abortion method god uses.  Most of the time the woman didn't even know she was preggers.  \n\nWhy does man think his moral judgement is superior to god's?",
            "title_similarity": "0.45389122",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i3eqp27",
            "score": 4,
            "text": "And they have Planned Parenthood's that are part funded by legal Cannabis taxes. What a crazy idea, amiright?!",
            "title_similarity": "0.4953412",
            "sentiment_compound": -0.2942
        },
        {
            "id": "i3f6ku2",
            "score": 5,
            "text": "I love my state. We're setting the example once again. There is an ugly underbelly though.",
            "title_similarity": "0.29409504",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i3f8gy2",
            "score": 5,
            "text": "I love Colorado. Considering moving there! Lots to love",
            "title_similarity": "0.55729437",
            "sentiment_compound": 0.8655
        },
        {
            "id": "i3fd88t",
            "score": 7,
            "text": "Good for Colorado. They are about to be very busy saving the lives of women.",
            "title_similarity": "0.5482656",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3fpzw5",
            "score": 5,
            "text": "Can we just saw off Texas and push them away from the rest of the U.S.. Just a little?",
            "title_similarity": "0.39522332",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3gpi10",
            "score": 6,
            "text": "Good on Colorado but it's sad when basic human rights is somehow news worthy",
            "title_similarity": "0.45570824",
            "sentiment_compound": 0.1655
        },
        {
            "id": "i3gzl7w",
            "score": 5,
            "text": "I'm genuinely glad we have intelligent, progressive states like Colorado and California to offset the stupid, backwards ways of Florida and Texas.",
            "title_similarity": "0.56415194",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i3er0gu",
            "score": 5,
            "text": "Kansas did this three or four years ago, now Republicans have drafted a constitutional amendment to make it illegal.",
            "title_similarity": "0.54168403",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i3fl9x2",
            "score": 2,
            "text": "This needs an Amendment but I’m scared AF how it would be ruled now. It also Needs an expansion of SCOTUS with a watchdog that judges the judges. \n\nAbortion shouldn’t be even arguable in certain cases- rape, incest, minor, viability/health of the mother, some other things I’m probably forgetting. \n\nGood for CO moving in the right direction.",
            "title_similarity": "0.5074535",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i3g4qtv",
            "score": 2,
            "text": "As someone who has lived in Tx/FL his whole life Colorado is starting to look mighty nice",
            "title_similarity": "0.5568789",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i3g6rg5",
            "score": 2,
            "text": "I have been fucking terrified seeing these anti-abortion bills be enacted. This gives me hope.",
            "title_similarity": "0.46985346",
            "sentiment_compound": -0.3384
        },
        {
            "id": "i3fty8n",
            "score": 1,
            "text": "Another good reason to move to Colorado.",
            "title_similarity": "0.6338476",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3fz1ns",
            "score": 1,
            "text": "Colorado just want people to move there 😂😂😂. Either way, good on them",
            "title_similarity": "0.6487707",
            "sentiment_compound": 0.8979
        },
        {
            "id": "i3g4ekn",
            "score": 1,
            "text": "Boebert is gonna be pissed.",
            "title_similarity": "0.20649463",
            "sentiment_compound": -0.6369
        },
        {
            "id": "i3g52wp",
            "score": 1,
            "text": "I love Colorado. So beautiful",
            "title_similarity": "0.5335573",
            "sentiment_compound": 0.8553
        },
        {
            "id": "i3g5mzl",
            "score": 1,
            "text": "This is the proper way of doing so. You can't rely on the federal government to take care of State laws.",
            "title_similarity": "0.5553853",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i3g7bi0",
            "score": 1,
            "text": "Excellent work Colorado. It’s disgusting what’s happening in half the country when the West subsidizes their poor decisions in the end. I wonder if they are stoking a division but they - much like Russia - are barking at the moon.",
            "title_similarity": "0.37196156",
            "sentiment_compound": 0.3291
        },
        {
            "id": "i3etp9l",
            "score": 5,
            "text": "Do I need to move back to Colorado? I don't need any abortions or anything but Colorado just seems pretty cool these days.",
            "title_similarity": "0.5811974",
            "sentiment_compound": 0.8047
        },
        {
            "id": "i3fcshk",
            "score": 6,
            "text": "Yay Colorado! Thank you for supporting women's rights, and freedom of choice. My house, my rules. My body, my choice.",
            "title_similarity": "0.6270528",
            "sentiment_compound": 0.923
        },
        {
            "id": "i3fjvup",
            "score": 7,
            "text": "Colorado, always doing the right friggin thing everytime.",
            "title_similarity": "0.51613736",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3g6g2m",
            "score": 6,
            "text": "Hell yes. Women’s autonomy enshrined. Next up: federally.",
            "title_similarity": "0.5446029",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i3eqw0n",
            "score": -111,
            "text": "Colorado’s new state motto:  \n  \n“If you can’t afford it, abort it.”",
            "title_similarity": "0.6104077",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3er74o",
            "score": 15,
            "text": "Love my state. Colorado is surprisingly progressive for a western state, always had been. It was the first state to decriminalize abortion at all, it was the first state to give women suffrage by popular vote (Wyoming was first but it was by court decision), and the first state to legalize pot.",
            "title_similarity": "0.6980207",
            "sentiment_compound": 0.6249
        },
        {
            "id": "i3eqpmt",
            "score": -38,
            "text": "[deleted]",
            "title_similarity": "0.08480234"
        },
        {
            "id": "i3eyils",
            "score": -38,
            "text": "Colorado is really becoming the real California.\n\nCalifornia politics is constantly letting me down. Especially Los Angeles politics. \n\nMaybe I can move to Colorado.",
            "title_similarity": "0.48783118",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3ez43s",
            "score": 11,
            "text": "i bet theres some MALES reading this and getting angry!😂",
            "title_similarity": "0.08307524",
            "sentiment_compound": -0.1759
        },
        {
            "id": "i3esg5p",
            "score": 7,
            "text": "very progressive for america!",
            "title_similarity": "0.40706402",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3f6lmz",
            "score": 5,
            "text": "I love my home. I am glad we respect women's bodies and choices here. Bittersweet to be a haven for anyone seeking healthcare.",
            "title_similarity": "0.43171608",
            "sentiment_compound": 0.875
        },
        {
            "id": "i3frk9b",
            "score": 8,
            "text": "Time and time again, when Republicans are voted out of state governments, you hear good news from state legislatures.  The expansion of rights, the protection of liberties, and the general flourishing of people.",
            "title_similarity": "0.47919798",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i3g5b4t",
            "score": 8,
            "text": "take that, Lauren “my husband is a pedophile” Boebert",
            "title_similarity": "0.26869878",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3giaas",
            "score": -11,
            "text": "Stuff like this is why it sucks living in CO.  \n\n\nWe pass non-braindead stuff and everyone wants to move here, which drives up the cost of everything. Legalize weed, abortions, (anything a responsible adult could do with their bodies without legal resentment from someone else) nationwide and let us natives buy houses that aren't 4000% higher priced than they were 5 years ago.",
            "title_similarity": "0.46222895",
            "sentiment_compound": 0.5165
        },
        {
            "id": "i3etlvp",
            "score": 9,
            "text": "Hello and congratulations from a jealous Florida resident.  Kuddos to Colorado, what a beautiful state!",
            "title_similarity": "0.4592788",
            "sentiment_compound": 0.7263
        },
        {
            "id": "i3f5bsc",
            "score": 10,
            "text": "Congratulations Colorado! Wonderful news.",
            "title_similarity": "0.50392765",
            "sentiment_compound": 0.8356
        },
        {
            "id": "i3h1svv",
            "score": 8,
            "text": "Lol abortion should be legal... for all you so called patriots that talk of freedom, you care WAYYYYYYYYY too much about strangers lives. You are a authoritarian fuck if you object to body autonomy. The only logic people can bring to me is religion and once again, read the constitution. Congratulations though Colorado on securing basic freedoms in the LAND OF THE FREE.",
            "title_similarity": "0.6504373",
            "sentiment_compound": 0.9619
        },
        {
            "id": "i3hfoja",
            "score": 9,
            "text": "Good, it's about time a state doesn't regress societal progress. Anyone that thinks this law is a bad idea, go back to mideval times where you belong, you're not wanted in the 21st century.",
            "title_similarity": "0.46844295",
            "sentiment_compound": -0.4464
        },
        {
            "id": "i3fj022",
            "score": -24,
            "text": "Gotta stay in Colorado now to keep blowing loads unrelentlessly",
            "title_similarity": "0.51705754",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3evwj0",
            "score": 5,
            "text": "I’m moving to Colorado just cause they sound better than my state in most ways man",
            "title_similarity": "0.5759334",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3gf2r5",
            "score": 5,
            "text": "It always amazes me how an advanced country such as this US still is ancient on some policies like abortion. Ridiculous.",
            "title_similarity": "0.47013274",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i3gg8kr",
            "score": 5,
            "text": "Man as a german i'm fucking baffled that wasnt the case lol",
            "title_similarity": "0.16474424",
            "sentiment_compound": -0.3252
        },
        {
            "id": "i3g3rbm",
            "score": 3,
            "text": "Hey Texas! This is what respecting women looks like.",
            "title_similarity": "0.4956417",
            "sentiment_compound": 0.7177
        },
        {
            "id": "i3hetaw",
            "score": 1,
            "text": "Lead, follow or get out of the way! When you stand up for INDIVIUAL rights, then you will be there when they attack the rights of the whole! Amazing on the right and conservatives want ot restrict what you think, say, do, eat and the color of your house? As long as you look like talk like think like and most of all do as I say then we will get along!",
            "title_similarity": "0.44111988",
            "sentiment_compound": 0.7767
        },
        {
            "id": "i3f3v8u",
            "score": 8,
            "text": "This should be done in every state and I’d even go as far as to say that the constitution should be amended.",
            "title_similarity": "0.563648",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3f9ur8",
            "score": 17,
            "text": "Don't fucking tread on women. Good job.",
            "title_similarity": "0.3024736",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3f2gl4",
            "score": 7,
            "text": "Colorado lowkey being making sense a lot.",
            "title_similarity": "0.46121243",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fmqiz",
            "score": 5,
            "text": "Another win for women's rights.",
            "title_similarity": "0.42405903",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i3er780",
            "score": -2,
            "text": "Well, I suppose a lot of the Texas license plates won't be dragging Colorado to the right for too much longer.",
            "title_similarity": "0.45807913",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i3ev9rw",
            "score": 4,
            "text": "Now do something about electing morons and criminals",
            "title_similarity": "0.27984703",
            "sentiment_compound": -0.7184
        },
        {
            "id": "i3fzyc5",
            "score": 3,
            "text": "It would be nice if the article wasn't pay walled.  \n\n\nBut I am fully in favor of this. Abortion is self-defense. If another person is going to put any part of their body through any of my orifices, I have an absolute right to prevent that by whatever means necessary. If someone is going to put a finger through my vagina without my consent, I have the right to stop them, and if the only way to stop them is to kill them then I have that right.",
            "title_similarity": "0.58592176",
            "sentiment_compound": -0.8395
        },
        {
            "id": "i3g03q1",
            "score": 5,
            "text": "And there is language to prevent stupid \"personhood \" bills from popping up too. God I love this state.",
            "title_similarity": "0.49987823",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i3g59sz",
            "score": 5,
            "text": "When Arkansas does the inevitable later this year, Colorado will be on our short list of relocation destinations.\n\nI work for a tech company, so I can live anywhere. Let the brain drain commence!",
            "title_similarity": "0.5483778",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3gf1z3",
            "score": 3,
            "text": "I literally thought this was r/UpliftingNews bc this news is so uplifting.",
            "title_similarity": "0.33127898",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3gl1z5",
            "score": 8,
            "text": "I’m a Republican who is reluctantly pro abortion. Though I’m personally against it, I would never support any attempts to ban it. It’s insane to force someone who wants an abortion to be a parent.",
            "title_similarity": "0.49126178",
            "sentiment_compound": -0.8384
        },
        {
            "id": "i3exy0p",
            "score": 12,
            "text": "Lauren Boobshurt is goons be so mad when someone reads this headline to her.",
            "title_similarity": "0.22904766",
            "sentiment_compound": -0.6269
        },
        {
            "id": "i3eutme",
            "score": 40,
            "text": "It's official. If I leave TX I'm going to CO.",
            "title_similarity": "0.4694734",
            "sentiment_compound": 0.4648
        },
        {
            "id": "i3et0cj",
            "score": 7,
            "text": "This is great news!\n\nNow let’s hope that other blue states do the same.",
            "title_similarity": "0.38577914",
            "sentiment_compound": 0.807
        },
        {
            "id": "i3f3cmv",
            "score": 10,
            "text": "Colorado is starting to sound pretty awesome.  Great parks, great cities, weed, women are people, what’s the catch?",
            "title_similarity": "0.5830742",
            "sentiment_compound": 0.9477
        },
        {
            "id": "i3evwap",
            "score": 4,
            "text": "ok there's no way anyone in the comments actually read this article. it's subscriber only.",
            "title_similarity": "0.19451532",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fbjaw",
            "score": 5,
            "text": "Surprised Boebert isn't running her mouth over this.",
            "title_similarity": "0.22042097",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i3fchxj",
            "score": 4,
            "text": "lmao Lauren Boebert punching the air right now 😂",
            "title_similarity": "0.31087714",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i3gezh6",
            "score": 3,
            "text": "This is how freedom is accomplished.",
            "title_similarity": "0.3657841",
            "sentiment_compound": 0.7964
        },
        {
            "id": "i3ggdrs",
            "score": 4,
            "text": "I’m in Australia but of all the US states it kind of looks like Colorado is one of the few that has its shit together more recently",
            "title_similarity": "0.45421684",
            "sentiment_compound": -0.3919
        },
        {
            "id": "i3glwj9",
            "score": 4,
            "text": "Wow really a great day for people in Colorado I shouldn’t have to come to a law for this to happen",
            "title_similarity": "0.6055534",
            "sentiment_compound": 0.8473
        },
        {
            "id": "i3gp1hh",
            "score": 4,
            "text": "Honestly my opinion abortion good option because most people who doing abortion not in spot where they can take good care of child and also adoption and foster care system flawed.",
            "title_similarity": "0.45793808",
            "sentiment_compound": 0.9022
        },
        {
            "id": "i3h8d9x",
            "score": 3,
            "text": "Its funny that the government thinks it can take away the right to do with your own body what you please. These are unalienable rights that every person has. No matter what country or what your government says.",
            "title_similarity": "0.49921077",
            "sentiment_compound": 0.6281
        },
        {
            "id": "i3hav2t",
            "score": 4,
            "text": "GOOD FOR COLORADO! Time and time again, bodily autonomy has been upheld in the courts when mothers wanted to deny forced cesarean sections. If the courts can cite bodily autonomy as a woman’s right to STAY pregnant, then that should also apply to a woman’s desire to END a pregnancy.",
            "title_similarity": "0.6671624",
            "sentiment_compound": 0.3016
        },
        {
            "id": "i3fa77s",
            "score": 15,
            "text": "Wait, laws being passed that benefit people. I’m so confused. \n\nThis is wonderful. Need to read it now, see if it gets better than the headline o:",
            "title_similarity": "0.46050304",
            "sentiment_compound": 0.7513
        },
        {
            "id": "i3hahun",
            "score": -14,
            "text": "Very sad, every person has the right to life.",
            "title_similarity": "0.26141313",
            "sentiment_compound": -0.5256
        },
        {
            "id": "i3ehq9i",
            "score": -31,
            "text": "I wish I wanted to love.  Colorado is pretty awesome",
            "title_similarity": "0.57685274",
            "sentiment_compound": 0.9349
        },
        {
            "id": "i3f86ss",
            "score": 9,
            "text": "Colorado is quickly becoming the most freedom loving state in this messed up country. Wish I could move there.",
            "title_similarity": "0.6020067",
            "sentiment_compound": 0.8632
        },
        {
            "id": "i3f6pdr",
            "score": 4,
            "text": "What I don't fully understand is how it's federally legal but states can deny it. Like, state that allowed pot to be sold legally still got raided by the feds.",
            "title_similarity": "0.3992611",
            "sentiment_compound": 0.25
        },
        {
            "id": "i3fdv7z",
            "score": 6,
            "text": "It’s interesting that the home state of Boebert protects what she and her party take from other states. Marijuana is legal there too. How did she get elected there?",
            "title_similarity": "0.6280042",
            "sentiment_compound": 0.802
        },
        {
            "id": "i3fsrqb",
            "score": 5,
            "text": "Imagine trying to tell somebody what they are allowed to do with their body...\n\nGood job Colorado",
            "title_similarity": "0.62731504",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3gjxyo",
            "score": 6,
            "text": "Wow I was expecting another state to outlaw it. Nice to see good news on this for once",
            "title_similarity": "0.4465022",
            "sentiment_compound": 0.8591
        },
        {
            "id": "i3gvciq",
            "score": 5,
            "text": "good.  At least some states have some sense of rights.",
            "title_similarity": "0.3702571",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3h9lh1",
            "score": 5,
            "text": "Almost everytime I see news from Colorado it's just them being all awesome and shit.\n\nI used to say I wanted to move their for the mountain views and people would scoff and call me a pothead. Now I just want to move their because their state government seems to hate it's people just a little less than other states.",
            "title_similarity": "0.45113266",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i3fjsjl",
            "score": -60,
            "text": "Sad to see more places allowing baby murder",
            "title_similarity": "0.2033077",
            "sentiment_compound": -0.8316
        },
        {
            "id": "i3f44d4",
            "score": 19,
            "text": "I've been wondering about places to move and honestly Colorado just more and more seems like the place I should go to. Their values seem to line up with mine a lot more than pretty much any other state.  \n\nWhile I don't think I'm ever gonna need an abortion or access to one even, but I'm glad CO now guarantees the right for those who want/need access to it.",
            "title_similarity": "0.679494",
            "sentiment_compound": 0.8744
        },
        {
            "id": "i3g5to3",
            "score": -21,
            "text": "Nice nothing better then woke Democrats killing then call for social justice",
            "title_similarity": "0.37620765",
            "sentiment_compound": -0.1546
        },
        {
            "id": "i3g6udm",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.08413527"
        },
        {
            "id": "i3hggwz",
            "score": 18,
            "text": "So, a law that allows women the right to save their own life. Guess that makes Colorado the first pro-life state.",
            "title_similarity": "0.71792996",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i3ezbkd",
            "score": 13,
            "text": "If I leave GA, CO is my #1 destination.",
            "title_similarity": "0.40378022",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i3gviwv",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.08413527"
        },
        {
            "id": "i3etquw",
            "score": -25,
            "text": "Good. Men should be able to get an abortion whenever they want regardless of what anyone else sees says or believes. That is only between you, your doctor, and God.",
            "title_similarity": "0.5731988",
            "sentiment_compound": 0.6486
        },
        {
            "id": "i3exxnw",
            "score": 30,
            "text": "And here's how the ~~nice people~~ insane zealots at LifeNews.com characterized it:\n\nhttps://www.lifenews.com/2022/04/04/colorado-gov-jared-polis-signs-bill-to-legalize-abortions-up-to-birth-with-no-limits/\n\nIn the immortal words of Chief Justice John Marshall:  Suck it, scumbags.",
            "title_similarity": "0.61595166",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i3fwrud",
            "score": -44,
            "text": "Hmmm... \n\nIf you can't be bothered to use birth control do the world a favor and get snipped. The endless abortion cycle has some women with killcounts higher than some serials.\n\nNot to conflate that with safe legal and rare for the life of the mother nd that kind of shit.\n\nHowever, life threatening and life altering are 2 different things.\n\nGate keep yourself.\n\n\n\nIf you think I want the respect of abortionists. You're sadly mistaken.\n\nA survey of more than 2.4 million aborting women performed by the states of Florida, Louisiana, Minnesota, Nebraska, South Dakota and Utah during the years 1996 to 2020 gives us an accurate estimate of the number of “hard case” abortions, since these are the numbers that abortion clinics must report in official documents to these states:\n\n1.14% are done to save the life or physical health of the mother.\n1.28% to preserve the mental health of the mother.\n0.39% in cases of rape or incest.\n0.69% for fetal birth defects, or eugenics.\n3.50% for all the hard cases combined.\n96.50% of all abortions are therefore performed for social or economic reasons.2\nEven the Guttmacher Institute puts the number of abortions done for the hard cases under 7% after doing several surveys of women obtaining abortions (the Guttmacher Institute was the research arm of the Planned Parenthood Federation of America, the largest chain of abortion clinics in the United States. It is considered the most reliable provider of accurate statistics on abortion).\n\nhttps://www.hli.org/resources/why-women-abort/\n\nhttps://www.cdc.gov/reproductivehealth/data_stats/index.htm",
            "title_similarity": "0.50813633",
            "sentiment_compound": -0.5763
        },
        {
            "id": "i3ewoj9",
            "score": 11,
            "text": "From the earliest days of being taught what it means to be an American, it was always drilled into me the separation of church and state.  The second most drilled lesson is the freedom to be whatever you want to be, so long as it didn’t have an impact on someone else’s pursuit of their freedoms.  \n\nThen the abortion topic was brought to my conscious…and it never made sense to me that someone else’s beliefs could possibly be codified in law, and during that time, it was never a concern.  \n\nAnd now, in 2022, we face the possibility that someone else’s perceptions could very well be codified into law and affect people.   \n\nWhy can’t conservatives get through their head that their views do not reflect everyone else’s?",
            "title_similarity": "0.523477",
            "sentiment_compound": 0.8439
        },
        {
            "id": "i3f6egf",
            "score": 14,
            "text": "Proud to be born and raised in Colorado",
            "title_similarity": "0.58549315",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i3eu2td",
            "score": 6,
            "text": "I feel bad for whatever republican gets forced into running against him.  He will win reelection in a landslide",
            "title_similarity": "0.33590317",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i3f5z1g",
            "score": 6,
            "text": "This is the best news I've had all week",
            "title_similarity": "0.30149263",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i3fyjin",
            "score": 7,
            "text": "Just my opinion but I honestly believe that more Govs should follow suite and make it a law to allow women the choice if they want to proceed with an abortion or not. It shouldn’t be left up too a grumpy Caucasian 70yr old man anyways.",
            "title_similarity": "0.62771314",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i3esvsc",
            "score": 68,
            "text": "Which means abortion is available for the people of Utah, Wyoming, Nebraska, New Mexico, and Kansas.\n\nEdit: I don't need a play by play on where it's legal. It fucking LEGAL IN ALL 50 goddamn states. Forgive me for abbreviating; If ROE V WADE is overturned and abortion goes back to being a state by state matter, Colorado having it in law ensures access for all the neighbors as well.",
            "title_similarity": "0.7335609",
            "sentiment_compound": 0.5559
        },
        {
            "id": "i3finea",
            "score": 1,
            "text": "Voters are polar opposite divided, green energy is polar opposite divided, politics are polar opposite divided, state laws are polar opposite divided on some things, interpretation of the constitution and of freedom is polar opposite divided.\n\nI don't mean simply One has it, other don't/neutral; I mean full on for it OR full on against it - no nuances.\n\nLooks promising...",
            "title_similarity": "0.4107536",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i3ftl3v",
            "score": 1,
            "text": "Hey wow I grew up in Colorado and for once I am very proud.",
            "title_similarity": "0.563979",
            "sentiment_compound": 0.8016
        },
        {
            "id": "i3ftq9l",
            "score": 1,
            "text": "It's nice that they actually get things done. I haven't, and probably won't, return but it's nice to see it doing well.",
            "title_similarity": "0.28706613",
            "sentiment_compound": 0.8047
        },
        {
            "id": "i3fumq1",
            "score": -1,
            "text": "Oregon welcomes you to the group.",
            "title_similarity": "0.4215471",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i3gg2pe",
            "score": -1,
            "text": "I thought it already did.",
            "title_similarity": "0.24564517",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3gwz8e",
            "score": -1,
            "text": "This won't get political at all, but I hope the hell it will be used as an example.",
            "title_similarity": "0.27047193",
            "sentiment_compound": -0.5499
        },
        {
            "id": "i3h35to",
            "score": 1,
            "text": "Can’t wait for the South Park episode on this",
            "title_similarity": "0.22864856",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3forjj",
            "score": -41,
            "text": "[removed]",
            "title_similarity": "0.08413525"
        },
        {
            "id": "i3fa0fw",
            "score": 7,
            "text": "That’s good to hear in 2022.",
            "title_similarity": "0.3495385",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3fmu7g",
            "score": 8,
            "text": "Good for you Colorado. Government has no rights to anyone's body. Let the woman choose what she wants.",
            "title_similarity": "0.5556593",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i3fsbo8",
            "score": 6,
            "text": "It always boggles me how the people who will complain about a woman getting an abortion are some of the same who say they have the right to do whatever they feel to their bodies and that the government shouldn’t be forcing us to do things.",
            "title_similarity": "0.49189538",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i3f3ft8",
            "score": 12,
            "text": "Colorado knows wassup.",
            "title_similarity": "0.5749155",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3f7akw",
            "score": -58,
            "text": "Legalized murder because why pay consequences for poor sexual partner decisions. Seems about on par for America in 2022.",
            "title_similarity": "0.47656858",
            "sentiment_compound": -0.8481
        },
        {
            "id": "i3ess9y",
            "score": 132,
            "text": "Thank you u/jaredpolis and all of the legislators that have made this bill a reality. \n\nI'm proud to live in a state where the complex realities of human birth and reproductive rights are left to trained medical professionals and pregnant women rather than draconian government control and religious extremists.\n\nPlease continue to support these women as states such as Texas explore the death penalty for women and doctors seeking options to terminate a pregnancy.",
            "title_similarity": "0.6261121",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i3f4fmy",
            "score": 8,
            "text": "Colorado really ahead of the game it feels like. Hope to be a future resident there the state has always attracted me coming from FL.",
            "title_similarity": "0.5688548",
            "sentiment_compound": 0.802
        },
        {
            "id": "i3fjo8l",
            "score": 6,
            "text": "The fact that any \"nation\" is \"deciding\" whether or not this should be legal or not in 2022 is disgraceful.",
            "title_similarity": "0.34015036",
            "sentiment_compound": 0.128
        },
        {
            "id": "i3ehnhj",
            "score": 243,
            "text": "With all the Lauren Boebert shit I’m glad we have such a great governor like Polis to outweigh all of her bullshit.",
            "title_similarity": "0.5118986",
            "sentiment_compound": 0.296
        },
        {
            "id": "i3eaocj",
            "score": 474,
            "text": "[deleted]",
            "title_similarity": "0.08480234"
        },
        {
            "id": "i3fbjt8",
            "score": 11,
            "text": "I’m never leaving Colorado ever. Except to go to Mexico for the beaches.",
            "title_similarity": "0.46400225",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3g7jvy",
            "score": 10,
            "text": "Haha fuck you Boebert",
            "title_similarity": "0.13921079",
            "sentiment_compound": -0.128
        },
        {
            "id": "i3h4f55",
            "score": 8,
            "text": "Republicans will always be able to get an abortion for their daughters and mistresses",
            "title_similarity": "0.6181083",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3euto8",
            "score": 2,
            "text": "This is great news.  I am curious though, what happens if a federal ban where to happen somehow? Would that supersede a state constitution?",
            "title_similarity": "0.55554706",
            "sentiment_compound": 0.4871
        },
        {
            "id": "i3f5hiz",
            "score": 2,
            "text": "Isn't federalism great!",
            "title_similarity": "0.29824564",
            "sentiment_compound": -0.5553
        },
        {
            "id": "i3fmj5a",
            "score": 2,
            "text": "This is the way forward state by state. Bodily autonomy for all!",
            "title_similarity": "0.5437235",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fmrld",
            "score": 2,
            "text": "Everybody a round of applause for our boys in Colorado. Thank you for restoring a little of my faith in our species.",
            "title_similarity": "0.4600721",
            "sentiment_compound": 0.8417
        },
        {
            "id": "i3fpu55",
            "score": 2,
            "text": "“In other news, Colorado Springs officially secedes. Rest of Colorado rejoices”",
            "title_similarity": "0.5699694",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fu8s6",
            "score": 2,
            "text": "God I love living here.",
            "title_similarity": "0.25563657",
            "sentiment_compound": 0.743
        },
        {
            "id": "i3fud33",
            "score": 2,
            "text": "So Colorado finally entered modern times. \nnoice.",
            "title_similarity": "0.56476307",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fx39m",
            "score": 2,
            "text": "I’m so glad I live in Colorado thank fuck",
            "title_similarity": "0.5534357",
            "sentiment_compound": 0.3167
        },
        {
            "id": "i3g423g",
            "score": 2,
            "text": "Nice! Stupid question, and it could be just me, but wasn’t CO kind of a hick state before legalizing weed? Or am I just imagining things?",
            "title_similarity": "0.34472653",
            "sentiment_compound": -0.2387
        },
        {
            "id": "i3g7u0i",
            "score": 2,
            "text": "Colorado best state now!",
            "title_similarity": "0.59563977",
            "sentiment_compound": 0.6696
        },
        {
            "id": "i3hba66",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.08413527"
        },
        {
            "id": "i3fnete",
            "score": -24,
            "text": "Shame on everyone who voted for this nonsense.",
            "title_similarity": "0.13217029",
            "sentiment_compound": -0.7371
        },
        {
            "id": "i3f1xqo",
            "score": 10,
            "text": "Careful, Texas will pass a law making it illegal in Colorado due to government overreach anyway. /s",
            "title_similarity": "0.593637",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i3f6rs9",
            "score": 12,
            "text": "Nice! Democrats better step up on a large scale and protect women’s rights like this and stop dangling abortion rights like a carrot at the end of the stick.",
            "title_similarity": "0.58438057",
            "sentiment_compound": 0.8858
        },
        {
            "id": "i3hbw2g",
            "score": 10,
            "text": "That’s our state apologizing for Lauren Boebert.",
            "title_similarity": "0.42628616",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i3hf8e5",
            "score": -10,
            "text": "while im personally against it, states are ultimately who should decide this issue, not at the federal level. Good for you CO. Represent your constituents appropriately.",
            "title_similarity": "0.42788464",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3fq5c2",
            "score": -19,
            "text": "You have the right to free speech, free assembly, and the right to kill fetuses.   Am I wrong?\nEdit:  why the down votes? Did I say anything incorrectly?",
            "title_similarity": "0.53740036",
            "sentiment_compound": -0.4098
        },
        {
            "id": "i3frxws",
            "score": -19,
            "text": "I don’t believe in abortion, but if a state approves it far be it from me to tell Colorado how they should live when I live in New York. I simply ask myself this. If it is not in the Constitution then the states make laws for themselves. If you don’t like your state then move with your feet. I’ll probably get banned but oh well. Intelligent, adult debate no longer is welcome.",
            "title_similarity": "0.47936195",
            "sentiment_compound": 0.8922
        },
        {
            "id": "i3g2zat",
            "score": -21,
            "text": "I don’t personally care for abortion, but this is what states rights are all about. Repeal Roe v Wade and make individual states pass laws for or against abortion. Keep it at the state level.",
            "title_similarity": "0.62318325",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i3g8rrr",
            "score": -20,
            "text": "[removed]",
            "title_similarity": "0.08413527"
        },
        {
            "id": "i3exi4y",
            "score": 230,
            "text": "Something tells me that those states passing archaic anti-abortion laws is nothing more than a façade. I’d bet 100$ that if the mistresses of any of those lawmakers ended up pregnant they would be first in line somewhere that it’s still legal.",
            "title_similarity": "0.6060424",
            "sentiment_compound": 0.128
        },
        {
            "id": "i3ev69b",
            "score": -66,
            "text": "What a shame. Californication really ruining America.",
            "title_similarity": "0.1887509",
            "sentiment_compound": -0.659
        },
        {
            "id": "i3fgynf",
            "score": -12,
            "text": "one less Jon Bennett Ramsey",
            "title_similarity": "0.15312162",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fnhou",
            "score": 11,
            "text": "I wonder how many Texas Republicans will sneak their daughters up there under the radar.",
            "title_similarity": "0.45808813",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3e19au",
            "score": 3920,
            "text": "This is why I vote for Democrats at the state level. Unlike at the federal level, they actually get shit done.",
            "title_similarity": "0.4033543",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i3envs1",
            "score": 35,
            "text": "Are those sneakers in a suit?",
            "title_similarity": "0.16857311",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3f224j",
            "score": 34,
            "text": "If they actually do enshrine this in the constitution before the Supreme Court has a chance to rule on it, there is a good chance it could hamstruing any decision on Roe v Wade because then it would becomes a states rights issue. If CO guarantees the right to choice, the federal government then cannot make laws that would infringe upon that right. It's a brilliant move, if they codify it.",
            "title_similarity": "0.5809955",
            "sentiment_compound": 0.9231
        },
        {
            "id": "i3fpbld",
            "score": -32,
            "text": "Murder shouldn’t be legal. That baby isn’t apart of your body. It’s a growing entity that is relying on you to be responsible to protect and nurture it. If you don’t want children then use fucking protection.",
            "title_similarity": "0.42339468",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i3f5t94",
            "score": 3,
            "text": "This is how it should be - states controlling their own destiny. Good on them.",
            "title_similarity": "0.43557358",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3f6s20",
            "score": 1,
            "text": "A good state they are",
            "title_similarity": "0.30713677",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3flm5l",
            "score": 2,
            "text": "I would host someone in need to come, get the medical attn needed, and stay to recover.",
            "title_similarity": "0.39304215",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fry1y",
            "score": 2,
            "text": "Can't wait to read Boebert's impotent rage tweets",
            "title_similarity": "0.2338017",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i3fyoyw",
            "score": 4,
            "text": "Something is very wrong when simple  common sense is celebrated as a great achievement",
            "title_similarity": "0.24179095",
            "sentiment_compound": 0.6605
        },
        {
            "id": "i3g7unp",
            "score": 3,
            "text": "I am deeply disappointed that Colorado beat Oregon to the punch!",
            "title_similarity": "0.30672914",
            "sentiment_compound": -0.5697
        },
        {
            "id": "i3g9asd",
            "score": 3,
            "text": "They should sponsor free bus rides from Texas.",
            "title_similarity": "0.53513247",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i3gbaq0",
            "score": 3,
            "text": "God, why do thinks keep going right in Colorado but Texas only gets worse?",
            "title_similarity": "0.47268382",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i3ew2ci",
            "score": -51,
            "text": "[removed]",
            "title_similarity": "0.08413527"
        },
        {
            "id": "i3f8kps",
            "score": -47,
            "text": "It's helpful that the power-drunk mod has pinned their comment stating indirectly that they will be removing comments that don't agree with their views.",
            "title_similarity": "0.37050998",
            "sentiment_compound": 0.1754
        },
        {
            "id": "i3eynnw",
            "score": 10,
            "text": "One huge thing to do to make voting easier is to make Election Day a National holiday. Instead of Presidents Day let’s have Election Day!!",
            "title_similarity": "0.53142565",
            "sentiment_compound": 0.8118
        },
        {
            "id": "i3ggaad",
            "score": -12,
            "text": "Hope they get rid of child support next.",
            "title_similarity": "0.3330113",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i3gnkiq",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.08413527"
        },
        {
            "id": "i3enmcj",
            "score": -118,
            "text": "This should be a solemn moment, not a party. Not all abortions are required. Some are downright evil.",
            "title_similarity": "0.46661687",
            "sentiment_compound": -0.7881
        },
        {
            "id": "i3ewwzx",
            "score": 24,
            "text": "Yes it’s a popular state but Colorado is not cheap. Probably the most expensive state between the two coasts.",
            "title_similarity": "0.38092804",
            "sentiment_compound": 0.4118
        },
        {
            "id": "i3gik5d",
            "score": -24,
            "text": "Can't wait until they strike down roe v wade",
            "title_similarity": "0.4042924",
            "sentiment_compound": -0.128
        },
        {
            "id": "i3es4j1",
            "score": 563,
            "text": "Breaking news, TX governor signs bill making it illegal for TX residents to travel to Colorado. And somehow the GOP is the “small government” party. Good for you Colorado. Edited reading news to say breaking news.",
            "title_similarity": "0.54684496",
            "sentiment_compound": 0.8159
        },
        {
            "id": "i3fnaws",
            "score": -15,
            "text": "... and yet still a \"no\" to corporal punishment.",
            "title_similarity": "0.19876675",
            "sentiment_compound": -0.4939
        },
        {
            "id": "i3ewe5m",
            "score": 5,
            "text": "I can just hear the states rights people walking back the concept now.",
            "title_similarity": "0.3984645",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fo2vj",
            "score": 3,
            "text": "Not a single post for miles about this on r/conservative",
            "title_similarity": "0.2493999",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fte2i",
            "score": 4,
            "text": "The next Supreme Court hurdle after the current one regarding abortion (Mississippi I believe is the plaintiff) will be in whether States can prosecute someone going to another State to do something illegal in there's (abortion, etc.)\n\nAnd...this may well come as a surprise to some...I think they are going to get a very rude awakening in regard to the current makeup of the Supreme Court.\n\nThe same Justices they cheer for \"original intent!\" and \"state's rights!\" are going to be the ones the right-wing decries when every such suit gets decided 6-2 in opposition with only Thomas and Alito sticking to a spaghetti-like twist to oppose Interstate Commerce protections clearly written in plain English in the Constitution.\n\nI know the liberal Justices will support them, but I can tell you right now Roberts, Barrett and Gorsuch will too.\n\n*To be clear in case my writing is a little thick, I'm saying as more and more States specifically enshrine abortion rights into Law, the current Supreme Court will uphold a citizen's right to travel TO those States to obtain those services and make any attempt by the States outlawing abortion to stop them null-and-void by ruling they violate the Commerce Clause.*\n\n**i.e. -- I can see the current Supreme Court maybe (and I'm still not convinced they will, but we'll all see in the coming months) throwing out R-v-W or at least neutering it so States can legally restrict abortion, however the very judicial philosophy that will drive the current majority to do that will also make them side with States that specifically** ***ALLOW*** **for Abortion Rights.**\n\nSaid another way, the right-wingers can have their abortions but they can't eat them too LOL",
            "title_similarity": "0.5374065",
            "sentiment_compound": 0.9555
        },
        {
            "id": "i3fw1uh",
            "score": 5,
            "text": "Meanwhile the death penalty in Texas! What a conflicted Nation",
            "title_similarity": "0.34133822",
            "sentiment_compound": -0.8016
        },
        {
            "id": "i3fxn2m",
            "score": 3,
            "text": "As a citizen or the state of Colorado I would support an initiative that used my tax dollars to regularly charter round trip bus rides from major cities in Oklahoma and Texas to abortion clinics in Colorado.",
            "title_similarity": "0.65771914",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i3gahhf",
            "score": 5,
            "text": "Colorado resident here. Now we know where the Republican donor class will send their mistresses for a “ski” vacation.",
            "title_similarity": "0.6169667",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3garv1",
            "score": 4,
            "text": "As a Coloradan, I have no opinion on this matter. Because it's none of my business. Wanna have kids? Great.. Good for you. Don't wanna have kids? Great.. good for you",
            "title_similarity": "0.32704794",
            "sentiment_compound": 0.9229
        },
        {
            "id": "i3h6ne7",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.08413525"
        },
        {
            "id": "i3f3wto",
            "score": -55,
            "text": "In other words they guarantee the right to murder damn what a wild time to be alive",
            "title_similarity": "0.45960885",
            "sentiment_compound": -0.5859
        },
        {
            "id": "i3fykyt",
            "score": -14,
            "text": "And they also guarantee your are going to get robbed on your driveway…",
            "title_similarity": "0.35334635",
            "sentiment_compound": 0.25
        },
        {
            "id": "i3era9c",
            "score": 107,
            "text": "Get ready to have a lot of “vacationing” Texans.",
            "title_similarity": "0.3644749",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i3fdz9r",
            "score": -33,
            "text": "My girl doesn’t want an abortion. Does this mean I have the right to force her now?",
            "title_similarity": "0.43218938",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i3g14hb",
            "score": -25,
            "text": "The updates & celebration over the right to kill your children is disgusting. One day you will face God for all your sin, good luck dummies.\nWake up before it's to late & repent of your sins, come to Christ or you will face the wrath of God on judgement day.",
            "title_similarity": "0.2972054",
            "sentiment_compound": -0.765
        },
        {
            "id": "i3f43ou",
            "score": 15,
            "text": "Crazy the same state that gave us Boebert the clown.",
            "title_similarity": "0.29676685",
            "sentiment_compound": -0.34
        },
        {
            "id": "i3fchja",
            "score": 6,
            "text": "Thank you Polis!!! So proud to be a Colorado native with th right to choose!!",
            "title_similarity": "0.5942678",
            "sentiment_compound": 0.8252
        },
        {
            "id": "i3fm2ro",
            "score": 7,
            "text": "Nice that some states want to keep moving forward in time.",
            "title_similarity": "0.37705672",
            "sentiment_compound": 0.4767
        },
        {
            "id": "i3futdr",
            "score": 5,
            "text": "Now if Colorado could preven Boebert come to DC again, i would really appreciate it.",
            "title_similarity": "0.622928",
            "sentiment_compound": 0.4576
        },
        {
            "id": "i3gabxl",
            "score": 6,
            "text": "As a Canadian it's nice to see that not all the states are going backwards with regards to human rights",
            "title_similarity": "0.48939717",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i3elsuh",
            "score": -49,
            "text": "Under what terms? Because it can be accurately said that Texas guarantees the right to an abortion,  even though we all know better.",
            "title_similarity": "0.76580894",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3edtx7",
            "score": -22,
            "text": "[removed]",
            "title_similarity": "0.08413525"
        },
        {
            "id": "i3eyw65",
            "score": 64,
            "text": "Great job Colorado... Now just don't elect a moron to represent you in Congress",
            "title_similarity": "0.50868964",
            "sentiment_compound": 0.7736
        },
        {
            "id": "i3e101q",
            "score": 2827,
            "text": "It's great that they did this. The sad thing about this, however, is that, unless it was enshrined in their constitution, the next time the Republicans are in charge of the legislature & the governor's office, this can just as easily be repealed and reversed.",
            "title_similarity": "0.5207402",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i3f4tqq",
            "score": 33,
            "text": "This is absolutely great.  In general when it comes to a person's health the government should never be a limiting factor.",
            "title_similarity": "0.44079223",
            "sentiment_compound": 0.659
        },
        {
            "id": "i3f9w4k",
            "score": -34,
            "text": "And, yet, they still don’t fully recognize the constitutionally protected right to bear arms.",
            "title_similarity": "0.27585128",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i3ffbva",
            "score": -32,
            "text": "I have been conflicted about this issue for a while ..I dont necessarily believe in \"life begins at conception\" ...But I believe once there is a heartbeat there is life...there has to be a compromise ..there just has to be...",
            "title_similarity": "0.3548883",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fhfmp",
            "score": -35,
            "text": "[deleted]",
            "title_similarity": "0.084802315"
        },
        {
            "id": "i3fm6uc",
            "score": -34,
            "text": "So Colorado is cool with killing humans. Gotcha",
            "title_similarity": "0.52932495",
            "sentiment_compound": -0.4284
        },
        {
            "id": "i3fq3wz",
            "score": -31,
            "text": "In colorado, you can't buy a new box with a spring in it that can hold more than 15 rounds, but you can kill your unborn kid. \n\nStrange, why not both?",
            "title_similarity": "0.45387286",
            "sentiment_compound": -0.8674
        },
        {
            "id": "i3fff7j",
            "score": 19,
            "text": "Skiing, weed, and civil liberties. Just some of the many perks living in Colorado provides!",
            "title_similarity": "0.6102576",
            "sentiment_compound": 0.5562
        },
        {
            "id": "i3f7i8d",
            "score": -50,
            "text": "Making abortion legal across the entire pregnancy for any reason is disgusting.",
            "title_similarity": "0.4431213",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i3ey0yj",
            "score": 24,
            "text": "Fuckin move Disneyland there ASAP",
            "title_similarity": "0.37982383",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3ewb69",
            "score": -45,
            "text": "I support abortion rights, but I don't know where to draw the line. How about you? Like, if someone wants to abort a 9-month old fetus that could be born at any moment, should that be legal? Legal for any reason? Like, this \"it's the woman's body\" argument obviously doesn't hold up when you start considering the prospect of killing an old fetus for fun, for example, right?",
            "title_similarity": "0.5245392",
            "sentiment_compound": 0.8276
        },
        {
            "id": "i3f3bes",
            "score": 41,
            "text": "I’ve moved around a lot. But I’m pretty proud to be born in Colorado.",
            "title_similarity": "0.56464314",
            "sentiment_compound": 0.8573
        },
        {
            "id": "i3fkpmg",
            "score": -40,
            "text": "Killing babies is wrong. What the hell is wrong with yall?",
            "title_similarity": "0.25600904",
            "sentiment_compound": -0.9451
        },
        {
            "id": "i3ermhv",
            "score": -85,
            "text": "[removed]",
            "title_similarity": "0.08413525"
        },
        {
            "id": "i3eq0cp",
            "score": -64,
            "text": "Down vote if you like dead babies!\n\nEdit: Jesus Christ Reddit",
            "title_similarity": "0.33294666",
            "sentiment_compound": -0.4753
        },
        {
            "id": "i3g3qsp",
            "score": -7,
            "text": "Most of the times I see things like this, there are 66.6 thousand likes or another variation of tenths. Not religious at all, but it happens so much I’m considering it.",
            "title_similarity": "0.30289352",
            "sentiment_compound": 0.3919
        },
        {
            "id": "i3ey0fd",
            "score": -28,
            "text": "Does anywhere in the Bill specify time frames for abortion or just abortion will be legal in general? Outside of health complications late term abortions are disgusting.",
            "title_similarity": "0.50494593",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i3f6v84",
            "score": -31,
            "text": "Irresponsible males in CO rejoice!",
            "title_similarity": "0.12577823",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3ffkd1",
            "score": -30,
            "text": "Politicians can’t fix real problems but celebrate shit like this …..",
            "title_similarity": "0.25144386",
            "sentiment_compound": 0.3716
        },
        {
            "id": "i3fg2f5",
            "score": -29,
            "text": "Can we get the abortion age moved to 18 years, so dad has a chance to say no as well?\n\nI mean, most people demonstrate how horrible they are by then anyways.",
            "title_similarity": "0.42376164",
            "sentiment_compound": -0.672
        },
        {
            "id": "i3g1yf5",
            "score": -8,
            "text": "Ahh, the let's murder children crowd riled up",
            "title_similarity": "0.17916822",
            "sentiment_compound": -0.6908
        },
        {
            "id": "i3gbk5p",
            "score": -8,
            "text": "I know this isn't popular with the pro-life crowd or the pro-choice crowd but it should be States right.",
            "title_similarity": "0.32892478",
            "sentiment_compound": -0.1695
        },
        {
            "id": "i3fj45g",
            "score": -35,
            "text": "Oh, look, people have the legal right to murder children. Hurray. \n\n/s",
            "title_similarity": "0.45214087",
            "sentiment_compound": -0.128
        },
        {
            "id": "i3fr7in",
            "score": -11,
            "text": "this means you have to get at least one if you ever have a baby right",
            "title_similarity": "0.4424907",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3eu8ao",
            "score": 1924,
            "text": "Just left Missouri to move back to Colorado. So happy to be back",
            "title_similarity": "0.56609315",
            "sentiment_compound": 0.6948
        },
        {
            "id": "i3etcsy",
            "score": 1002,
            "text": "Mountains, good economy, weed, healthcare now.  Must be nice!",
            "title_similarity": "0.46871477",
            "sentiment_compound": 0.7177
        },
        {
            "id": "i3fa2d5",
            "score": -39,
            "text": "May the God Most High swiftly judge the State of Colorado and her people.",
            "title_similarity": "0.6433119",
            "sentiment_compound": 0.5542
        },
        {
            "id": "i3fgulo",
            "score": -36,
            "text": "Women be like isn't it great I get to kill my future child",
            "title_similarity": "0.38817346",
            "sentiment_compound": -0.7575
        },
        {
            "id": "i3fpqq0",
            "score": -11,
            "text": "You have the right to remain silent. You have the right to an abortion. You have the right to a lawyer. If you can't afford a lawyer then a public defender will be appointed to you.",
            "title_similarity": "0.6086035",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i3fbrt0",
            "score": 100,
            "text": "Things like this are why, despite the high cost of living here in CO, I stay. I’ve lived in backwards ass states, the difference feels like night and day.",
            "title_similarity": "0.30828902",
            "sentiment_compound": 0.128
        },
        {
            "id": "i3er5fo",
            "score": -16,
            "text": "So much for “settled law”…",
            "title_similarity": "0.36484692",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3eyz21",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.08413525"
        },
        {
            "id": "i3f76xk",
            "score": -18,
            "text": "And free disposal of the waste!",
            "title_similarity": "0.3341164",
            "sentiment_compound": 0.2003
        },
        {
            "id": "i3fddg0",
            "score": -23,
            "text": "Does this mean they're going to stop trying to force the policy on states that don't want it, and return the issue to the states, where it belongs?",
            "title_similarity": "0.43756688",
            "sentiment_compound": -0.3447
        },
        {
            "id": "i3fo0he",
            "score": -25,
            "text": "Does everyone here know this means you can have an abortion at full term including just before the moment of birth? Like literally as you’re in labour, you can choose to abort and kill the baby? I’m curious what people think about that (genuinely curious, I’m not here to argue and call people names).\n\nI am what I think is pro choice, I absolutely support a woman’s right to abort for any reason including “I just don’t want the baby”. But I think the line has to be drawn somewhere and it has to be way before you literally have a living human. For me I think that line is somewhere around when the baby is able to survive outside the womb without the mother, but I realize that line is fuzzy and down to interpretation by doctors. \n\nRegardless, this is a net good. I’d err on the side of more individual freedom (especially for women about womens issues) about when you can abort than less.\n\nEdit: Lol, god forbid anybody have an opinion that maybe we shouldn’t kill babies days, hours or minutes before they’d be born, eh? Stay classy, you’re no better than conservatives.",
            "title_similarity": "0.5741072",
            "sentiment_compound": 0.882
        },
        {
            "id": "i3fl7vl",
            "score": 63,
            "text": "There is way too much talk about Boebert in here and not nearly enough praise for my BFF Polis. My dude has done a lot for our state and continues to. So happy to have him in office.",
            "title_similarity": "0.3290518",
            "sentiment_compound": 0.8151
        },
        {
            "id": "i3f7ton",
            "score": -32,
            "text": "Per mods request, this is my real account. I object to this new law. Baby killing has its place, I guess, but shouldn't be so normalized and encouraged.",
            "title_similarity": "0.50972223",
            "sentiment_compound": 0.2372
        },
        {
            "id": "i3fgcaf",
            "score": -37,
            "text": "There will come a day when pro choice ideals are viewed in the same light as white supremacy and nazism. We’re always trying to treat certain people as less than human. So many are so slow to learn.",
            "title_similarity": "0.31558773",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i3f0l1a",
            "score": 3028,
            "text": "I'm sure all the people that shout about states rights will support this.",
            "title_similarity": "0.4784212",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i3exbqw",
            "score": 2280,
            "text": "Medical tourism in the US is gonna boom. Like the buses that take people to the casino",
            "title_similarity": "0.43558845",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i3ffrru",
            "score": -38,
            "text": "[deleted]",
            "title_similarity": "0.08480235"
        },
        {
            "id": "i3etfxk",
            "score": 2,
            "text": "I wonder what ben shapiro thinks about this",
            "title_similarity": "0.11442166",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fhojd",
            "score": 2,
            "text": "So the site is paywalled and I can't check but if it's not in the constitution... it's not guaranteed.\n\nPut it in the constitution.",
            "title_similarity": "0.30659217",
            "sentiment_compound": 0.0
        },
        {
            "id": "i3fnhxj",
            "score": 2,
            "text": "Being from Texas, I’m honestly so relieved it’s a state we give patients gas cards to drive to.",
            "title_similarity": "0.5641433",
            "sentiment_compound": 0.7481
        },
        {
            "id": "i3fu7xy",
            "score": 1,
            "text": "\"This content is not available in your region\"\n\nWTF?",
            "title_similarity": "0.1959024",
            "sentiment_compound": -0.6739
        },
        {
            "id": "i3g94p9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08413527"
        },
        {
            "id": "i3h6qdd",
            "score": 4,
            "text": "That’s interesting. So now we are making laws that already have a federal law that supports the same law that was made in support of the federal law that supports the state law that supports the federal law….\n\nThat’s some goddamn circular shit going on there. The fucked up thing is that it’s apparently necessary.",
            "title_similarity": "0.600564",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i3h856n",
            "score": 2,
            "text": "...to seek....\n\nThis is a very important distinction. No one can be forced to perform an abortion on someone else. That would be slavery.",
            "title_similarity": "0.5675911",
            "sentiment_compound": -0.847
        }
    ]
}