{
    "If Blue, Red and Yellow are the primary colors then why are Blue, Red and Green (RBG) used for generating colors in computer programs?\nI really tried to google this, but I didn't see clear explanations on the difference. If I google RBG then I find posts which call these the primary additive colors, with green and red making yellow. I thought maybe my primary schooling was just old and color theory had changed a bit, but if I google primary colors for art purposes like painting, then it seems that blue, red and yellow are still the primaries for, say, mixing paints.": [
        {
            "id": "gw83zcu",
            "score": 1,
            "text": "It's not the same blue and red\nThe primary blue is called Cian blue, the primary red is called Magenta red and the primary Yellow is Lemon Yellow. \n\nThere is two way to synthesise a color, one is called additive and use RGB as primary color to obtain CMY colors.\n\nThe other one is substractive add use CMY as primary colors to obtain RGB.\n\nLight source like computers' screens are additive, so RGB. When it's not a light source like paint,  it's substractive so CMY.",
            "title_similarity": "0.7367331"
        },
        {
            "id": "gw7s9k4",
            "score": 4,
            "text": "I had a discussion about this with an artist. She insisted the primary colors are RBY. I told her about the additive (RGB) and subtractive (CMY) primaries, and she didn't care; for her, working with paint, RBY + black and white led to all the colors she needed. So I'm guessing it's because the painter's gamut is limited compared to human vision, and as someone else has said here, tradition dictates pedagogy in this case. Also there's the fact that we commonly use paint to teach the idea of primary colors to kids. Or at least we did 5000 years ago when I was in school.",
            "title_similarity": "0.8205952"
        },
        {
            "id": "gw87rpa",
            "score": 1,
            "text": "Red yellow and blue are not primary colors, this is incredibly dated but still taught in schools for some crazy reason.\nIn the additive model, where the colors combine to create white (light) the primary colors are Red, Green and Blue.\nIn the subtractive model where instead colors combine to create black (dye that absorbs light instead) the primary colors are the inverse, Yellow, Cyan and Magenta. This is used in printers where color accuracy is essential and by advanced artists.\nThis makes perfect sense, simple, yet...\nSome artists stick with RYB but they are wrong and are just stuck in their old incorrect ways. There are colors that you cannot make from mixing these colors such as, Cyan and Magenta! Purple and light blue are very different to these colors. You'll also find that you can never create black when mixing RYB paints together just some nasty muddy grey.\nSome people claim it's related to human eyesight but that is also wrong, while we see some colors more clearly on average, this varies from person to person and still doesn't apply to color mixing which is what primary colors are all about.\nIt's mind blowing how long this misinformation has spread!\nThere are many articles on this and the evidence is in printer ink, plain and simple.",
            "title_similarity": "0.83659756"
        },
        {
            "id": "gw7op0x",
            "score": 7,
            "text": "Because we don't optimize for making perfect light. We optimize for exciting the color-sensing cells specifically in human eyes. Evolution didn't give us perfect range over the colors. We got red, blue, and green sensors.",
            "title_similarity": "0.7349812"
        },
        {
            "id": "gw9ryjp",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.045685768"
        },
        {
            "id": "gw7beo5",
            "score": 19,
            "text": "Our eyes has one receptor for general light (black/white) and three receptors for different wavelengths. They're best named short, medium and long (wavelength), but they're almost always called blue, green and red. (These names are rather inaccurate).\n\nExcept that some women can see a fourth colour, and some humans can't see as many colours as the norm.",
            "title_similarity": "0.6072402"
        },
        {
            "id": "gw7s362",
            "score": 30,
            "text": "Colors can be defined using what are called color models. These are the systems we use to define a specific color. \n\n**RGB** is one of these systems - it uses a mixture of the primary colors of **Red, Green, and Blue**. **RGB** is **additive** meaning that the more of each color you add, the lighter the colors become. This is the way that light works. Why RGB? As others have mentioned, we have 3 different color receptors in our eyes that are most sensitive to short, medium, and long wavelengths which correspond most closely to Red, Green, and Blue (though not exactly). There are different types of RGB color models as well - sRGB, Adobe RGB, Profoto RGB etc. These different models are built the same way, but define their RGB color primaries slightly differently.\n\n**CMYK** is just another type of color model, or system for defining colors. It uses a mixture of **Cyan, Magenta, Yellow, and Key (black).** CMYK is **subtractive** meaning that the more color you add, the darker the resulting color will be. This is because the pigments are absorbing the light instead of emitting the light. Light that is not absorbed and is reflected back is the color that we see. **CMYK** is commonly used for printing. Like RGB, there are multiple different CMYK color models (SWOP being the most common on computers).\n\n**LAB** is another type of color model, and perhaps the most important. It stands for **Luminance, the value A (red to green), and the value B (blue to yellow).** It was designed to encompass the entire visual spectrum of light (and beyond). Therefore, all other color models can be defined within LAB. LAB is also used to translate colors between two different color models.\n\nSo why do computers use RGB most commonly? That largely comes down to how computers physically display colors on our screens. Most computer monitors utilize Red Green and Blue pixels to build and display colors. That means that our monitors utilize the RGB color model. Therefore it makes sense that we would define colors using the same color model.",
            "title_similarity": "0.66519"
        },
        {
            "id": "gw8hnd6",
            "score": 1,
            "text": "Basically RGB, is the primary colors of light.  RYB, are the primary colors of pigment.  \n\nConsider that white light can be broken into all of the colors using a prism.  Yet for pigment, if you mix all of the colors together (sans white) you get black.",
            "title_similarity": "0.60515666"
        },
        {
            "id": "gw9nhh2",
            "score": 2,
            "text": "I never heard of blue, red and yellow beeing the primary colors. There is Red Green and Blue for light emitting systems (screens) and Cyan Magenta Yellow (and Black) for light absorbing systems like a painting, a chair, everything that does only bounce external light.. The two systems are complementary. Ignore black in the cmyk for now, since it is only added to further increase contrast in print jobs. If you mix the colors of RGB you get CMY. Red + blue = Magenta, red + green = yellow, blue + green = cyan. That is because a colored surface is simply absorbing certain light spectra. \n\nA tennis ball is absorbing blue light. If you shine neutral white light (light containing RGB in similar amounts) the ball will bounce back only red and green, which results in yellow. If you shine red light, there is no green to bounce and hence the ball looks red. If you shine blue light, there is no light the ball can bounce and it will appear black.",
            "title_similarity": "0.8127284"
        },
        {
            "id": "gwa9i12",
            "score": 3,
            "text": "Blue and red are *not* primary colors of pigment. There are colors that can't be mixed using red, blue, and yellow. The 3 primary colors of pigment are cyan, magenta, and yellow. The 3 primary colors of light are red, green, and blue. The primary colors of light are like the opposite of the 3 primary colors of pigment. With light, you add wavelengths to build up a color. With pigment, you use chemicals that filter out certain wavelengths to reveal the remaining color.\n\nDon't believe me about the primary colors of pigment? Look at any color printer. The ink or toner you have to buy comes in 3 colors, plus black (K): (C)yan, (M)agenta (Y)ellow. CMYK.\n\nRed and Blue are wrong when it comes to mixing paints. They're not primary colors at all in that context. But they're \"close enough\" and they have common sounding names, so that's what we teach kids in kindergarten. The more you learn, the more you realize your teachers were glossing over some pretty glaring details. Sometimes the stuff you learned as a kid was just plain wrong.",
            "title_similarity": "0.7607112"
        },
        {
            "id": "gwa9tsy",
            "score": 4,
            "text": "Ha ha, there are colors and there are colors.\n\n**Physical colors** \\- these are wavelengths of visible light. These span from red through the rainbow to purple.\n\nExample: Intensity 0.05 lumen of Wavelength: 622nm\n\n**Physiological colors** \\- these are the effects that the wavelengths have on a human retina. Four different detector cells develop a reaction to light, and their reactions peak around certain wavelengths. \"Blue\" peaks around blue... \"Green\" and \"Red\" peak very closely together, one around green and the other somewhere in red. Then there is a magnitude sensor that peaks around blue-green. So, the various detector cells send signals to the brain...\n\nExample: R: 0.03, G: 0.4, B: 1.1, M: 0.23...\n\nNotice, a concept like \"yellow\" doesn't necessarily exist here. Yellow is just a really low blue signal, balanced by roughly equal Red/Green signals.\n\n**Psychological colors** \\- This is where colors are interpreted by a person. These include colors that don't exist on the rainbow physical spectrum, like brown or hot pink. It in this place that we can imagine almost all colors originating from three \"primary\" colors.\n\nWhy RGB? I'm sure there's a good Wikipedia article on this... but basically RGB is one way of reconstructing most of the range of the physiological colors with only three light emitters or three dye filters. The three reference colors approximate the R, G, B physical detectors in the human eye.",
            "title_similarity": "0.58320045"
        },
        {
            "id": "gw8qvlv",
            "score": 7,
            "text": "Blue, red, yellow are for print (pink rather than red), Red Green and blue are for screens.\nFor print means light reflects from surface, for screens means you have color lights that shine in your directions.\n\nWith print you adding colors with light you remove colors. If you want to have black in print you have to add all colors together, when you want to have black on screen you have to turn off all lights. Check in any graphic program take RGB and set all values on 0 and you’ll have black (no lights are shining you turned off all) set CMYK all values on 0 and you’ll have white (no paint is used).\n\nSo basically it’s it. You “create” colors adding paint or removing light. This is why those colors differ.\n\nEdit: some clarification.\nI think part of the confusion are names of colors: \"Red Green Blue\", and \"Red Blue Yellow\" That might seems like only difference is Yellow and Green. It's \"Cyjan, Magenta, Yellow\" so in RGB  if you want to have red you light red light on max (255) in CMY if you want red you need to remove color that doesn't reflect red light which mean Cyan should be set on 0 and Magenta and Yellow 100%",
            "title_similarity": "0.72273153"
        },
        {
            "id": "gw87uc9",
            "score": 9,
            "text": "It's worth noting that there is a very non-science reason behind part of your question.\n\nThe primary additive colors come from mixing colored lights. These are Red, Blue, and Green. Since computer programs are usually telling lights on your TV or monitor to turn on at different intensities it makes sense to represent a color this way.\n\nThe primary subtractive colors come from mixing pigment. These are Cyan, Magenta, and Yellow. These are the colors used in color printer ink for example. If you were writing software specifically for a pigment based display, you might actually choose to store colors this way instead of RGB.\n\nWhere does Blue, Red, and Yellow even come from then? Simply put, they are the primary colors on the color wheel. The color wheel is useful for artists making decisions about how to use color in their compositions. You may notice that Cyan is a kind of Blue and Magenta is strongly associated with Red, so you've got a taste of the subtractive primary colors there. It doesn't exactly line up though because no artist in their right mind would use pure Cyan and Magenta in their work (unless the point was to look awful).\n\ntl;dr Blue Red Yellow is an artistic primary color set and doesn't have an immediate scientific justification.",
            "title_similarity": "0.8271569"
        },
        {
            "id": "gw8pfoj",
            "score": 25,
            "text": "Previous fine art student here... \n\nAll colour is a percept. Meaning, colour is only perception. It is a mixture of Light + Stuff + Eyes + Brains. If one thing in that equation changes, it changes the way we perceive colour. \n\nThere is something called a \"colour model\" which is described as a set of dimensions and operations with which you choose to describe and handle colours. RGB is a colour model. It is a set of colours that are described as \"additive\" combinations of Red, Green and Blue light. \n\n\"Additive\" means mixing colours of light. On a computer screen, you are looking at light, not physical pigment. Computer printers for example, work with the colour model of CMY, which are the true primary colours of paint, Cyan, Magenta and Yellow. But to be fair, any colours you have on hand are your \"primary\" colours, and any colours you can create with those colours are considered secondary colours.   \n\n\"Subtractive\" means mixing colours in the world of paints and other solids. It is described by hue, value, and intensity. \n\nTo summorize:\n\nThe primary colours of light are Red Blue and Green. \n\nThe primary colours of paint (in the 20th century) were Red Blue and Yellow.\n\nThe primary colours of the 21st century, are Cyan Magenta and Yellow.",
            "title_similarity": "0.74182665"
        },
        {
            "id": "gw7kowr",
            "score": 81,
            "text": "I think the primary colors for painting are really cyan, yellow, and magenta. Blue, red and yellow happen to be close enough and common in nature, so I guess we picked those to put on our crayons and paint sets. The difference between painting/pigment primary colors and rgb primary colors is whether it's being used for direct or reflected light.\n\n The way I understand it, the painting primary colors are the colors between red, blue and green on the color wheel. As in, painting primaries are actually what a computer rgb system would call secondary colors, and vice versa.\n\nRed blue and green roughly match the peaks of the light spectrums that our 3 cones are sensitive to, and are used as primaries for direct light sources, such as tv and phone screens. But with reflected light like what you see when you shine white light on a painting, the way they combine is the opposite, so the non-rgb colors are primary for paints.\n\nI think the colors add something like this:\n\nDirect Light: \n\nRed+green = yellow (traffic lights actually have good color spacing)\n\nReflected Light (paint pigments):\n\nYellow (absorbs blue, reflects red and green which we see as yellow) + cyan (absorbs red, reflects blue and green which we see as cyan)= green (yellow paint absorbed all blue, cyan paint absorbed all red, so only green is left to be reflected)\n\nRemember that with paint (and most non glowing objects), the color you see is only the wavelengths that are *reflected* by that pigment, while all other rainbow colors are absorbed. This is why green plants die if you put them under a green lamp, because green is the only color they *can't* absorb.",
            "title_similarity": "0.8446398"
        },
        {
            "id": "gw799bi",
            "score": 524,
            "text": "It has to do with the difference between [additive and subtractive primary colors](https://www.xrite.com/blog/additive-subtractive-color-models) The linked article explains it more thoroughly than I can.\n\n\"By mixing red, green and blue (***the additive primaries***) in different combinations and at varying levels of intensity, we can simulate the full range of colors in nature. If the reflected light contains a mix of pure red, green, and blue light, the eye perceives white. When no light is present, the eye perceives black.\n\nCombining two pure additive primaries produces a **subtractive primary.** The subtractive primaries of cyan, magenta, and yellow are the opposing colors to red, green, and blue.\"",
            "title_similarity": "0.7317451"
        },
        {
            "id": "gw83f4g",
            "score": 15,
            "text": "Because blue red and yellow are not primary colors. They are just close. Also reflected light reacts differently than cast light. \n\nCyan, Magenta and Yellow are primary. Can't really get purple with blue and red, works great with magenta and cyan. Magenta and Yellow make reds and oranges...\n\nIf you really want to learn more, Youtube has a lot of color theory videos. \n\n[https://www.youtube.com/watch?v=yRQmV4XYmqI](https://www.youtube.com/watch?v=yRQmV4XYmqI)",
            "title_similarity": "0.7559696"
        },
        {
            "id": "gw8wvy6",
            "score": 76,
            "text": "Additive Vs Subtractive colors.\n\nLight is essentially energy that vibrates at different rates, which we call frequencies. We call light that our eyes can perceive “visible light”.\n\nThere is also invisible light, like far ultraviolet and infrared. Some animals eyes are able to see a wider or more narrow spectrum of visible light. Like some can see heat the way we see light.\n\nAll light out there bouncing around the Universe is vibrating at real frequencies that can fall anywhere along a continuous range of numbers. Lets say blue is 200 and red is 1200 (I’m just making these numbers up for now). The important point is that light you see might be 805.3 or 288. Those numbers might be a purple or a green. There is a near infinite range of actual values of light between the two limits of what is visible to us.\n\nHuman eyes, however only have 3 different sensors in our eyes, called cones. (Some people have 4 but they’re rare-awesome weirdos) Our three common cones can see the blue (200), green (600), and red (1200) light. But they are clever and learned to work with each other. So if a red one says, “I see about 66% intensity”, green says “20%” and blue is “0%” our brains *construct* a color that is the blending of these three values. It *adds them* to make a fourth color that we think we see. (So-called color blind people just have one or more of their cones giving janky, off-kilter, or no values at all. So their eyes give their brains incomplete information to construct colors from.)\n\nWith the real, actual light sources out in the world, you can also take two or more different light emitting sources, like a red floodlight and a blue floodlight, and overlap their beams. The beams *add* their frequencies together and a third color is sensed by our eyes, which do their thing I mentioned earlier to show us that color.\n\nThe important thing here is that when you mix colored *lights*, the lights *add together* to make new colors. This is why we call mixing of pure light colors *additive color mixing*. The three primary colors of additive lights correspond to our cones wavelengths of sensitivity; red, green, and blue. If you add together all the various wavelengths of light together, you get pure white light. This is very important. *Additive colors ultimately result in white light.* Remember that! The primary colors of additive light are RGB because you can make any other color to us by mixing just those three colors. No others are necessary. That is not true for other additive colors than RGB.\n\n*Reflected colors* are an entirely different beast than pure light colors. Surfaces/materials will selectively reflect some color wavelengths of light back at our eyes while absorbing others. Our eyes see the colors of light that escape the surface.\n\nSo if you shine a white light at a surface that we think of as red, the surface is actually absorbing all the other wavelengths of light, allowing only red light to get back to our eyes.\n\n*Artists* developed *pigments* based on powdered minerals and other molecules that are very good at absorbing most of the wavelengths of white light, leaving for our eyes only very pure, specific colors of light for our eyes. An artist’s paint is just mineral in a suspension, like clear oil, so that it can be spread and then will stay put when it dries instead of falling away as powder again.\n\nFor example, powdered sulfur and cadmium are both very bright yellow pigments because they *absorb* all the other wavelengths of light except for yellow. A bright yellow paint can be made from them.\n\nSomething weird happens when you mix two pigments, like two colors of paint. The colors of light they reflect *don’t* add together like pure light. Instead, *the colors they absorb add together*. This means that if you start mixing pigments together like an artist mixing paints, *eventually they absorb all colors and you get black!* This is why pigments that result in reflected colors are called *subtractive colors* or *subtractive color mixing*.\n\nAs it turns out, the three pure, primary colors of pigments are red, yellow, and blue. We know these are the primaries because you can theoretically arrive at any other reflective color by mixing different values of those three. No other colors allow you to do this, which is why RYB are the subtractive primaries.\n\nSo to summarize: \n\nRGB are the colors of light you can combine to arrive at pure white or any other visible color of light by mixing them. Because computer displays, TVs, stage lights, etc. all *project* light to transmit color information, they are governed by the rules of additive color mixing. \n\nOn the other hand, RYB are the colors of pigments that you can combine to absorb all the visible colors to arrive at pure black or any other visible color of reflected light by mixing them. Because paints, colored pencils, and any other matter that doesn’t emit light will instead selectively reflect and absorb its various wavelengths, the colors of this non-light “stuff” is governed by the rules of subtractive color mixing.",
            "title_similarity": "0.50220263"
        },
        {
            "id": "gw9hfd1",
            "score": 97,
            "text": "Nobody has given the simple answer.\n\nThe primary colors of light are red, green, and blue. That is because the human eye has receptors for those three colors. You can combine these colors of light to produce (nearly) any color of light that humans can see. \n\nThe *secondary* colors are cyan (green+blue), yellow (red+green), and magenta (red+blue). These are the \"primary pigments\" because pigments mix differently. Unlike light, which adds together, pigments *subtract*. So if you have cyan pigment, that means it *absorbs* red and *reflects* green and blue. If you have yellow pigment, it *absorbs* blue and *reflects* red and green. If you mix them together, you get a new pigment that absorbs *both* red and blue, so it only reflects green. That's why your art class lied to you and said yellow and blue make green. Really, yellow and *cyan* make green and only for pigments.",
            "title_similarity": "0.72850716"
        },
        {
            "id": "gw7farw",
            "score": 6895,
            "text": "Our eyes contain receptors sensitive to red, green, and blue light. There is some overlap between them at the edges of their sensitivity spectra. We see yellow when our red and green receptors are both stimulated. This can be caused by light wavelengths in between red and green stimulating both receptors, but a mix of red and green light will also stimulate both receptors. Hence RGB for light-emitting screens.\n\nPaint and pigment is based on reflecting *and* absorbing light, rather than directly mixing light. This leads to different effects from mixing pigments vs mixing light. You're not only combining the reflected light bands, but also cancelling them out via absorbed light bands.\n\nEdit: why yellow and blue make green.\n\nYellow paint reflects red and green light while absorbing blue. Blue paint reflects blue light while absorbing more red light than green light. Red-absorption from blue paint cancels out red-reflection from yellow paint, and blue-absorption from yellow paint cancels out blue-reflection from blue paint. Green-absorption from blue paint doesn't quite cancel out green-reflection from yellow paint, so the resulting paint mix is green. Replacing blue paint with cyan paint will result in a brighter green, since cyan paint mainly absorbs red while reflecting blue and green.",
            "title_similarity": "0.6926999"
        },
        {
            "id": "gw85uwm",
            "score": 1,
            "text": "to add to the other answers: because B, R, and Y are not primary colors, neither additive nor subtractive. \n\nhere’s an analogy. ever hear of people saying that the american “left” isn’t really the left, but rather *more to the left* than the republican party? kind of like a smaller square within the big political compass.\n\n \nwell, saying BRY are primary colors technically works, and you can get **a** color wheel with it, but it’s incomplete. there are colors you’ll never get with BRY alone.",
            "title_similarity": "0.66431904"
        },
        {
            "id": "gw87bpx",
            "score": 3,
            "text": "Subtractive vs Additive color models have already been explained pretty well here, but one important thing to note is that the subtractive color model (the „non-digital“ one used in print, painting etc) consists of Cyan, Magenta, Yellow and Black (you may have read the „CMYK“ acronym before). So the primary colors are *never* Red, Blue and Yellow, neither in the additive nor in the subtractive color model.\n\nEdit: [this](https://i.pinimg.com/originals/26/8d/fb/268dfb16397574b24486c74834c2f18b.jpg) sums it up pretty neatly.",
            "title_similarity": "0.729336"
        },
        {
            "id": "gw8chnc",
            "score": 2,
            "text": "one is addative, the other is subtractive...\n\nnatural colours absorb wavelengths, while reflect others, causing the colour we see. this is subtractive (removing wavelengths) - those remaining wavelengths hit the relevent receptors in our eyes, creating the colours we see...\n\nArtificial light, such as a computer screen etc, work by emitting  light in colours that excite the correct receptors in your eye, as yellow falls somewhere between green and red in the spectrum, you need to excite both the red and green part of your eye...",
            "title_similarity": "0.6494884"
        },
        {
            "id": "gw8d0jq",
            "score": 5,
            "text": "There's a difference between additive coloring and subtractive coloring. In additive coloring, visible light is added. The reason we use rgb is because the three color receptors in our eyes are red green and blue, unless you're colorblind. So in this case, you can mix green an red light to make yellow light. Whereas subtractive coloring is taking light away to make colors. In this case, the primary colors are actually yellow, magenta, and cyan, which are the colors in your printer ink.",
            "title_similarity": "0.79086983"
        },
        {
            "id": "gw8ii9e",
            "score": 2,
            "text": "Primary colors are not actually blue, red, and yellow; they are cyan, magenta, and yellow. Very important distinction for understanding why.\n\nPigment color (cyan, magenta, yellow) is the reflection of light off a surface, light (RGB) is the spectrum we see. \n\nWhen looking at an object we are looking at the inverse of the colors reflected. On the color wheel the color you see is the opposite of the color of the light being reflected off the object.\n\nA circle (color wheel) is 360 degrees. R,G,B sits at 0, 120, 240 degrees respectively. This means  C,M,Y sits at 300, 60, 180 degrees respectively.",
            "title_similarity": "0.62906766"
        },
        {
            "id": "gw8jetg",
            "score": 2,
            "text": "One point that hasn't been touched on so far is that besides purely physical color systems such as RGB & CMYK, some color systems are built on a basis of ***perception***. As in, mental perception: what looks good together and in contrast of each other.\n\nThese systems have appeared through artistic experimentation and typically don't align directly with physical systems. RYB is one of these systems. Despite being physically inaccurate, it holds up reasonably well as a color picking tool for artists.",
            "title_similarity": "0.70712113"
        },
        {
            "id": "gw8nelk",
            "score": 2,
            "text": "TL;DR: Blue Red and Yellow are not primary colors of anything. You probably are thinking on the similar (but not identical) Cyan, Magenta and Yellow. Our eyes see different amounts of Red, Green and Blue light. Monitors generate light (they're light bulb) so you want to add more of the color you want to mix things (no colors == black, all colors == white). Printers use ink that absorbs colors, so instead of adding colors you take color away and when you mix you take away a mix of colors (so no colors == white and all colors == black, well grey, but read the whole thing). We want to start with inks that absorb only one of the type of light our eyes see, that makes the colors Cyan (absorbing Red), Magenta (absorbing Green) and Yellow (absorbing Blue), many people tie them to colors they are close to, Cyan looks kind of like blue, and Magenta looks kind of like red, so people simplify it, but it's not the same at all.\n\nLets talk a bit about this. Color is weird, it doesn't really tie to anything physically perfectly (that is some colors can be described as objective physical phenomena) but not all (some colors can only be described in terms of human experience, ie. magenta) and what separates one color from another can be very complicated (the difference between dark orange and brown depends entirely on things around the color, not the color itself). Lets move that all apart.\n\nColor is created when our eyes receive stimuli which they convert into a series of signals that they send to the brain, which then maps these to a color. The stimuli, which is light that enters the eye, is converted into signals by cones and rods. Rods focus only on amount of light, and when they're the only ones sending signals (such as looking in a dark room at night) we can't tell colors, we see everything in black and white.\n\nCones are the ones that create signals that identify colors. Cones are filtered to send a signal based on frequency. They each [center on a certain frequency](http://www.computableminds.com/img/2012/rgb/RGB-to-LMS-cones.png), and the closer they are to that frequency the stronger the signal is. Also the more light, the stronger the signal. If you send a single pure wave, it'll stimulate things. If you send multiple signals it'll trigger multiple one. The brain will, generally, map multiple signals from different color cones into something that's around the (weighted by strength) midpoint. I say generally because there's exceptions and weird cases. Magenta should be green by the rule above, but the brain differentiates between pure green and a mix of blue and red, violet is kind of a weird thing that happens around the edge of our color view. Also some colors, like orange and brown, may seem very different but have the same wavelength and are more a matter of intensity and context.\n\nAll of this seems like a lot, but it sets the foundations for the next part. And trust me, I skipped *a lot* about how we see color, no polarization, no comment on how some things are metallic or not, etc. etc.\n\nLets start talking about light bulbs. Say we are in a room with no windows or any outer light coming in, and we have all lightbulbs turned off. What would we see? Nothing, well everything would look black, the color of no stimuli. So we turn on a red light. The light bounces of things and then makes it into our eyes. Everything that bounces red light will look red, because that's all there is. Everything that absorbs red light will look black, because no light will come from there. We can then turn on a green light, and we'll also see oranges and yellows. We can turn on a blue light and we'll see all colors fully, because there's enough light. (Well in reality we wouldn't see violets very well, but this is close enough). So as we add more light of a certain type, that light becomes visible and in there. This is why computers use RGB, because each pixel is literally 3 very small light-bulbs of each color, and you control how strongly each one shines.\n\nWhen you talk about Blue Red and Yellow you are talking about the primary **pigments**, they're also not Blue, Red and Yellow, but Cyan, Magenta and Yellow. This has to do with paints. Lets draw something this time. Paintings and drawings don't generate light, you have to shine a light on them, and then they bounce it back. They absorb some of the light and that's how they generate colors. So we start with a white page, which bounces all colors (well it absorbs a bit of light, but lets not go into that, it bounces all colors equally enough). When we draw a red line over it, it's a line that absorbs all colors except red, and bounces it off. Now when you mix two paints, you create a new paint which is of a color that absorbs the colors of both lights, removing them from white. So if you mix red and blue you get black. Why? Because red absorbs all colors except red (meaning it also absorbs blue) and blue paint absorbs all colors except blue (meaning it also absorbs red) when you mix them together, you get a color that absorbs all the colors absorbed by either painting, that includes blue and red and all other colors. (In reality you get grey, because red does bounce a bit of the other colors, and blue does bounce a bit of the other colors too, so when you mix them you get something that absorbs most of all colors, but bounces a bit still, that's why you need black for blacks).\n\nBut Red and Blue are special colors (they are cones) what about mixes? Well mixes bounce a bit of multiple colors, and absorb a mix of both. So if we had magenta paint, it would bounce red and blue mostly, and absorb green. Our red and blue cones send a strong signal to the brain that maps it to magenta. The best way to create a perfect magenta paint is one that absorbs all green wavelengths (and all green-like) but bounces all red (and red-like) and blue (and blue-like) frequencies. Now here's the cool thing: because magenta only absorbs green light, you can mix it with a color that only absorbs red light, and you should get blue (what's left after absorbing all light that is either green or red). So with these we want to remove colors. Pigments work backwards, they take away colors, while RGB lights add it. To get the pigments it's easy, just mix the two light colors you want to keep and you'll get the one that absorbs. Magenta (Red light + Blue Light) absorbs green, Cyan (Blue light + Green Light) absorbs red, and Yellow (Red light + Green Light) absorbs blue light. These are called CMY, normally CMYK because, as I said, you can't get perfect black by mixing, so you need black pigment (K is used so it doesn't get confused by the B for blue). By mixing two pigments, they would absorb two of the colors and leave only one, giving us the primary colors again. By mixing different amount of each color you get mixes, by mixing in white paint (which bounces everything and absorbs nothing) makes how much light is absorbed less.",
            "title_similarity": "0.77239627"
        },
        {
            "id": "gw8nubz",
            "score": 2,
            "text": "the short answer is that RBG is the primary colors of additive color, whereas red blue and yellow are the primary colors of subtractive color.\n\nwe have 3 kinds of color sensing cells in our eyes, one for red, one for blue, and one for green. our brains see color by picking out how much of the incoming light is red, how much is green, and how much is blue. thats why a screen only has red green and blue pixels, but those three colors are enough to make every color you can imagine, including grayscale.",
            "title_similarity": "0.6819593"
        },
        {
            "id": "gw8owhd",
            "score": 2,
            "text": "There's no really any scientific colour space where red-blue-yellow are the primary colours.\n\nFor subtractive colours the primaries are CMY(K) - which stand for Cyan-Magenta-Yellow(-Black) and are used to describe how colours are made by mixing pigments. In case you're wondering why K for black, it's means Key Colour which is typically black.\n\nFor additive colour the primaries are RGB - which is based on the colour of the light source that is projected into your eyes. You have cones in your eyes that allow you to perceive the colour, the vast majority of humans only have Red-Green-Blue cones. There are a small number of people who have additional cones, often considered yellow - that allow them to see a broader spectrum.\n\nRGB and CMY are opposites of each other: Red is opposite Cyan, Green is opposite Magenta, Blue is opposite Yellow. If you have an image in an image editing program and invert the colours - that's the mapping you will get.\n\nThere are a number of other methods for describing colour. Several are based on the hue/saturation/shade (light vs darkness) of the colour. You also have the concept of colour temperature - which refers to the wavelength of the light you are viewing the colour under, which can affect how it is perceived.\n\nRemember that colour is simply the way your brain interprets the light reflected from objects. Some pigments/objects reflect or absorb certain wavelengths better or worse than others. Some people perceive certain wavelengths differently than others (which is why some people are 'colour blind').\n\nI always find it an interesting thing that what I perceive as red may not be the same as how you perceive red - but we both use the same label.\n\n[https://en.wikipedia.org/wiki/List\\_of\\_color\\_spaces\\_and\\_their\\_uses](https://en.wikipedia.org/wiki/List_of_color_spaces_and_their_uses)\n\nColour is a really fascinating are of study. Even the development of language in relation to colour is interesting, most cultures evolve words to describe colours in an extremely similar order.\n\n[https://en.wikipedia.org/wiki/Color\\_term](https://en.wikipedia.org/wiki/Color_term)\n\n[https://en.wikipedia.org/wiki/Linguistic\\_relativity\\_and\\_the\\_color\\_naming\\_debate](https://en.wikipedia.org/wiki/Linguistic_relativity_and_the_color_naming_debate)\n\nThat's before we even get into colours we see that aren't really there... like on the wings of iridescent butterflies - which isn't caused by pigment but by the shape if microscopic holes in the scales on the wings.\n\n[http://www.webexhibits.org/causesofcolor/15A.html](http://www.webexhibits.org/causesofcolor/15A.html)\n\nColour is a really interesting topic to ask questions about - have fun exploring it.",
            "title_similarity": "0.7119193"
        },
        {
            "id": "gw8qv78",
            "score": 6,
            "text": "RGB are the additive colors, that can be added together to create all other colors. All colors that you make in the gamut are combinations of these three.\n\n\"Blue Red and Yellow\" are usually quoted as \"the paint colors\" or \"mixing colors\", but the proper theoretical colors are actually cyan (blue-ish), magenta (red-ish) and yellow: these are the subtractive colors. Pigments with these colors can be mixed to combine the subtractive light properties. By mixing paints, the resulting mix will only reflect the colors that \\_both\\_ of the original colors were reflecting. (you are adding together the absorbing properties)\n\nMagenta is white with green removed (absorbed/subtracted).\n\nCyan is white with red removed (absorbed/subtracted).\n\nYellow is white with blue removed (absorbed/subtracted).\n\nIf you mix Magenta and Cyan colors, you end up with a color that absorbs both green and red colors, leaving a pure blue paint(!).\n\nWhen painting using blue and red instead of cyan and magenta, you lose some of the possible colors, but the idea is that it is \"good enough\" for natural paintings. It's confusing because blue and red appear in both the mixing and additive sets because of this. \n\nBy using blue paint instead of cyan paint, you can't make colors that reflect red and blue but no green, and without cyan you can't make colors that reflect green and blue but no red.",
            "title_similarity": "0.71238285"
        },
        {
            "id": "gw8vcl7",
            "score": 2,
            "text": "Well because there's a difference between additive mixing and subtractive mixing. \n\n\n\nIf you mix red, green, and blue light, you get white because you're adding each color. But try that with paint and you'll get a dark grey because you're absorbing each color",
            "title_similarity": "0.77708554"
        },
        {
            "id": "gw8xlbi",
            "score": 6,
            "text": "There are many colour theories which describe a particular quality of colour.  Generally, though there are two sets; additive where the primaries are red, green and blue-violet.  Combining all theses colours together will produce white.  This describes what you would see on computer screens, TV’s etc.  Then there is the subtractive set, where yellow, cyan and magenta are the primaries.  Combining all these colours will produce black.  This set is use in printing and photography etc.  Technically these primaries will produce all colour combinations.  This is a very simplified summary of colour theory.",
            "title_similarity": "0.7166416"
        },
        {
            "id": "gw95oe9",
            "score": 6,
            "text": "Awhile ago I watched [this video](https://www.youtube.com/watch?v=NVhA18_dmg0) which answers your question exactly: its thesis is that the \"Blue Red Yellow\" primary colour model is wrong.\n\nAccording to this lady (*who, incidentally, voiced Todd's girlfriend in Bojack Horseman? huh*), the primary ADDITIVE colours are Red, Green, Blue, and the primary SUBTRACTIVE colours are Cyan, Yellow, Magenta.\n\nHer demonstrations and explanations seemed rather convincing to me, although I would be interested if any more knowledgeable folks disagree.",
            "title_similarity": "0.7751911"
        },
        {
            "id": "gw9dj13",
            "score": 1,
            "text": "Everything you've ever learned about color, unfortunately, is a lie.\n\nThe primary colors in paint are not red, yellow, blue. 🙁 They are cyan, magenta, and yellow, which are better thought of was not-red, not-green, and not-blue.",
            "title_similarity": "0.6642146"
        },
        {
            "id": "gw9ezqy",
            "score": 2,
            "text": "There are two sets of primary colors. One is for pigments, referred to as subtractive since they absorb light. Red, yellow, and blue (alternatively magenta, yellow, and cyan) are the subtractive primary colors.\n\nLight is referred to as additive color, since they add together in how we perceive color. The additive primary colors are red green and blue.",
            "title_similarity": "0.61912096"
        },
        {
            "id": "gw9i834",
            "score": 2,
            "text": "For paint, green is easy enough to get by mixing blue and yellow, but getting yellow from other colors is basically impossible.\n\nThat's why color printers print by cyan, magenta and yellow ink (CMY), plus usually black for good measure. \n\nRGB is a standard because it's the most practical compromise for color *filters* (substracting light) to combine colors with, as opposite to adding colors together on paper.\n\nThat said, color filters of different kind exist. Many cameras use pixels with no filters on them to receive a black-and-white signal, or combine stronger and weaker filters as a compromise, and there were some filters with additional cyan filters or even CMY.\n\nAnd that's just for visible light; when you go outside this spectrum, you need different filters or paints.",
            "title_similarity": "0.72091794"
        },
        {
            "id": "gw9jxxg",
            "score": 4,
            "text": "That's additive color versus subtractive color.\n\nLight from a computer screen causing your eyes to see different colors, is very different than looking at that color ink on a piece of paper.\n\nThe screen can only produce three colors, red, green, and blue. Thus tricking your eye into telling your brain it's seeing a certain color.\n\nAn ink or paint absorbs white light, and reflects only the wavelength which you see, such as orange or green or anything.\n\nEdit: Also, this has definitely been asked here a few times before, so I'd suggest searching this sub specifically, before posting next time.",
            "title_similarity": "0.7330413"
        },
        {
            "id": "gw9lzoa",
            "score": 3,
            "text": "Your question is based on a false premise.\n\nAll light is a mix of photons of various colors (frequencies).  There is no such thing as primary colors.  There also isn't really such a thing as additive or subtractive colors. \n\nYou can have a computer screen with Infrared, Red, Orange, Yellow, Lime, Green, Cyan, Blue, Violet, Ultraviolet pixels. That computer screen would illuminate objects correctly since it would be a \"full spectrum\" light source.  \n\nBut your eyes only see in the ratio of Red to Green to Blue (vaguely) therefore by just shining ratios of those receptors in our eyes we can trick our brains into thinking that they're seeing something like \"yellow\" light. But yellow light isn't actually Red plus Green... There is actually a color of photon that is legitimately \"yellow\" and it's a different color from Red + Green. Our eyes just can't see it so when there is a color that excites both our red and green receptors equally our brain assumes that it must be yellow because it's halfway in-between where the eye can't see. But our eyes can't see true yellow so they also can't tell the difference between \"halfway between red and green\" and \"yellow\". Both scenarios equally stimulate our retina.\n\nIf we had yellow receptors in our eyes, our computer monitors would need to add yellow pixels to maintain the illusion. If you have more color receptors in your eyes you have to have more color emitters and have more \"primary colors\" to maintain the illusion of perfect color reproduction on a screen.\n\nIf we had hyperspectral eyes we would be able to differentiate between R+G and Y. Or between G+B and Cyan. There are plenty of things in nature that are also R+G vs Y and we would see those differently as well as distinct colors.  \n\nA good example is Red + Blue is Magenta. But if we only had two receptors Red + Blue would would be stimulated by Green. So what we see as \"Magenta\" is how we would see Green objects and we would have no perception of true Green.",
            "title_similarity": "0.6413264"
        },
        {
            "id": "gw9nk3h",
            "score": 3,
            "text": "There are a lot of good answers here already about additive / subtractive colors, but I just wanted to add that primary colors is **an arbitrary concept invented to aid color reproduction**. There isn't a hard physics reasons behind them. We don't have a technology to easily reproduce an infinite set of wavelengths on screen or print, and therefore we invented the concept of using 3 primary colors to mix together to trick our eyes into believing it's seeing other colors (for example, if you shine both pure blue and red light into the eye, our eyes can't differentiate between that versus a pure yellow light).\n\nBecause of that, there isn't a set of colors that are absolute best as primary colors. Even though we usually use RGB as primary additive colors, note that the precise red/green/blue that we use as the base depends on the color space. Also, it's actually impossible to represent all human perceptible colors using just three primary colors (because the cones in our eyes detect a range of wavelength that overlap with each other rather than pure red/green/blue wavelengths), see [this Wikipedia entry](https://en.wikipedia.org/wiki/RGB_color_model#Physical_principles_for_the_choice_of_red,_green,_and_blue) to see how you can't really create a triangle within a curved space that will cover the entire space. If you want to represent all human-perceptible colors, you essentially need an infinite number of primary colors. 3 colors (RGB) just gets really close.\n\nEdit: Thinking more about it maybe I should have added that because humans have 3 different sets of cones, we do need a *minimum* of 3 primary colors to have enough dimensions to represent a large enough set of colors. More primary colors help but we can’t go below 3, and some sets of red/green/blue are the set that will cover the most of the space.\n\n---\n\nAs others have pointed out, the \"correct\" additive (e.g. computer monitors) primary colors are Red / Green / Blue, while the subtractive (e.g. paint and print) primary colors should be Cyan (absorbs red) / Magenta (absorbs green) / Yellow (absorbs blue). Red / Yellow/ Blue is more an oldschool way of teaching primary colors for art students because they are easier to conceptualize and use in real use than CMY, and that's also why printers have no problems with using CMY because printers can precisely mix colors.\n\nThat said, it's not like RYB is \"wrong\" per se. It's just a more limited choice of primary colors that can mix to a smaller set of colors than what CMY can do (e.g. it's harder to mix vibrant colors under RYB), but it's not like CMY can reproduce all human-perceptible colors anyway. If you have say 6 paint primary colors to pick from, you can actually do better than CMY.",
            "title_similarity": "0.78559315"
        },
        {
            "id": "gw9snnk",
            "score": 2,
            "text": "Others explained the difference between additive and subtractive color mixing, or primary colors for light and primary colors for pigment.\n\nBut what is missing in my opinion is an explanation why blue, red and yellow are falsely taught as primary colors. It's simply because that's what people several hundred years ago assumed and the public school system still hasn't adopted to teaching an updated color wheel.\n\nhttps://en.m.wikipedia.org/wiki/Tertiary_color\n\n>Unlike the RGB color wheel, the RYB color wheel has no scientific basis. The RYB color wheel was invented centuries before the 1890s, when it was found by experiment that magenta, yellow, and cyan are the primary colors of pigment, not red, yellow, and blue. \n\n>The RGB color wheel has largely replaced the traditional RYB color wheel because it is possible to display much brighter and more saturated colors using the primary and secondary colors of the RGB color wheel. In the terminology of color theory, RGB color space and CMY color space have a much larger color gamut than RYB color space",
            "title_similarity": "0.7735745"
        },
        {
            "id": "gw9swfi",
            "score": 3,
            "text": "Lots of good answers here. Just wanted to point out that if you show a layperson magenta and cyan, they will call them red and blue, and think you are splitting hairs; this may account for the simplistic naming in primary education and art.\n\nAs an aside, it’s practically impossible to make pure primary pigments, and humans don’t tend to compute colour like that, so artists tend to choose pigments by things like light fastness or fashion anyway. Printers will discuss the gamut of ‘full colour’ process (CMYK) inks, which is the region of colour space they can reproduce, taking into account their impurities.",
            "title_similarity": "0.86443573"
        },
        {
            "id": "gwa08zw",
            "score": 3,
            "text": "The science of primary colours is extremely complex: \n\nhttps://en.m.wikipedia.org/wiki/Primary_color\n\nMy understanding is that there are an infinite number of sets of three colours that can be used as primary colours (whether additively or subtractively) to make the full trichromat visual spectrum.",
            "title_similarity": "0.44611892"
        },
        {
            "id": "gwa51sp",
            "score": 3,
            "text": "The additive primary colors are blue red and green.\n\nThe subtractive primary colors are cyan, magenta, and yellow. \n\nRed + Blue + Green = white.\n\nWhite - red - blue - green = black\n\nCyan = green + blue = white - red\n\nMagenta = red + blue = white - green\n\nyellow = red + green = white - blue\n\nMonitors produce light so they use additive primary colors. If the screen is off the color is black. Printing using subtractive primary colors. If there's no pigment the paper is white. But adding pigment removes colors from the reflected light.",
            "title_similarity": "0.7322398"
        },
        {
            "id": "gwa8ctz",
            "score": 3,
            "text": "There is a difference between additive and subtractive color. Subtractive is like painting. Red plus blue equals a darker color than both: purple. However with additive, red plus blue equals a lighter color than both: magenta.\n\nThis difference comes about because one is a pigmented fluid, and the other is made of light. Add two types of light together and you get brighter light. Mix two colored fluids together and you get a darker, \"muddier\" color.\n\nHow CMYK (cyan, magenta, yellow, and key/black) is different from RGB (red, green, blue) is important to know if you're a graphic designer or printer. They'll show up differently on the screen (RGB) vs when they're printed (CMYK). So we have to work in a computer simulated CMYK color profile to see how muddy the colors will look once printed. Then we design around the muddiness. Only if we are desiging for the web do we use RGB throughout the whole project.",
            "title_similarity": "0.65449226"
        },
        {
            "id": "gwaay07",
            "score": 1,
            "text": "since everyone went into the whole RGB (+) vs CMY (-) here...\n\nid just like to draw your attention to the opponent colours, ie not for mixing colours, but for choosing them. ie perception rather than rendition.\n\nthat you can divide in 4 at 90* (as opposed to 2 opposed triads by 120*), to get RED-GREEN and BLUE-YELLOW as two axes.\n\nthese colours are diametrically opposed, and they cannot mix. that is, \"reddish green\" or \"blueish yellow\" just do not exist. this combined with lightness (greyscale) is probably the closest model to the 3 dimensions we actually see colour in.\n\nso red, green, yellow, blue, white, black are the \"pure\" colours. https://en.wikipedia.org/wiki/Opponent_process",
            "title_similarity": "0.6469554"
        },
        {
            "id": "gwadbcw",
            "score": 4,
            "text": "Blue, Red and Yellow simply aren't the primary colors, it is long outdated science.\n\nReally it's just an unupdated painting standard. Most color tricks are based on the old system, and many understandably don't feel like adapting.\n\n\nFurthermore, the actual modern answer is much longer, making it harder to spread the fact.",
            "title_similarity": "0.6877966"
        },
        {
            "id": "gwafl80",
            "score": 2,
            "text": "A while back, someone noticed that mixing blue and yellow makes green. Mixing red and yellow makes orange, and mixing blue and red makes purple. \n\nThey decided that the three colors you start with should be called \"primary\". Its all very arbitrary. The way I understand it, the Japanese don't consider green to be a color, it's just another shade of blue to them.\n\nI've been told for decades that bees see in black and white, but now we're told they see colors in the UV spectrum that humans cannot see.\n\nCalling red, blue, and yellow \"primary\" colors is an art world thing, it's not from biology or science.",
            "title_similarity": "0.81300926"
        },
        {
            "id": "gwaodsc",
            "score": 2,
            "text": "Blue, red, and yellow aren’t really the primary colors. Historically, artists mixed these colors of paint to get a pretty full gamut of colors, and so they still get taught as the primary colors, but color is now better understood. If you are mixing pigments (subtractive color), the best colors to use as your primaries are cyan, magenta, and yellow, which along with black are the inks used in most printing. If you are adding light, the best primaries are red, green, and blue. These two sets of primary colors are each other’s secondary colors. https://en.m.wikiversity.org/wiki/File:Subtractive-Additive-Colour-Mixing.jpg\n\nNow even this is an oversimplification. Others have noted that human eyes have three types of cones, sensitive to red, green, and blue light. In reality, the “green” and “red” cones are both sensitive to blue through red light on the spectrum, with peak sensitivity in the center of the range. The peak for the “red” cones is actually greenish yellow. But that’s offset enough from green green to let our brains use the signals from the the different cones to distinguish red from green. Color vision is also often modeled as two pairs of colors: red vs green and blue vs yellow, which is physiologically closer to what’s going on in the eyes than the idealized color wheel.\n\nThe reason that a linear rainbow of colors can get turned into a circular wheel is that there is no frequency of light that strongly stimulates both blue and red cones cells. But that doesn’t mean they can’t be stimulated simultaneously but multiple frequencies. When you combine red light and blue light, you see magenta. And you use yellow pigment to remove the blue from magenta to get red (yellow being the complement of blue on a color wheel), and cyan pigment to remove the red from magenta to get blue.",
            "title_similarity": "0.8374155"
        },
        {
            "id": "gwar777",
            "score": 6,
            "text": "It's even more complex than additive/subtractive, too.  Ink behaves differently than light, sure, but they operate basically inverted from one another (i.e., you can achieve, for example, orange by mixing a little green with a lot of red _light_, or by mixing a little magenta and a lot of yellow ink).\n\nBut with paints, there's an additional wrinkle; paints are a solution of white with colors mixed in - so when you blend paints, you get something between a subtractive combination and a mean.\n\nIn physics, dealing with just light, the primary colors are red, green, and blue, because those colors are roughly equidistant in the visible spectrum, so mixes of them can simulate the colors in between.\n\nIn inks, you're relying on the paper to reflect light, and the inks act as filters.  Cyan filters out red light; yellow filters out blue, and magenta filters out green.  So it's basically the RGB mix, but inverted.  Black's also in there, because no consumer-grade formulation of CMY results in a really good black.  Some printers also come with RGB pigments, to get purer tones than the equivalent CMY mixes.\n\nWith paint, you've got the color filters mixed in with the backing reflector - so you end up closer to the average of a pair of mixed colors, rather than the subtractive sum.\n\nCrayons work similarly to inks, but, where inks layer, crayons mix. \n Because of this, each color-over dilutes the layer beneath it.  That's why \"yellow blue makes green\" - because you're getting something like a hue/sat mean + darkness sum instead of the straight subtractive sum.  This is why you're taught in primary school the wonky set of primary colors - because you're meant to apply them with crayons, and that's the best way to teach kids to do color with crayons.  \n\nPhysical color theory is messy and complicated.",
            "title_similarity": "0.6717644"
        },
        {
            "id": "gwbjlaz",
            "score": 3,
            "text": "Well actually Green and Red were released first in Japan with Blue having slight graphical upgrades and released a little later. Red and Blue were released simultaneously in the US and YELLOW was released after all of them featuring strong crossover with the popular animated series. Green doesn’t exist outside Japan. \n\nI hope this clears things up.",
            "title_similarity": "0.67876637"
        },
        {
            "id": "gwde6mh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.045685768"
        },
        {
            "id": "gwf26gj",
            "score": 1,
            "text": "In traditional art paints (or other pigments) are subtractive source of color meaning they absorb other colors and reflect others therefore mixing every primary color should result to black, light (which comes out of the monitor) is additive meaning if you mix every primary color you should get white. Since subtractive mixing produces black it's impossible to produce lighter color from mixing paint, yellow among all the hues is the brightest therefore there's no way to get yellow from mixing paints. So artist had to choose yellow as one of the primary colors instead of green since green can just be made by mixing mixing blue and yellow.",
            "title_similarity": "0.7371719"
        },
        {
            "id": "gwhe98o",
            "score": 2,
            "text": "Blue, Green, and Red are not the primary colors.  The cones in the retina have maximum sensitivities at Blue-Violet (a shorter wavelength than Blue), Green, and Yellow-Green.  Helmholtz got it wrong because he wasn't measuring the peak sensitivities and had preconceived notions about what were real colors and what weren't.\n\nRGB and RYB are approximations, with RGB being more useful.  The CIE tongue diagram takes into account the supersaturation necessary to produce colors such as Carmine.  It also shows the large number of Blue-Greens.  All these need a fourth parameter to show saturation and brightness; HSV and its equivalents don't.\n\nRYB is used for paints purely from tradition.  A greenish Yellow and a greenish Blue will make Green, but a warm Yellow and purplish Blue will not.  Cyan is not fully saturated Blue + Green, and Magenta is not Blue + Red.\n\nPrinters use CYMK but also know some inks cannot be specified by it.  Rubidine Red, for example.\n\nSo the idea of all colors being formed by mixtures of primary colors is oversimplified.  There are perceivable colors which cannot be made by any mixture of perceivable primaries.",
            "title_similarity": "0.7192439"
        },
        {
            "id": "gwkle8q",
            "score": 1,
            "text": "Regarding color mixing paints, Just a quick FYI from an artist... there are two of each \"primary\" warm and cool versions. If you mix a warm red say Cadmium Red light with a cool yellow say Lemon Yellow  which is on the green side you get MUD! A cool blue and a warm red will make brown. But elementary education is not color theory so they do the best they can. Look a the monitor you are using now with a magnifying glass for more on RGB.",
            "title_similarity": "0.79828966"
        },
        {
            "id": "gwnl8np",
            "score": 1,
            "text": "Because in eye you have Red, Green and Blue sensitive parts, so screens are made with those colours of LEDs in each pixel. Number associated with colour in computer means how bright given colour light is supposed to shine in every pixel. Different light/dimm ratios of leds= different colours for your eye.",
            "title_similarity": "0.66800296"
        },
        {
            "id": "gwvl8tu",
            "score": 1,
            "text": "TL;DR here...\n\nRed Blue and Yellow are not the true primary colors, but they represent the subtractive colors. They are used when we have to subtract from white (in print media or art), rather than build from black.\n\nRGB represents the additive colors used when we want to build from black. We use them in electronics because we have well-defined equations and interactions between various emitters of light, and the energy given to them. (CRTs, LCDs, OLEDs, even incandescent bulbs)\n\nWe use RGB in programming because it makes the math of sending color data easier.\n\nPurple and Yellow aren't real.\n\n&#x200B;\n\nA reasonably thorough explanation.\n\n**Bold = search term**\n\nThe primary colors are lies told to all of us at a young age. It comes from older color theory used in art, and is still used in modern printing and artwork. Truly, the primary colors are Cyan, Magenta, and Yellow. When added to a white background (artist's canvas), they cancel the resultant complimentary color out. I suggest searching **subtractive colors** for more information.\n\nRGB as a colorspace dates back to CRT televisions, and the reason we use it in programs is still  strongly related to this. Check out **CRT Displays** if you want to know more about them, but they blend varying the amount of energy interacting with red, green, and blue phosphors to produce red, green, and blue light, and mixing them allows us to make all the colors we can see.\n\nIt all comes back to physics. The color of light is proportional to its frequency/wavelength, and its wavelength is proportional to its energy. Blue light is at a short 400nm wavelength (the highest frequency), and red light is at 700nm wavelength (the lowest frequency).  If I go lower, I get infrared, and if I go higher, I get ultraviolet light. This gives us the **spectral power distribution**, which is used in all sorts of devices and ideas reliant on **modern color theory.**\n\nThis SPD equation gives us a way to relate the light (including frequency) coming from some source, and the energy applied to that source.\n\n&#x200B;\n\nUnfortunately, we can't see in UV or IR, but the principle really holds for the whole range of electromagnetic radiation.\n\nHowever, the astute Redditor will note that ~~ultra~~violet light is below blue on the frequency range, yet we see it in the middle. And what about yellow, why is its range of frequencies so thin?\n\nWe evolved to see colors that are not actually there, called non-spectral colors. When we see purple, we are indeed seeing a mix of red and blue light. Somehow, it's different from the other mixes of blue and red, otherwise known as every other color imaginable. And yellow is an imaginary color that allows us to differentiate it from a red-green muddle?? I don't have enough knowledge of how light interacts with cone cells in our eyes to know why this is, but with our eyes and brain physiology this way, we can see more colors. **Color vision in humans** would be the place to start if anyone is interested.\n\n&#x200B;\n\nBack to why we use RGB in electronics though...\n\nBy varying the brightness of these three, I can get all possible colors. By changing the brightness of each on a range of 0-256 (00-FF in Hexadecimal), I can use a range of numbers to explain nearly every single color. Check out a **hex color picker** if you want to mess around with it.\n\nColor in computer programs is described with a hexadecimal number from 000000 - FFFFFF. The number is somewhere around 16 million in integers, and this represents 16 million combinations of brightnesses of red, green, and blue, and 16 million different colors.\n\nThe color in any given LCD pixel is controlled by 3 liquid crystals 'rods', one for each color. When a rod untwists, it lets more light through. The amount of light for each color can be controlled by the amount of current going through the rod, with a maximum and minimum. This means that each rod needs a number to control its brightness, and collectively the pixel's color can be described by a number. Search **LCD display theory of operation** for more.\n\nNow to tie the program and the display together.... The color for each pixel in your screen gets encoded by your video card/display adapter as a number, is sent through the cable into the screen, and the decoder that sits behind your screen converts these binary numbers into voltages and currents, for each individual pixel, every screen refresh. (A staggering amount of information is sent every second). Search **display interfaces** for more.\n\nThe same happens for OLED displays, although the electronics are quite a bit more complicated.\n\n&#x200B;\n\nSo now you know way too much about light physics and color in electronics, and so do I.",
            "title_similarity": "0.7884872"
        }
    ]
}