{
    "If hand sanitizer kills 99.99% of germs, then won't the surviving 0.01% make hand sanitizer resistant strains?\n": [
        {
            "id": "gzxsji9",
            "score": 0,
            "text": "No in short if you through all the humans into a volcano (even over time) they will all die. The person that broke their legs and survived on the side or managed to survive the fall still wouldn’t live in direct contact with the lava/magma. Every human would go extinct before being able to adapt to that drastic of a change.\n\nEvolution takes a long time and certain things we can’t evolve past. Like even the famous tardigrade dies like a motherfucker in a plethora of ways before it enters cryptobiosis shadow form number 7 (all eyes upwards onto heaven) mode which in of itself takes time to activate (1 hour casting time).",
            "title_similarity": "0.60362303"
        },
        {
            "id": "gzvwyom",
            "score": 9,
            "text": "The 99.99% isn't 100% because the process of using hand sanitizer is a chemical process. Byapplying hand sanitizer you are conducting a chemical reaction between the sanitizer and the microbes on your hand. Now if you remember grade school chemistry, it is very rare for reactions to fully combined in the experiment and get to 100% entropy.  Basically the reason we say 99.99% is because we live in a universe full of chaos and there is always a chance that there will be perfect unpredictable circumstances in the microcosm of you hands that 0.001% of microbes will survive the process. Also there is the possibility of human error when applying.\nIf you are truly concerned you should use a hand sanitizer that lists benzalkonium chloride as an active ingredient. Not only are they water based, and alcohol free but benzalkonium chloride kills most microbes and bacteria, including SARS-CoV-2 in as little as 15 seconds as opposed to the 60 seconds alcohol based hand sanitizer takes to work.\nYou should also note that if you aren't using enough hand sanitizer for your hands to stay wet for 60 seconds you aren't getting anywhere close to the 99.99% effectivity because alcohol based hand sanitizer is totally ineffective when its dry.\nThere is a great one called bioprotrct that you can get on Amazon, and it is supposed to keep working for upto 6 hrs after it dries.",
            "title_similarity": "0.7500075"
        },
        {
            "id": "gzwgttu",
            "score": 9,
            "text": "You are quite right and this is the problem with using things like triclosan in hand soap. It kills many bacteria, but those that survive are stronger, and have resistance. So it's a good idea to avoid those so called \"antibacterial\" soaps.\n\nSource: An epidemiologist and bacteriologist at CDC (not me).",
            "title_similarity": "0.6847803"
        },
        {
            "id": "gzxasmz",
            "score": 1,
            "text": "Yes.  \n\n\"For example, research conducted by Pidot and colleagues in 2018 showed that the bacteria Enterococcus faecium – which is one of the leading causes of hospital-acquired infections – is becoming more resistant to alcohol sanitizers.Mar 10, 2021\"\n\nhttps://microbiologysociety.org/blog/has-the-increased-use-of-hand-sanitizers-during-the-pandemic-impacted-antimicrobial-resistance.html",
            "title_similarity": "0.6547959"
        },
        {
            "id": "gzx2d7c",
            "score": 2,
            "text": "In the simplest of terms that .01% are already resistant to the sanitizer. It's not like it kills 99.9% of cold germs then leaves .01% of cold germs to mutate and change. It kills 100% of the cold germs there just might be .01% of some other germs. In reality the reason it says 99.9% is for legal reasons. It's like condoms (which also say 99.9% effective), on the off chance that the product does fail they don't want to be sued. Condoms use to spout 100% effective (because when used correctly they are) but then people got pregnant from misuse and sued and won.",
            "title_similarity": "0.7734269"
        },
        {
            "id": "gzvz9on",
            "score": 21,
            "text": "The short answer is yes. There has been a well documented increase in the observation of alcohol tolerant bacteria in healthcare settings where frequent sanitization is the norm.\n\nThat said, it's not problematic in the same way as antibiotic resistance. At the point where you've picked up a hospital acquired infection, alcohol tolerance becomes irrelevant as there's no alcohol in your system.\n\nIn the end, it's a net benefit because any form of washing reduces transmission rates in hospitals, and a squirt of purely is more convenient than washing hands 100 times a day, which means better compliance with the sanitization policy.",
            "title_similarity": "0.64233303"
        },
        {
            "id": "gzw1557",
            "score": 3,
            "text": "I remember from a previous thread or some article that sanitizer is like a volcano. If 100 people fall into a volcano and 1 of them lands on a ledge and survives you won't develop a resistance to lava. The .01% that survives isn't just strong arming the sanitizer its just not being contacted enough if at all.",
            "title_similarity": "0.68013304"
        },
        {
            "id": "gzw0daa",
            "score": 7,
            "text": "Also they say 99.9% but the number is actually much higher. It just isn’t 100% and at some point saying 99.9999999999% feels like more of a marketing gimmick than 99.9%. Alcohol is like a bacterial nuke. You won’t be able to nuke humans enough to generate nuke resistant humans.",
            "title_similarity": "0.73712534"
        },
        {
            "id": "gzxeflg",
            "score": 0,
            "text": "A good way of thinking of it is that the sanitizer kills 100% of 99.99% of all species of germs, and 0% of the remaining 0.01% which as others mention, are designed to not be affected.\n\nA dilute bleach wash can often be used in places where transmission of resistant species is more common.",
            "title_similarity": "0.8484584"
        },
        {
            "id": "gzxf5zs",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.14969762"
        },
        {
            "id": "gzxpaxp",
            "score": 0,
            "text": "As others have pointed out, the 99.9% metric is orthogonal to the development of anti-microbial resistance.\n\nHowever, the answer to the spirit of your question is: yes, absolutely.  Heavy use of alcohol-based sanitizers has been clearly observed, in a number of studies, to result in more robust anti-microbial resistance, and \\*this is a very serious concern going forward\\*.\n\nHere's a recent review of some of the research: https://phys.org/news/2020-04-heavy-sanitizer-boosts-antimicrobial-resistance.html",
            "title_similarity": "0.6516609"
        },
        {
            "id": "gzx1yvn",
            "score": 8,
            "text": "Yes:\n\n[Increasing tolerance of hospital Enterococcus faecium to handwash alcohols.](https://stm.sciencemag.org/content/10/452/eaar6115)\n\nFor the general reader:\n\n[Superbugs are growing more resistant to hand sanitizer, scientists say](https://www.sciencealert.com/superbugs-becoming-more-resistant-to-hospital-alcohol-disinfectant-sanitiser).",
            "title_similarity": "0.671666"
        },
        {
            "id": "gzwc25w",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.14969762"
        },
        {
            "id": "gzxr628",
            "score": -1,
            "text": "Edited to correct misinterpretation of the post:\n\nI misread the post.  Sanitizer doesn't *create* the resistant germ.  The resistant germ has a trait that allows it to tolerate the cleaning process.  Then, the cleaning you just did, having removed all the susceptible bacteria, what then fills the void is the resistant bug replicating and populating the sanitized area.  *That*'s the problem. \n\nThe other end of the stick is the over-use of hand sanitizer by individuals causing them harm.  Comedian [Howie Mandel](https://www.instagram.com/p/CIy7o82DbMS/?utm_source=ig_embed&ig_rid=b26cab09-37ef-4b99-aae6-0e9de1b22363) is a germaphobe and has used so much hand sanitizer that his doctors have told him to stop using it, because further use will cause his skin harm.",
            "title_similarity": "0.6380968"
        },
        {
            "id": "gzyp5sk",
            "score": 1,
            "text": "I don’t understand the misconception of this 99.9% of germs. It literally kills 100% of germs but companies can’t statistically prove that it will kill everything because no one in their right mind can’t test it against every virus. \n\nIt’s not saying there’s 0.01% of germs that are resistant.",
            "title_similarity": "0.77978"
        },
        {
            "id": "gzvuc1r",
            "score": 128,
            "text": "The first reason is simply that cleansers can't kill everything. There are plenty of microorganisms that are not denatured – that is, torn apart – by alcohol, which is the primary ingredient in hand sanitizers. For example, norovirus, which is responsible for the stomach flu, and clostridium difficile, an intestinal germ that causes severe diarrhea, are not killed by alcohol. \n\nThe second reason why products say they only kill 99.9% of germs is marketing and legal liability. If a company claims that they can kill 100% of germs, and someone with an electron microscope decides to put that to the test and discovers germs on the cleansed surface, the company could be liable for false advertising. \n\nThe third reason is one of physical reach. Look at your hands. You can see tiny textures to your skin, right? Little micro-wrinkles, pores where hair grows, the deep grooves around and under your nails. To you, these are tiny. To a germ, they're larger than the grand canyon. Bacteria, viruses, and other microorganisms can hide deep in these cracks, where an application of hand sanitizer might not be thorough enough to get them.",
            "title_similarity": "0.7875271"
        },
        {
            "id": "gzw6rj1",
            "score": 35,
            "text": "The easiest way to explain it I know of:\n\nIf lava kills 99.99% of humans, won't the surviving 0.01% eventually make lava resistant offspring? \n\nIt's just too extreme of damage. The ones that survived weren't more protected against lava that they can then pass on, they probably just got lucky. You *could* end up with a strain that works against it, but the chances of it would require so many complex changes that it's just not happening unless you're specifically trying to make this happen over generations and generations in a lab with tons of work. You'd end up with a very different organism before it was 'ready'.",
            "title_similarity": "0.7884508"
        },
        {
            "id": "gzw14se",
            "score": 53,
            "text": "[removed]",
            "title_similarity": "0.14969762"
        },
        {
            "id": "gzwta9p",
            "score": 2,
            "text": "Yes and no. Eventually there is a possibility it will create a mutation with a cell wall that resist alcohol, and that mutation won't have crippled itself in some other way, and that mutated cell will escape from the alcohol gel by some means, and that mutation would then replicate many times and at some point later be reintroduced to a host in order to cause an infection....\n\nThat's a lot of ands. Basically the cell is vulnerable to alcohol in a way that it's incredibly unlikely to overcome in one mutation, and even if it does, it's probably not going to be completely resistant to it and will be worn down by the extreme amount of molecules of alcohol available to kill it.",
            "title_similarity": "0.664608"
        },
        {
            "id": "gzwvleo",
            "score": 4,
            "text": "This is more of a marketing, advertising, and legal issue than one of science. Companies don’t want to get sued for false advertising. As proof, I submit Purell. Look at what’s happening to them now because of Covid. They’re actually getting sued for claiming 99.99% when it’s not true. Products claiming any percentage of effectiveness will soon be a thing of the past.",
            "title_similarity": "0.6959163"
        },
        {
            "id": "gzw3il6",
            "score": 16,
            "text": "It's likely that hand sanitizer kills more than 99.99% of germs, it's just that we can't detect germs at less that 0.01% so saying they kill 100% of germs would technically be false advertising.\n\nAlso alcohol destroys germs in the same way heat destroys germs: you can't evolve yourself immunity to alcohol with a single mutation any more than you could evolve yourself immunity to fire...",
            "title_similarity": "0.8579534"
        },
        {
            "id": "gzxjjsp",
            "score": 7,
            "text": "[It's already happening.](https://www.npr.org/sections/goatsandsoda/2018/08/02/635017716/some-bacteria-are-becoming-more-tolerant-of-hand-sanitizers-study-finds)\n\n\nI don't know if anyone is posting this or not, but it's real and it is happening.",
            "title_similarity": "0.43395633"
        },
        {
            "id": "gzw4uqy",
            "score": 48,
            "text": "Antibiotics are basically clever ways of sabotaging a bacterial cell. Alcohol etc. is more like using a sledgehammer. The ability to withstand that sort of thing is not the same as antibiotic resistance, because the attack vectors antibiotics rely on are much more specific, and can be \"patched\" with relatively small genetic differences. \n\nFor example, penicillin is a beta-lactam antibiotic that tampers with part of the final step of building cell walls, and tons of bacteria have developed the enzyme beta-lactam*ase* which inactivates it before it can harm them. \n\nOther ways to gain resistance could be to change the vulnerable parts of the bacterium or carry the antibiotic  away from them. Staph aureus just plain old made its cell wall *thicker*, and gained resistance to vancomycin, a fairly strong drug.",
            "title_similarity": "0.6467732"
        },
        {
            "id": "gzvrm6o",
            "score": 691,
            "text": "From what I've read of this issue before, it isn't that the 0.01% are some kind of super strong germs that resist the alcohol, it's just that the alcohol does not fill every microscopic crack of flesh, and so some of them get missed.",
            "title_similarity": "0.5685792"
        },
        {
            "id": "gzwdz2a",
            "score": 123,
            "text": "The 99.99 thing is more of a mathematical remainder than a statement about bacterial resistance. I used to work for a laboratory doing disinfectant efficacy testing (not for commercial release, but still) and the way the calculations are performed are based on Logarithmic reductions in colony counts. \n\n(In case you've forgotten your logs) Essentially a 2 Log reduction is a 100-fold reduction. 3 Log a 1000-fold reduction, etc....\n\nSo when you perform a test you use a known concentration/ amount of microorganism, say .1 ml of 10,000 cfu/ml. (Colony forming units) so a total of 1000 organisms is what you would expect on your control and then the disinfected test would have less. If it is 0 (>1 technically) Then that would be a 3Log reduction. So for every 9 that gets added there would have to be a 10x increase in testing concentration. Which at some point becomes inpractical or infeasible for other reasons. \n\nUsing 99.99% instead of Log4 Reduction is I'm sure because it sounds more market-friendly, but it essentially means \"complete killing\" from the lab.",
            "title_similarity": "0.745251"
        },
        {
            "id": "gzvrc5f",
            "score": 6634,
            "text": "[removed]",
            "title_similarity": "0.14969762"
        },
        {
            "id": "gzwxtvh",
            "score": 1,
            "text": "One I thing I think is pertinent to mention is that genetic mutation isn’t forced by conditions. If a bacteria isn’t killed by antibiotic or alcohol it’s not going to cause mutation, it’s random. It’s a type of fallacy. If you roll a 20 sided die 100 times and don’t get a 20 once, the next rolls still has a 1/20 chance of being a 20. Previous condition do not influence the chances.",
            "title_similarity": "0.66688335"
        },
        {
            "id": "gzxajvq",
            "score": 3,
            "text": "Both the growth and death rates for bacteria tend to follow a logarithmic curve. We use this concept in food science, since at a specific temperature in a specific medium there is some length of time that reduces cell count of a certain bacterial strain by one log, which is a 90% reduction. Four log reductions would therefore in theory kill 99.99% of bacteria in a medium. The same applies to the effect of sanitizers, so you could assume that a sanitizer that is 99.99% effective causes a 4 log reduction of total bacteria count before evaporating (assuming proper usage).\n\nThis model assumes that bacteria in the sample die at random, since the sterilizing treatments are so rapid and extreme that they don't really allow for selective pressure. There are definitely strains that manage to survive cleaning and disinfection, especially ones that form biofilms, which is why ideally a food manufacturer should have a couple of different sanitizers on rotation to make sure that there won't be any resistant strains that manage to survive in the factory.\n\nFun fact: For commercial sterility, like when making shelf-stable canned food, we aim for 12 log reduction, which means that in theory if 10^12 viable cells were in the medium only a single cell should survive the heat treatment.",
            "title_similarity": "0.7728668"
        },
        {
            "id": "gzy64yf",
            "score": 2,
            "text": "The remaining germs are almost always \"spores\" or dormant bacteria. These will never be killed by traditional methods whatsoever; not even honey can kill them (honey is naturally antiseptic; however it never can kill dormant germs, which is why you never give it to babies). Dormant germs are able to be washed off quite easily, which is why hand washing is always better than hand sanitizer.",
            "title_similarity": "0.5337168"
        },
        {
            "id": "gzy7qtw",
            "score": 1,
            "text": "Doesn't this mean that 99.99% of different types of bacteria etc are killed but the 0.01% are a different type that isn't affected, not that it kills 99.99 of a specific type, but a few of those same type are resistant?",
            "title_similarity": "0.85917944"
        },
        {
            "id": "gzyho2l",
            "score": 2,
            "text": "I always believed that companies advertise with the term \"99.99%\" because in reality it does kill all of the germs but if an annoying Karen with a microscope finds some germs even after the application and decides to sue them, then they'd be safe since they can just say it belongs to the 0.001%.",
            "title_similarity": "0.7305521"
        },
        {
            "id": "gzykt1x",
            "score": 1,
            "text": "Within corporate statistics a normal probability test is taken, and a large sample size of hand sanitizers are tested to get a population to test. When this is done the probability test of the samples are tested against a chosen probability value, in this case p=99.99%, or p=0.001.\n\nthis doesn't always mean that 0.01% of germs survive, but simply that the probability of germs surviving is AT MOST 0.01%, although this can vary on the environment.\n\nOther industries use this to make stastical claims aswell! most often when learning statistics you'll learn to use p=0.05 to test probability.",
            "title_similarity": "0.7188732"
        },
        {
            "id": "gzytf4p",
            "score": 1,
            "text": "I am of the understanding that in most tests the compound will kill 100% of exposed bacteria. \n\nHowever if someone tests it in a real world environment there may be a bacteria that didn't get killed due to being in a crack of some material.\n\nThe difference between 99.99% and 100% is only 0.01% in terms of efficacy, but in terms of lawsuits it only requires a single bacteria to survive to make it a \"misleading\" advertisement.\n\nSo they err on the side of caution and say 99.99%",
            "title_similarity": "0.8463743"
        },
        {
            "id": "gzyxwsc",
            "score": 1,
            "text": "OP you have the basic idea correct.\n\nbacteria can and do mutate and overcome chemicals that would have killed them before the change.\n\nhospitals deal with antibiotic strains like MRSA, among others.\n\nMethicillin-resistant Staphylococcus aureus (MRSA) is a cause of staph infection that is difficult to treat because of resistance to some antibiotics\n\n&#x200B;\n\n&#x200B;\n\nso yeah, you have the basic idea down solid.\n\nthat said, not all bacteria will change and become resistant to tricks to kill them.\n\n&#x200B;\n\ni remember several years ago there was talk of banning stuff with TRICLOSAN, like soaps etc, as they could potentially lead to super bugs that we would not be able to kill.\n\n[https://www.news-medical.net/health/What-is-Triclosan-and-Why-is-it-Banned.aspx](https://www.news-medical.net/health/What-is-Triclosan-and-Why-is-it-Banned.aspx)",
            "title_similarity": "0.6659861"
        },
        {
            "id": "gzza585",
            "score": 1,
            "text": "This is how I had it explained to me by a biologist over a decade ago. When you wash your hands with soap and water; you are in fact killing 99.99% of bacteria that way also, the water basically flushes away the \"dead bodies\" of the bacteria that would have otherwise been left on your hands with sanitizer. The 0.01 percent left over is just dead weight. You kill a mouse in your bedroom, you remove it to be 100 percent rid of it. This made sense to me, some people raise thier eyebrows when I repeat it. Either way. I only use sanitizer if I'm not working with food.",
            "title_similarity": "0.7541078"
        },
        {
            "id": "h3aa6d8",
            "score": 1,
            "text": "It helps to think about it like this. If you threw 1000 humans in a volcano and 999 landed in the lava and died and one landed on a rock and lived that human is not, in any way, resistant to lava. \n\nSame thing applies to bacteria in these situations. They are the ones who were in some crack and didn’t get hit by the sanitizer",
            "title_similarity": "0.6693047"
        }
    ]
}