{
    "How do we know we’ve discovered a new species of human based on a single fossil, and not just a really ugly dude?\nThis [article](https://www.bbc.co.uk/news/science-environment-57432104) claims they’ve discovered a new species of human, which is awesome, but since the claim is based off a single fossil, how do we know that it wasn’t just one person with some sort of genetic defect?": [
        {
            "id": "h36c76f",
            "score": -2,
            "text": "We absolutely do not know this wasn't some strange weird mutant. The headlines just scream at the top of their lungs after the Chinese government screamed at the top of its lungs after some anthropologists found a single fossil that may, possibly, represent a new human ancestor/species.",
            "title_similarity": "0.74286675"
        },
        {
            "id": "h3514cl",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.0015639402"
        },
        {
            "id": "h35afuj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0015639402"
        },
        {
            "id": "h34qrt0",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.0015639402"
        },
        {
            "id": "h35qrf9",
            "score": 2,
            "text": "We don't. Most of the time individual fossils do not provide sufficient evidence of speciation if we use the categorization process that is applied to extant organisms in order to classify them as species, sub-species or merely possessing a common genera.\n\nJust as often those differences are based on behavior and geographic distribution as they are based on biological morphology.",
            "title_similarity": "0.6379303"
        },
        {
            "id": "h34un71",
            "score": 22,
            "text": "Legitimately, the answer depends on if you're a \"lumper\"or a \"splitter.\"\n\nA lumper would be a researcher who is more likely (though not guaranteed) to assume a new specimen is of the SAME species as one we already know about until the researcher feels enough evidence has been shown otherwise. \n\nA splitter would be a researcher who is more likely to assume (though not guaranteed) to assume a new specimen is a NEW species until the researcher feels enough evidence has been shown otherwise.\n\nAs such, any time a new specimen is found (even in living species, not just fossils), there is always lots and LOTS of debate on the subject. Almost never-ending, honestly.",
            "title_similarity": "0.7457049"
        },
        {
            "id": "h34p7vr",
            "score": 45,
            "text": "There's a general statistical argument that because congenital deformities are rare and finding preserved skeletal remains is also so rare, then the combination of those things will be so exceptionally rare that it should not be an assumed explanation unless there's specific evidence supporting it. Of course, this is just a probabalistic argument, but that's what science is built on. It's essentially a form of parsimony: in the absence of other evidence, we assume the anatomy and morphology of fossils is representative of their populations.\n\nOf course, that doesn't mean that researchers don't consider the possibility. They do and it's incorporated along with many other considerations as part of the confidence estimate that individual researchers and the field as a whole have in mind in any analysis that includes the fossil or the putative species described from it. Ultimately, whether it's a species or not doesn't matter very much. Species are of less and less concern in biology these days as the nature of evolution and gene flow have shown that genetics interact and cluster at many different levels, not well captured by the single designation \"species.\"\n\nIn this particular case, you can also add that the analysis of this fossil suggests that it has some characters that place it closer to modern humans than would otherwise be expected for its age and location. While it's not impossible that congenital deformities could make an indvidual from a species other than *Homo sapiens* look more like a *Homo sapiens* without sharing a more recent common ancestor, that just adds another layer of improbability. Not only would this have to be a rare preserved fossil with rare deviations from its population's normal morphology, but the deviations are also in a specific direction that matches another lineage it is not closely related to. Again, not impossible, but just so unlikely that it's hard to build a theory on it without some evidence.",
            "title_similarity": "0.72070074"
        },
        {
            "id": "h34x1h2",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.0015639402"
        },
        {
            "id": "h36mler",
            "score": -15,
            "text": "[removed]",
            "title_similarity": "-0.0015639402"
        },
        {
            "id": "h35mbio",
            "score": 7,
            "text": "This reminds me of the Triceratops. There are many fossils of Triceratops during several stages of it's development that were thought to be different species based on the development of the plate on their head. Things like that do happen but there are many other people around to check your work these days to give scientists more accurate results.",
            "title_similarity": "0.6440432"
        },
        {
            "id": "h34ntc5",
            "score": 84,
            "text": "Sometimes it can be something obvious. There's a nerve that runs through a human jaw and the jawbone has a hole for it. Neanderthals as an example have two such nerve and two such holes. I also want to say the shape of the mandibular foramen is different, but it's been 20 some odd years.. There are other features folks look for as well.. Sometimes it's speculation. But since life is a continuum from single cell organisms to what we have today,  Sometimes it's just... educated guesses. *** edited because someone corrected it, nerve not vein. Been 20 years since I had to identify the differences in hominid skulls. Point was that there are certain features a trained eye can notice that identify different species in some specimens. Not always doable with every specimen found, but usable nonetheless and I think relevant to OP's question.",
            "title_similarity": "0.6607361"
        },
        {
            "id": "h34mjz0",
            "score": 355,
            "text": "That article repeats the *claims* of the team that found the skull \"*It could be a new species of human*\", but also puts it into the context of other old human remains discovered in the region.\n\n>Dragon Man joins a number of early human remains uncovered in China that have proven difficult to categorise. These include remains from Dali, Jinniushan, Hualongdong and the Xiahe jawbone from the Tibetan Plateau.  \n>  \n>There has been a fierce debate about whether these remains represent primitive examples of Homo sapiens, Neanderthals, a human group called the Denisovans, or something else entirely.\n\nSo it's one piece of pretty interesting evidence, the hard part is determining where it fits in the human evolution story and it's offshoots, predecessors and extinct or assimilated competitors etcetera. Because yeah, it's just one skull.",
            "title_similarity": "0.7338737"
        },
        {
            "id": "h34mme2",
            "score": 3011,
            "text": "[removed]",
            "title_similarity": "-0.0015639402"
        },
        {
            "id": "h34n0ff",
            "score": 2311,
            "text": "I'll start by saying that we actually don't know if this is a new human species or not. The authors who found this fossil argue that it is because:\n\n> \"A combination of primitive and derived features in the Harbin cranium establishes a good set of diagnostic features that were used to define a new Homo species.\" via Shao et al: https://www.cell.com/the-innovation/fulltext/S2666-6758(21)00056-4, published yesterday.\n\n\nBasically, there are certain features that tend to be specifically diagnostic of species difference when we look at hominids. Things like brain size, face length, brow size, tooth differences, cheek bone size, etc. The reason we look at these things is because they tend to be variable between species, but fairly consistent within species. And, even in cases where one or more of these traits is variable (e.g., a baby born with microcephaly), all the concomitant traits probably won't change much. For example, the authors note that this fossil has a mix of features that are commonly seen in more human-like hominids, and those more common in \"primitive\" hominids:\n\n\nLike humans:\n> \"large cranial capacity, short face, and small check bones\"\n\n\nMore \"primitive:\"\n> \"low vault, strong browridges, large molars, and alveolar prognathism\" via Ni et al: https://www.cell.com/the-innovation/fulltext/S2666-6758(21)00055-2, published yesterday.\n\n\nBecause this combination of traits isn't known in any other hominid, and because it doesn't seem to showcase signs of any known disease or deformity, it's unlikely (although never impossible) that this is just, like, some guy who looked real weird. \n\n\nStill, the leap that this is a brand new species just from one skull is problematic. First of all, there are known species of hominid that have unknown skull structures. The article you linked to mentions Devisovans as an example of this. They are a close relative species of ours, and some people of east Asian descent have their DNA in their genomes! We only know they exist because we sequenced the DNA of some non-skull bones, so we have no idea what their heads would have looked like. That means it's possible that this is just a skull of a species we already knew about. Even if this is the case, that's still a really cool find! \n\n\nI should also mention that even if this is a species we already knew about, it's almost certainly not *H. sapiens*, as the time and place it was found doesn't match up with human migration. Present evidence suggests that modern humans probably didn't make it to East Asia until about [50,000 years ago](https://en.wikipedia.org/wiki/Early_human_migrations), and this individual lived in present day China over 146,000 years ago.",
            "title_similarity": "0.8450047"
        },
        {
            "id": "h34u3uo",
            "score": 14,
            "text": "Assigning species level status from skeletal remains not something that is all that easy to do, but without alternative means it’s all that paleoanthropologists have to assemble our family tree.  Ideally researchers will use statistical metrics on a number of morphological features to determine if a specimen fits within the range of variation for a generally accepted species or lies outside of it (which may indicate that you have a new species). Skeletal and dental remains are actually a pretty conservative measure of speciation - basically if you go by skeletal remains alone you are likely to underestimate the number of species within a given sample.  That said, with fragmentary evidence the picture can be really murky and often remains that way until new finds are made.  For example, during the 1960s there was a lot of research grouping very fragmentary ape fossils into the genus Dryopithecus. However, with additional work a number of these were reassigned into a variety of other genera (Sivapithecus, etc.).  \n\nAnother thing to note is that there are also a number of philosophical debates on where to draw the line on what constitutes a new species.  Remember that species evolve through time and the morphology and variation present within a given lineage changes through time.  This can make assigning species level status to a set of fossils difficult - basically, is there enough difference to suggest a new species is present or does it just represent something a bit different than previously seen?  Overall researchers tend to be “splitters” or “lumpers” when it comes to this issue.  Splitters are likely to put a divergent find into a new taxon while lumpers are more likely to assign it to an existing taxon.  For example, among paleoanthropologists, some believe that African Homo erectus is divergent enough to be placed into its own species of Homo ergaster, leaving only Asian finds in the species Homo erectus.\n\nWith respect to the current Dragon man find, I haven’t read the paper yet - but it has a general Homo heidelbergensis / archaic H. sapiens  vibe to me...",
            "title_similarity": "0.6810979"
        },
        {
            "id": "h36p9ua",
            "score": 14,
            "text": "I argue that this question arises from a misconception about how species are defined. they are defined by obvious differences when comparing an individual versus other known individuals that we suspect are related but separated in the family tree by huge amounts of time causing obvious differences. it is arbitrary but it works because there are a countable number of them.\n\nif instead we were able to obtain every single fossil of every single ancestor for analysis, there would be none in the genealogical line where we could identify and say \"this is a different species\" because the difference from one generation to the next would be imperceptible. the word *species* would lose meaning entirely because we have the entire chain. the word species has meaning only because we do not have the whole picture but only  the snapshots and those snapshots are sufficiently unique to be called separate.",
            "title_similarity": "0.7224718"
        }
    ]
}