{
    "Do veins grown in the same pattern in every body or is it unique like fingerprints?\n": [
        {
            "id": "h3rsysb",
            "score": -5,
            "text": "Just as an FYI, veins and arteries are both types of vessels. Veins take blood back to the heart while arteries take it from the heart to the rest of the body. The terms you would use in your post would be \"vessels\" since I assume you are talking about both veins and arteries.",
            "title_similarity": "0.4315375"
        },
        {
            "id": "h3rtg6l",
            "score": 1,
            "text": "Generally speaking, the circulatory system is pretty generic. It’s like any other major organ system if you think about it. It’s form serves a function and major anomalies will affect it. So the major vessels are more or less the same. Size and shape may vary but the layout is pretty consistent.",
            "title_similarity": "0.47943524"
        },
        {
            "id": "h3tj241",
            "score": 0,
            "text": "You will get the same basic area. A heart is in approximately the same place in every single body. So is the superior and inferior vena cava. Everyone has an AC vein (at the elbow). \n\nYou need roughly the same arteries to supply every body part, and roughly the same veins to return blood to the heart. You should find the same large veins in the same parts of the body, but if you were to examine 2 different arms for exactness, you would find millimeter differences in everyone. \n\nYou also have physical differences based on physical activity. Someone that works out needs a different blood supply than someone who is sedentary. Usually this will result in larger and smaller veins.",
            "title_similarity": "0.61208916"
        },
        {
            "id": "h3vqu2l",
            "score": 0,
            "text": "The cardiovascular system is unique to us humans, the basic biology does have a stamp per se that says that you are human. It is applicable to those in the various genes groups as blood type and what makes you, well you. There is variation as family groups pass down various traits that an inclusive to you, as those genes give you the various health elements. We are all one and the same, but with variations to well proliferate the species. So we don't all get sick and as an organism survive. Those elements that make from the capularie junction the pumping of the heart are as individual as the person but we are all changed by our environment gradually picking up mutation ~ traits that make us all a little unique and different.",
            "title_similarity": "0.53186715"
        },
        {
            "id": "h3sco88",
            "score": 2,
            "text": "As a med student who just finished anatomy: everything should be roughly in the same spots, meaning both nerves, veins, arteries, lymph nodes, muscles and bigger organs but there are ontogenetic differences. From ten corpses I’ve seen this year there has been nerves and vessels branching earlier, some connections between them that are not standard and of course difference in size. We’ve even had one with a giant heart with a huge aorta. But yeah, they mostly stay the same",
            "title_similarity": "0.45378357"
        },
        {
            "id": "h3ru6xt",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.13129942"
        },
        {
            "id": "h3rticm",
            "score": 5,
            "text": "Similar situation with nerves as with vessels. There is a general human “blueprint” for the layout of such things but individual variation is quite common. This happens more so in the smaller / peripheral ones but can occasionally big plumbing / wiring problems can occur more centrally with certain epi/genetic conditions (e.g. congenital heart and brain/spine problems).",
            "title_similarity": "0.44148803"
        },
        {
            "id": "h3rukeq",
            "score": 12,
            "text": "To a certain point, they are basically the same. You'll find all the same major arteries, nerves, veins, in essentially the same spots. But there is natural variation in sizes and precise locations, and particularly after you get to a small enough size, the variation is huge.",
            "title_similarity": "0.5250628"
        },
        {
            "id": "h3rue9f",
            "score": 60,
            "text": "I remember reading an extended article about a team of scientists using vein patterns on hands, arms and other visible body parts to identify pedophiles in videos where you can't see their face. \nThe uniqueness of the patterns in the hands alone is  remarkable enough for it to be used in that way.\nThe lady doing that job is a British professor named Sue Black if I'm not mistaken.",
            "title_similarity": "0.4557609"
        },
        {
            "id": "h3s1pha",
            "score": 99,
            "text": "You know how retina scans are used as biometrics as they're all different?  What the scan is of are the blood vessels that flow through the retina, everyone is unique.  As with fingerprints, they look supericially similar, but everyone is unique - veins, arteries, fingerprints - even the way the bones grow broadly similar in gross structure, but the acutal pattern is unique to each individual.",
            "title_similarity": "0.66770864"
        },
        {
            "id": "h3rvx6u",
            "score": 245,
            "text": "Veins can be pretty unique!\nI’m a medical student, so I have the privilege of spending quite a bit of time studying donor bodies. Arteries don’t vary much between individuals. Veins, however, do! They follow the same general layout, but definitely differ between people on where exactly they branch and how tortuous they are. In anatomy lab, we literally say “veins do vein things” because of how unique they can be.",
            "title_similarity": "0.48168662"
        },
        {
            "id": "h3spiti",
            "score": 189,
            "text": "This reminds me of an interesting story I read about once.\n\nA woman was working in a factory, and her hair was caught in a machine. It ripped her scalp off. Horrifying, of course, but not immediately life-threatening. But her co-workers were smart; while they were waiting for the ambulance, they took her scalp and put it on ice. This allowed a surgeon to reattach it later.\n\nNow, there are thousands and thousands of little blood vessels in that patch of skin, and it would have been impossible to reattach all of them. But the surgeon didn't need to do that. He just needed to reconnect a few main blood vessels, allowing blood to flow into the area and be distributed to all of the smaller vessels. This allowed the skin to remain alive, and the natural healing process gradually reconnected everything else, including the blood vessels and nerves.\n\nBut there was one weird side effect. While the nerves all reconnected, they didn't connect exactly the way they were before. Which meant that the signals going to her brain were different now. So if she touched one part of her scalp, she felt the touch in a completely different part, because her brain thought it was receiving the signal from a different area.",
            "title_similarity": "0.32862082"
        },
        {
            "id": "h3ts20h",
            "score": 79,
            "text": "They form in the same place but have varying unique patterns, now considered unique enough to identify one person from another.\nAnatomist and my ultimate girl crush- Dame Sue Black is spearheading a forensic identification process via pattern matching veins in the hands and arms of child abusers caught on tape and comparing against the likely subject.\nChild abuse and child sexual abuse is unique in that the abuser often documents their abuse via images and video- without the identifying factor of their face. Forensic anthropology is a keystone not only in identifying the dead, but also to establish that a person is who they say they are. Can you identify a person without their face?  Can you identify a person without a fingerprint? \nThis is one very specific example but it blew my mind in it’s apparent simplicity and efficacy of gaining convictions against those guilty of these disgusting acts against children.\nLecture here: [Full lecture](https://youtu.be/9Jrd5kJ-vTU)\nReaders Digest Version: [here](https://youtu.be/Qjqa8oTikP8)",
            "title_similarity": "0.424824"
        },
        {
            "id": "h3ssxza",
            "score": 658,
            "text": "Developmental vascular biologist here... veins are INCREDIBLY variable from individual to individual. There are humans with entire cerebral veins missing and compensatory hyper/hypoplasticity of a single side. They really grow where there are specific ligands signaling angiogenesis and where there is flow dependent uptake of interstitial fluid. So, depending on the individual, the venous make up can vary greatly. Arteries on the other hand are a little more stable and consistent",
            "title_similarity": "0.4164512"
        },
        {
            "id": "h3s6afc",
            "score": 371,
            "text": "You know \"retinal\" scans? They're scanning for blood filled retinal capillaries. So, yes, unique.\n\nIn general, the vascular system is the same in the gross. In the fine, they can be variable and the variability/ ease of detecting variability varies depending on where you look.",
            "title_similarity": "0.61177045"
        },
        {
            "id": "h3rrjcq",
            "score": 5158,
            "text": "Both kinda. There are veins in roughly the same spots in everyone but they are also slightly different and different veins are more pronounced in different people. With arteries more than veins, but somewhat with veins. this is why it's important to check the functionality of other vessels in the area before procedures etc to make sure blood is still able to circulate if a vein is taken for a graft or an artery is occluded temporarily",
            "title_similarity": "0.5071627"
        },
        {
            "id": "h3rtxvs",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.11302195"
        },
        {
            "id": "h3sh7rp",
            "score": 4,
            "text": "Things like major arteries/veins follow a similar pathway, but when it gets to the level of actually making the blood delivery it's unique. Cells excrete a chemical requesting blood flow and nutrients based on their needs. Given a high enough concentration of this the body will respond by building new vessels to feed that need. This means that the exact \"plan\" for your vessels is unique to your body and its needs. \n\nUnfun fact: cancer tells your body that it needs absurd levels of blood to stimulate new vessel growth. This results in it getting more nutrients to grow and kill you faster :-/",
            "title_similarity": "0.3598407"
        },
        {
            "id": "h3sl4bm",
            "score": 8,
            "text": "Well, that really does depend on how specific you wanna get\n\nBlood vessels follow generally similar paths but they can all differ slightly. If memory serves right retinal scans work by analysing the complex capillary structures of the retina, and then matching them like you would fingerprints. I also do believe if you take certain blood medication, it can change that pattern and thus make your retina scan not match a previous one done.\n\nBut again, this is really about the very specific stuff, thin capillaries. It’s possible that the vena cava is 1 mm or 0.5mm to the left from one body to the next, but often times this level of specificity is negligible",
            "title_similarity": "0.47781044"
        },
        {
            "id": "h3sof7t",
            "score": 3,
            "text": "I once had an internship at the San Diego Supercomputing Center and in order to get into the building, I’d have to scan my hand. Except, it was actually scanning the back of your hand and looking for veins and things. So I can say that there is definitely use of veins for identifying individuals. However, I also had to enter a short PIN.",
            "title_similarity": "0.46757394"
        },
        {
            "id": "h3srqwu",
            "score": 5,
            "text": "Veins in hands are definitely unique. I watched a Ted Talk where a specialist was campaigning for vein pattern analysis to be admissible in court in the same manner of finger reprints. She was able to identify and match hands of pedophiles from pictures taken of them abusing children.",
            "title_similarity": "0.38964257"
        },
        {
            "id": "h3sv66b",
            "score": 1,
            "text": "Easiest way to envision it is to think of a Faraday Cage, or just Lightning.  Notice the lightning (arc) is going the same place but it's taking a different path, (Path of least resistance).  Your Body is going to connect your shoulder vein to your elbow vein in a predictable pattern, but what muscle/fat tissue it goes around to get there can differ.  It's going to find the easiest way to connect cell that needs Oxygen to a source of Oxygen",
            "title_similarity": "0.33378366"
        },
        {
            "id": "h3svrdl",
            "score": 1,
            "text": "Generally speaking, the larger blood vessels, especially the arteries, are more or less similar in everyone (with some known variations). \nThe smaller they get, however, the less predictable they are, especially the veins.",
            "title_similarity": "0.40309006"
        },
        {
            "id": "h3sw4j3",
            "score": 6,
            "text": "I had superior vena cava syndrome...the main vein bringing blood back from my upper body to my heart to recirculate was mostly blocked...and my body grew new veins in an attempt to compensate. The blockage was fixed with a balloon procedure in the superior vena cana, but I wonder if those newer veins still exist now that there's not an urgent need for them? Or did they shrivel up or become reabsorbed?",
            "title_similarity": "0.32816386"
        },
        {
            "id": "h3swx1j",
            "score": 2,
            "text": "To my knowledge, most people have similar vein structures, which is why stuff like IV's and taking blood happen in the same spots, but veins can kind of move, and some people have different positions for there veins",
            "title_similarity": "0.5527214"
        },
        {
            "id": "h3sygl9",
            "score": 2,
            "text": "We all have the same veins in the same areas. Where they go and connect to one another can vary slightly from person to person.\n\nIt’s the same concept as other body parts. Generally speaking, we all have 10 fingers. How they form and the length of them varies slightly from person to person. There are anomalies though where people are born missing fingers or have an extra finger. The same goes with veins.",
            "title_similarity": "0.64382094"
        },
        {
            "id": "h3syifg",
            "score": 2,
            "text": "Yea even the ones in your hand are different enough. There was an LG phone I believe it was the g8thinq that used biometric data from the veins in your palm to unlock your phone rather then facial rec or fingerprint.",
            "title_similarity": "0.528517"
        },
        {
            "id": "h3syut0",
            "score": 5,
            "text": "They are formed in similar ways but ultimately there are slight differences that make them unique. To the point we use palm vein scans and retinal scans (which use capillaries in your eye) for biometric authentication.",
            "title_similarity": "0.63310933"
        },
        {
            "id": "h3t1u4r",
            "score": 3,
            "text": "Recently took the CISSP exam from ISC2, administered by Pearson Vue (at a testing center)\n\nThey require palm vein scans when you enter the testing room, and again when you come out, to ensure you didn't like, swap people while taking the exam. So presumably they are pretty unique.",
            "title_similarity": "0.39360374"
        },
        {
            "id": "h3t4qf9",
            "score": 4,
            "text": "To add to what people here answered. People can \"grow\" or create different veins if they lift or do hard exercises. This is due to the body trying to adapt and bring more oxygen to the muscles. Kind of cool if you ask me.",
            "title_similarity": "0.37351054"
        },
        {
            "id": "h3t6wmm",
            "score": 6,
            "text": "I took an anatomy class for students pursuing a Master's or PhD in anatomy. The class included 9 hours of dissection per week. I saw some fascinating anatomy variations in just the 6 bodies we had access to. Typically, a person's brachial artery (the main artery supplying blood to each arm) splits into the radial and ulnar artery just after the elbow. One body had no appreciable brachial artery on *only one side* of their body. The artery split into the radial and ulnar in the range where it would be considered the axillary artery (which is in the armpit area). Another body had their extensor digitorum tendons (the tendons that point your four fingers when pointing them all together) attached to their thumb on only one hand. This means that the person would have had difficulty or would have been unable to point their fingers without pointing their thumb.\n\nArteries, nerves, and to some degree muscles, tendons, and bones, follow a general human blueprint, but have all kinds of variations. I wouldn't say it's \"like a fingerprint\", because fingerprints are a random product of development, and because you'd have difficulty identifying a person by their anatomical variations, but it is \"like a fingerprint\" in that every body is its own special snowflake.",
            "title_similarity": "0.3476894"
        },
        {
            "id": "h3t7vgf",
            "score": 1,
            "text": "[Here's a video of Sue Black talking about a superficial vein pattern being used as evidence in court.](https://youtu.be/Qjqa8oTikP8)\n\n&nbsp;\n\nIf you don't want to watch, she talks about a time she helped the MET police by matching the vein pattern of an offender caught in a photo to the victim's father. \n\nIt was apparently the first time identification evidence of this kind had been presented and it was accepted by the courts as it was being brought to there by anatomists.\n\nThe father was found innocent though and Black says she heard it was believed to be because the daughter didn't seem upset enough.\n\n&nbsp;\n\nThe rest of the video is about other markings on hands that were used to catch pedophiles in other cases her and her team helped. Then at the end she makes a call to action to create some technological advancement that will end the recording and spreading of cp.",
            "title_similarity": "0.32873884"
        },
        {
            "id": "h3tbf1s",
            "score": 2,
            "text": "Veins are super weird. Kinda along with arteries they have a general area they’re suppose to be in but the branching patterns are all different. Like in the heart for example, the coronary arteries can come off of different, larger arteries to supply the heart. I had a professor tell me they’re pretty loose in where they go. However nerves are not the same way, they’re very specific on where you can find them and there’s a lot less anatomical variation. Whenever I’m looking for nerves in cadavers they’re usually where you expect them to be and are similar in most humans.",
            "title_similarity": "0.45903802"
        },
        {
            "id": "h3tcscg",
            "score": 4,
            "text": "Unique enough in fact that forensic analysis of vein patterns on the back of someone's hand have gotten convictions in child molestation cases where the criminal's hand was present in the videos that were taken of the child.\n\nPlaintiff thought he was being smart by not showing his face or any identifying surroundings in the videos, but the back of his hand was visible in some frames showing a unique enough vein pattern to add to evidence that he was the one taking the videos.\n\nEDIT- i see this was already mentioned in other comments.",
            "title_similarity": "0.4076667"
        },
        {
            "id": "h3tdimw",
            "score": 2,
            "text": "Definitely unique! Someone dear to me has a condition in which their blood vessels have grown oddly, putting them on blood thinners, likely for the rest of their life… but it does point to the degrees of variability in the growth of veins.",
            "title_similarity": "0.44757652"
        },
        {
            "id": "h3thcsj",
            "score": 1,
            "text": "They actually do. There is a famous Japanese anatomist called Buntaro Adachi who spent his life looking for these variations and found many of them[here](https://link.springer.com/article/10.1007/s00381-020-04517-6).  \n\nFun fact: some people have 2 Inferior vena canvas which is the largest vein in our body.",
            "title_similarity": "0.37116185"
        },
        {
            "id": "h3tkkzm",
            "score": 1,
            "text": "The one thing I haven’t seen anyone mention is that veins can move over time. I’ve been getting infusions for almost 12 years now and they have this tool that scans your arm and projects the location of your veins onto your arm for the nurse to see. Over the years I’ve watched some veins sink lower into my arm and others become more prominent. I’ve watched even from month to month as the path they take changes slightly. Also when damaged the body routs stuff around it; I had a vein burst in my hand one time and over the following months several veins I hadn’t seen before started showing up in the area.",
            "title_similarity": "0.41729292"
        },
        {
            "id": "h3tkmpw",
            "score": 3,
            "text": "it’s a mix. There’s a template, so to speak, developmentally speaking, but then everyone is unique as the body develops/grows/expands. I know that makes little sense but I hope it does help somehow or is an apt enough simplistic analogy.",
            "title_similarity": "0.45309168"
        },
        {
            "id": "h3tn16u",
            "score": 3,
            "text": "It's a bit of both based on an assortment of factors. Namely body shape and type too. But there is a base structure that we all generally have as well. So, you could say, while there are similarities, there are people who are genuinely built different.",
            "title_similarity": "0.4844604"
        },
        {
            "id": "h3tp4t5",
            "score": 3,
            "text": "Veins and arteries grow according to need during development, in the beginning there are small vessels supplying and draining everything. The vessels that supply and carry the most blood will continue to develop and take over, if you will, and smaller vessels will regress. Since we all develop similarly we end up with pretty similar vascular systems to each other. However, the development is not dictated beforehand like other parts of the body so there is a lot of variability.\n\nThink about it like dumping one of the Great Lakes into a desert. You will get lakes and rivers forming. If you could do it over and over you would see different patterns in the lakes and rivers that formed every time.  This is how the vascular system basically forms.",
            "title_similarity": "0.34776014"
        },
        {
            "id": "h3tryaw",
            "score": 5,
            "text": "Veins follow a *fractal* growth pattern, which means they follow a few simple rules about when to branch and when not to branch. [Though really very simple, the result can appear incredibly complex, and will always be unique in every individual](https://www.google.com/search?q=fractal+branching&client=firefox-b-d&source=lnms&tbm=isch&sa=X&ved=2ahUKEwjknMi17cTxAhX0dM0KHT6KCC0Q_AUoAXoECAEQAw&biw=1920&bih=927). The Human body is pre-programmed to start with a few key \"arteries\" which are just the starting veins from which the fractal begins.\n\nIt can be hard to understand why the arteries end up \"big\" while capillaries are \"small\", but you can draw a tree that will help you understand how fractal biological growth occurs.\n\n(1) Find a pencil and paper\n\n(2) Draw a simple line from the bottom up.\n\n(3) Starting from where the first line started, draw a second line touching it (making it a thicker line) and about halfway up, branch to the side.\n\n(4) Again starting from the \"base\" draw another line that thickens the first, but branch half way between the first branch and the top of the first line.\n\n(5) Repeat 3 and 4 over and over again, branching half way between a previous spot, sometimes following previous branches and branching from those branches.\n\nEventually you will have drawn a tree with a thick trunk, some thick branches and some smaller branches and some very small single-line branches at the very ends. The reason every tree is unique is because the rules get changed by the realities of the world. Where the seed landed, how the wind blew, how much water and nutrients were available each day, all these things mess with the simple rules of branching and cause variation. The same principle applies to how veins grow. We each lead unique lives, and therefore our veins form according to unique conditions.",
            "title_similarity": "0.4160884"
        },
        {
            "id": "h3u1pd3",
            "score": 3,
            "text": "Completely unique.   \n\n\nVascular pattern recognition, also commonly referred to as vein pattern authentication uses near-infrared light to reflect or transmit images of blood vessels. Researchers have determined that the vascular pattern of the human body is unique to a specific individual and does not change as people age.\n\n[https://www.biometricupdate.com/201208/explainer-vascular-pattern-recognition](https://www.biometricupdate.com/201208/explainer-vascular-pattern-recognition)",
            "title_similarity": "0.47598857"
        },
        {
            "id": "h3u1t1q",
            "score": 1,
            "text": "No need to apologize. We appreciate patients like you who hydrate to help and recognize you just aren't a simple stick. While most patients are, well, patient, others treat a second poke like assault with a deadly weapon. Like dude, I already truly feel bad having to do this again, but I'm also dang good at my job and it's a blow to my ego when I miss.",
            "title_similarity": "0.19741747"
        },
        {
            "id": "h3u80fv",
            "score": 1,
            "text": "There was a phone by LG that used the fact that vein structures in the hand are unique to allow you to hold your palm up to the front facing IR camera and it would unlock your phone. There were also some other things you could do with hand gestures over your phone. Worked better in theory than in practice, but it was still a cool idea IMO.",
            "title_similarity": "0.46329153"
        },
        {
            "id": "h3ua47s",
            "score": 1,
            "text": "Generally we all have the same anatomy the major organs and the veins/arteries that connect them are similar. Each of us does have some uniqueness though. Like when they go to draw your blood, everyone's veins are in different places, sometimes finding a good one is easy, sometimes not. \n\nWhat's really nuts is when someone has weird anatomy, like sidus inversus, where all that person's organs are flipped out of place. The liver, heart, pancreas, and the stuff that connects them, *all on the opposite side*.",
            "title_similarity": "0.5441724"
        },
        {
            "id": "h3ufu1k",
            "score": 1,
            "text": "One of my professors in uni has been developing a finger vein scanner for a while now. It relies on the fact that everyone's veins are unique like fingerprints. It would be harder to hack than a fingerprint sensor for obvious reasons.",
            "title_similarity": "0.55346775"
        },
        {
            "id": "h3uh7yx",
            "score": 1,
            "text": "Yes. If you were in the tech loop a while back, you might remember LG's VeinID security method. It basically scans your hand for your own unique patterns, memorizes those, and uses that information to as a security measure",
            "title_similarity": "0.5565672"
        },
        {
            "id": "h3uhsaa",
            "score": 1,
            "text": "Very similar patterns with a few types usually.\n\nAn easy example is too look at the veins inside your elbow, where they draw blood.  There are two very common ways these are situated.  Either as a y, or an H.\n\nBut there are tons of subtle variations.  Just as if you tried to make the same. Later over and over by hand.",
            "title_similarity": "0.51393175"
        },
        {
            "id": "h3uqvqz",
            "score": 2,
            "text": "There are places and machines that use palm vein scans instead of fingerprints. In fact vein patterns are far more unique than fingerprints.\n\nThe general distribution of veins is the same, but the exact layout is totally unique.",
            "title_similarity": "0.6246212"
        },
        {
            "id": "h3uytox",
            "score": 2,
            "text": "There was a video talk about a lady that used uv light to examine the unique vein patterns to identify child sex trafficking victims and pedophiles\n\nhttps://youtu.be/Qjqa8oTikP8\n\n\nTLDR of the video: doing that takes lots of man hours, and she's begging a programmer/dev to choose to help children rather than make money",
            "title_similarity": "0.23544466"
        },
        {
            "id": "h3v29or",
            "score": 2,
            "text": "Aha, username relevant! I work in a plasma donation center so I see quite a few different veins every day. \n\nMost people have the same major veins with accessory veins forming where needed by the body to support tissue. In the inner elbow, for example, most people have three veins (cephalic, basillic, and median cubital) of varying quality and depth. Some people are missing one or it’s so small it can’t be palpated. I also recently learned about a “recent” evolutionary development in humans: an extra median artery running through the forearm. This is why phlebotomists will put on a tourniquet and palpate your arm before they stick you; to find the best quality vein to stick.",
            "title_similarity": "0.45999524"
        },
        {
            "id": "h3v8wsw",
            "score": 1,
            "text": "Highly recommend the work of Dr. Sue Black from the UK, who identifies criminals from their veins in their hands. Aka, yes, they are unique patterns in that area of the body. I would imagine though that in other parts of the body, certain veins and arteries must be in roughly the same place in every body",
            "title_similarity": "0.59241056"
        },
        {
            "id": "h3vaajv",
            "score": 1,
            "text": "Just as others have said, they are unique to some extent. I recall a criminal trial where the prosecution identified and charged someone by matching the veins on the defendant's forearm and the arm portrayed in media evidence. I think it was a murder trial, but I don't remember exactly.",
            "title_similarity": "0.3630817"
        },
        {
            "id": "h3vc08b",
            "score": 3,
            "text": "Superficial vein patterns have actually been used in court to identify criminals. There’s a ted talk about a case where a father was molesting his daughter and the only part of him visible in the video was his arm, including his superficial veins.",
            "title_similarity": "0.2874898"
        },
        {
            "id": "h3vlu1z",
            "score": 2,
            "text": "They are unique like fingerprints. The most common form optical biometrics systems(like those used in some of the Samsung Galaxy phones) actually look at the veins in the back of the eye for verification. If you’re wondering how they see them, they shine an IR illuminator into your eye to see the back of it.",
            "title_similarity": "0.5734421"
        },
        {
            "id": "h3vof69",
            "score": 1,
            "text": "What do veins and trees have in common?  Their growth patterns are fractals.  They grow a bit then split and continue to grow.  This is one of the ways how things can grow to appear very complex but are governed by a simple rule, or gene-program.  For both there will be other factors in the environment that drives them as they grow, hence they are never identical even with identical DNA.",
            "title_similarity": "0.43804544"
        }
    ]
}