{
    "Can adrenaline actually give you the strength to lift a car and how does it work?\n": [
        {
            "id": "h601hsa",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.008266015"
        },
        {
            "id": "h600qm3",
            "score": 20,
            "text": "[removed]",
            "title_similarity": "-0.008266015"
        },
        {
            "id": "h5zxejq",
            "score": 733,
            "text": "It doesn’t. Adrenaline is a neurotransmitter/hormone that activate your sympathetic nervous system, so it increases your heart rate, arousal, blood pressure, blood delivery to the muscle, breathing, etc. So you can survive your stressful situation. Now if you theoretically have the strength to lift a car, then adrenaline can help boost your ability, but it can’t make you a hulk on its own.",
            "title_similarity": "0.737697"
        },
        {
            "id": "h600kbe",
            "score": 80,
            "text": "[removed]",
            "title_similarity": "-0.008266015"
        },
        {
            "id": "h600f5x",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "-0.008266015"
        },
        {
            "id": "h602m3v",
            "score": 8465,
            "text": "[here's a good breakdown](https://www.healthline.com/health/hysterical-strength#how-it-happens). Basically the adrenaline gives your more blood and oxygen to your muscles which in turn allows you to be more effective. Like others have said, you don't suddenly gain super strength, but you *are* suddenly able to use the full potential of your musculature. Your body normally prevents you from doing so because it isn't necessary (I don't need full strength to lift my coffee cup) and you could injure yourself very easily. \n\nSomeone once explained it to me in comparison to gorillas. They're foolishly strong but lack the finer motor skills of humans because huge explosive strength is hard to direct into fine movement.",
            "title_similarity": "0.52844924"
        },
        {
            "id": "h604usf",
            "score": 25,
            "text": "[removed]",
            "title_similarity": "-0.008266015"
        }
    ]
}