{
    "Do other monogamous animals ever \"fall out of love\" and separate like humans do?\n": [
        {
            "id": "h8qforf",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.285711"
        },
        {
            "id": "h8r31l3",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.285711"
        },
        {
            "id": "h8tg9i2",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.3162703"
        },
        {
            "id": "h8tdqil",
            "score": 0,
            "text": "So, humans aren’t necessarily monogamous by nature. We’re socially monogamous, meaning that the boundaries set by society and the way that we are raised make us inclined to practice monogamy. Many humans practice non-monogamy (when you do that without your partner’s knowledge, that’s called cheating). \n\nTons of animals practice forms of monogamy which we recognize as similar to human social monogamy. The one that comes to mind for me is the bald eagle. Eagles form pairs and return to the same nest every year to raise young. If one of the mates disappears or dies, the other will often move on to a new long-term. Like in humans though, this isn’t a hard and fast rule. Some bald eagles live in committed triads instead of pairs, and some have sexual flings outside of their partnerships. Many large birds practice similar partnership structures. \n\nYou can find examples of just about any relationship structure in nature. It’s all natural and beautiful.",
            "title_similarity": "0.6793096"
        },
        {
            "id": "h8qe581",
            "score": 28,
            "text": "[removed]",
            "title_similarity": "0.285711"
        },
        {
            "id": "h8s1vou",
            "score": 21,
            "text": "[removed]",
            "title_similarity": "0.285711"
        },
        {
            "id": "h8res1t",
            "score": 13,
            "text": "In nature you get two types of species - Tournament and Pairbond.\n\nTournamant Males commonly abandon the females with the kids.\n\nPairbond Females commonly cheat on or even abandon the males with the kids.\n\nthat sweeping statement said - there is variation in this, other than in humans who do both.",
            "title_similarity": "0.74194705"
        },
        {
            "id": "h8qjk1m",
            "score": 234,
            "text": "No animals discovered are truly monogamous. All of the ones who form bonded pairs have been shown to \"cheat\", taking opportunities to mate with others when their primary partner isn't around.  \n\n\nAnd there are instances of a bonded pair separating, though it isn't as common as in humans for most \"monogamous\" animals. This is likely because animals have far simpler lives with much less to get upset about, haha. Can't really speak as to whether or not they fall out of \"love\" or if they ever \"loved\" each other to begin with though. You can't really measure an animal's emotional state.",
            "title_similarity": "0.7566221"
        },
        {
            "id": "h8u91pf",
            "score": 2,
            "text": "Firstly please consider that you framed your question assuming humans are biologically monogamous animals which I have found not to be true in life and in study. It’s all about propagation of the genome and for most species that involves consummating with the first available and willing mate (insects), for the rest, spreading their seed as widely as possible is going to increase their chance of spawning progeny (lions, and lastly a few species with longer lifespans (albatross) will be driven by a compulsion developed through years of evolution to favour only one mate for one reason or another. I hope this came across well and it’s helped. \nP.S. I haven’t touched on the phylogenic maps of a hive colonies which are also really interesting so please have a read yourselves :)",
            "title_similarity": "0.6214071"
        },
        {
            "id": "h8typ19",
            "score": 4,
            "text": "But are humans even monogamist? I mean, now that the marriage for life or eternal shame attitude that came from religion has died down, most marriages don’t last „forever“. Same for relationships. How can you call a species like that monogamist?",
            "title_similarity": "0.71905154"
        },
        {
            "id": "h8tfj2t",
            "score": 7,
            "text": "I think this is actually sort of two questions in one.\n\nBecause, monogamy, in the animal kingdom, in and of itself, does not *necessarily* mean that the two monogamous (or nearly-monogamous) animals are in \"love\" with each other, in the way we think of romantic love (or any kind of love, for that matter, perhaps).\n\nSo, there's the first, and much easier question, of whether monogamous animals ever break their monogamy-bond with each other, or have sex with others other than their monogamy-partner.  Answering that is as simple as watching the animals, or doing DNA tests or so on, and seeing what they do, in terms of their monogamy, or lack thereof.  And, seems like plenty of animals break their monogamy in that regard.\n\nThe second question, though (to do with love) becomes a question of: are there any non-human animals species that can even *feel* romantic love for one another... at all?\n\nThis is, obviously, a much more difficult question to answer, or to be sure of.\n\nIt would not surprise me if some of the smartest animals, such as dolphins, cetaceans, elephants, and/or some of the high-order apes can experience genuine romantic feelings of some sort, towards one another.  Also maybe even some of the smartest birds, like some of the corvids, perhaps.\n\nBut, it also wouldn't surprise *that* much if it turns out none of them are capable of experiencing it.\n\nIf I had to take a wild guess, I would suspect that elephants are probably the likeliest of the non-humans to be able to experience it, given the combination of their high intelligence, extremely good long-term memories, and, that they *seem* (at least, we think, it's hard to be sure), more so than even the great apes, to experience a greater depth of sadness and mourning over deceased family members than any other species.  So, presumably this increased depth of emotional capacity, on the down-side of the spectrum (sadness and mourning) would indicate a higher probability of being able to experience the flip side as well (i.e. something like romantic feelings towards another, perhaps).  But, that's just my wild guess, so, who knows.",
            "title_similarity": "0.74215126"
        },
        {
            "id": "h8qkh9x",
            "score": 122,
            "text": "You can take a look at swans if you want :\n\n[http://www.bbc.com/earth/story/20141204-the-truth-about-swans#:\\~:text=Once%20courtship%20is%20complete%2C%20male,to%20new%20mates%20the%20next.&text=By%20finding%20extra%20mates%20in,bird%20can%20produce%20more%20offspring](http://www.bbc.com/earth/story/20141204-the-truth-about-swans#:~:text=Once%20courtship%20is%20complete%2C%20male,to%20new%20mates%20the%20next.&text=By%20finding%20extra%20mates%20in,bird%20can%20produce%20more%20offspring).\n\nWe do not know if they truly fall in love in the way human fall in love (it's a quite difficult hypotheses to test to be fair), but they stay with their partner for life. It often occurs that when one member of the couple die, the other die very shortly after.\n\n(edit : I choose the first link on google, there exist other sources)\n\n(edit2 : I was beeing a bit ashame of the BBC link I linked so here is a much better reference : EILEEN, C., REES, P. A. L., & RICHARD, A. (1996). 6 Mate fidelity in swans: an interspecific comparison. Partnerships in Birds: The Study of Monogamy: The Study of Monogamy, 118. )",
            "title_similarity": "0.29757607"
        },
        {
            "id": "h8rtu51",
            "score": 13,
            "text": "Yes. Some remate after a partner dies as well. I got way too into researching this because dove hunting is popular where I live and as much as I hate their annoying coos, the thought that mated partners lost a life mate really bothered me.",
            "title_similarity": "0.6128342"
        },
        {
            "id": "h8th7np",
            "score": 16,
            "text": "A lot of discussion about birds here, but divorce is EXACTLY what happened to two giant Turtles at an Austrian zoo. The female hated the male so much, they couldn’t even be housed together. https://www.dailymail.co.uk/news/article-2156866/Giant-turtles-divorce-115-YEARS-despite-couple-counselling.html",
            "title_similarity": "0.5527085"
        },
        {
            "id": "h8rob0m",
            "score": 24,
            "text": "[removed]",
            "title_similarity": "0.285711"
        },
        {
            "id": "h8qkvmd",
            "score": 827,
            "text": "As someone else has said; infidelity is basically a guarantee in \"monogamous\" species.\n\nAnecdotally, I'm familiar with the colony of [Northern Royal Albatross in Dunedin, New Zealand](https://albatross.org.nz/). The first bird at the colony, Grandma, had quite a few partners throughout her life. When her first partner died, she paired up with a younger male for a few years, but was unsuccessful reproducing with him. She \"divorced\" him, and paired up with a male closer to her age. After husband number three died, she got back together with the 2nd male again, and was with him until she died.\n\nAlso, there's a female-female pair there that usually lays two ~~underutilized~~ unfertilized eggs, but occasionally one of them will lay a fertilized egg - implying at least one of them is gettin' busy with a side piece.\n\n\nEdit: underutilized - - - > unfertilized",
            "title_similarity": "0.6306833"
        },
        {
            "id": "h8rfflt",
            "score": 192,
            "text": "There’s a story about an NZ Robin that was near extinct (literally like 8 individuals left, and only 1 of those was a female able to breed). These robins typically mate for life, but when her mate was getting old and wasn’t able to properly fertilise her eggs she left him and found a younger male to mate with. These eggs were viable so a team of researchers that had been studying these birds removed her eggs to artificially incubate them, and she laid another clutch. She literally saved her species by swapping partners",
            "title_similarity": "0.580899"
        },
        {
            "id": "h8qdq84",
            "score": 184,
            "text": "[removed]",
            "title_similarity": "0.285711"
        },
        {
            "id": "h8qkhzs",
            "score": 1124,
            "text": "Yeah it happens and birds are a good example. Even though about 90% of bird species are monogamous, they may not be the typical kind of monogamy that people think of right away. Some have social monogamy where they only have a partner for the mating season or year and then move on. Some may even have the typical lifetime monogamy. In fact some can even “divorce” their partners if they do not find them fit to be a father or mate (most commonly done by females).",
            "title_similarity": "0.6662742"
        },
        {
            "id": "h8s70yo",
            "score": 194,
            "text": "There's a small antelope like creature called the Dik-dik. Monogamy is basically enforced by the females. The males might try other relationships if the opportunity presents it self. \n\nThey also have a romeo and Juliet thing going where if one of the couple dies, the other one will commit suicide. They make themselves easy prey for preditors. In the Mara there are rumours that they will even approach Lions, to die.",
            "title_similarity": "0.67209554"
        },
        {
            "id": "h8qz994",
            "score": 603,
            "text": "There's a book from 1996 (\"Partnership in Birds\" by Jeffrey Black) where the author gathered data on bird \"divorce rates\". It varies from species to species, but some birds were more frequently observed as being monogamous than others. Some birds had a near 100% chance of \"cheating\" (flamingos, if I recall correctly) while other birds were pretty faithful (or at least observed as being so).",
            "title_similarity": "0.6244237"
        },
        {
            "id": "h8qifx7",
            "score": 6042,
            "text": "A mentor of mine in college was a primatologist who studied gibbon social structures. Gibbons are socially monogamous. He found out that gibbons are cheating, swapping partners, getting gibbon “divorced” all the time. At one point he drew a diagram off all the side hanky pankey that was going on among gibbon families that lived near each other it looked like a complex soap opera. \n\nSo yes “monogamous” animals do separate. Or at least gibbons do— they’re apes just like we are.\n\nEdit: I think [this is the paper](https://www.jstor.org/stable/4535165) he wrote about it. Behind a paywall but you can get the gist from the abstract.",
            "title_similarity": "0.6818377"
        },
        {
            "id": "h8qqrpa",
            "score": 5993,
            "text": "used to work as a penguin aquarist. Everyone likes to say they mate for life, and some do, but usually its a good number of breeding cycles, raise a number of chicks over a good number of years, and then it isn't uncommon to find a new partner later in life",
            "title_similarity": "0.48392013"
        },
        {
            "id": "h8te966",
            "score": 2,
            "text": "Yes and no. Our concept of love and monogamous relationships aren't comparable for the most part. However, much like humans, animals can just leave a formerly committed relationship. But reasoning is what separates us.",
            "title_similarity": "0.7818564"
        },
        {
            "id": "h8um2i8",
            "score": 6,
            "text": "My town had this Swan couple for a long time, and the female Swan died. There were several articles in the local paper about how the male may die now, because they mate for life and will never take another mate, and depression can kill them. Like, 2 weeks later there is a new female swan, and then boom, it's a pregnant swan. It was great fun, by local news standards.",
            "title_similarity": "0.5475835"
        },
        {
            "id": "h8ynqz5",
            "score": 1,
            "text": "Yes definitely. Swans, and other kinds of monogamous birds sometimes 'divorce' and move onto a different mate. I should also mention that even if an animal is sociallu monogamous doesn't mean they are sexually monogamous.",
            "title_similarity": "0.74680877"
        },
        {
            "id": "hc9z0hv",
            "score": 1,
            "text": "mainly penguins, for instance there was this one penguin named grape-kun, he had a wife who had a kid that they were separated from, after that they had a falling out and the wife fell in love with a younger penguin and left him, and after that he fell in love with an anime waifu, became famous, took a picture with the voice actor for the anime waifu, you know how it is. wang has a full video on it",
            "title_similarity": "0.5219667"
        }
    ]
}