{
    "If an air bubble is accidentally left in a syringe for a vaccine or any other medicine can it kill me? Or is it rare?\nEDIT : I have been supplied with answers so thank you people who commented and goodbye\n\nEDIT 2 : Wow I didn't expect this post to blow up I woke up and saw my phone was filled with notifications and when I saw why I got extremely happy so thank you!": [
        {
            "id": "h8wl7cj",
            "score": -12,
            "text": "Yes, but doctors and nurses and pharmacists, who give shots for things like vaccines, are trained to take the air out of a syringe before injection, specifically to prevent this.\n\nBecause of these precautions, you have a greater chance of spontaneously developing an embolism on your own (60k to 100k cases per year in the United States, or about 1 in 300-500 deaths) than you are to have air injected into your bloodstream during a vaccine.\n\nThe far more likely cause from doctor-sources is going to be during surgery.",
            "title_similarity": "0.6639779"
        },
        {
            "id": "h8wk960",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.06413375"
        },
        {
            "id": "h8wqpu5",
            "score": 1,
            "text": "It's possible that it could cause an air embolism but it's pretty rare I think and only an issue if the medicine is being delivered by IV. Most air bubbles that make it into veins are stopped at the lungs. If an air bubble gets into an artery somehow, that's another story and could potentially be quite dangerous.",
            "title_similarity": "0.6204698"
        },
        {
            "id": "h8x3n14",
            "score": 17,
            "text": "If your healthy your body will filter out a huge amount of air. We do air bubble studies in the hospital where we fill syringes with air bubbles and inject it and watch with a echocardiogram to make sure your heart is clearing the air. I've never even seen a unhealthy heart have troubles with bubbles.",
            "title_similarity": "0.6775046"
        },
        {
            "id": "h8x1sfo",
            "score": 25,
            "text": "Vaccines are injected in your muscle. So no. The air bubble would not fit into the needle - but even if it did - it would be harmless and have zero effect on the medicine at all. The muscle absorption rate takes about an hour. The air bubble even if somehow injected into the muscle would not make into the blood stream- remember your blood stream is a microscopic network of capillaries that turn into venules then into your veins - even if one of these air bubbles made it through this net work ( not even happening ) your veins have valves and it would most likely not travel. And be stuck. You would develop symptoms like edema and redness , warmth at the site and pain- and go to the doctor and get an ultrasound and see it. Get prescribed an anticoagulant and be cured, the end.",
            "title_similarity": "0.5886377"
        },
        {
            "id": "h8wkuov",
            "score": 901,
            "text": "This is only a concern for Intra-venious.injections, not for intramuscular injections, which is why intramuscular injections like vaccines can be trusted to more people with less experience. If a bit of air is injected into muscle during an IM shot it doesn't cause any issues.\n\nEdit to clarify, vaccines are intramuscular, usually in the deltoid, or shoulder muscle.",
            "title_similarity": "0.6778163"
        },
        {
            "id": "h8x0o4p",
            "score": 14,
            "text": "So generally speaking bubbles are fine. We inject bubbles all the time. The only exception is arterial. If we are working on the carotid or femoral artery we are hyper careful to not inject bubbles. In fact we fill the syringe 2/3 full so we can back out a bit and then don’t inject the last cc or 2",
            "title_similarity": "0.64011115"
        },
        {
            "id": "h8wu0wb",
            "score": 7,
            "text": "Nothing will happen. Even intravenously, a very large air bubble would be needed to travel downstream and block the heart / lung / brain vasculature to any significant degree. You would need to pump the vein with 100ml of air per second for 5 seconds to kill someone!\n\nAlso, that is a very funny edit lol",
            "title_similarity": "0.59514254"
        },
        {
            "id": "h8wm7xe",
            "score": 30,
            "text": "[removed]",
            "title_similarity": "-0.06413375"
        },
        {
            "id": "h8wkvyy",
            "score": 31,
            "text": "[removed]",
            "title_similarity": "-0.06413375"
        },
        {
            "id": "h8wxgiv",
            "score": 11,
            "text": "As a radiologist I see air in veins, cavernous sinuses in the head, svc, I’ve and rarely in the right ventricle. Even a large amount of air has almost no chance to hurt you unless you have a r to left heart shunt or vascular malformation in your lungs. The lungs do a great job of just filtering that air out very quickly. Arterial lines should always be air free since those plug the terminal\nBlood supply of whatever organ they feed. Brain is most obviously bad. After a cerebral angiogram it is common to see tiny strokes from micro bubbles.",
            "title_similarity": "0.68016624"
        },
        {
            "id": "h8wteml",
            "score": 31,
            "text": "The air embolism killing you thing is mostly a myth perpetuated by TV shows. First, it would take an arterial injection-not a venous or intramuscular injection. Second, it would take a volume of air well beyond what a vaccine syringe contains to cause an arterial air embolism.\n\nIn medicine we routinely inject air bubbles into a person’s veins in order to check for heart defects by doing a procedure called a “bubble study” where we use a Doppler ultrasound to listen for bubbles in the intracranial arteries after injecting bubbles into the venous circulation. In a normal heart the bubbles will travel into the lungs and be dissolved but in some heart defects the bubbles will enter into the left side of the heart directly and you can hear the bubbles in the arterial circulation.",
            "title_similarity": "0.65943587"
        },
        {
            "id": "h8wmjr2",
            "score": 321,
            "text": "But the caveat is that in most cases it would take several mL of gas to actually kill you. An easy example is if you get an IV, there are almost always small bubbles that travel through the lines and into your bloodstream. The risk of issues arising from that amount of gas is extremely small.",
            "title_similarity": "0.59895337"
        },
        {
            "id": "h8wkzt6",
            "score": 87,
            "text": "For a vaccine, the risk is basically non-existent as those are intramuscular, not intravenous. The air bubble should eventually be absorbed, and has no way of entering a vein and causing an embolism. For intravenous injections, it is possible, but unlikely to cause en embolism.",
            "title_similarity": "0.552535"
        },
        {
            "id": "h8x00ux",
            "score": 1602,
            "text": "Anesthesiologist here, on a typical day I inject medicine intravenously more than 100 times. \n\nWe try not to get too many bubbles into the vein but as many commenters have pointed out, it takes a significant amount (more than most of the typical volumes of our syringe) to cause significant issue. Essentially it would only be a problem if enough accumulates in your heart chamber and causes the pumping mechanism to fail. \n\nHaving said that it IS possible for people to be killed by air embolus and that has unfortunately happened accidentally before. One of the ways is this:\n\n- an IV bag of saline is disconnected from the line but is not discarded. \n- significant amount of air now collects in this bag (normally it only contains saline but no air)\n- this bag is reconnected (“respiked”) to the IV line\n- normally the air shouldn’t “flow into” the vein \n- however, sometimes people use a pressure bag to squeeze the IV bag so that it flows faster\n- because of the additional pressure the significant amount of air can now be forced into the vein, leading to air embolus which can be fatal. \n\nExample of a tragic case leading to a 3-year-old’s death in Australia:\n\nhttps://gravelessons.com/2015/01/12/ruby/\n\nADDIT: this comment is specifically about intravenous air. For intramuscular injection eg vaccines, air does not matter.",
            "title_similarity": "0.6751517"
        },
        {
            "id": "h8wrg92",
            "score": 379,
            "text": "The risk is minuscule. \n\nThe real risk of air embolism is when a very large amount of air enters a vein. (Several syringe fulls). \n\nTiny bubbles are in fact sometimes used to outline blood flow in the the heart because they show up nicely on ultrasound (echocardiography)\n\n\nFor an air bubble to cause a problem it would have to enter a blood vessel (a vein). This is unlikely when the injection is in a muscle. Even if it were to happen the bubble would pass through the right side of the heart and be caught in the lung where blocking a small blood vessel temporarily (until it dissolved) would not be a problem. If a large bubble ( several syringe fills) was injected it could become lodged in the heart and interfere with the pumping action (gas being compressible, a contracting heart chamber might not force blood along the arteries.). There is a rare risk for people who happen to have a hole between the left and right sides of the heart the a small bubble might enter a vein, by chance move across the wall in the heart and then enter the main arterial circulation, if it then went into the brain it could produce a stroke. This is wildly unlikely, would involve the bubble passing from a low pressure (right heart) to high pressure(left heart) - so moving upstream so to speak and happening then to go to the brain rather than anywhere else. And even a bubble entering the brain’s circulation would in most cases do nothing. \n\nBottom line: you are way more likely to be killed in a car accident on the way to get the injection than from a bubble in the syringe.",
            "title_similarity": "0.6775226"
        },
        {
            "id": "h8wrhku",
            "score": 139,
            "text": "In most cases, it will require at least 50 mL of air to result in significant risk to life, however, there are case studies in which 20 mLs or less of air rapidly infused into the patient's circulation has resulted in a fatal air embolism.\n\n50mL is 5x the capacity of a typical syringe used for injections of meds.",
            "title_similarity": "0.525744"
        },
        {
            "id": "h8wm4av",
            "score": 7894,
            "text": "No a simple air bubble won’t kill you, either in the muscle or even in the IV. \n\nIf somebody grabs a huge syringe and fill it completely with air and inject it in your veins, it may cause problems. But small air bubbles get commonly injected with no side effects",
            "title_similarity": "0.65072566"
        },
        {
            "id": "h8wro56",
            "score": 63,
            "text": "Ok, so just to clarify.\n\nVaccines usualy are applied on muscle, so air bubbles are not a problem.\n\nWhen we talk about IVs, injecting small amount of air bubbles in to a superficial vein won’t cause trouble, because the final pathway from the venous system point of view is your lungs, and a small embolism in a fraction of your lungs will cause no harm, if you repeteadly inject large quantities of air, in this case you may see repercussion.\n\nWhen we talk about arterial lines, that’s a whole new story, the final pathway for arterial system can be anywhere in your body. Brain, fingertips, etc. Even a small bubble can obstruct an arteriole (small final artery) and cause damage, like a small stroke. But to be honest, even when it happens, most of the time you will see no repercussion at all, the area affect is so small and may receive blood from the “neighborhood” arterioles.\n\nSome people have abnormal communicarion between arterial and venous system, most common in children, so in these cases we need to be extra careful about injecting air in veins.",
            "title_similarity": "0.69258106"
        }
    ]
}