{
    "The Johnson&Johnson one-shot vaccine never seems to be in the news, or statistics state that “X amount of people have their first shot”. Has J&J been effective as well? Will a booster be needed for it?\n": [
        {
            "id": "hb3tyls",
            "score": 6,
            "text": "\"Boosters\" will be needed for all of the vaccines. Most are likely to all just be third (second, fourth, fifth) doses of the same vaccine, but the later ones will hopefully be tweaked for variants, which is what I think J&J is trying to do.\n\nWe're all still inoculating against Covid19A right now, which hasn't been a concern in the USA for six months, but that's how it always goes: vaccines will always lag behind mutations.\n\nI'm just glad  the news is catching up on this because I'm tired of reading about \"fully\" vaccinated when they mean two doses, as if that means \"finished\" somehow, and of arguing with dumb people who started saying Covid was \"over\" since  the spring, or just because 70% of Americans have some vaccine. Two won't be considered \"fully\" by November, once the messaging catches up. As ever, both the government and media have been pretty awful in terms of communicating clearly.\n\nWe'll be getting shots for awhile yet.",
            "title_similarity": "0.71539456"
        },
        {
            "id": "hb30nsi",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.14529371"
        },
        {
            "id": "hb3txq8",
            "score": 43,
            "text": "Something else to remember is that J&J was used to vaccinate people who would not have had the ability (or likelyhood) to show up for 2 shots. Like people in remote/resource-limited areas, the homeless, etc. So while it may not have been as effective as the others it certainly was better than nothing when it came to controlling contagion rates. I personally didn't want J&J because of the (albeit very rare) clotting issues because of personal health concerns. But if it had been all that was available you bet I would've been on the line. In the end, the thought of lowering the chances I spread it to others over-rides my slight concerns about q rare clotting disorder. The thought of possibly indirectly murdering someone via virus absolutely terrifies me.",
            "title_similarity": "0.6465306"
        },
        {
            "id": "hb385cz",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.14529371"
        },
        {
            "id": "hb338m9",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.14529371"
        },
        {
            "id": "hb3g07k",
            "score": 16,
            "text": "And here are the FDA briefings for Moderna and Pfizer for comparison. Note though those vaccine efficacy (VE) numbers are only the initial measurements ;-) If someone has an updated document please let me know.\n\nhttps://www.fda.gov/media/144246/download\n\nhttps://www.fda.gov/media/144434/download",
            "title_similarity": "0.6009847"
        },
        {
            "id": "hb36i01",
            "score": 72,
            "text": "Less than 8% of Americans have received the J&J shot, most people don't hear about it because Pfizer and Modernas vaccines have the most time in circulation and account for 92% of the vaccines administered in the US.",
            "title_similarity": "0.7339846"
        },
        {
            "id": "hb3479j",
            "score": 165,
            "text": "It's slightly less effective than the moderna/Pfizer vaccines, but still works well. It's just much, much more rare, so few people really think about it. Only 8 percent of fully vaccinated people got the J&J. \n\nIt also had a lot of early missteps, like vaccine contaminations, and was paused for a bit in April after heart and blood clot issues were springing up, both of which kept it from being as common as the mRNA vaccines.",
            "title_similarity": "0.7497072"
        },
        {
            "id": "hb3lnf0",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.14529371"
        },
        {
            "id": "hb2x3if",
            "score": 1601,
            "text": "It is likely that people who received a J&J COVID-19 vaccine will  \n need a booster dose. Because the J&J/Janssen vaccine wasn’t given   \nin the United States until 70 days after the first mRNA vaccine doses (Pfizer-BioNTech and Moderna),  \n the data needed to make this decision aren’t available yet. These data   \nare expected in the coming weeks. With those data in hand, CDC will keep  \n the public informed with a timely plan for J&J/Janssen booster   \nshots.\n\nhttps://www.cdc.gov/coronavirus/2019-ncov/vaccines/booster-shot.html",
            "title_similarity": "0.73964334"
        },
        {
            "id": "hb2x6dw",
            "score": 424,
            "text": "Here are some recent articles on it. I got the j&j and will certainly get the booster when it becomes available. Data is still being collected. I imagine this has a lot to do with the fact that the majority of vaccinations were moderna/pfizer. \n\nhttps://www.jnj.com/johnson-johnson-announces-data-to-support-boosting-its-single-shot-covid-19-vaccine\n\nhttps://www.npr.org/sections/coronavirus-live-updates/2021/08/25/1030909283/johnson-and-johnson-covid-vaccine-booster-six-months\n\nhttps://www.cdc.gov/coronavirus/2019-ncov/vaccines/booster-shot.html",
            "title_similarity": "0.60106206"
        },
        {
            "id": "hb313s0",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.14529371"
        },
        {
            "id": "hb3coqq",
            "score": 962,
            "text": "They announced recently that a Booster to the J&J vaccine increases the effectiveness. I believe its usage dropped when the unforeseen side effects announcement coincided with the Phase 2 deployment in the USA earlier this year.",
            "title_similarity": "0.70141757"
        },
        {
            "id": "hb3apmy",
            "score": 3501,
            "text": "We gave people who recieved the J&J shot a booster here in Iceland after many of them were infected with symptomatic covid, including serious symptoms.\n\nAll of the data is here: www.covid.is\n\nIt includes a full breakdown of all of out breakthrough cases.",
            "title_similarity": "0.50427645"
        },
        {
            "id": "hb3dn3v",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.14529371"
        }
    ]
}