{
    "Wikipedia states, \"The human nose is extremely sensitive to geosimin [the compound that we associate with the smell of rain], and is able to detect it at concentrations as low as 400 parts per trillion.\" How does that compare to other scents?\nIt rained in Northern California last night for the first time in what feels like the entire year, so everyone is talking about loving the smell of rain right now.": [
        {
            "id": "hcdp3on",
            "score": -19,
            "text": "I LOVE IT!\n\nTHANK YOU, O YOU WHO UNDERSTANDS!\n\nToo too often, information such as the original post here is given without enough context to ensure that a reader, even a studier of the topic, will be able to understand what matters about the statement! This abounds in the statistics and maps posted here on reddit, but this post is a complete example.\n\nInteresting topic. An exotic word, geosimin, part of the word tantalizingly similar to the word \"semen.\" Astonishing numbers -- TRILLION! And 400 of them!\n\nBut the reader is not empowered to understand what this means, as there is nothing to compare against.",
            "title_similarity": "0.6602526"
        },
        {
            "id": "hcde4th",
            "score": 35,
            "text": "There's a lot of good answers, but  I also want to add that when it comes to molecules, a trillion isn't all that much. It sounds like much because it's a lot when it comes to pretty much every day-to-day thing, but not when it comes to the molecular level. For comparison, [a single breath you take has 25 sextillion molecules](https://www.nationalgeographic.com/science/article/air-gas-caesar-last-breath-sam-kean#:~:text=But%2C%20on%20average%2C%20it%27s%20inevitable,That%27s%20a%20gargantuan%20number!) (1 x 10\\^21), in other words a single breath has *billion trillion* molecules. \n\nSo, in an air pocket the size of your average breath would have 400 billion molecules or 'rain smell'. So yeah, quite a lot.",
            "title_similarity": "0.5507257"
        },
        {
            "id": "hcd97ov",
            "score": 23,
            "text": "I’m from the east coast initially and am used to four distinct seasons and notably an ample amount of rainfall whether in season or not (snowstorms like a Moth#%Fu&@!% in the winter as well). That being said, I’ve lived in NorCal for just over a year now and I’ve never been so chronically dehydrated in my life. The heat and sheer dryness of this climate is unbearable for me and I’m in the process of moving as we speak. I thought it was really funny coming across this post though, I literally stood outside smiling like a madman in the rain last night and have been taking huge huffs of air outside all day soaking up the remaining smell of the pleasant dew that’s barely clinging on to the now scorching 90 degree earth for dear life. I’m sorry moisture, once we crank back up twenty more degrees you’ll be no more :’(",
            "title_similarity": "0.80942297"
        },
        {
            "id": "hcekh5m",
            "score": 10,
            "text": "Interesting fact: 1 in 10 can't smell geosmin(which is produced by actinobacteria). I am one of them. I discovered it when I was working in a microbiolgy lab. My coworkers always commented on the earthy smell when ever we worked with actinobacteria, and I could smell nothing. So from an evolutionary perspective, so some of us are super defective.",
            "title_similarity": "0.64782184"
        },
        {
            "id": "hccqp9g",
            "score": 164,
            "text": "[removed]",
            "title_similarity": "-0.051719856"
        },
        {
            "id": "hcd0786",
            "score": 119,
            "text": "I’m familiar with methyl mercaptan (MeSH), it’s close to 1ppb for human detection and mixed in with many flammabale gasses (it’s what gives us the smell of leaking gas).\n\nI used to worked at a research lab and remember we had to evacuate one day when a small vial (maybe a couple mL) of MeSH leaked outside a hood. Same for one time in college when a prof studying thiol compounds had a leak in his vacuum equipment.\n\nAs for the scent itself, it’s reminiscent of rotten eggs / rotten flesh and is an evolutionary trait for humans to distinguish.",
            "title_similarity": "0.6881002"
        },
        {
            "id": "hcd5vr5",
            "score": 490,
            "text": "There were tests done on [thioacetone](https://www.science.org/content/blog-post/things-i-won-t-work-thioacetone) in the 1960s where a single drop of the substance could be smelled downwind seconds later from a quarter mile away.\n\n> Recently we found ourselves with an odour problem beyond our worst expectations. During early experiments, a stopper jumped from a bottle of residues, and, although replaced at once, resulted in an immediate complaint of nausea and sickness from colleagues working in a building two hundred yards away. Two of our chemists who had done no more than investigate the cracking of minute amounts of trithioacetone found themselves the object of hostile stares in a restaurant and suffered the humiliation of having a waitress spray the area around them with a deodorant. The odours defied the expected effects of dilution since workers in the laboratory did not find the odours intolerable ... and genuinely denied responsibility since they were working in closed systems. To convince them otherwise, they were dispersed with other observers around the laboratory, at distances up to a quarter of a mile, and one drop of either acetone gem-dithiol or the mother liquors from crude trithioacetone crystallisations were placed on a watch glass in a fume cupboard. The odour was detected downwind in seconds.\n\nI have no idea what that concentration is, but it's *low*. Thioacetone is such a strong odor and it causes such severe effects (nasuea, vomiting, and unconsciousness) that it's actually quite dangerous.",
            "title_similarity": "0.6590551"
        },
        {
            "id": "hcd9ho5",
            "score": 171,
            "text": "I had to look up why the rain would have a smell...\n\n\"Geosmin is produced by various blue-green algae (cyanobacteria) and filamentous bacteria in the class Actinomyces, and also some other prokaryotes and eukaryotes. The main genera in the cyanobacteria that have been shown to produce geosmin include Anabaena, Phormidium, and Planktothrix, while the main genus in the Actinomyces that produces geosmin is Streptomyces.[2][6][7][8] Communities whose water supplies depend on surface water can periodically experience episodes of unpleasant-tasting water when a sharp drop in the population of these bacteria releases geosmin into the local water supply. Under acidic conditions, geosmin decomposes into odorless substances.\"\n\nSo basically it is earthy smell that accumulates in the soil when it does not rain, then a big rain happens and disturbs the soil",
            "title_similarity": "0.4605184"
        },
        {
            "id": "hcdnmn9",
            "score": 693,
            "text": "As a perfumer, there are a lot of things that can do that. Though, often smells that are very strong to our noses are undetectable in full concentration. So diluting them is actually necessary.\n\nI can say that there are a few chemicals I have that are so substantive that if you scrub them out over and over they will still be detectable. For example, I used to wash my beakers in the dish washer (they only contained trace amounts of aroma chemicals that themselves had been previously diluted to 10% or less. So it was a tiny, tiny amount of each beaker.) No problem right? Nope, my dishwasher smelled like humus ether (dirt) for 6 months even after doing a vinegar rinse multiple times and using it daily. That’s a “lasts you until it goes bad ” chemical. Others include things that smell like human waste, such as indole.\n\nGeosmin is something you can now buy pure from some perfume companies, but it wasn’t until recently. The only problem is that you could probably never use that much before it went bad. They usually sell it at 1% and that’s plenty. I usually dilute it to .01%.\n\nIf you want the smell of fresh rain (real fresh rain, not the stuff at B&BW), you need a combination of geosmin and other surrounding flora and fauna. Vetiver, Mysore, Floralozone (proprietary chemical from IFF that smells like green air), hedione (one of those chems that’s too strong to smell unless it’s diluted for most people, but it adds sweet floral notes), hexenol 3 cis (smell of grass), jasmine sambac, and, only if you want to get that authentic dirt smell, a tiny bit of humus ether. Though, I’d suggest trying carrot seed oil first. It smells more like sweet carrots covered in dirt but it’s less harsh and usually adds a wearable characteristic that humus ether doesn’t . My specific version of a rain accord is tailored to my area and contains the smell of wet hay lol",
            "title_similarity": "0.6478511"
        },
        {
            "id": "hcd2peo",
            "score": 1981,
            "text": "There are a large number of studies on odor detection thresholds. Here's a table from 1986 that compiles several sources: https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.694.8668&rep=rep1&type=pdf.\n\nThe lowest thresholds in the literature the author surveyed were for vanillin, skatole, and ionone, all of which were in the sub-ppt range according to at least one surveyed study. The highest threshold in the table is for propane, which is normally considered odorless, but apparently becomes detectable somewhere between 0.1% and 2.0% concentration, depending on which study you accept. There is a difference of 11 orders of magnitude between the lowest and highest thresholds reported.\n\nGeosmin isn't in the table, but 400 ppt would place it among the lowest thresholds (most sensitively detected). However, it's also clear from the differences between the \"low\" and \"high\" thresholds that the actual numbers for a particular substance can vary widely between studies.",
            "title_similarity": "0.54779345"
        },
        {
            "id": "hcdheah",
            "score": 23,
            "text": "We are also particularly sensitive to the smell of sulfurous compounds, such as the smell of rotten eggs or the smell we associate with propane gas.\nWe can identify them down to 0.3 parts per billion.\n\nSulfur-based chemical odorants are injected into the propane tanks so we can identify leaks by smelling them and large enough leaks at larger scales have been reportedly smelled by people in adjacent cities and even neighboring countries!",
            "title_similarity": "0.67210484"
        },
        {
            "id": "hcdtlfp",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.051719856"
        },
        {
            "id": "hceadkd",
            "score": 12,
            "text": "This may or may not be related to geosmin, but is anyone else familiar with the smell of spring/summer in the northeast?  It’s a round lush greenish scent that’s a sharp contrast to the biting sharp scent of frozen. \n\nIt’s the smell in the air on the first 70F+ day in March or April. It’s stronger in late spring when the warm air is here to stay, usually in late May. Then it dissipates as the summer wears on (or our noses get used to it). \n\nSomeone please tell me they’ve noticed this too!",
            "title_similarity": "0.6789484"
        },
        {
            "id": "hceey4v",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.051719856"
        },
        {
            "id": "hcfx577",
            "score": 2,
            "text": "Oh hey - I actually made a correction on that Wikipedia page back in May! The original version incorrectly claimed we could smell geosmin at 5 parts per trillion, but the cited source stated 400 parts per trillion. Still not sure how that mistake happened.\n\n\nAnyway, weird seeing it in the wild months later...",
            "title_similarity": "0.6687609"
        },
        {
            "id": "hcfxr07",
            "score": 3,
            "text": "On a related topic, I know that the older common view of the human sense of smell is that we've actually got a fantastic sense of smell within the animal kingdom in terms of fidelity, but it's low range. Like the animals that can see a ton but are short-sighted.",
            "title_similarity": "0.5378738"
        },
        {
            "id": "hcge41y",
            "score": 2,
            "text": "“Like sheep which, having been driven to a pasture, can now spread out at their leisure, the clouds began to drift. Afternoon sunlight sliced through into the still waters. The boomerang hung in the sky, and the boy thought he would have to find a new word for the way the colours glowed.\nIn the meantime, he looked down at the water and tried out the word he'd been taught by his grandfather, who'd been taught it by his grandfather, and which had been kept for thousands of years for when it would been needed.\nIt meant the smell after rain.\nIt had, he thought, been well worth waiting for.” \n\nSir Terry Pratchett  The Last Continent",
            "title_similarity": "0.65710735"
        },
        {
            "id": "hcmwwg6",
            "score": 1,
            "text": "I never liked the smell of rain hitting pavement after it’s been dry for a long time. You can feel the electrons in the air and everything smells like a metallic wet rag that was used to wipe oil. \n\nNow after days of heavy rain I like the smell, once all the man made pollution is washed away.",
            "title_similarity": "0.77816886"
        },
        {
            "id": "hf283xq",
            "score": 1,
            "text": "I’m wondering if other people can detect when someone close to them is getting sick? Whenever one of my children is coming down with something I can usually tell a couple of days before by the way their skin smells. It’s usually a heavy almost musky odor.",
            "title_similarity": "0.5813003"
        }
    ]
}