{
    "Why haven't we selected for Avocados with smaller stones?\nFor many other fruits and vegetables, farmers have selectively bred varieties with increasingly smaller seeds. But commercially available avocados still have huge stones that take up a large proportion of the mass of the fruit. Why?": [
        {
            "id": "he18kb6",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.012443619"
        },
        {
            "id": "he1wwrj",
            "score": 1,
            "text": "Avocado farming is causing deforestation, destroying ecosystems, funding drug cartels, and contributing to climate change. In Michoacán, Mexico, the biggest avocado producing region in the world, farmers are illegally razing pine forests in order to plant lucrative avocado trees. Stop buying Avocados.",
            "title_similarity": "0.6499306"
        },
        {
            "id": "he172gb",
            "score": 2,
            "text": "At the time of sale, there is no way for the purchaser to tell how large the stone is, so there is no monetary advantage to growing a smaller stone.  Even if someone did try to gain a sales advantage via marketing/brand recognition, usually isn't enough demand for stores to carry more than one brand/type of avocado, so supermarkets just stock whatever brand is the cheapest on the wholesale market.",
            "title_similarity": "0.76756275"
        },
        {
            "id": "he3dncd",
            "score": 0,
            "text": "Avocados are very sensitive to water and climate, have different bearing characteristics, different types of pollination, vastly different sizes, different oil characteristics, and lots of other differences. There are over a thousand varieties of avocados. If you would like to know more the University of California has an avocado growing site in Riverside to test and develop avocado varieties. \nhttp://www.ucavo.ucr.edu/General/General.html",
            "title_similarity": "0.6722405"
        },
        {
            "id": "he14zb8",
            "score": 29,
            "text": "[removed]",
            "title_similarity": "-0.012443619"
        },
        {
            "id": "he127cd",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "-0.012443619"
        },
        {
            "id": "he1f4kx",
            "score": 1,
            "text": "There are different types of seeds and ones that are quite large like avocados and peach pits tend to carry a lot of essentials for the plant. Shrinking it via selective breeding would have an adverse effect on the plant.",
            "title_similarity": "0.7604183"
        },
        {
            "id": "he2hjoo",
            "score": 4,
            "text": "Avocados do not grow true to seed. They scramble their genes just like we do, so it's a mishmash of their parents' genes.\n\nBasically, if you plant an avocado seed, you will not get the same plant as before. This means that all the varietals are grown by grafting, as are grapes, apples, and most citrus.\n\nThere's a really good (if a bit geeky, lol) video about it. BRB with a link.\n\nEdit: [link](https://youtu.be/yWAR_DotvZs).",
            "title_similarity": "0.8101746"
        },
        {
            "id": "he1nfhd",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "-0.012443641"
        },
        {
            "id": "he1gu2u",
            "score": 18,
            "text": "The problem with fruit like this is transportation and the modern food distribution networks \n\nThere are better and more flavorful avocados but they dont transport well and so you cant buy them.\n\nAs an example, you will hardly ever find fresh currants for sale in big chain grocery stores because they bruise and then mold very quickly.",
            "title_similarity": "0.7646601"
        },
        {
            "id": "he10wu9",
            "score": 155,
            "text": "[removed]",
            "title_similarity": "-0.012443619"
        },
        {
            "id": "he36c08",
            "score": 43,
            "text": "I'm an avocado farmer and it's so great to see this topic in askscience.  The main characteristics we select for are: flavor, yield, consistency, resilience, and month of harvest.  There's a lot of talk about the desire for varieties with a smaller seed but so far nobody has grown a seedling variety that meets the requirements of our other 5 higher priority selection criteria and also has a small seed.\n\nIf at some point a seedling tree grows a fruit that tastes as good as Hass and produces a consistently high yield and has a tiny seed you'll see them in your local supermarket.  \n\nHere's a vid I did using candy to demonstrate avocado pollination and why it's difficult to grow and select new varieties:  https://youtu.be/yWAR_DotvZs\n\nThe comments I got on this vid are  surprisingly controversial...people seem to not want to believe that avocados are heterozygous and every new seed is a crap shoot as far as fruit quality.",
            "title_similarity": "0.8225701"
        },
        {
            "id": "he139jv",
            "score": 10451,
            "text": "Avocado's are not well suited for selective breeding. This is for a number of reasons.\n\n1. Avocados can take a very long to produce fruit and reproduce. Growing from seed, it can take 5 to 10 years for it to create fruit. That means you have to wait a long time to try to breed better avocado\n\n2. It's phenomenally difficult to control pollination. They create thousands and thousands of blooms, only a few which actually become fruit, meaning hand pollination is almost impossible. So you're at the mercy of the winds and of the other trees nearby - it's very tough to control the gene lines\n\n3. Avocados are incredibly heterozygous, meaning even selecting for two parents of a certain type (say, two small trees) can produce wildly different offspring. So even if you can control the pollination, you have to grow hundreds of seedlings to see if one or two are worth keeping.\n\n4. Finally, the avocado craze is fairly new. Humans haven't domesticated that many plants, and probably haven't put much effort into avocado until the last few decades. \n\nThat's why when you get a good avocado like Hass (which was a total accident) you propagate it by grafting, not by seed.",
            "title_similarity": "0.79670453"
        },
        {
            "id": "he16obg",
            "score": 828,
            "text": "Avocados don't grow \"true to seed\". If you grow a tree from the seed of a Haas avocado -- the only avo most have ever eaten -- the fruit from that tree won't look or taste like a Haas avocado. Apples are the same way. Grow from the seeds of a Fuji and the resulting apples will probably be small and sour. \n\nSo every Haas avo or Fuji apple is grown from a graft originating from a single original tree. The bottom line is that you can't just plant a bunch of Haas seeds and pick the ones with smaller seeds -- the usual method of domestication.\n\nIt might be more economical to locate the genes that control seed size and tweak the Haas line, but there's no guarantee this would even be possible. It might be that their nutty flavor is the *result* of its large seed!",
            "title_similarity": "0.8050068"
        },
        {
            "id": "he1gt8s",
            "score": 14,
            "text": "In addition to all the talk of how avocados have indeed been cultivated with more flesh, the challenges of creating new varieties, etc... one thing that's being missed here in this thread is that this is not the most important quality. Taste and texture are generally more important when looking between varieties, but most important of all are what commercial growers are looking for -- consistent bearing on smaller trees in different climates/soil conditions. That's where most of the variety experimentation is happening: on varieties like GEM that produce quality equal to Hass, but more consistently on smaller trees, and on avocado rootstock adaptable to climate change.",
            "title_similarity": "0.83127606"
        },
        {
            "id": "he1gwhe",
            "score": 103,
            "text": "In Hawai'i avocados easily self propagate. You'll quickly realize why only several cultivars are commonly grown. Some are better than others but most home gardeners still plant several varieties because they will come into fruit at slightly different times of year, ensuring more avocados year round. There's Hass, Sharwill, Yamagata, Malama, etc... They all have slightly different qualities to the fruit. \n\nAnyway. Far greater factor than seed size in \"wild\" avos is the texture and fat content. Most of them are simply shit. They are super watery (no fat), pithy/grainy, not good.",
            "title_similarity": "0.88863087"
        },
        {
            "id": "he1mzkr",
            "score": 5,
            "text": "There actually already exist avocados that don't have a stone at all. They're called \"cocktail avocados\". They're smaller than a Hass, and the skin is edible too. They are unpollinated, which is why there's no stone. They come from multiple cultivars, but especially Fuertes and Mexicola varieties. They're rare because to get a lot of them on a tree you have to prevent pollination.",
            "title_similarity": "0.7599487"
        },
        {
            "id": "he1ol6w",
            "score": 15,
            "text": "There are actually a lot of avacodo varieties that humans eat besides at the store. But they are all grafted and basically from what I understand were mostly found by chance from a seedling. There are a lot of other factors to consider like: how well the tree produces, what times of the year, the fruit size, fat content, how soft the skin is (thicker skin is better for shipping), cold and heat tolerance of the tree, etc. That's how we landed on Hass being the most popular, it kinda ticks all the boxes. I have a Brogden tree in my yard. Personally I think it tastes way better than Hass (also Hass won't produce much here as I live in central Florida, not the right climate). But it has thin skin and an even bigger pit than Hass does so wouldn't be good for selling in the grocery store.",
            "title_similarity": "0.8150954"
        },
        {
            "id": "he1ozxm",
            "score": 56,
            "text": "Honestly, we have.  Prehistoric avocados had even larger seeds relative to fruit size.\n\nThat said, as others have pointed out, they aren't easy to breed.  Most fruit trees aren't, but most fruit trees we have been breeding for millennia, where as avocado only became popular about a hundred years ago.",
            "title_similarity": "0.8471844"
        },
        {
            "id": "he1povz",
            "score": 4,
            "text": "Just to jump on all the comments about avocado varieties. There is one trait I've noticed people skip and that's how well they ship. Hass avocados ship well which is why they are ubiquitous. There are tons of local varieties but most ship like crap. There are many amazing local varieties and some are definitely better (imo). Creamier, richer, oiler but you'll never find them unless your local.",
            "title_similarity": "0.76779294"
        },
        {
            "id": "he1s0bx",
            "score": 2,
            "text": "There’s an easier method than selective breeding avocados. A biologist who worked for an avocado grower here in South Florida told a story about how they sourced wild variants of avocados and mangos.\n\nTraveling through Central America they’d hold competitions with a prize and ask villagers to bring in various avocados they had growing. Then the challenge was finding the tree that avocado came from and taking cuttings to then graft on to existing trees. When you’re in the native range of avocado trees you can get quite a bit of variety.\n\nMy own yard in South Florida had a couple dozen trees and those that grew up from one tree weren’t usually like the parent tree. I had one truly enormous variety that weighed close to 5lbs and was larger than a softball. When dealing with a fruit that large seed size is less relevant.",
            "title_similarity": "0.7188659"
        },
        {
            "id": "he1stmm",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.012443619"
        },
        {
            "id": "he1sxmd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.012443619"
        },
        {
            "id": "he22c6a",
            "score": 7,
            "text": "The answer is that we have. A real wild avocado pre domestication would have been like 90% seed, and nearly inedible. Long time to maturity and low chances of improvement from any 1 tree means it's a slow process getting a \"better\" avocado. The genetics basically make it a shotgun process, just plant hundreds of seeds, grow to maturity and see if any are good. Multiple seeds from the same crossing will get wildly different results, so when you do get a good one, you have to propagate by grafting.",
            "title_similarity": "0.809642"
        },
        {
            "id": "he231fi",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.012443619"
        },
        {
            "id": "he293ie",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.012443651"
        },
        {
            "id": "he2cwyq",
            "score": 27,
            "text": "The Avocados you eat are mostly of the Hass and Fuerte varieties.\n\nHass is a thick skin avo that goes dark when ripe. It is a smaller fruit with a bigger seed and it tastes pretty shit compared to some other cultivars. It does however ship and pack easily. Hass generally go to Europe. \n\nFuerte is a larger green fruit, with a thin skin and great \"meat\" to seed ratio. Fuerte tastes great but shipping and packing is a challenge because they bruise easily and ripen fast. These mostly go to America. \n\n The main focus when breeding new characteristics/varieties are mainly pest and diseases resistance, as chemical application on avos are heavily regulated if you are planning on exporting.\nThat being said, the seeds in your store bought avos are actually much smaller than older and lesser known cultivars like Ryan, Velvic or Edranol. This is because of selective breeding.\nThe good news is that seed will get smaller, as we are constantly improving characteristics. It just takes forever! Breeding a \"new\" cultivar can take 30 years + and many never reach commercial acceptance due to changing climate cycles and shifting market trends.\n\nAnyway, kind of forgot what I was getting at. Im a avocado and Macadamia nursery manager in South Africa. I love this shit. \nAsk me anything.",
            "title_similarity": "0.7747912"
        },
        {
            "id": "he2fqv9",
            "score": 12,
            "text": "We already did. Wild avocados prior to domestication had massive pits and only a small bit of flesh on the outside. They looked like [this](https://www.valerieorsoni.com/fr/wp-content/uploads/2018/11/Screen-Shot-2018-11-02-at-4.59.53-PM-600x493.png) and [this](https://rawfoodsos.files.wordpress.com/2010/01/avos11.jpg). Over the past 10,000 years they've changed significantly, but in mesoamerica they weren't a staple food and weren't bred as selectively as maize or other crops. They also didn't become major industrially produced crops until relatively recently.\n\nAlso, we already have pitless avocados. They're called cocktail avocados and they are small elongated fruits from unpollinated blossoms. You can read about it [here](https://www.naturesproduce.com/encyclopedia/cocktail-avocado/). They don't taste quite as good as regular avocados and they aren't commonly sold in stores because customers prefer normal looking avocados.  They are harvested from normal avocado trees, and I imagine they are sorted with the other unmarketable fruits to be used in other avocado products.",
            "title_similarity": "0.74937373"
        },
        {
            "id": "he2m0pa",
            "score": 1,
            "text": "I thought there were university labs at the Agro engineers/biology departments/spin outs specialised in genetic manipulation it would be no problem to sequence the genome of advocados, locate the genes responsible for the size of the nut and then with crispr technique to cut out the instructions for it to grow so big?",
            "title_similarity": "0.6265557"
        },
        {
            "id": "he2pf82",
            "score": 1,
            "text": "A huge problem is that avocados don't grow true to seed. So even if you have a perfect specimen and save/sprout/plant the pit, you aren't guaranteed to reproduce a desirable (i.e. tiny pit)/tasty fruit from it. Not only that, but to get to that point of disappointment from a seed/pit will probably take multiple years. It's just not a great or even guaranteed pay-off from seed. I believe most avocado trees are grown from grafts.",
            "title_similarity": "0.78967905"
        },
        {
            "id": "he2shl7",
            "score": 2,
            "text": "One thing people aren't talking about is we actually have seedless avocados through stenospermocarpy, a similar process that we use for seedless watermelon and grapes. \n\nWhen creatures with distant genes attempt to hybridize they generally cannot create viable offspring. Sometimes you can have an offspring but they are sterile (like in the horse-donkey hybrid mule). \n\nSeedless watermelon is a cross of two genetically separate melons that create abortive non-viable seeds. You can't grow seedless watermelon from seedless watermelon. \n\nThey use a process like this in the [Fuerte and Ettinger](https://www.google.com/url?sa=t&source=web&rct=j&url=http://avocadosource.com/Journals/ASHS/ASHS_1980_105_PG_341-346.pdf&ved=2ahUKEwji8aScu5fzAhXDT98KHbzPDr4QFnoECBMQAQ&usg=AOvVaw1LL5bo3Rqs5RxdOfI0zGj8) avocados. \n\nThe only problem is they are small like a little pickle. Most only growing to ~2 inches long.",
            "title_similarity": "0.80933046"
        },
        {
            "id": "he2stbr",
            "score": 1,
            "text": "There are other avocados with smaller pits, but they don't have the properties of the Haas.  You can pick a Haas, stick it in a big box with thousands of others, ship it 3000 miles, and have it ripen right when it hits the shelves.  Other avocados bruise easily, ripen quickly, or aren't as shipable/tasty. It's the same as banana.  Unless you live in the area where they grow them, you are stuck with one type.",
            "title_similarity": "0.83312136"
        },
        {
            "id": "he398va",
            "score": 2,
            "text": "[Here](https://deniseminger.com/2010/01/28/what-you-may-not-know-about-avocados/amp/) is a decent article about avocados. \n\nShort answer is that we definitely have cultivated them for more and better flesh. But in most cases not for the seed size. \n\nAnd honestly we don’t want to diminish the seed size too much or we’ll end up with something similar to bananas where we halted the biodiversity by cultivating the seeds out entirely.",
            "title_similarity": "0.7842199"
        },
        {
            "id": "he3np62",
            "score": 2,
            "text": "Not going to cover all of the things people have already pointed out but one thing that is interesting is we have bred them for smaller seeds already. We have found ancient avocados and the seed to flesh ratio was much worse.",
            "title_similarity": "0.8149955"
        },
        {
            "id": "he3o0xt",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.012443619"
        },
        {
            "id": "he3s31g",
            "score": 3,
            "text": "Getting an edible avocado from cross pollination is very rare, mostly they either don't fruit properly or the taste awful. So selective breeding for a smaller stone is really out of the question. All commercial fruit are from cuttings of established lines.",
            "title_similarity": "0.8021549"
        },
        {
            "id": "he3xvmu",
            "score": 3,
            "text": "All this talk of varying cultivars and breeding true-to-seed seems to miss something that I've observed: Sometimes when I buy Haas avocados from the supermarket I'll get one with a marble-sized seed rather than the usual golf-ball or larger seed.  Taste and texture are just fine.  What makes this difference, and is this something that can be isolated and exploited (i.e. find the shoot that made the small-seed avocado and clone it off)?",
            "title_similarity": "0.82420695"
        },
        {
            "id": "he41ner",
            "score": 6,
            "text": "Probably too late to this thread but take a look at Sir Prize avocados. Breeders are definitely trying to min/max seed/flesh in avocados. Sir Prize avocados claim to have the largest flesh to seed ratio for commercially available avocados. I have had the chance to try these multiple times the past year and they have become my favorite avocado. \n\nhttps://www.specialtyproduce.com/produce/Sir_Prize_Avocados_12030.php",
            "title_similarity": "0.7202107"
        },
        {
            "id": "he438x2",
            "score": 4,
            "text": "It's been done, but there are more commercially important traits to consider, cost to convert orchards to new varieties and plant breeders rights and legal issues licensing in different countries. \n\nhttps://www.semanticscholar.org/paper/Development-of-Seeded-and-Seedless-Avocado-Fruits-1-Blumenfeld-Gazit/5c8337e642c3fdfea89901384c9bcafbc21838a9\n\nhttps://www.today.com/today/amp/tdna119817",
            "title_similarity": "0.7153542"
        },
        {
            "id": "he51irj",
            "score": 1,
            "text": "We sort of have, by focusing on specific varieties, like HASS.\n\n  \nOthers:\n\n[http://www.avocadosource.com/slides/20040328/005009s.jpg](http://www.avocadosource.com/slides/20040328/005009s.jpg)\n\n&#x200B;\n\n[http://www.avocadosource.com/slides/20040328/005051s.jpg](http://www.avocadosource.com/slides/20040328/005051s.jpg)\n\n&#x200B;\n\n[http://www.eattheweeds.com/wp-content/uploads/2020/12/005092s-300x274.jpg](http://www.eattheweeds.com/wp-content/uploads/2020/12/005092s-300x274.jpg)",
            "title_similarity": "0.35831264"
        }
    ]
}