{
    "Why do healthy habits usually require a lot of will power? Why are unhealthy habits so addicting?\nWhat evolutionary reasons made humans so prone to making bad long term decisions?": [
        {
            "id": "hk37mib",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.17575522"
        },
        {
            "id": "hk38tc6",
            "score": 3,
            "text": "If a habit we easy like breathing, we would not label it as healthy even though we all agree it is required for good health. If a habit we're hard like eating glass we would not label it as unhealthy. The way we use the phrase a  healthy habit is basically defined as something that requires a little disciple.",
            "title_similarity": "0.7094722"
        },
        {
            "id": "hk2pg7v",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.17575522"
        },
        {
            "id": "hk339pa",
            "score": 1,
            "text": "I think it seems confusing because the cause and effect are switched. It’s not that unhealthy habits are addicting, it’s that addicting habits lead to unhealthy situations. \nEg. if eaten in sufficient quantities, even apples can be unhealthy. The difference is I can be satisfied with 1 -2 apples, but I want the entire bakery, once I have the first cake",
            "title_similarity": "0.66187334"
        },
        {
            "id": "hk3h2wm",
            "score": 1,
            "text": "For the first question, there are statistically more unhealthy things you can do than healthy things you can do. But most healthy habits require zero to little will power, like breathing, looking where you are going and chewing your food. We tend to notice the healthy habits we struggle with and dwell on those.\n\nFor the second question, well it’s a tautological question. Unhealthy habits are seen as addicting because they unhealthy. No one says I am addicted to breathing.\n\nFor the third question. We are prone to make short term decision because in the long run, we are all dead. To get to the long term, you first need to survive the short term. Most of the time, surviving the short term and long term go hand in hand so the decision is easy. But sometimes they don’t and that’s when it’s harder to make the long term healthy habit. Economists call this tendency to favour the short run a “positive time preference”",
            "title_similarity": "0.76871943"
        },
        {
            "id": "hk3ox24",
            "score": 1,
            "text": "I haven't the time to read all the posts so I'll wing it:\n\nUnhealthy habits have a higher level of instant gratification. Healthy habits require more energy, or changes in behavior (like moving, exercising, or giving up candy bars, cigarettes, etc. \\[which provide instant gratification\\]).",
            "title_similarity": "0.761993"
        },
        {
            "id": "hk3b6wz",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.17575522"
        },
        {
            "id": "hk3o8gn",
            "score": 4,
            "text": "Biologist here, and I think I may be able to shed some light on this for you.\n\nFrom an evolutionary standpoint, a lot of habits that are unhealthy in our current environment stem from what used to be important survival mechanisms. I'll use the biggest example to explain...\n\nWithout a doubt, the most pervasive and most damaging unhealthy habit in our society is overeating. To understand why it's so common, you have to understand that our ancestors evolved under dramatically different conditions than those under which we currently live. For the vast majority of our evolutionary history, food was scarce and starvation was as major cause of death. As a result, our brains evolved mechanisms that encouraged us to eat as much as we possibly can when food was available, because it could be days or even weeks before food would be available again and loading up our energy reserves was the only way to stave off starvation. We're also specifically programmed to target the most energy-rich foods we can find; this is why foods with lots of sugar and/or fat taste so good.\n\nIn the modern world, at least in developed nations, food is no longer scarce. In fact it's practically everywhere. Anyone who isn't living in total poverty has access to as much food as they want all the time, but those evolutionary mechanisms are still present so if you don't use rational thought to override that instinct telling you to eat everything in sight you're going to get very, very fat. And those mechanisms aren't going away any time soon, either, since things like heart disease and type 2 diabetes don't tend to strike until well after reproductive age and natural selection can only act on factors that contribute to differential reproductive success.",
            "title_similarity": "0.8140373"
        },
        {
            "id": "hk2vabc",
            "score": 5,
            "text": "Evolution \"designed\" the human animal to live in a resource diffuse environment by prioritizing satiation and efficiency. In that environment, laziness and overeating whenever possible would be healthy habits. We have used technology to generate a resource dense environment (for some at least). Those ingrained instincts are extremely difficult to overcome. Genetics is a factor in this. People who have a propensity to obesity would likely have an evolutionary advantage in a resource diffuse environment.",
            "title_similarity": "0.7667474"
        },
        {
            "id": "hk3mkwi",
            "score": 2,
            "text": "There are a lot of healthy habits that are easy to follow. I never walk on dangerous cliffsides, my diet does not include glass shards, I don't start a physical fight with every person I see, I don't leave the gas on after extuingishing the flame needed for cooking....\n\nIt's just a handful of habits where the short term value was so great that I harm some of my long term health.\n\nSalt is great in food. I like fatty foods. I don't always like telling the truth. And exercise can hurt like a mofo.",
            "title_similarity": "0.47113833"
        },
        {
            "id": "hk3tcer",
            "score": 1,
            "text": "I feel you will learn some ways to recognize and change your habits by reading Atomic Habits.\n\nThere's plenty books like this every decade and I guess this is the one that works for current generation.\n\nTry to recognize your good and bad habits. Understand how they impact your daily life and long term goals. Realize techniques to make bad ones less bad or just change entirely. \n\n\nThings like adding more friction to doing things you don't want and less friction into things you want.\n\nIf you want to start eating healthier. Use smaller proportions and remove junk food from house entirely. \n\nIf you want to workout, try to get your exercise clothes ready to go as soon as you wake up. You are more likely to have strong will power early in the day than later. You will have used a lot of energy throughout the day and can become more prone to being lazy.",
            "title_similarity": "0.6364256"
        },
        {
            "id": "hk4fiof",
            "score": 1,
            "text": "Because unhealthy habits are instinctual. The environment we currently live in is unnatural. Normally, when an animal finds food, it consumes as much as it can because finding food is hard. Doing things immediately traditional had better payoff than delaying.",
            "title_similarity": "0.76991177"
        },
        {
            "id": "hk2cpo0",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.17575522"
        },
        {
            "id": "hk3f8j4",
            "score": -3,
            "text": "Entropy, essentially.  It’s the reason why it’s easier to mess up a room than to clean it up.  There are limited paths toward increased order/health, and almost infinitely more toward decreased order/health.  So it’s not that the unhealthy paths are generally more addicting.  It’s that among all of the addicting paths for a particular person, by sheer probability alone, much much more of those paths will be unhealthy.",
            "title_similarity": "0.7796782"
        },
        {
            "id": "hk47mgt",
            "score": 0,
            "text": "Many unhealthy habits involving some sort of ingesting are usually laced with chemicals creating a habit forming dependency. \n\nUnhealthy habits like hygiene or cleanliness are laziness issues and I blame parents for that. \n\nGood habits only seem hard when laziness or chemical dependency is already in place.",
            "title_similarity": "0.81099856"
        },
        {
            "id": "hk4gt5p",
            "score": 0,
            "text": "I think any habit that you can get easily can become unhealthy quickly. That's what makes them unhealthy in the first place. Maybe I'm wrong though\n\nFor example, I think eating too much vegetables can quickly turn unhealthy. If it was easy to get it as a habit, people would complain about it as much as they complain about sugar and fat, making vegetable addiction unhealthy.",
            "title_similarity": "0.7962079"
        },
        {
            "id": "hk2iwa9",
            "score": 11,
            "text": "We evolved in conditions of scarcity (particulaly of salt sugar and fat) and not optional excercise (hunting, gathering, tool making, migration). And we created abundance. Or instincts want us to hoard salt fat and sugar, and minimize energy burn.",
            "title_similarity": "0.6272253"
        },
        {
            "id": "hk2rm1c",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17575522"
        },
        {
            "id": "hk39gpb",
            "score": 1,
            "text": "As far as unhealthy eating goes- that's easy. We're designed to survive in a world where food is scarce. Therefore we're engineered to seek out high calories foods- fatty and sweet foods tend to be high in calories, so we get the biggest taste reward from them.\n\nFood scarcity isn't a thing anymore, we've figured out how to refine foods that highlight taste and pleasure, and our body design hasn't caught on to that fact...therefore we're all fat :)",
            "title_similarity": "0.7404948"
        },
        {
            "id": "hk3lyve",
            "score": 1,
            "text": "Several people have explained delayed gratification, so I won't repeat them.\n\nCompanies do a lot of research into what works to make them more money. That's why sugary drinks are popular. Juice boxes are advertised as healthy so parents will still buy them. Chocolate and other candy are stocked at the registers so you grab one while waiting in line. Binge-watching and short-form video websites have become insanely popular because of the instant gratification and the algorithms to keep you there longer.\n\nIn an ironic twist, unhealthy habits for us are also instant profits/gratification for those companies. They don't have to think long-term about the health of consumers because by then a new generation is ready to give them time and money.",
            "title_similarity": "0.6426766"
        },
        {
            "id": "hk4ctju",
            "score": 1,
            "text": "Actually when you think about it healthy habits being hard and unhealthy habits being easy is the exception to the rule. We have no trouble remembering to breathe, or eat, or sleep when we need to, or wear warm clothes in the cold and take them off when it's hot, and we don't run around willy-nilly throwing ourselves into icy ponds or open flames or off cliffs. We're just usually so good at doing healthy things and not doing unhealthy things that the few times when either is hard are really noticeable.",
            "title_similarity": "0.50934434"
        },
        {
            "id": "hk4eoxo",
            "score": 1,
            "text": "Good habits are much easier to maintain if you actively set up your life to make failing hard. And if you are doing it right, it doesn't take willpower to succeed.\n\nA simple example: if you want to drink less beer, don't keep it in the house. Then when you're tired after a day's work and don't want go out, you won't go out to get beer.\n\nSince there's no beer at home, there's no willpower required to not drink the beer.\n\nIt does require making some right decisions and using some willpower, like when at the supermarket but it's easier and more sustainable than you think.\n\nThe hard part is getting through a high stress period with the successful habits in place rather than reverting back to the old habits.",
            "title_similarity": "0.59671396"
        },
        {
            "id": "hk4iqxq",
            "score": 1,
            "text": "*Evolutionary* speaking, our problem with food is not finding any, not that we have too much available. \n\n*Evolutionary* speaking, our minds need to push our bodies to go seek food (make us hungry, make us like food, make us remember and think about some really good food we found and ate to go do that again...). We just can't find sugar and cakes and hamburgers and coca cola, you know, according to evolution at least. That's not what has been available to humans. We eat some animals that we catch and cook, but we mostly eat roots and plants and berries and such. So our bodies are adapted to that. \n\n*Evolutionary* speaking, humans do not sit still. A human just waking up and sitting still for a full day is completely unheard of. We move because we have to, so our bodies try to avoid moving more than we need to, otherwise humans would just waste all their energy on running around for no use. \n\nBut our bodies work great, for the life they have been evolved. Our blood is full of molecules that are produced when we move and run and jump and climb, and other parts of our body (like our brain) uses those molecules for different purposes. Humans through history has not just sat still all day, because we just can't. \n\nSo here we are. Humans suddenly sit still all the time. We can eat any amount of food we want. Human bodies have never faced this situation before. \n\nMolecules and systems that has always just worked through evolution are just not there anymore. Our arteries clog up with plaques. Our bodies don't get enough muscle mass. Balance in our brains goes out the window and we become depressed. We only eat junk food because screw eating roots, that tastes boring and we have a *choice* not to eat roots. \n\nWe just weren't evolved for this at all.",
            "title_similarity": "0.6452267"
        },
        {
            "id": "hk5r83i",
            "score": -1,
            "text": "Unhealthy habits are only unhealthy because they easy to do. That and they feel really good. It's really that simple. Easy + feels good = overindulgence and addiction. The trick is to voluntarily accrue suffering in life and reject the temptation to actively search for pleasure. In that way, in a slow and brutal process, you greatly lower your your sensitivity to hardship in life and thusly reduce suffering. He who does this successfully is usually greatly rewarded with respect, money, power, attention from attractive people / high-status people, broader general opportunity in life...",
            "title_similarity": "0.6340883"
        },
        {
            "id": "hk5ydw5",
            "score": 1,
            "text": "If we explain it with traditional Freudian theory, your id, ego and superego are constantly at odds with one another. Your id controlling your natural impulses is also known as the pleasure principle — always searching and driving you to seek out more gratification regardless of the source. Your ego and superego on the other hand balances it out by imposing rational thought and rules.",
            "title_similarity": "0.7110684"
        },
        {
            "id": "hk6iqk9",
            "score": 1,
            "text": "For me personally, bad habits are just easier. It's hard to get up everyday at 7:30 and go to the gym at 8:30, it's much easier to just sleep in. It's hard to study and stay concentrated for 5 hours, it's easier to just play videogames. It's easy and fast to just fry food, it's less convenient to actually cook a healthy meal (generally speaking).\n\nThis is just my perspective though, convenience and immediate results over objectively better decisions but less convenient ones",
            "title_similarity": "0.54748404"
        },
        {
            "id": "hk6a2ba",
            "score": 6,
            "text": "The question presupposes a false dichotomy.\n\nThere's many good habits that are trivial to form (and we sometimes consider not having the habit a mental condition). Take for example, not jumping of a ledge when you get the intrusive though. We habitually ignore these thoughts with ease, as we should. We don't even think of this as a habit, until you stop doing so due to depression or a condition. Generally it's easy to recover the habit if the situation improves.\n\nSimilarly there's many bad habits that are extremely easy to lose under the right conditions (and not being able to get rid of such bad habit is sometimes seen as a mental condition). Take, for example the habit of eating dirt or other things that, while technically edible, are not what we'd consider food, like dirt, or chalk. Pica generally is seen as a problem, and we're not sure what causes it to happen, but it's generally a phase that resolves itself as the thing that triggered it (pregnancy, childhood, etc.) ends. It's an easy bad habit to throw away.\n\nWhile we could ask a better form of the question, why are some bad habits so hard to drop, and why are some good habits so hard to form and keep. Personally my (limited) observation is that a good chunk of them have a myriad of physical challenge (it comes down to genes, how the physical aspects of the brain work, etc.) and most of those will probably be about things being the logical and right solution for a context that was true for millions of years and only very recently it's stopped, and at this point it's baked into our genes (such as the ability to eat controlled portions). Similarly many others will be that people live in contexts where things that would be a bad habit in our life are a good habit in the other. Think of how the habit of making sure there isn't a speck of dust is great for the bedroom, but not as useful for a green garden.\n\nI think that our notion of this dichotomy comes from psychology investigating people behavior under one specific context, not understanding the context they came from. The answer we got was 80% right, but there were exceptions that lead to incorrect notions. Now we are revisiting and re-exploring these, as is normal in science.",
            "title_similarity": "0.6687691"
        },
        {
            "id": "hk2l84m",
            "score": 38,
            "text": "Many of the bad habits have roots in commercial enterprises that study human behavior and try to change it in order to maximize their gain:\n- social media wants you to waste your time reading or watching useless information in order to game your purchasing decisions.\n- Food and beverage companies want you to grow fatter so you consume large quantities of food. \n- credit card and financial companies want you to spend more so that you end up paying high interest or carry over balance. \n\nThere could be other Examples but the point being is we are being gamed. And these companies understand how entrap people to maximize their profits.",
            "title_similarity": "0.7700446"
        },
        {
            "id": "hk3m3wu",
            "score": 2,
            "text": "They're not, they're just habit. The difference is that you never try to correct your good habits. \nI'm sure if you look you'll find many good habits that you have that requires you no effort at all. Take someone who go out for a run every morning and ask him to instead stay in and smoke 3 cigarettes.",
            "title_similarity": "0.44362575"
        },
        {
            "id": "hk48nao",
            "score": 2,
            "text": "Why do mice get caught in traps? What evolutionary reasons made mice so prone to getting caught in traps? Isn't it evolutionarily favorable for mice to not get caught in traps? Yes, it is. However, the mice aren't the only entities that evolve. The traps also evolve, and they evolve to continue catching mice.\n\nExtending this analogy to humans—humans are vulnerable to getting stuck in lifestyle traps. Many of these lifestyle traps are perpetuated and propagated by other humans. For example, let's say you're addicted to drinking a liter of soda every day. The soda that you're addicted to was created by a soda company that poured millions of dollars into research & development and advertising so that they can get profits from you. As another example, let's say you're stuck in an abusive relationship. The abusive relationship that you're stuck in was created by a person who invested mental resources into figuring out how to manipulate you and convince you to stay so that they can get benefits from you.\n\nTo answer your question, healthy habits usually require a lot of willpower because it takes energy to escape the lifestyle traps of unhealthy habits, and unhealthy habits are so addicting because they constantly evolve to be addicting (natural selection of habits) and they are constantly being designed to be addicting (parasitism).",
            "title_similarity": "0.5859708"
        },
        {
            "id": "hk4pw3f",
            "score": 2,
            "text": "Our bodies need a balance of food, water, movement, rest, etc. “Healthy habits” are the things we (most of us) *notice* as “healthy habits” because we have no reason other than health to adopt those habits. Most people love resting and eating and don’t need a particular reason to do them. Most people find exercise hard and need a reason to do it (in this case health).\n\nSleep is a funny one because most of us love sleep but many of us also have reasons to avoid it, like being interested in a movie or video game, or just not feeling ready for tomorrow, so going to bed *on time* is a healthy habit, even though the feeling of being asleep is mostly easy and pleasant (although some people struggle with actually getting to sleep). In a less structured world staying up late wouldn’t be such an issue because we could sleep in to compensate.\n\nEven for the obvious easy things like resting and eating, there are people on the other end of the spectrum who struggle with those things. For people who suffer from an eating disorder or compulsive exercise behaviours the “healthy habit” might be eating more and reducing their exercise to more moderate levels, and those people can struggle just as much with that as another person might struggle with eating less and exercising more.",
            "title_similarity": "0.6114281"
        },
        {
            "id": "hk4rwco",
            "score": 2,
            "text": "Most of it’s psychology and dopamine really.  Sugar, drugs, and other unhealthy consumables trigger huge dopamine responses so we go back for more.  Working out can be painful, exhausting, and time consuming whereas we could use that time on social media getting more instant dopamine.  Junk food manufacturers have food scientists/engineers on hand to make sure the texture and taste of your food is addicting as possible so you’ll go back for more, making them more money.  It’s a bizarre world we live in",
            "title_similarity": "0.8144042"
        },
        {
            "id": "hk5jgb1",
            "score": 2,
            "text": "There isn't really a fundamental difference on a neuronal level between addictive behaviours and other behaviours we have all the time that giveus pleasure (think: reward neuron network), such as eating or having sex.\n\n Addiction is basically the neurons in ur brain that manage whether u find anything pleasurable going a bit overboard, and they start mixing up the reward itself (ie: food) and the behaviour that leads to the reward (placing food inside a dish), which leads to repeating that behaviour for the sake of itself and not caring about actually getting rewarded. In that sense, unhealthy habits can be addicting, not because they're unhealthy but because they are healthy in some other contexts.\n\nNow this doesn't explain why people will be addicted to say, gambling rather than drugs while having been exposed to both. There are some theories as to why people can become addicted in the first place (ie lacans concept of jouissance or its earlier version, freuds ideas of death drive nd repetition principle, do look that up if ure interested), but none of those that I know of are powerful enough to reliably predict if one given person will or not develop addictions. There are risk factors of course, but anyone who has worked with addict patients will be able to come up with a counterexample because real life situations are way too complex for those predictions to work\n\nAsfor why healthy habits can feel very hard to maintain, this also goes back to lacan and freuds concepts that I entioned above. Basically the human mind has a tendency to entropy because it always tries to go back to a state where everything is supplied by a caretaker. However we also have evolved in such a way that we have what Freud calls a fundamental life drive, which goes against this tendency to entropy.\n\nSo what our unconscious perpetually does is balance those two tendencies in a way that's not too costly and is adapted to the social context we live in. It does so by allocating an amount of energy to either of those (Freud calls that attention libido for other reasons that would be too long to elaborate on here). However, it cannot always do it perfectly due to other constraints from the environment we grow in. So the more unbalanced and skewed towards entropy your mind is, the more costly it will be on a conscious level tokeep healthy habits going, because u are struggling against ur unconscious functioning\n\ntldr we evolved in a weird balance between a drive to do bad things and a drive to do good things and sometimes one of them overpowers the other\n\nSorry if that wasn't clear, I wrote this at 3 am and English isn't my first language",
            "title_similarity": "0.656728"
        },
        {
            "id": "hk6g1j9",
            "score": 2,
            "text": "A lot of good answers here talk about the evolution aspect of why. \nI'll go on to say that mental health can play a large role along with developmental disorders such a ADHD and autism. \n\nIn terms of brain chemistry, you get a little reward in your brain be every time you do something like chores or healthy activities. \n\nWith depression and developmental disorders, the brain is physically wired differently, and as a result, you don't get that little hit of dopamine for doing the dishes or folding laundry, etc. There is no \"reward\" for following the healthy habits. So you tend to do things that do give you the dopamine, like eating junk food or doing a million hobbies. \n\nIt's much easier to follow bad habits now, because we have greater access to things that allow these.",
            "title_similarity": "0.7305113"
        },
        {
            "id": "hk5t4ik",
            "score": -3,
            "text": "I will give you an unpopular point of view. As a Christian, I believe in free will. As beings of free will, who we are is a product of choice.\n\nIt is easy to give in to what feels good. This is why addition is powerful.  \nIt is hard to turn away from pleasure. This is why living healthily is so hard.\n\nIf you want to turn away from a pleasurable addiction and replace that with a healthy habit, do it. Do you know what water fasting is? It's where you do not eat, only drinking water. I did this for 7 days, 12 hours and dropped 25 pounds. I put it back on quickly, but now I know why I struggle with my weight. I stress eat, and I eat out of boredom. Finding other ways to compensate with the stress of life, and finding other outlets to alleviate boredom will allow me to gradually lose weight for good. How did I not eat for 7 days, 12 hours? I just made the decision to do it, and I held myself to it no matter how hard it was.\n\nI hope my fasting story is helpful.",
            "title_similarity": "0.6145475"
        },
        {
            "id": "hk31j88",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.17575522"
        },
        {
            "id": "hk6f0c1",
            "score": 3,
            "text": "actually, it’s not like that.  \nthere are addicting healthy habits, there are difficult healthy habits, there are addicting unhealthy habits and difficult unhealthy habits.  \nIt’s just, you don’t even think about addicting healthy habits and difficult unhealthy habits at all, because that solves automatically. Like eating regularly is pretty healthy habit, most people manages to get it right. Or sleeping every night. Unhealthy habit like not standing up from the couch for a whole day would take a lot of practice, but why would anybody do that?  \nThere could be millions of other examples, but you just don’t do difficult unhealthy habits and automatically do healthy habits that are addictive. So you just focus on those going wrong way.",
            "title_similarity": "0.6729061"
        },
        {
            "id": "hk317wp",
            "score": 7,
            "text": "a big part of healthy habits are access to quality and affordable foods. most of what is available at a local level--convenience stores, fast food--do not have any healthy foods. you affect a community's food source, it reverberates throughout the city.",
            "title_similarity": "0.6147033"
        },
        {
            "id": "hk3i6v6",
            "score": 118,
            "text": "Let’s say that there are 4 types of habit:\n\nAddictive Healthy Habits - AHH\n\nChallenging Healthy Habits - CHH\n\nAddictive Unhealthy Habits - AUH\n\nChallenging Unhealthy Habits - CUH\n\nNo one talking about CUH. Why would they? No one talks about how hard it is to develop the habit of consistently swabbing your eyes with MRSA every morning. \n\nNo one talks about how difficult it is to poop in the toilet rather then in your pants (an AHH). Why would they? Every exception to this habit is deemed a medical condition. That’s how ubiquitous and easy this habit is. If you don’t do it correctly every single time, it’s because something is medically wrong. \n\nSo all that’s left are the kind of habits that people struggle with or write books about.",
            "title_similarity": "0.54850096"
        },
        {
            "id": "hk2lf1l",
            "score": 72,
            "text": "By 'healthy habits' I assume you mean stuff like eating healthy. For most of human history humans have experienced famines and so we are designed to find sugar and fat (which would normally be scarce in nature) delicious, because it's high in calories. We have not had enough time to evolve and change our taste, and so it requires willpower to resist these tasty foods and instead eat foods which are less calorie dense but better for us.\n\nThe same with conserving energy, we are designed to save energy and so not exercise if we don't need to, so we tend to be couch potatoes and become fat, because our bodies want to store energy ready for a famine or hard work in the future, but in modern society that never happens, so people get fat.",
            "title_similarity": "0.75153863"
        },
        {
            "id": "hk2wm7j",
            "score": 90,
            "text": "[removed]",
            "title_similarity": "0.17575522"
        },
        {
            "id": "hk2rkdp",
            "score": 14,
            "text": "While many answers address the root causes of what makes them addictive, they don't always deal with what makes them unhealthy. Which is typically little more than overindulgence. Exercising might be \"healthy\" but if it were addictive and you engaged in it to excess it would quickly become unhealthy as you caused significant wear and damage to your body, ran the risk of dehydration, etc.",
            "title_similarity": "0.8168143"
        },
        {
            "id": "hk2dp8z",
            "score": 691,
            "text": "There are plenty of healthy habits that are easy and addictive, they're just so common they're near enough unnoticeable a lot of the time.\n\nEating enough food throughout the day, getting regular sleep, getting out of bed every morning, putting warm clothes on when it's cold, taking layers off when it's hot etc.",
            "title_similarity": "0.44989663"
        },
        {
            "id": "hk2ckvx",
            "score": 3357,
            "text": "Healthy habits are often connected to delayed gratification: The ability to resist a temptation now in order to have a more valuable reward later. E.g. don't eat that chocolate now to be more healthy in a few months. You've also probably heard about the famous \"marshmallow experiment\"\n\nAnd that's incredible difficult to attain. It's much more easier to use regulation strategies than pure willpower- e.g. don't have access to the chocolate, don't look at it and try to distract yourself instead. \n\nFrom an evolutionary perspective, while delay gratification is a very important skill to have now, that wasn't the case thousands of years ago. E.g. you have a fruit that's not yet ripe. You could wait a bit so it has more calories later - but also risk another animal coming along and stealing it. \n\nThere was a study a few years back that showed that children who grow up in very dangerous and stressful situations show a diminished delayed gratification. Why? If you can't be sure that your reward is still there in a few hours you won't risk waiting for it.",
            "title_similarity": "0.71652794"
        },
        {
            "id": "hk3slaq",
            "score": 348,
            "text": "There's also a certain amount of [negativity bias](https://en.wikipedia.org/wiki/Negativity_bias) here. There are plenty of excellent decisions that are extremely easy to make because we are evolved to make them that way.\n\nThe habits of not touching fire, not eating rotten food, and not jumping off cliffs have served us pretty well for the most part. These decisions certainly have excellent long-term outcomes compared to the alternatives. But most people do these things automatically without having to really think about the complex evolutionary pathways that are designed to encourage these behaviors.\n\nEvolution gets a bad rap sometimes, but it still does a reasonably good job of keeping us alive (long enough to mate and reproduce, at least).",
            "title_similarity": "0.6171359"
        },
        {
            "id": "hk2bnbe",
            "score": 5228,
            "text": "[removed]",
            "title_similarity": "0.17575522"
        },
        {
            "id": "hk3rsuw",
            "score": 1349,
            "text": "1) For most of our evolutionary history making a good short-term decision *was* a good long-term decision, because the good short-term decision was necessary for survival. The ability to think in terms of a ten year life plan is a modern luxury.\n\n2) Most \"healthy\" habits are things our ancestors would have *had* to do, so there was no reason for our brain to provide a chemical reward to encourage us to do them. For hunter gatherers exercise is an inevitable part of life. When sugar and fat were scarce but leafy green vegetables were plentiful, we didn't need an extra motivation to eat our greens. The options not to exercise and not to eat fiber are very recent.\n\n3) Most \"unhealthy\" habits used to be healthy ones. For most of human history putting on some excess weight was an excellent choice for your long-term health - it gave you a buffer for when food inevitably ran short. Calorie-dense foods were so rare and difficult to acquire, and provided such an evolutionary advantage, that our brains provide a chemical reward to encourage us to continue seeking them out despite the amount of work it takes. The urge to rest protected our ancestors from overexerting themselves. \n\nIn short, humans are very well adapted to a different environment from the one we live in now.",
            "title_similarity": "0.6024323"
        },
        {
            "id": "hk3yt16",
            "score": 6,
            "text": "It's not the habit that is the problem, it's the way you view the habit that is the problem. The truth is that anything that gives you pleasure has the potential to be addictive. \n\nWhen it comes to good habits, a lot of us view them as 'necessary evils' especially when we are using those good habits to correct the bad habits that we found enjoyable. The key to this is to try and associate our good habits with good things. Focus on the benefits you gain by doing  them and don't look at your bad habits as a loss. Rather rejoice in the  fact that you are becoming aa good person by forming good habits.",
            "title_similarity": "0.7109542"
        },
        {
            "id": "hk45pdk",
            "score": 1,
            "text": "I feel like the area this paradigm holds most true is in food - sugary fatty foods are delicious and people by and large struggle to restrict the consumption of these foods, even though an excess is so blatantly harmful.\n\nThe answer is, in nature sugar and fat are scarce. If we were not naturally predisposed to get as much sugar and fat in us as we possibly could, we wouldn't get enough and we'd die. It's beneficial, pre-farming, for us to want to absolutely gorge on a source of sugary and/or fatty food when it's available because its possible that we'd be surviving on grains and leaves for the next three weeks with very little nutritional value.\n\nIn modern society there is an enormous excess of fatty sugary foods but our body hasn't caught up with our lifestyles because evolution takes much longer than a few thousand years to adapt, so our bodies and brains are still trying to cram us as full as possible with such rich foods, and our bodies are extremely efficient at extracting the energy from it.\n\nAddiction in a wider sense is a runaway-overaction of reward circuits in our brains designed to reward behaviours that make survival more likely and discourage behaviours that are dangerous. The disconnect comes from the fact that our environment in modern society is so far removed from the environment we evolved in that the triggers that stimulate these reward circuits simply aren't present, and so our brains fill in the gaps with other behaviours.\n\nIn fact many psychological issues that plague modern humans can be at least in part attributed to the massive differences between what our brains and bodies evolved to deal with, and what our brains and bodies actually experience in the modern world.",
            "title_similarity": "0.8025584"
        },
        {
            "id": "hk469l2",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.17575522"
        },
        {
            "id": "hk48pbh",
            "score": 1,
            "text": "A lot of the time unhealthy habits are hard to stop and can feel addicting because we make them very interesting. We make it something you are not supposed to do or have; we deny ourselves certain foods which leads to craving that food and feeling out of control around that food. And we ascribe certain traits to (un)healthy habits, for instance if you don't drink alcohol some people mau call you not fun and a party pooper, if you eat vegan some people may call you a treehugger. Etc",
            "title_similarity": "0.7550243"
        },
        {
            "id": "hk4bj07",
            "score": 4,
            "text": "Our bodies are hardwired to survive in conditions of hardship and a lack of energy. Before candy stores and fast food joints, there was no evolutionary incentive to discourage consumption and rest, because too little food and too much physical activity was the limiting factor. In addition, unprocessed and wild food is less energy dense and more rich in fibre, so even when there was food abundance the stomach got full before one over-ate. \n\nSo we've basically changed the context faster than our bodies can evolve and adapt.",
            "title_similarity": "0.6818323"
        },
        {
            "id": "hk4rxum",
            "score": 1,
            "text": "We are impatient creatures.  Healthy habits take a long time and dedication like cleaning, cooking.  Bad habits are quick like smoking, buying food instead of making it. Perfect for impatient people.\n\nWe are creatures of pleasure. Like dogs, pleasure motivates us what to do.  Bad habits can give you pleasure quickly.",
            "title_similarity": "0.7143706"
        },
        {
            "id": "hk4s24j",
            "score": 1,
            "text": "Dopamine has a lot to do with this. We have developed an environment with constant access to sources of dopamine, whereas our ancestors evolved in very different circumstances. If you’re interested in this I recommend the book Dopamine nation, a fascinating read.",
            "title_similarity": "0.6747955"
        },
        {
            "id": "hk4sdq1",
            "score": 1,
            "text": "Selection bias. People do unpleasant healthy things because they're healthy. People do pleasant unhealthy things because they're pleasant. No one needs to be convinced to do pleasant healthy things. No one can be convinced to do unpleasant unhealthy things. \n\n\nPeople only have unhealthy habits *because* they're addictive, so that are the only unhealthy habits we think about.",
            "title_similarity": "0.66734624"
        },
        {
            "id": "hk4tn11",
            "score": 1,
            "text": "Most healthy habits don't require will-power, it's just that we don't think about them because of how easy they are. Let's take sleep as an example, it's not something we have to force ourselves to do, despite being a very healthy habit. \n\nAlmost all unhealthy habits are variants of things that were previously hard to do/come by, but that we now have more access to. For example overeating, our ancestors often starved to death, and so it almost never made sense not to eat as much as you could. Our bodies haven't adapted to having practically unlimited amounts of food. \n\nAlso, many unhealthy habits only really start killing you once you're old, and dying at 40 really isn't any worse than dying at 80 from an evolutionary perspective, so there isn't a big incentive for mother nature to fight obesity.",
            "title_similarity": "0.6055458"
        },
        {
            "id": "hk4w31l",
            "score": 1,
            "text": "Because, humans are lazy, and love instant gratification. Most of us don’t keep a voice of positive affirmation in our head. Once we see results, that’s when healthy habits become a lifestyle. Like, how quitting smoking is tough the first week. Our small steps are what give us big payouts, physically and mentally.",
            "title_similarity": "0.6363864"
        },
        {
            "id": "hk52rrt",
            "score": 1,
            "text": "It's a great question, but just for a perspective shift, think about how many healthy habits we have that are easy! \n\n- breathing regularly\n\n- drinking water when you're thirsty\n\n- constructing new skin cells to replace old ones (not really a habit if the brain is not involved, but still a small miracle)\n\nEtc. It's kind of awesome our sacks of flesh stay alive as long as they do, considering all it takes that we don't even think about on a daily basis.",
            "title_similarity": "0.5596972"
        },
        {
            "id": "hk55wcm",
            "score": 26,
            "text": "Basically a lot of habits considered “bad” in modern times used to serve evolutionary purposes in the past. Bad food habits? You’re wired to crave sugar, carbs, fatty foods- our ancestors mostly had limited access to food and so your body is wired to _want_ to eat the fattiest food to prepare for scarce months. The desire to be a couch potato? Bad habits with not exercising enough? Once again, while your body needs adequate exercise to be healthy, you’re also wired to preserve energy whenever possible. The problem is that it’s now possible to barely exercise at all. \n\nDrugs? Shopping? Other addictions? It creates pleasure responses in the brain, making us increasingly crave that high. \n\nA lot of modern “good” habits deal with delayed gratification. Your brain is very focused on the now and the present- in a time when your life was short, you seized whatever you could. \n\nOur brains are relatively the same brains ancient humans had thousands of years ago. Our environments have changed so rapidly but we haven’t, and now we’re seeing the consequences. \n\nAlso, I’ve seen some people mention the marshmallow experiment. That has been debunked.",
            "title_similarity": "0.76617897"
        },
        {
            "id": "hk592qb",
            "score": 1,
            "text": "Usually it comes from a lack of understanding what you are putting in your body. Healthy habits are easier to maintain than you would think. The reason you want junk food or soda is because of the unhealthy way your mind works. Train your mind and your willpower or willingness will have nothing to do with it. It will just make sense to you.",
            "title_similarity": "0.73272705"
        },
        {
            "id": "hk5anel",
            "score": 1,
            "text": "Dopamine. Usually the less healthy things are more fun and fun things release more dopamine. \n\nYour brain wants to do the things that release more dopamine first so to do the less fun things you have to be more disciplined",
            "title_similarity": "0.71428823"
        },
        {
            "id": "hk5dpvm",
            "score": 1,
            "text": "Biology innately encourages death  to stop the planet from expiring. If we don't kill ourselves the forces of nature will find a way. Virus, natural disaster or disillusionment driven mental disorder will naturally drive us to death at a rate that maintains the greater picture. As things get worse all these things slowly over time come together forcing all biological entities into compliance. Resistance is nigh.",
            "title_similarity": "0.65161884"
        },
        {
            "id": "hk5fvc6",
            "score": 1,
            "text": "A lot of unhealthy habits trigger the same reward center of our brain as sex, which is a fundamental necessity for the survival of our species (or any species, really). Addictions are basically hijacking our survival mechanism, and we're developing addictive substances much faster than we can evolve to select against the addictions. Meanwhile, some healthy habits have only become necessary due to very recent, rapid advances, and we haven't had time to catch up, evolutionarily speaking.",
            "title_similarity": "0.8475827"
        },
        {
            "id": "hk5km9u",
            "score": 1,
            "text": "Healthy habits can be addicting if the rewards is associated more immediate. For example if you masturbate or eat your favorite meal after studying. You will over start associating studying with a good moment afterward.",
            "title_similarity": "0.64720535"
        },
        {
            "id": "hk5o1de",
            "score": 1,
            "text": "Unhealthy habits usually give instant gratification, while healthy habits can be painful and grueling with positive effects only in the long run. In addition, certain bad habits are mostly formed because they provide us with a sense of comfort. Comfort is a extremely unhealthy, as it discourages us to change and grow.",
            "title_similarity": "0.7923125"
        },
        {
            "id": "hk5sdn8",
            "score": 1,
            "text": "One person chooses a easy/lazy/unhealthy way and settles for not wanting better, and it’s like who they surround themselves with follow suit. “Get in where you fit in.” Surround yourself with good people with healthy habits and your motivation to do so should surely increase little by little! I know seeing success for me boosts my motivation! Good luck for everyone out there battling the negative things in life and wanting better!!!",
            "title_similarity": "0.6015913"
        },
        {
            "id": "hk5u5w0",
            "score": 1,
            "text": "For most of human evolution we lived in scarcity. We had to do a lot of work manually and we walked everywhere. We evolved to seek pleasure, avoid pain, and conserve energy. Calories were hard to come by. Fat and sugar were not easy to come by. So to our brain, sitting on the couch watching TV and eating chips and ice cream is the height of evolutionary success.\n\nAdditionally, many addictive substances trigger the pleasure neurotransmitters like dopamine and serotonin. \n\nWe simply evolved in a very different world than the one we live in and evolution hasn’t had time to catch up.",
            "title_similarity": "0.69927394"
        },
        {
            "id": "hk5xj8e",
            "score": 1,
            "text": "I think this is but another case of survivorship bias\n\nGood habits that can be achieved easily are already automatically done on a daily basis (breathing, drinking water)\n\nBad habits that take a lot of willpower will not even be considered is in most cases (e.g. self-harm)\n\nAnd so we only notice the rest",
            "title_similarity": "0.60241556"
        },
        {
            "id": "hk5xnl0",
            "score": 1,
            "text": "Because of how dopamine works. Dopamine is the reward hormone that makes you feel good. Addictive habits give you a bunch of dopamine quickly. Healthy habits might not give you dopamine at all, or it might be something that gives you dopamine relatively slow compared to addictive habits.",
            "title_similarity": "0.7174332"
        },
        {
            "id": "hk5xxdh",
            "score": 4,
            "text": "\"Healthy\" habits are really referencing homeostasis or having a particular state that is best for maintaining life. This means that there is actually a lot of ambiguity about what is healthy for each individual. Also our mental health has its own type of homeostasis and when not in balance our brains develop defense mechanisms to help maintain homeostasis for our mind even if at the cost of some \"healthy\" habits. \nOvereating is a common example to handle stress. Our brain tries to protect us from the mental homeostasis burden by rewarding us with food. There could be many evolutionary reasons for this but essentially that food helps us defend our minds at that time even if having \"health\" consequences later on.",
            "title_similarity": "0.7912191"
        },
        {
            "id": "hk62m4j",
            "score": 1,
            "text": "Habits are conditioned by immediate rewards. Unhealthy habits tend to be immediately self-reinforcing. The unhealthy thing IS the reward. And indulging in it is the habit. Healthy habits mostly pay off later, therefore there is no short term reward to reinforce the behavior and turn it into a habit.",
            "title_similarity": "0.65748256"
        },
        {
            "id": "hk63yva",
            "score": 1,
            "text": "doing something a lot makes everything unhealthy. you can die from drinking too much water too. it's just that we don't bother worrying about addiction to positive things like collectibles or work or coffee. some substance are highly addictive and it's unnatural. like a poppy plant isnt addictive by itself, you have to refine it into opium. so we never evolved to deal with these things. i bet if a highly addicted substance like opium grew on a tree, humans would've evolved to avoid it because those who got addicted couldnt pass on their genes.",
            "title_similarity": "0.6370792"
        },
        {
            "id": "hk66lf1",
            "score": 1,
            "text": "I don't know about evolutionary. But you may want to look into a concept called delayed gratification. Children that can delay gratification tend to be better long term planners versus those that can't resist instant gratification (prone to addictions). Maybe also the neurological reward system and dopamine. I suggest the book Mindwise as well, it's written by Nicholas Epley, a professor of neuroscience at the University of Chicago. I think it will help you understand yourself and others better.\n\nCheers.",
            "title_similarity": "0.6872721"
        },
        {
            "id": "hk67y0a",
            "score": 1,
            "text": "That \"ping\" of dopamine in the reward center right now feels so much better than thinking of the future. Yaa, one is reasonable, but it's not pleasurable in the same way. Things that don't create that \"ping\" aren't addictive. There are ways to work around making boring acts less boring, think of all the awesome things you *could* buy if you save the money instead of spending it right now f.ex.\n\nBut modern life is drastically different from the way humans lived for the last million years or two. In places where the unhealthy habits become a problem you usually have an overabundance of temptations. Engineered to be as tempting and reward-center-activating as possible simply to make money.   \nDevouring sweet or fatty things as they became available used to be a benefit, eat it while it's there or it will be gone. If babies didn't evoke a solid wave of pleasurable hormones we'd probably eat our young or abandon them after the third night without sleep. That desire to seek out pleasurable things isn't a defect, it's actually a way to secure our survival. Sugar isn't sweet and tastes good because of that. Sugar is an easy to digest source of energy that should be used to sustain life, so creatures evolved to seek it out. Seek it out by instinct because it's pleasurable.   \nOur modern life is the problem, making these things all too easy and common to obtain. The intensity and density of the pleasurable moments is way beyond anything humans used to experience. It's really hard to work against ages of beneficial instincts with willpower and the ability to calculate future outcomes. They're just not fun.",
            "title_similarity": "0.7597421"
        },
        {
            "id": "hk69mls",
            "score": 6,
            "text": "Because up the last 100 years or so, nearly all humans were always on the brink of starvation.  Getting enough to eat was difficult, getting enough fat or sugar was almost impossible...so the need was put in to seek these things out as a mandate.\n\nThe rich were fat because they could afford it.  Being pale meant that you didn't have to work outside.\n\nFast forward: we live in an abundance of food where the poor are now obese because sugar and fat are easy to scale up with industrial methods.\n\nNow the rich are thin (or have muscles) and tan, because that requires a lot of non-monetary effort and money.",
            "title_similarity": "0.65415955"
        },
        {
            "id": "hk6epze",
            "score": 1,
            "text": "Because healthy habits often have long lasting benefits, while unhealthy habits tend to have more immediate benefits with a later drawback.\n\nWe're wired to think about the immediate more clearly than the future, so the immediate benefit seems to outweigh the long term drawback even though in reality it does not.",
            "title_similarity": "0.7135415"
        },
        {
            "id": "hk6ghdr",
            "score": 1,
            "text": "It seems to me that unhealthy habits are the ones that require least effort. For instance, it’s healthy to exercise, but exercising is uncomfortable (assuming you’re increasing the resistance in your training ). On the other hand, sitting on the coach is absolutely pain free and easy to do.",
            "title_similarity": "0.6068203"
        }
    ]
}