{
    "Is it true that you get older quickly if you've been under intense stress for a period of time?\n": [
        {
            "id": "hlf6pa1",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlepo0d",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlh5l8a",
            "score": 4,
            "text": "I just graduated with my bachelor's in psychology last year. I know that doesn't make me an expert but just so you know where I'm coming from and where I'm getting my info. Being under intense stress for a period of time will have an affect on you but it also depends on how you handle the stress. The power of positivity might sound like hokum but it really does work. I remember watching a TEDtalk about research that was done regarding this.",
            "title_similarity": "0.42881608"
        },
        {
            "id": "hlf3osi",
            "score": 27,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlhe57k",
            "score": 20,
            "text": "I'm fairly sure it does. Pick a president, any president. In particular, let's look at Obama when he first entered office there wasn't a gray hair on his head. And then by the fourth year of his term he was almost fully gray and had lines on his face that were not there before. Being the president of the United States is probably the most stressful job in America. So stress-induced aging is probably what happened to Obama and basically every other president who ever existed.\n\nI myself am a good example. At the start of quarantine I was 27 years old but I look like I was 15. No wrinkles anywhere, radiant healthy skin, not a single gray hair to be seen.\n\nFast forward 2 years and there are dark circles under my eyes that were not there before. My eyes and cheeks look sunken in. There are little elevens between my eyebrows and lines around my mouth. And I have more gray hair than my almost 70 year old mother. And I can't stop losing weight",
            "title_similarity": "0.44225997"
        },
        {
            "id": "hlhfvij",
            "score": 1,
            "text": "My 100% non-scientific study says yes.\n\nE.g. any decent competent US president that actually highly cares about what they're doing (it's a job with immense responsibility, and generally with that great stress - at least for those that take it quite responsibly and seriously), well, generally in about 4 years in office they will have aged about 10 years - just look, e.g., at before and after pictures from those only 4 years apart.",
            "title_similarity": "0.44564164"
        },
        {
            "id": "hlero7w",
            "score": 58,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hleqb4s",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlhu1fb",
            "score": 27,
            "text": "Based off solely my time in the Marines, I would say a big yes. It is so common place to have a gunnery sgt who is 35 years old and they have full head of gray hair and look older than my 65 year old dad. \n\nThe general statement that every year in the Marines will put 7 years of stress on your body seems to be accurate. Other comments have been far more scientific, but yeah I have seen and experienced stress aging for sure.",
            "title_similarity": "0.4514988"
        },
        {
            "id": "hlfvh8m",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlhhuy8",
            "score": 58,
            "text": "I know a guy who owns a bakery where he is also head baker. He normally works 10 to 16 hours shifts with almost no breaks, drinking up to 12 cups of coffee a day. He only takes a day off when the bakery is closed and he spends the day off doing errands for the bakery (for example accounting). During the summer season the bakery doesn't close, so he normally works 90 days straight (mid June to mid September). He's been doing that for about 10 years, he is 45 years old and totally looks 75.",
            "title_similarity": "0.29552913"
        },
        {
            "id": "hlf4efi",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlevnyy",
            "score": -45,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlft6tf",
            "score": 52,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlhswh3",
            "score": 19,
            "text": "The responses here (that yes it does cause physical aging) prompt two further questions:\n\nIs the aging internal as well as external (aka, does organ health, skeletal and muscle condition, etc deteriorate as fast as the cosmetic aspects of aging like skin and hair)?\n\nAlso, what does this tell us about mental health and it’s impact on physical health? Do things like emotional disregulation and anxiety impact lifespan (when suicide, drug use etc are controlled for)?",
            "title_similarity": "0.6126592"
        },
        {
            "id": "hlf56jy",
            "score": 29,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlehmpt",
            "score": 149,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlej6v4",
            "score": 1587,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlhhpeo",
            "score": 45,
            "text": "It is true. For people who have lived exceptionally long lives, at least 100 years or more, one constant that they say is, that they don't allow themselves to be stressed out, to not let the little things bother them, to do all things in moderation, and to think good thoughts. It is also believed that people who live in remote places, where there's limited and predictable human interaction, live longer than people who live in crowded locales like New York or London.",
            "title_similarity": "0.58514804"
        },
        {
            "id": "hlh3toj",
            "score": 49,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlfc6ec",
            "score": 726,
            "text": "[removed]",
            "title_similarity": "0.28592527"
        },
        {
            "id": "hlfmzjd",
            "score": 2698,
            "text": "There was a groundbreaking study out of [UMichigan](https://pubmed.ncbi.nlm.nih.gov/31230727/) in 2019 that showed newly minted physicians who just started their specialty training (residency) will have their DNA age six times faster than the normal population. \n\n\nThe telomeres at the end of DNA— which are sort of like aglets at the end of a shoelace—shrink 6 times faster when newly minted doctors are introduced to the new stress of training (long work hours 80-120hrs/week, little sleep, life and death situation etc). \n\n\nTelomere shortening is a well-known hallmark of both cellular senescence and organismal aging. [Telomere length](https://pubmed.ncbi.nlm.nih.gov/25612739/) is thus considered one of the most consequential biomarkers of chronological ageing, it’s maximum at birth and progressively decreases with age.  \n\n\nAnd it is irreversible.",
            "title_similarity": "0.48850304"
        },
        {
            "id": "hlfq5gn",
            "score": 325,
            "text": "The ACE (adverse childhood events) study showed a dose/response relationship between early stressful events (eg parental divorce) and reduced life expectancy. Lots of info online about it. The hypothesis is that these events cause a higher persistent baseline stress level which inevitably takes its toll.",
            "title_similarity": "0.65419"
        },
        {
            "id": "hlgrlz9",
            "score": 427,
            "text": "Stress can literally kill you. But it depends on how much stress and for how long. This is a National Geographic documentary on a study that's an incredible eye opener. It's fairly old, so the style is old fashioned, but in my opinion everyone should learn this.  \n\nhttps://youtu.be/eYG0ZuTv5rs",
            "title_similarity": "0.56868565"
        },
        {
            "id": "hlgz7hy",
            "score": 41,
            "text": "This article, [Physician-Training Stress and Accelerated Cellular Aging](https://pubmed.ncbi.nlm.nih.gov/31230727/), concluded that new doctors had telomere shortening and aging at a faster rate, and it was related to stress, physical training, and workload.",
            "title_similarity": "0.58299166"
        }
    ]
}