{
    "Could I, as a speaker of early 21st century Modern English, be capable of communicating with a speaker of 14-15th century Middle English?\n": [
        {
            "id": "ho4puaw",
            "score": 18,
            "text": "Chaucer and Shakespeare are about 150 years apart or so, and don't even use the same alphabet. \n\nmeanwhile we can read Samuel Clemens un-adulterated. \n\neven so, our spoken slang is evolving really fast. we're losing context from the boomer's parents. \n\nwe'd probably have enough in common to function, but fluent understanding wouldn't exist, the bridge would be gapped in rudimentary gesture and expression.",
            "title_similarity": "0.4975131"
        },
        {
            "id": "ho4su3h",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.19614327"
        },
        {
            "id": "ho4z9wu",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.19614327"
        },
        {
            "id": "ho5n89t",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.19614327"
        },
        {
            "id": "ho501vx",
            "score": 15,
            "text": "May I recommend if you wan to deep dive into the reality.  The History of English.    Hours and hours of deep talk of how messed up English is.\n\nYou can understand someone back to about 1200 but the further back the harder and harder it will get  .  It's not always the sound of the words... its the change of what words mean or the word not being used yet.",
            "title_similarity": "0.36979884"
        },
        {
            "id": "ho6t6rn",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.19614327"
        },
        {
            "id": "ho4zvis",
            "score": 23,
            "text": "Read Chaucer's Canterbury Tales. If you can understand it, then yes. Otherwise, no. \n\nAnd, they probably could not understand most of what you say.  Your frame of reference, and all the different things you know, would make little to no sense to them.",
            "title_similarity": "0.345618"
        },
        {
            "id": "ho82d2f",
            "score": 3,
            "text": "The Appalachian \"Mountain Talk\" is supposed to be the most historically accurate record of 16th-17th century ~~English~~ (edit: Scots-Irish). The reason is that they were so isolated from the modern progression of American English. [Here is an hour long documentary about that](https://www.youtube.com/watch?v=iHIJfbYhQFg). I don't normally post links to hour long documentaries, but this one is well worth watching for nothing else than the amazing accents that have been forgotten with time.\n\nEdit 2: The Ocracoke Island is [the US island that speaks Elizabethan English](https://www.bbc.com/travel/article/20190623-the-us-island-that-speaks-elizabethan-english). **[Here is a video that highlights the accent](https://www.youtube.com/watch?v=8Uuzr_gl4Oo).**",
            "title_similarity": "0.42183173"
        },
        {
            "id": "ho5byj8",
            "score": 4,
            "text": "There’s a lot of scholarly information on here, which I think is great. But on a more practical level, I would use this as an example: I just got back from Athens, Greece. I do not speak Greek, and a lot of the people there don’t speak English. However, I got around just fine, even when I was interacting with someone who didn’t speak English, because I was able to point at things, I was able to mimic the action of whatever I wanted to do, and so on. Eventually you would figure it out, and you probably recognize a lot of the language, so it would be a little easier than what I went through.",
            "title_similarity": "0.34971744"
        },
        {
            "id": "ho5viem",
            "score": 29,
            "text": "Nope, not immediately. Unless you are a very astute doctor of English, your language would have to be corrupted enough to communicate with everyone, and refined enough to talk to scholars in their current language.  The learned people in 14 Century England used \"modern\" English, this is a taste of what that was like:\n\nWhan that Aprille with his shoures soote\n\nThe droghte of Marche hath perced to the roote,\n\nAnd bathed every veyne in swich licour,\n\nOf which vertu engendred is the flour;\n\nWhan Zephirus eek with his swete breeth\n\nThat's the first 5 lines of The Canterburry Tales written  by a lawyer in the Vernacular, not the ordinary populace language most people spoke in their day to day lives which was a lot rougher and more disjointed with a lot more slang. And whatever pronounciation you think you may have down, wouldn't even probably register without some rounds of charades thrown in, and that doesn't even cover the refrences the language is heavily based on, (nor would they understand yours) you'd have to understand all of that as well. You'd be able to after a while, but you would essentially be learning a new language, from commoners that largely can't read for the most part.\n\n\\[This is Old English for comparison (between 700-1000AD), first 5 of The Epic of Beowulf:\n\nHwæt! We Gardena  in geardagum,\n\nþeodcyninga,  þrym gefrunon,\n\nhu ða æþelingas  ellen fremedon.\n\nOft Scyld Scefing  sceaþena þreatum,\n\nmonegum mægþum,  meodosetla ofteah...\\]\n\nA better example showcasing the difficulties of understanding what is essentially the same language, years apart, without being able to read is an outsider's undersatnding of the Hoi Toider accent of North Carolina (youtube has some great videos with subtitles), it's so distinct it is considered a different dialect of english altogether and the closest thing to what the early pilgrims spoke some 200-300 years after the time in your question, and it is still spoken today.",
            "title_similarity": "0.54920495"
        },
        {
            "id": "ho6i3hc",
            "score": 17,
            "text": "One thing I would add (as a Linguistics student and not an expert) is that people aren't mentioning comprehension by the listener. \n\nTo them, your English would actually sound quite deliberate and if they were literate and you wrote English for them, the lightbulb would \"go off\" and understand that English pronunciation had evolved with the spelling. \n\nWhen you see English from that time period, I would liken it to the IPA. If you consider the language as something more spoken than written, then writing exists to make sure it could be read aloud intelligibly. We've changed in the sense that we read quite a bit for information. When people claim words aren't spelled as they sound, they're right, because we read for economy, not for narrative. \n\nThat's why I hypothesise that a literate person would immediately recognise the shift in written English to be something for written communication; they would probably ask if reading written texts was widespread and took the place of conversation. Which they are and they do. \n\nThey would then figure out that your pronunciation is tied to how words are spelled for *written* communication and not as phoenetic. What would be initially foreign to them as you sounding too deliberate/overpronounced would quickly adapt *them* to you as well. Meaning, you may start to sound more like them, but they would also sound more like you as you talk.\n\nA good example of this as the Antarctica dialect. With the scientists there being international, Linguists have noticed that after their 9 months are up, there's a different accent than when they started. But those changes happen right away; the pronunciation shifts happen when there's an agreement on pronunciation, which isn't really official. It just happens. \n\nSo I would say that from the listener's perspective, yes, they would get you, and as a reciprocal speaking-listening dynamic, in conjunction with written modern English, you would quickly reach a middle ground.",
            "title_similarity": "0.44894415"
        },
        {
            "id": "ho6i54w",
            "score": 6,
            "text": "By the 14th century we are in the middle english period, (think Chaucer) so yes very likely, although there would be difficulties for you, but you could probably find a bathroom and where the market was. The same cant be said of conversing with a 9th century english speaker, however. Thats like beowulf. English in that period would be for is for a modem speaker, practically a foreign language.",
            "title_similarity": "0.68911445"
        },
        {
            "id": "ho59fvd",
            "score": 10,
            "text": "Probably, but you'll both need to speak in simple phrases and concentrate to make yourselves understood.  I used to read a lot of old English and it didn't take me long to be quite comfortable with it, so if you somehow broke your time machine and got stuck there you'd be fine within a few months I expect.  The further back you go the harder it becomes and eventually it'll start sounding like Icelandic.  Past the 16th century and the great vowel shift things get easier, you'd have no trouble at all after that but some slang and local phrases will baffle you.",
            "title_similarity": "0.45829445"
        },
        {
            "id": "ho4o9np",
            "score": 219,
            "text": "Chaucer is pretty readable.  If you read it out loud and pronounce every consonant it makes sense.  If anything, it shouldn't take you more than a couple weeks to be fluent if you were sent back in time.\n\nIt's mostly pronunciation and a bit of word replacement.\n\n\"Whan that Aprill with his shoures soote The droghte of March hath perced to the roote, And bathed every veyne in swich licour Of which vertu engendred is the flour\"",
            "title_similarity": "0.40254444"
        },
        {
            "id": "ho55x1n",
            "score": 11,
            "text": "More specific think of the words you'd use, what you'd discuss. How much farming and animal diction do you have. Would your ideas make sense to someone from that time. A conversation may be more complicated than you think.",
            "title_similarity": "0.3257629"
        },
        {
            "id": "ho51hnc",
            "score": 17,
            "text": "Clarification: what is your definition of \"communication\" \n\nFor (hundreds-? tens-? of) thousands of years, people (perhaps even other hominids?) with no common language encountered one another and managed to trade. There must be something that could be called \"communication\" to make that happen. \n\nI've been to countries where I only know the words for \"yes\", \"no\", \"please\", and \"thank you\" and gotten by with pointing and grunting. Is that communication for the purpose of your question, or do you mean something deeper?\n\nAside: if you are a native English speaker and studied a little French, Chaucer and Gower will be much more accessible. Even without, there's enough to get the main point if you squint a bit, so to speak.",
            "title_similarity": "0.45145136"
        },
        {
            "id": "ho4lwog",
            "score": 510,
            "text": "It'd be comparable to a german speaker talking to a dutch speaker. Hard to understand, but enough in common to make yourself understood.\n\nYou propably couldn't discuss quantum-physics, but would have no problem finding something to drink.",
            "title_similarity": "0.2756741"
        },
        {
            "id": "ho4ouz3",
            "score": 3146,
            "text": "Yes, eventually. This period is part of the Great Vowel Shift where we know that the sounding of most vowels changed. There could be some considerable difference between someone speaking at the start of the period vs someone near the end. At first they would sound similar, but often unintelligible, but I think after some practice many of the words would be clear. Context would be a clue in many cases, although some terms and concept would be quite foreign to understand. Shakespeare was writing only 80 or so years after your criteria dates and he is largely understandable.",
            "title_similarity": "0.4452541"
        },
        {
            "id": "ho4xkat",
            "score": 143,
            "text": "There's a great podcast called The History of English and the first few episodes compare old, middle, and modern English in a really accessible way. He even recites examples of texts in each of the three languages.",
            "title_similarity": "0.46609837"
        },
        {
            "id": "ho51yup",
            "score": 76,
            "text": "Some good examples of spoken Old, Middle, and Early Modern [English] (https://www.youtube.com/watch?v=nhgXnEGSn4A)\n\nI think a speaker of modern english, with some knowledge of Latin, or even one of the Romance languages could work out Middle English a bit, but it would be hard. Throw in a regional accent, and it might be unintelligible. Early Modern english comes closer to just a harsh accent, and you could probably stumble through.",
            "title_similarity": "0.52593803"
        },
        {
            "id": "ho5292i",
            "score": 460,
            "text": "William Caxton tells the story of a northern merchant trying to buy an egg from a southern woman, only to be told “sorry, we don’t speak French”.  This is 1490.  \n\nOP, they couldn’t even understand each other, I question many of the responses saying “you’ll figure it out quick enough”.  There were many, many dialects in England at that time.  Which one you were speaking would influence the answer.\n\nhttps://www.bl.uk/learning/timeline/item126611.html",
            "title_similarity": "0.42513818"
        },
        {
            "id": "ho4xynb",
            "score": 3516,
            "text": "You can test it yourself by reading this untranslated extract from 'The Knight's Tale' by Chaucer:\n\nWhilom, as olde stories tellen us,\n\nThat whilom was ycleped Scithia,\n\nAnd weddede the queene Ypolita,\n\nAnd broghte hire hoom with hym in his contree\n\nWith muchel glorie and greet solempnytee,\n\nAnd eek hir yonge suster Emelye.\n\nObviously reading it is not like speaking it, but it'll give you a better idea of what Middle English was like. A lot of words are the same, but you also have leftover traces from Old English like 'ycleped' (means 'called' in relation to a name) and 'eek' (means 'also') a modern English speaker wouldn't understand.",
            "title_similarity": "0.43094862"
        },
        {
            "id": "ho54qef",
            "score": 8,
            "text": "Op, have you ever watched Deadwood on HBO? Watch that and tell me if you actually understand what’s being said. Not word for word, sentence for sentence. That’s a good example of familiar English, but the usage (metaphors, etc) are so different that you’ll understand quite quickly how different our modern (and internet) English is.",
            "title_similarity": "0.39353526"
        },
        {
            "id": "ho5n2ov",
            "score": 3,
            "text": "I always like to ask the question of native speakers of other languages as to how far back a modern non-specialist speaker can understand their language. It seems it starts to get difficult in many cases after 500 years or so. 14-15th centuries would be hard for most English native speakers but not impossible. It would not be like learning a completely foreign language.\n\nEnglish standardised with Shakespeare (1560 or so) and the King James Bible (1611) and the Book of Common Prayer (1550). The latter being important because with widespread religious observance, passages were being preached across the country.",
            "title_similarity": "0.4566056"
        },
        {
            "id": "ho5rqy1",
            "score": 7,
            "text": "Middle English is a bit odd sounding to us today, and you'd probably be able to understand some of it. I think because it's all English it would be easy to learn over time if you had to spend time among people speaking Middle English. I would say it would be easier then picking up a foreign language because a great deal of words would sound familiar. Though I think a difficult thing would be all the words that have been adopted by English since. There would be a lot of words you'd want to use but other people wouldn't be able to understand. And there would be a lot of words you wouldn't get at all because the differences in slang, and a lot of antiquated words that aren't used anymore.\n\nThis video is somewhat helpful in seeing the changes over time: https://youtu.be/8fxy6ZaMOq8",
            "title_similarity": "0.37187737"
        },
        {
            "id": "ho66vl7",
            "score": 9,
            "text": "Yes and no. Some words would be very familiar to you, others might be pretty confusing. There's a lot more French in Middle English, and a lot of the sentence structure is pretty different, at least in written words. \n\nHowever, it's much easier to understand out loud, than it is written, so that would be helpful. \n\nSource: Studied medieval literature as my Lit focus in undergrad.",
            "title_similarity": "0.40524265"
        },
        {
            "id": "ho69d6t",
            "score": 9,
            "text": "Copied from a previous comment. This is pretty basic.\n\nI studied philology back at University and I'm 95% sure that we wouldn't be able to understand what people were saying if we went back far enough, even in our own country. Back before 1066 and the Norman invasion here in Britain we spoke Old English and we would hear that as a foreign language (Think Beowulf).\n\nMiddle English (between say 1100 and 1450) it would sound more like a different accent than a language but you'd be hard pressed to understand all of it. \n\nYou'd probably be okay by about 1600s.",
            "title_similarity": "0.51801157"
        },
        {
            "id": "ho70d42",
            "score": 3,
            "text": "It would really depend on the region, if you think modern day brits have varying accents, you should hear 15th century. But if you went to London and heard proper English, you'd have a good idea of what they're saying, as long as you can decipher the accent because it would sound completely different. However they would have a hard time understanding you.",
            "title_similarity": "0.5463098"
        },
        {
            "id": "ho7du1d",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.19614327"
        },
        {
            "id": "ho7f73n",
            "score": 5,
            "text": "Short answer: yes.\n\nLong answer: it would be like the hardest to understand dialect you've ever heard. It would definitely take some time, but it should still be easier than learning an entirely new language. There'd be words that we don't use anymore, a slightly different language structure, lots of different pronunciations, but not an entirely different beast.",
            "title_similarity": "0.33952254"
        },
        {
            "id": "ho7ik6i",
            "score": 7,
            "text": "Understanding Middle English would probably not be too hard, aside from adjusting to the pronunciation and figuring out some words that have been lost since then. The real issue might be making yourself understood to them. We have so much more vocabulary that’s been created since then, it might be tough to remember to use only Germanic and Norman French-based vocabulary.",
            "title_similarity": "0.46804005"
        },
        {
            "id": "hql3dr2",
            "score": 1,
            "text": "No. \n\nBecause Old English which was a germanic language was widely spoken until the 17th century, but even then it would be difficult to understand completely. \n\nOur modern language we call \"English\" is a hodgepodge of German, Finnish, Norwegian, Greek, etc \n\nIts a blend of several languages. \n\nThe original English was started by the Saxons and Danes. Thats where the roots lie. \n\nIf you were to speak to English people in England in the 15th or 16th century, even the 17th, you would be better off trying to speak French or Latin.\n\nhttps://theconversation.com/in-medieval-britain-if-you-wanted-to-get-ahead-you-had-to-speak-french-73164",
            "title_similarity": "0.570306"
        },
        {
            "id": "htpu53g",
            "score": 1,
            "text": "A bit of a broad timeframe. A lotta changes were happening, and English had a much larger amount of variation (a lot of loan words were in flux)\n\nBut over all, probably. The great vowel shift had finished, so it would be somewhat similar outside of a few words and terms. Think talking to a real rural speaker of some obscure dialect in north wales or smth. You'd call it a thick accent with a couple made-up words\n\nBut reading? Nah, good luck with that.",
            "title_similarity": "0.4014514"
        }
    ]
}