{
    "When different breeds of cats reproduce indiscriminately, the offspring return to a “base cat” appearance. What does the “base dog” look like?\nDomestic Short-haired cats are considered what a “true” cat looks like once imposed breeding has been removed. With so many breeds of dogs, is there a “true” dog form that would appear after several generations?": [
        {
            "id": "homtonj",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.09419124"
        },
        {
            "id": "hoiuu30",
            "score": 466,
            "text": "The concept of a base or true form of a species is flawed.  Species are always changing,  there is no \"norm\" to return to. \n\nIn the case of cats,  what comes out is a set of characteristics that favor the current environment, based on the available gene pool.  Same thing for the street dogs example. \n\nSpecies, populations,  and evolution are always forward looking,  adapting to the current conditions.  The concept of reverting isn't applicable.",
            "title_similarity": "0.6978494"
        },
        {
            "id": "hoit3d6",
            "score": 37,
            "text": "Sure, dominant genes are more likely to express themselves with more biodiversity, (probably whats going on with domestic-cats) but I doubt there is a true or base dog- the varieties of canines are too great after thousands of years of selective breeding- and of course the results of \"wild\" interbreeding are greatly effected by the environment they are living in. For example: A cold wet climate will give very different results in what animal survives, breeds and thrives than a hot dry environment. You'll have to learn to love the base-dog-emoji! 🐶🐶",
            "title_similarity": "0.7321122"
        },
        {
            "id": "hokorj6",
            "score": 20,
            "text": "Does this really exist anymore?  Dogs have been domesticated for much longer than cats.   most scientific consensus holds that they originated from Eurasian Grey Wolves during the late Pleistocene era,  so they've been diverging from that for about 25,000 years. \n\nThe \"base\" dog would really be that lineage/ecomorph of the Grey Wolf, which itself no longer exists. \n\nThere's been so much genetic drift since then, in every place that domesticated dogs are found, that arriving at a single \"base\" dog appearance now seems unlikely. \n\nI think what's more likely is multiple different \"base\" appearances based on the region and what breeds the dog's lineage is made from.",
            "title_similarity": "0.6499729"
        },
        {
            "id": "homc8jv",
            "score": 2,
            "text": "Base dog is a wolf,  but that is back so many generations that you'll pretty much never be able to get back to it.  People have been domesticating and breeding dogs for specific traits for so long that it is amazing that they are still considered the same species with how much they vary",
            "title_similarity": "0.54983044"
        },
        {
            "id": "holz2qy",
            "score": 4,
            "text": "The base cat you're talking about is actually the wild version of the cat. https://en.m.wikipedia.org/wiki/Wildcat\n\nCats were only domesticated 12,000 years ago.  Dogs were likely domesticated from wolves tens or even hundreds of thousands of years earlier.    The genetic differences between wildcats and domestic cats are much less than dogs and wolves.  \n\nCats return to their wild form more easily because the genetic mutations that differentiate the breeds are narrower.\n\nIn theory, If you could un-breed dogs in the same way, you'd get something that looks like a wolf.  But in practice, you'd get something totally different.  What you got would depend heavily on what breeds you started with and, maybe more importantly, where.  Chihuahuas would die in siberia, huskies would die in the Chihuahuan desert.",
            "title_similarity": "0.7755692"
        },
        {
            "id": "homqumo",
            "score": 3,
            "text": "It depends a lot on the environment that they are returned to. For example desert environments favor a tawny or otherwise brown coat and slender body and tundra will favor white or gray and stockier body.\n\nThe most obvious example i can think of are dingos. They are actually a distant offshoot of early domesticated dogs. After a few thousand years of adaptation, they have returned to a uniform tawny coat and lean, swift body type. This is the form that consistently performed best over a few thousand years. It was enough to ensure that all modern dingos have a \"base\" type.\n\nEnvironmental stresses play a role too. In indiscriminate populations that have a fairly low risk of predation and dont completely rely on their own ability to hunt, theres less pressure to adapt an ideal form to ensure their success.\n\nA basic urban dog is probably going to look much more diverse than a basic purely wild dog like the dingo. You'd probably have a medium sized animal with short hair and a return to a more typical dog's shape but the colors might vary quite a bit.",
            "title_similarity": "0.6344657"
        },
        {
            "id": "holdu20",
            "score": 6,
            "text": "The closest thing to wildtype dog phenotype is more or less like the spitz phenotype.  This phenotype represents some of the oldest (and closest to wolves) dog breeds in the world.  Pointed ears, fluffy and often curly tail, double coat, often black and tan in some combination.  If you set all dogs free, I imagine they'd probably end up more or less like a spitz.\n\n&#x200B;\n\nOn the other hand...\n\nThe genetics that are different from the original dogs/wolves result from: 1) removal of natural selection (genetics that lead to less competitive animals persist rather than dying out), 2) selective breeding (naturally rare or recessive genes are selected for specific purposes/cuteness).\n\nAssuming we're only talking about letting them breed freely and not setting them free in the wilderness, this removes the selective breeding portion only.  That means that any dominant phenotypes that are a result of selective breeding will remain (this includes short corgi legs).  So my guess is that it's a matter of figuring out what the dominate phenotypes are.",
            "title_similarity": "0.6531667"
        },
        {
            "id": "hoj1yxf",
            "score": 143,
            "text": "[removed]",
            "title_similarity": "0.09419124"
        },
        {
            "id": "hoj7xnt",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "0.09419124"
        },
        {
            "id": "hojtora",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.09419124"
        },
        {
            "id": "hoiwgvu",
            "score": 1364,
            "text": "[removed]",
            "title_similarity": "0.09419124"
        },
        {
            "id": "holsxg3",
            "score": 83,
            "text": "We have lots of \"base dogs\" in the Philippines and generally call them aspin (asong pinas—dog from Phil). They're almost always a stray, we adopted one as well, and are pretty quick in catching up non-verbal queues. You can train them as you would pure breds, and they are more resistant to diseases. Take care of them and they can live longer than a golden retriever, for example. They're usually medium at most in size and still has pointy or floppy ears (but shorter than, say, a Labrador) and are usually shorthairs because ours is a tropical country.",
            "title_similarity": "0.5344991"
        },
        {
            "id": "hoisvcl",
            "score": 2082,
            "text": "[removed]",
            "title_similarity": "0.09419124"
        },
        {
            "id": "hojxh7m",
            "score": 730,
            "text": "[removed]",
            "title_similarity": "0.09419124"
        },
        {
            "id": "hokmv1g",
            "score": 714,
            "text": "This is similar to the concept of a [landrace](https://en.m.wikipedia.org/wiki/Landrace), a variety of domesticated animal that has been bred in a certain geographic area without reference to formal breeds or pedigrees and is adapted to the prevailing local conditions. The shorthair is just one of several common cat landraces, according to the Wiki article.\n\nLooking through Wikipedia's [list of dog landraces](https://en.m.wikipedia.org/wiki/Category:Dog_landraces), most landrace dogs are medium to large in size and have coats appropriate to the local climate—short in hot climates, fluffy in cold ones.",
            "title_similarity": "0.6893699"
        },
        {
            "id": "hojnr90",
            "score": 451,
            "text": "[removed]",
            "title_similarity": "0.09419124"
        },
        {
            "id": "hoj3xuj",
            "score": 1157,
            "text": "[removed]",
            "title_similarity": "0.09419124"
        },
        {
            "id": "holqlx8",
            "score": 739,
            "text": "You can search up \"village dogs,\" the common name for stray/street dogs that live near or in human settlements. They tend to be medium-sized yellow dogs with slim faces and pointy ears, generally. They tend to look the same on pretty much every continent. \n\nHere are a few examples:\n\n[Brazilian street dogs.](https://www.google.com/search?q=vira-lata+caramelo&rlz=1C1CHBF_enUS894US894&sxsrf=AOaemvKazlxYPW98_iKfMttzDGMIZnvuOQ:1639540288015&source=lnms&tbm=isch&sa=X&ved=2ahUKEwjG0djD8-T0AhUgCTQIHUFWAiUQ_AUoAXoECAEQAw&biw=1745&bih=881&dpr=1.1)\n\n[Indian street dogs.](https://www.google.com/search?q=indian+pariah+dogs&tbm=isch&ved=2ahUKEwigr4uO9OT0AhXSIX0KHRXbB3wQ2-cCegQIABAA&oq=indian+pariah+dogs&gs_lcp=CgNpbWcQAzIFCAAQgAQ6BwgjEO8DECc6BAgAEEM6CAgAEIAEELEDOgcIABCxAxBDUM0HWLUVYJwWaABwAHgAgAFmiAGNDJIBBDE4LjGYAQCgAQGqAQtnd3Mtd2l6LWltZ8ABAQ&sclient=img&ei=3Ga5YaDRAdLD9AOVtp_gBw&bih=881&biw=1745&rlz=1C1CHBF_enUS894US894)\n\n[Egyptian street dogs.](https://www.google.com/search?q=egyptian+street+dog&rlz=1C1CHBF_enUS894US894&sxsrf=AOaemvLJOrpV6cZOGfIeXsKSFS9Mq6YTSw:1639540578003&source=lnms&tbm=isch&sa=X&ved=2ahUKEwjTgfzN9OT0AhWpDzQIHfkfAIoQ_AUoAXoECAEQAw&biw=1745&bih=881&dpr=1.1)",
            "title_similarity": "0.4997419"
        },
        {
            "id": "homa3fa",
            "score": 2,
            "text": "In the philippines we have dogs called [askals](https://en.m.wikipedia.org/wiki/Askal). Theyre dogs that roam the street and basically breed with any dog. Other askals, pure breeds, and half breeds. Most of the time they just look like weirder versions of their pure breed selves though like a dalmatian and askal makes a dalmatian with fluffier fur or less black spots.",
            "title_similarity": "0.55297816"
        }
    ]
}