{
    "AskScience AMA Series: We're experts working on the James Webb Space Telescope, the most powerful observatory ever built. It's ready to launch. Ask us anything!\n**That's a wrap! Thanks for all your questions. Find images, videos, and everything you need to know about our historic mission to unfold the universe: [jwst.nasa.gov](http://jwst.nasa.gov).**\n\n-----\n\nThe James Webb Space Telescope (aka Webb) is the most complex, powerful and largest space telescope ever built, designed to fold up in its rocket before unfolding in space. After its scheduled Dec. 24, 2021, liftoff from Europe's Spaceport in French Guiana (located in South America), Webb will embark on a 29-day journey to an orbit one million miles from Earth.\n\nFor two weeks, it will systematically deploy its sensitive instruments, heat shield, and iconic primary mirror. Hundreds of moving parts have to work perfectly - there are no second chances. Once the space telescope is ready for operations six months after launch, it will unfold the universe like we've never seen it before. With its infrared vision, JWST will be able to study the first stars, early galaxies, and even the atmospheres of planets outside of our own solar system. Thousands of people around the world have dedicated their careers to this endeavor, and some of us are here to answer your questions. We are:\n\n+ Dr. Jane Rigby, NASA astrophysicist and Webb Operations Project Scientist (JR)\n+ Dr. Alexandra Lockwood, Space Telescope Science Institute project scientist and Webb communications lead (AL)\n+ Dr. Stephan Birkmann, European Space Agency scientist for Webb's NIRSpec camera (SB)\n+ Karl Saad, Canadian Space Agency project manager (KS)\n+ Dr. Sarah Lipscy, Ball Aerospace deputy director of New Business, Civil Space (SL)\n+ Mei Li Hey, Northrop Grumman mechanical design engineer (MLH)\n+ Shawn Domagal-Goldman, NASA branch head for the Planetary Systems Laboratory (SDG)\n\nWe'll be on at 1 p.m. ET (18 UT), ask us anything!\n\n[Proof!](https://twitter.com/NASAWebb/status/1470861166503096320?s=20)\n\nUsername: /u/NASA": [
        {
            "id": "hos0fy0",
            "score": 1,
            "text": "Thoughts on UFOs?",
            "title_similarity": "0.4277966"
        },
        {
            "id": "horz7a9",
            "score": 1,
            "text": "Is the end result photo shown to us (the world) is actually from the telescope or is it photoshoped (edited) first?\n\nI hope you understand the question. I mean, is it like a polaroid photo or do you have to edited it first otherwise it won't be understandable by average person?",
            "title_similarity": "0.5743189"
        },
        {
            "id": "horwm44",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.04217322"
        },
        {
            "id": "hos0uly",
            "score": 0,
            "text": "How do you fix it if it breaks?",
            "title_similarity": "0.15926029"
        },
        {
            "id": "hosmg8v",
            "score": 1,
            "text": "Can we see dinosaurs from the past?",
            "title_similarity": "0.37543732"
        },
        {
            "id": "hospjdp",
            "score": 1,
            "text": "Finally, something that can see my penis.",
            "title_similarity": "0.29513428"
        },
        {
            "id": "horxnb6",
            "score": 0,
            "text": "What are all the knobs and bits I'm looking at? Like what are those yellow strips?",
            "title_similarity": "0.24960683"
        },
        {
            "id": "horvzp2",
            "score": -1,
            "text": "Is anything about this project insurable?",
            "title_similarity": "0.21605937"
        },
        {
            "id": "hotscxd",
            "score": -1,
            "text": "Why are you wasting your time on social media ?",
            "title_similarity": "0.22120509"
        },
        {
            "id": "horr8sk",
            "score": 16,
            "text": "If you aimed a space telescope back at earth would it become an ultra-high definition spy satellite?",
            "title_similarity": "0.63818955"
        },
        {
            "id": "horzr6z",
            "score": 2,
            "text": "Will JWST be able to see the hypothetical 9th planet, assuming we'll have detected its position in the near future? If so, how detailed of an image we should be expecting?",
            "title_similarity": "0.46810094"
        },
        {
            "id": "hos8hjb",
            "score": 4,
            "text": "For the team: pineapple on pizza, yes or no?",
            "title_similarity": "0.32999498"
        },
        {
            "id": "horw29h",
            "score": 0,
            "text": "Can you see further galaxies?",
            "title_similarity": "0.3503999"
        },
        {
            "id": "hos2hck",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.054252036"
        },
        {
            "id": "hos3gec",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.054252036"
        },
        {
            "id": "hos8w5h",
            "score": 0,
            "text": "What are you going to focus on first?",
            "title_similarity": "0.06996314"
        },
        {
            "id": "hosd66v",
            "score": 0,
            "text": "Will there be a publicly available stream or feed for accessing what the telescope is seeing? This is beyond exciting!",
            "title_similarity": "0.5928539"
        },
        {
            "id": "hosdqsm",
            "score": 0,
            "text": "Say you detected something big, like an actual dyson sphere or some other megastructure thats evidence of an alien species far more advanced than us, are you going public with that? Or you guys want to avoid creating a mass panic?",
            "title_similarity": "0.6802281"
        },
        {
            "id": "hoseq0w",
            "score": 0,
            "text": "Being able to see the edge of space is great and all, But can it see why kids love cinnamon toast crunch?",
            "title_similarity": "0.4738549"
        },
        {
            "id": "hosh6qm",
            "score": 0,
            "text": "No question but I'm happy to see it happening thank you all for the hard work you guys put in.",
            "title_similarity": "0.352556"
        },
        {
            "id": "hoshfsf",
            "score": 0,
            "text": "What if dust lands on the mirrors during the launch process. Will that affect the image greatly?",
            "title_similarity": "0.5085479"
        },
        {
            "id": "hosirc3",
            "score": 0,
            "text": "I got to go see it being tested in SoCal back in 2019 and got to see myself in it's main mirror.\nAwesome to see it'll 'finally' be launched after the many years of setbacks.",
            "title_similarity": "0.5564551"
        },
        {
            "id": "hosmi9b",
            "score": 0,
            "text": "Why will the telescope orbit AROUND L2, and not just stay right on L2?",
            "title_similarity": "0.4704594"
        },
        {
            "id": "hotanjs",
            "score": 0,
            "text": "Will you actually launch it in the next 5 years",
            "title_similarity": "0.24934274"
        },
        {
            "id": "hotba87",
            "score": 0,
            "text": "Why didn’t NASA change the name when it came out James Webb was a bigot?",
            "title_similarity": "0.5638485"
        },
        {
            "id": "hothxak",
            "score": 0,
            "text": "Is it true everything must exist inside something else? (Not related to the telescope) just curious on anyone's thoughts.",
            "title_similarity": "0.38554874"
        },
        {
            "id": "hotkzbb",
            "score": 0,
            "text": ">the most powerful observatory ever built\n\nthat we know of! Imagine seeing getting it up there and focusing on a point to see an eye looking back at us.",
            "title_similarity": "0.8245406"
        },
        {
            "id": "hotperf",
            "score": 0,
            "text": "How far will it be able to see and will the images be in black and white?",
            "title_similarity": "0.16024467"
        },
        {
            "id": "hou2461",
            "score": 0,
            "text": "Wheres my penis ?",
            "title_similarity": "0.17319846"
        },
        {
            "id": "hou4qqm",
            "score": 0,
            "text": "What wavelengths can this telescope detect? Does it go further than infared? Can it observe ultraviolet?",
            "title_similarity": "0.36919826"
        },
        {
            "id": "hou976h",
            "score": 0,
            "text": "Will it crash",
            "title_similarity": "0.10681033"
        },
        {
            "id": "houco8n",
            "score": 0,
            "text": "If you point it at Earth, could you use the telescope to find Waldo?",
            "title_similarity": "0.4780011"
        },
        {
            "id": "houkmcb",
            "score": 0,
            "text": "How many years behind schedule and how many billions over budget?",
            "title_similarity": "0.3250589"
        },
        {
            "id": "houzvj3",
            "score": 0,
            "text": "When launch?",
            "title_similarity": "0.3189646"
        },
        {
            "id": "hox1rje",
            "score": 0,
            "text": "Does pineapple belong on Pizza?",
            "title_similarity": "0.29272854"
        },
        {
            "id": "hortwb9",
            "score": 7,
            "text": "When you say \"ready for launch\" does that *really* mean next week?",
            "title_similarity": "0.33723164"
        },
        {
            "id": "horxf6g",
            "score": 1,
            "text": "It appears that the base of the building you are in is a basketball court. Did you build a revolutionary piece of space exploration equipment in a gymnasium?",
            "title_similarity": "0.5235601"
        },
        {
            "id": "horypp3",
            "score": 1,
            "text": "Was JWST designed to potentially be refueled by e.g. a simply specified yet undesigned docking mission delivering new fuel?",
            "title_similarity": "0.44569737"
        },
        {
            "id": "hos2314",
            "score": 1,
            "text": "Are you as terrified about deployment as I am?  So much to go wrong, and everything has to go right.  What is your biggest concern about deployment?  What are you personally most excited to explore with JWST?",
            "title_similarity": "0.46409386"
        },
        {
            "id": "hos5m09",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.054252036"
        },
        {
            "id": "hos707f",
            "score": 1,
            "text": "I dont have a question,  however i am asking you to please start planning a re-supply mission for more helium and whatever else. Hubble has been working for years, JWST needs to do the same.. i doubt we will be launching something of this magnitude anytime soon.\n\nAlso, straight up props, you guys are amazing!",
            "title_similarity": "0.6537472"
        },
        {
            "id": "hos9d40",
            "score": -1,
            "text": "Are you worried that by the time it launches in 2040 the technology will be hopelessly out of date?",
            "title_similarity": "0.3451584"
        },
        {
            "id": "hos9k39",
            "score": 1,
            "text": "Are we alone in the universe?",
            "title_similarity": "0.29108685"
        },
        {
            "id": "hos9svb",
            "score": -1,
            "text": "If you took your first peep into it and saw an alien peeping back at you, would you tell reddit about it or would it become government classified?",
            "title_similarity": "0.49773422"
        },
        {
            "id": "hosbv4a",
            "score": 1,
            "text": "What are the chances the Webb is damaged in transit?",
            "title_similarity": "0.1449918"
        },
        {
            "id": "hosd0np",
            "score": 1,
            "text": "Can it run Crisis? Jk, lol. \nFrom the moment you acquire data, how long is the data processing and analysis? And how long does it take to release/publish your findings?\nThanks for the AMA! Cheers",
            "title_similarity": "0.5210229"
        },
        {
            "id": "hosf2up",
            "score": -1,
            "text": "Does anyone in your camp theorize rhe reason it's been delayed so many times is that there's some kind of cosmic force keeping this from happening? Like maybe someone from the future, for example. Just a weird idea I had.",
            "title_similarity": "0.47172165"
        },
        {
            "id": "hosgepm",
            "score": 1,
            "text": "Can you estimate the probability of success?",
            "title_similarity": "0.20044065"
        },
        {
            "id": "hosgypz",
            "score": 1,
            "text": "If the worst were to happen and one of those 344 single points of failure actually failed, how much would it cost to build a replacement? I've heard that a very large percentage of it's cost was toward development which presumably is a one time expense.",
            "title_similarity": "0.49219188"
        },
        {
            "id": "hosh9o6",
            "score": -1,
            "text": "When you find aliens will you tell us?",
            "title_similarity": "0.47850522"
        },
        {
            "id": "hoshfum",
            "score": -1,
            "text": "Will you let me know when you see aliens, I need to get back home?",
            "title_similarity": "0.37285787"
        },
        {
            "id": "hoshy3t",
            "score": 1,
            "text": "What's so iconic about that primary mirror?\n\n\nTo all of you scientists: \n\n\n**THANK YOU**",
            "title_similarity": "0.67052186"
        },
        {
            "id": "hosimmq",
            "score": 1,
            "text": "Will it actually launch on Christmas? That will be easy to remember.",
            "title_similarity": "0.31166494"
        },
        {
            "id": "hosvqax",
            "score": 1,
            "text": "Are You Sure??",
            "title_similarity": "0.012897506"
        },
        {
            "id": "hotgx3y",
            "score": 1,
            "text": "Let's hope it doesn't explode during the launch.",
            "title_similarity": "0.31555092"
        },
        {
            "id": "hort173",
            "score": 8,
            "text": "1. Are we gonna find life on other planets with this telescope? It sounds like the next step in understanding exoplanets and knowing if life could flourish on those planets. 2. Are there any personal  discoveries or information you excited to gather and find the results of?",
            "title_similarity": "0.6275041"
        },
        {
            "id": "horxoyf",
            "score": 2,
            "text": "How many different nearby systems will the JWST be able to analyze planets for habitability or biosignatures?  And can you description be the mechanisms that will be used to do that analysis?",
            "title_similarity": "0.48384583"
        },
        {
            "id": "horxsv6",
            "score": 2,
            "text": "Are you not sleeping due to the workload or pure excitement?",
            "title_similarity": "0.32028598"
        },
        {
            "id": "hose7z6",
            "score": 2,
            "text": "Chances of it going FUBAR?",
            "title_similarity": "0.1175927"
        },
        {
            "id": "hosiffj",
            "score": 2,
            "text": "The James Webb telescope seems to be primarily aimed at deep space exploration. Is there something to be gained by directing it at planets with dense atmospheres like Venus and Jupiter? How high would something like that be on the priorities list?",
            "title_similarity": "0.7522541"
        },
        {
            "id": "host32d",
            "score": -2,
            "text": "What is your org's thoughts on astrology?",
            "title_similarity": "0.43123478"
        },
        {
            "id": "hosz5hv",
            "score": -2,
            "text": "Why spend all this money to observe life far away; when we have confirmed footage within NASA and the Def. Dept that there is Non-Human intelligence engaging us on this planet.",
            "title_similarity": "0.64429975"
        },
        {
            "id": "horwj0h",
            "score": 28,
            "text": "Hi team,\n\nWould you like to expand on \n\n> Hundreds of moving parts have to work perfectly - there are no second chances\n\nYour undertaking has been characterised as a \"gamble\" (Scientific American) among criticism of the increasing cost and delays of the project and yet surely you have performed design and risk analysis that you consider adequate and indeed so has an independent review board. Could you describe to our readers how you are dealing with the risks of mission operations at a distance that makes repair missions uneconomical?",
            "title_similarity": "0.6349841"
        },
        {
            "id": "hosnxws",
            "score": 13,
            "text": "Why doesn't NASA talk to the public only in Metric? NASA could be a great source for education here.  (You noted a million miles above)",
            "title_similarity": "0.7066207"
        },
        {
            "id": "horzxpx",
            "score": 4,
            "text": "Hi! I heard this proyect has a 10 years lifespan, why is that?",
            "title_similarity": "0.40042928"
        },
        {
            "id": "hortibv",
            "score": 15,
            "text": "I assume there is some sort of insurance in place if the rocket goes kablooie? Other than the collective disappointment of the human race, what would happen should disaster occur?",
            "title_similarity": "0.47304523"
        },
        {
            "id": "hosg8ls",
            "score": 5,
            "text": "I have no questions but congratulations to everyone who worked on the JWST! I can't wait to see what we can learn from your hard work! :)",
            "title_similarity": "0.4601205"
        },
        {
            "id": "hot01b0",
            "score": -5,
            "text": "If you are cishet: How are you supporting any queer colleagues who are being forced by NASA to associate their work with an agency directory who was [complicit in carrying out homophobic policies](https://www.scientificamerican.com/article/nasa-needs-to-rename-the-james-webb-space-telescope/)?\n\nIf you're queer yourself: How are you being supported by your cishet colleagues?\n\nETA: \"Ask us anything except uncomfortable questions about homophobia within NASA,\" got it.",
            "title_similarity": "0.6364331"
        },
        {
            "id": "horzmyo",
            "score": 7,
            "text": "From 1 - 10, how scared are you of its journey? AFAIK there is not much you can do, when things go sideways?!\n\nPs: have you given your \"baby\" a nickname?",
            "title_similarity": "0.3586812"
        },
        {
            "id": "horuwup",
            "score": 23,
            "text": "It's true that at L2, Webb will not be serviceable?\n\nIs any kind of orbital testing going to be done before it heads out or is it just a Jesus take the wheel moment right at takeoff?",
            "title_similarity": "0.5517"
        },
        {
            "id": "horwwa2",
            "score": 9,
            "text": "Are there any hidden momentos, signatures, or messages on the craft from the engineering teams that built it? Or are is there a pioneer-like plaque installed?",
            "title_similarity": "0.4494104"
        },
        {
            "id": "hos86bi",
            "score": 9,
            "text": "NASA keeps saying that if something goes wrong we can't send an astronaut to fix the JWT.  But that's gotta be a bluff, right?  The JWT will be a million miles away but that's only 1/34th of the distance to Mars.  Is the plan to really say \"oh well\" if something goes wrong?",
            "title_similarity": "0.58144456"
        },
        {
            "id": "hos0fz0",
            "score": 75,
            "text": "If JWST were 50 lightyears away looking at Earth (and seeing it as it was in 1971), could it detect spectral lines of the following biosignatures and technosignatures in our atmosphere?\n\n- The approx. 40 parts per trillion of carbon tetraflouride\n- The approx. 1.3 parts per million of methane\n- The approx. 325 parts per million of carbon dioxide",
            "title_similarity": "0.5684315"
        },
        {
            "id": "hosbckf",
            "score": 31,
            "text": "I've read many times (on Reddit) that the average person is going to be \"disappointed\" when they realize the JWST doesn't take normal pictures.  Is there anything that the general public should be looking forward to?  Or is all of the gathered data just going to go over our heads?",
            "title_similarity": "0.43202078"
        },
        {
            "id": "hors1k6",
            "score": 11,
            "text": "What are you most hoping to see or discover/prove?",
            "title_similarity": "0.21009001"
        },
        {
            "id": "horvu4k",
            "score": 13,
            "text": "What are you most concerned about? What are the biggest risks or potential points of failure?",
            "title_similarity": "0.3328424"
        },
        {
            "id": "hos5esx",
            "score": 39,
            "text": "James Webb is not the first telescope bound for Sun-Earth L2 orbit...\n\n* [https://en.wikipedia.org/wiki/Gaia\\_(spacecraft)](https://en.wikipedia.org/wiki/Gaia_(spacecraft))\n* [https://en.wikipedia.org/wiki/Planck\\_(spacecraft)](https://en.wikipedia.org/wiki/Planck_(spacecraft))\n* [https://en.wikipedia.org/wiki/Herschel\\_Space\\_Observatory](https://en.wikipedia.org/wiki/Herschel_Space_Observatory)\n* [https://en.wikipedia.org/wiki/Wilkinson\\_Microwave\\_Anisotropy\\_Probe](https://en.wikipedia.org/wiki/Wilkinson_Microwave_Anisotropy_Probe)\n\nCan you contrast the mission objectives and capabilities between James Webb and these predecessor sensing equipment that were put at L2.",
            "title_similarity": "0.5916358"
        },
        {
            "id": "hos1eal",
            "score": 12,
            "text": "Can the telescope clean its own mirrors? Or is it even necessary to do so in case of dust build up over time?",
            "title_similarity": "0.41783503"
        },
        {
            "id": "horrfij",
            "score": 97,
            "text": "How nervous are you about this launch?",
            "title_similarity": "0.37433696"
        },
        {
            "id": "horxf9l",
            "score": 19,
            "text": "Does it have any hidden Easter eggs that future scavenger aliens might find?",
            "title_similarity": "0.42052996"
        },
        {
            "id": "horu5r2",
            "score": 21,
            "text": "Thank you for this AMA! What are the plans in place to enable repair and maintenance, since it won't be possible to physically reach the telescope for maintenance? Good luck!!",
            "title_similarity": "0.51291627"
        },
        {
            "id": "horrp9a",
            "score": 69,
            "text": "What's the furthest distance you will be able to see to?",
            "title_similarity": "0.07992332"
        },
        {
            "id": "hos1hih",
            "score": 32,
            "text": "What’s a little known cool fact you personally learned about it while working on it?",
            "title_similarity": "0.31890723"
        },
        {
            "id": "hosa68o",
            "score": 28,
            "text": "Big fan here. What would happen if you really really, I mean really found extra terrestrial life somewhere for the first time. Would the information be filtered and hidden from\nus? :(",
            "title_similarity": "0.63466394"
        },
        {
            "id": "hos3zi9",
            "score": 34,
            "text": "I've been dying to ask this for ages.\nThe high cost associated with the telescope makes sense considering all the new tech that goes into it. But then why didn't you build 2 or 3 amortizing the costs and bringing the cost per unit down and insuring backups or even triple the observational power? It seems the small increase in actually constructing the additional telescopes would have been minor compared to development costs.",
            "title_similarity": "0.66414154"
        },
        {
            "id": "hory33z",
            "score": 40,
            "text": "What is the most important thing JWST will be able to image that no other current space or ground based observatory can do?",
            "title_similarity": "0.63302964"
        },
        {
            "id": "horx6hp",
            "score": 102,
            "text": "What is the general process for capturing, relaying, and processing the infrared data? Roughly how long might it take from the initial collection of light by the instruments to produce a publishable image?",
            "title_similarity": "0.28945154"
        },
        {
            "id": "horztmt",
            "score": 104,
            "text": "I know that the main benefits are that it can see deeper to the universe, but how about looking at objects that we can already observe? Lets say that there is a distant object of which Hubble can take a picture, with like two shades of colour and barely seeing that it is a circle. How much better would JWST do in comparison? Would the images be much more sharp, for example 5x5 pixels with Hubble would be something like 50x50 pixels with JWST? I am aware that the size of the mirrors do not offer a direct comparison, since we are talking about objests lightyears away, and all pictures online are reconstructions of data if I have understood correctly.\n\nAre there any comparison pictures, with real images taken by Hubble and a picture taken by JWST which is based on theory?\n\nI hope that everything goes well with the launch. It would be a horrific setback if something goes wrong, I have been following the news closely over the years!",
            "title_similarity": "0.49617386"
        },
        {
            "id": "hos0jg4",
            "score": 56,
            "text": "If you would restart the project now, what would you change?",
            "title_similarity": "0.23146442"
        },
        {
            "id": "horu4bl",
            "score": 289,
            "text": "Realistically, how far back in time is it actually possible to see? I've seen some people talking about being able to see the big bang, which seems absurd to me. But I'm curious what actual scientists think is possible.",
            "title_similarity": "0.5844511"
        },
        {
            "id": "horu67c",
            "score": 85,
            "text": "Given the lengthy and costly development of JWST, do you think a \"mass production\" approach for building scientific equipment, where sets of say a dozen units are built, could reduce the per unit cost? And do you see something like that happening in the decades to come?",
            "title_similarity": "0.5831504"
        },
        {
            "id": "horubmc",
            "score": 129,
            "text": "Is there anything you all are specifically planning to look at that caught interest in a previous telescope, but didn't have the range for? If so, what do you all expect to find?",
            "title_similarity": "0.48951936"
        },
        {
            "id": "horrkxa",
            "score": 366,
            "text": "What will be JWSTs first science target?\nAnd when will we see the first image?\nThanks!",
            "title_similarity": "0.4766392"
        },
        {
            "id": "hos07tf",
            "score": 191,
            "text": "Thanks for doing this! I am a science communicator in a science center. Is there anything about JWST or it's goals that you wish the public understood more?",
            "title_similarity": "0.538219"
        },
        {
            "id": "horw2zu",
            "score": 248,
            "text": "What are the most surprising data the telescope might plausibly find? What would make the biggest waves in cosmology?",
            "title_similarity": "0.7420209"
        },
        {
            "id": "hos0dmw",
            "score": 491,
            "text": "Hubble has been going strong for **thirty years** at this point. I know that JWST has enough fuel to go between 5 and 10 years. Given that it would be useful for far longer than that, is there a chance that its useable life estimate has been lowballed like instruments before it and other remote NASA missions (e.g., rovers)?",
            "title_similarity": "0.6537259"
        },
        {
            "id": "hortxf6",
            "score": 51,
            "text": "I just saw the Solar probe footage and it was mind boggling to say the least. What kind of mind boggling pics or footage can we expect from the Webb? Thanks for doing this AMA!",
            "title_similarity": "0.62243044"
        },
        {
            "id": "horv6z8",
            "score": 30,
            "text": "Is our understanding increasing of where, position-wise, we are in the universe/cosmos? Does it seem likely we will be able to answer this question?",
            "title_similarity": "0.49724555"
        },
        {
            "id": "horvr1v",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.054252036"
        },
        {
            "id": "horxema",
            "score": 11,
            "text": "What are some interesting projects slated to use the James Webb Space Telescope? And how will they utilise the Telescope?",
            "title_similarity": "0.6382519"
        },
        {
            "id": "horxi20",
            "score": 4,
            "text": "Thank you for the AMA!How long do you think will the Webb telescope be the 'best' and most optimal telescope?And what do you expect of it?",
            "title_similarity": "0.6669402"
        },
        {
            "id": "horxtkx",
            "score": 39,
            "text": "What is the projected operational life-time of the telescope? and is there any forethought put into how you might increase the life expectancy and usage of the telescope in the future?",
            "title_similarity": "0.5480619"
        },
        {
            "id": "horzh45",
            "score": 2,
            "text": "Following with interest and wishing you best of luck for a successful launch.\n\nWill having a clearer visual image of a black hole, for example, fill in any gaps or provide any new information about how they work based on just being able to see it in more detail? If so, what information will the clearer picture provide?\n\nSame question for any other distant objects, planets, early stars etc?",
            "title_similarity": "0.6535954"
        },
        {
            "id": "horzvhy",
            "score": 3,
            "text": "Can you ELI5 how the James Webb Space Telescope works? If that's even possible.",
            "title_similarity": "0.6298723"
        },
        {
            "id": "hos0bji",
            "score": 3,
            "text": "What are you most worried about? Micrometeorite damage or something not working in space the way it did in testing?",
            "title_similarity": "0.502038"
        },
        {
            "id": "hos11kl",
            "score": 100,
            "text": "Is Proxima B on the short list for exoplanet research? Could you describe the images we might see from this planet 4.2 light years away? From my understanding you will be able to tell if there is artificial light, but will we be able to make out any details, or will it be a blurred ball? Thanks for everything you do! My daughter and I are so excited for this!",
            "title_similarity": "0.7043344"
        },
        {
            "id": "hos1img",
            "score": 3,
            "text": "Does something akin to the [Wait Calculation](https://en.wikipedia.org/wiki/Interstellar_travel#Wait_calculation) exist for telescopes?\n\nIf you could build it again today, what would you change, and would it be faster?",
            "title_similarity": "0.61691046"
        },
        {
            "id": "hos1t3v",
            "score": 7,
            "text": "What size is the largest single frame/image that the JWST will be able to capture and how long will it take to transmit one single such frame back to Earth (or another orbiting comms satellite?)",
            "title_similarity": "0.7220316"
        },
        {
            "id": "hos20vt",
            "score": 20,
            "text": "What type of testing was done to ensure that the sunshield will come out properly? I'm guessing you weren't able to test the expansion of the sunshield in a ESS chamber, so did it involve ESS testing the individual pulleys separately? If so, how confident are you that it will work in a similar manner in space? If I remember correctly, one of the major schedule slips had to do with tears in the sunshield that occurred when expanding it. How confident are you that that this won't be a problem again and what resolutions do you have set in place in the event something like this happens?",
            "title_similarity": "0.5551633"
        },
        {
            "id": "hos240z",
            "score": 10,
            "text": "What are you hoping to find and explore with the newer telescope that its predecessors couldn't?\n\nAs someone who's very fascinated by astronomy, I can't wait to learn more about outer space as a whole which couldn't be possible without your hard work!",
            "title_similarity": "0.7778676"
        },
        {
            "id": "hos261m",
            "score": 6,
            "text": "What kind of testing happens pre-launch to engineer the 2-week unfolding process and ensure no problems occur? In space, how do you confirm that everything unfolded as expected on the telescope?",
            "title_similarity": "0.6430155"
        },
        {
            "id": "hos2aml",
            "score": 28,
            "text": "Somewhat technical questions about the reaction wheels because I'm really curious about them.\n\nWhen unloading the reaction wheels, are there any methods or tricks used to minimize the amount of fuel needed to do so? Or is the remaining angular momentum so small after a maneuver (or many maneuvers, or outside influences whatever those may be) that the amount of fuel needed is basically nothing at all?\n\nAnd when it does eventually run out of fuel, is there a plan for how to most efficiently use the reaction wheels and minimize saturation, potential oscillation, or even damage? Or is that so far in the future that you don't worry about it (there will be refueling methods, we'll have a better telescope by then, etc)? Or is there something besides fuel that can somehow be used to unload the wheels?\n\n~~Can I see a picture of one of the reaction wheels?~~\n\nSorry if this is a lot of questions.\n\n^(PS because I can't help myself: What's the angle between how far toward and away from the sun it is allowed to point? I'm curious how much sky it can actually look at at any point in the year and how long it has to wait before it can look at something.)",
            "title_similarity": "0.41056907"
        },
        {
            "id": "hos2dfk",
            "score": 1,
            "text": "What is your plan b if the launch fails to position the JWST at L2? Is it usable at LEO?",
            "title_similarity": "0.5045419"
        },
        {
            "id": "hos33zq",
            "score": 1,
            "text": "I'm even nervous about it, how nervous are the experts for it all working correctly ?",
            "title_similarity": "0.37503862"
        },
        {
            "id": "hos36i5",
            "score": 2,
            "text": "Are there any plans for potential repairs or modifications post-launch? Its orbit is further than any human possible repair mission, but are there any ideas/plans to see a satellite docking or cubesat mission ever? Thanks for all the work you guys have done! Inspiring stuff truely!!",
            "title_similarity": "0.7608044"
        },
        {
            "id": "hos3a9o",
            "score": 16,
            "text": "The telescope is designed to see infrared, but is it able to see visible light just as well? Will we see close up objets (eg Trappist) in a weird infrared way?",
            "title_similarity": "0.39817613"
        },
        {
            "id": "hos3ea5",
            "score": 6,
            "text": "Congratulations and good luck! \nHow will data from the Webb be disseminated? Is it all publicly available or will only certain data be made public? Thanks!",
            "title_similarity": "0.46208036"
        },
        {
            "id": "hos3eoo",
            "score": 2,
            "text": "What do you think is the significant gain for mankind in uncovering the deep and obscure parts of the universe? I personally think that exploring and studying the universe is really cool but with my limited experience, I see regular people care less about the mysteries and wonders of the universe.",
            "title_similarity": "0.52879906"
        },
        {
            "id": "hos3h0j",
            "score": 2,
            "text": "Do you prepare contingency plans for when things go wrong, e.g. one of the hundreds of things that should unfold not unfolding properly? What are these preparations like?",
            "title_similarity": "0.33442876"
        },
        {
            "id": "hos3mvv",
            "score": 1,
            "text": "Glad to see this launch happening at last!! What's your best case scenario for the first few days of operation in space, and what's your worst case scenario? What are you most hoping to discover? Thanks for taking the time to do this AMA!",
            "title_similarity": "0.7060934"
        },
        {
            "id": "hos3o76",
            "score": 2,
            "text": "Really curious to know how one can learn about astronomy for beginners? I know there are A LOT of information you can start but for starter wise how can you begin to learn it?",
            "title_similarity": "0.62290883"
        },
        {
            "id": "hos3ppj",
            "score": 2,
            "text": "What's next for you all? Are you staying on to manage and operate, or are some or all of you going to New projects? What will staying on look like? What cool new projects will you all be working on?",
            "title_similarity": "0.40116537"
        },
        {
            "id": "hos3qfk",
            "score": 6,
            "text": "How will the launch of the telescope affect our understanding on errors about the size of the universe and  cosmic distance ladder measurements?\n\nThe JWST is the successor to the The Hubble telescope i n these regards. What mistake from the Hubble mission would you pick to have learned from in the development on the JWST?\n\nDoes it use a pulsar positioning system to orient and track itself in relation to its observations?",
            "title_similarity": "0.604081"
        },
        {
            "id": "hos3x60",
            "score": 26,
            "text": "Hi!   \nHow is the JWST team doing mentally right now? \n\nI cannot imagine the pressure on you all, what are y'all doing to calm your nerves? \n\nLooking forward to the launch!",
            "title_similarity": "0.49838758"
        },
        {
            "id": "hos441t",
            "score": 1,
            "text": "What is the earliest expected date, when we can see the wonderful pictures it capture?",
            "title_similarity": "0.42560807"
        },
        {
            "id": "hos4j2f",
            "score": 2,
            "text": "when it experiemced a \"sudden and unexpected vibration\" does that mean you guys dropped it?",
            "title_similarity": "0.24103066"
        },
        {
            "id": "hos4qra",
            "score": 1,
            "text": "Hiya, \nDoes Webb have any specific pieces that you’re especially excited about working with?",
            "title_similarity": "0.4253122"
        },
        {
            "id": "hos53zj",
            "score": 1,
            "text": "What are you excited about potentially learning that people aren't talking about?\n\nAlso you guys are amazing. Go NASA!",
            "title_similarity": "0.69988966"
        },
        {
            "id": "hos546h",
            "score": 2,
            "text": "What probability would you give for this telescope to be deployed successfully?",
            "title_similarity": "0.5095806"
        },
        {
            "id": "hos5657",
            "score": 2,
            "text": "This is such an awesome experiment. I have 2 questions: does it have a robot on board to take commands from the ground to fix problems in space? How does it avoid in coming objects such as rocks, debris in those orbit?",
            "title_similarity": "0.65434396"
        },
        {
            "id": "hos590l",
            "score": 7,
            "text": "When will we get first images and what are we going to point it at?",
            "title_similarity": "0.22981475"
        },
        {
            "id": "hos5c4c",
            "score": 57,
            "text": "The Hubble telescope advanced technology in a bunch of fields outside of space exploration, like the advancement of cancer MRI’s. What kind of technological advancements outside of space exploration do you envision being made off of the work completed for the JWST?",
            "title_similarity": "0.57848537"
        },
        {
            "id": "hos5elq",
            "score": 8,
            "text": "How are targets chosen? Is there a predefined schedule already locked in, or does the possiblity to adjust its attention (so to speak) exist in the case of interesting discoveries that warrant further time?",
            "title_similarity": "0.34198487"
        },
        {
            "id": "hos5le0",
            "score": 2,
            "text": "On a scale on one to ten, how does it feel to be at about a billion right now in terms of stress? How do you deal with it? Armchair space enthusiasts like myself are FREAKING OUT right now. Can't imagine the pressure on you guys.\n\nSincerely, thank you for all your work. Best of luck in the coming days.",
            "title_similarity": "0.7137934"
        },
        {
            "id": "hos5srr",
            "score": 1,
            "text": "How much more clear will the images you get from the Webb telescope be compared to previous ones such as Hubble?",
            "title_similarity": "0.50534403"
        },
        {
            "id": "hos5v63",
            "score": 2,
            "text": "Is the mirror the correct shape on this one before launching this time? Lol.   \n \nMy serious question: How long will it take to get signals back and generate full images given the telescope will sit over 1 million kms away? When can we expect to see a released image?",
            "title_similarity": "0.667567"
        },
        {
            "id": "hos5yp1",
            "score": 1,
            "text": "What are the risks of failure for this effort, ranked from most probable scenarios?",
            "title_similarity": "0.2748981"
        },
        {
            "id": "hos6137",
            "score": 1,
            "text": "What were some of the biggest challenges the team faced while creating the telescope",
            "title_similarity": "0.7106466"
        },
        {
            "id": "hos6284",
            "score": 1,
            "text": "What are the most important questions that JW could help you find the answer?",
            "title_similarity": "0.4332822"
        },
        {
            "id": "hos64hy",
            "score": 7,
            "text": "Are you going to try another \"deep field image\" like Hubble did to dazzle us with galaxies?",
            "title_similarity": "0.5803491"
        },
        {
            "id": "hos661z",
            "score": 2,
            "text": "Can't wait for the launch! Really excited about the discoveries it could do and thank you for your hard work! \n\nWhile it might be a bit early, what's going to happen *after* JWST? I can imagine a large part of the team will be dedicated to maintaining the telescope and processing the data while it's up there, but are there plans for the next generation telescope? I imagine the amount of intelligence gathered while building JWST could be really useful for a next gen design.\n\nWish everyone good luck! And in \"hype language\": let's gooooo!",
            "title_similarity": "0.7824413"
        },
        {
            "id": "hos6dov",
            "score": 2,
            "text": "If the first one breaks, how much will it cost to replace it?",
            "title_similarity": "0.23555128"
        },
        {
            "id": "hos6fwt",
            "score": 2,
            "text": "How can you get clear informations from a telescope up in space but my voice call on WhatsApp is often reconnecting?",
            "title_similarity": "0.64233226"
        },
        {
            "id": "hos6rhq",
            "score": 2,
            "text": "What observation technology is the James Webb Space Telescope carrying that no other space  exploration device has? What do we expect to learn with it?",
            "title_similarity": "0.663604"
        },
        {
            "id": "hos6t6c",
            "score": 2,
            "text": "Slightly off topic but the media picked up on the naming of the telescope and that it should be changed because of some allegations against James Webb. Do you have any views? Or it’s just the media stirring some things up",
            "title_similarity": "0.5111964"
        },
        {
            "id": "hos6vtx",
            "score": 6,
            "text": "What kind of breakthroughs in technology made JWST possible?",
            "title_similarity": "0.41867352"
        },
        {
            "id": "hos6w8u",
            "score": 1,
            "text": "What are the odds of it failing after deployment? In case it fails is there a plan B or will the entire project have to be abandonned?",
            "title_similarity": "0.24714673"
        },
        {
            "id": "hos77ew",
            "score": 7,
            "text": "Do you guys have any idea what the early galaxies will look like? Will there be more, bunched up even closer? Will they be in a state of disarray? Will there be galaxies merging and siphoning each other? I can't wait to see what this looks like!",
            "title_similarity": "0.6065456"
        },
        {
            "id": "hos7bx9",
            "score": 5,
            "text": "With the distance making it inaccessible to Astronauts, are there any scenarios where a robotic maintenance mission would be considered?",
            "title_similarity": "0.38194987"
        },
        {
            "id": "hos7o5z",
            "score": 3,
            "text": "What fields outside of cosmology/astrophysics is expected to gain the most from this? I would expect particle physics as well, but anything surprising?",
            "title_similarity": "0.5017202"
        },
        {
            "id": "hos7sbk",
            "score": 3,
            "text": "What kind of computer chips are on board this type of system? How would it compare to my desktop computer?",
            "title_similarity": "0.40136376"
        },
        {
            "id": "hos81ip",
            "score": 3,
            "text": "Given that plans/construction started years ago, is any technology on the JWST essentially “obsolete”? Is there any technology now that that you wish you could go back and add, or have you been adding/modifying things along the way?",
            "title_similarity": "0.36647797"
        },
        {
            "id": "hos8nd7",
            "score": 3,
            "text": "Hi! I was wondering if there will be any way for the public/students/citizen scientists to access any observational data from the JWST?",
            "title_similarity": "0.4356653"
        },
        {
            "id": "hos8oah",
            "score": 2,
            "text": "Y'all are rock stars and should be surrounded by floozies and groupies in my book! What's the most ridiculous thing that's happened during this saga so far, where you all just went \"omg i can't believe that just happened?\"",
            "title_similarity": "0.65071553"
        },
        {
            "id": "hos8w91",
            "score": 2,
            "text": "Do you have a spare?",
            "title_similarity": "0.01788355"
        },
        {
            "id": "hos8xue",
            "score": 2,
            "text": "Is there a published list of who gets telescope hours?",
            "title_similarity": "0.40259093"
        },
        {
            "id": "hos94rd",
            "score": 6,
            "text": "How will you handle space debris from hitting it while it is in operation?",
            "title_similarity": "0.5213388"
        },
        {
            "id": "hos97mj",
            "score": 2,
            "text": "First of all, you and your team are heroes. Don't ever think anything less of yourselves. This is a monumental and generational accomplishment, thank you so, so much. I am very excited to see the results.\n\nFor my question, what are the options for repairs should something go awry in the future with JWST?",
            "title_similarity": "0.6064265"
        },
        {
            "id": "hos97y0",
            "score": 1,
            "text": "What is the probability that the telescope will outlast the mission target 10 yrs ?",
            "title_similarity": "0.52248883"
        },
        {
            "id": "hos991l",
            "score": 2,
            "text": "Are project's planned in which we use both Hubble and James to study the same objects? Such that we can learn more about past Hubble studies? A reference/comparison scientists can use to inference?",
            "title_similarity": "0.29817724"
        },
        {
            "id": "hos9fve",
            "score": 2,
            "text": "What could you see on Earth if you pointed it this way? Could you see if a penny was heads or tails?",
            "title_similarity": "0.123238325"
        },
        {
            "id": "hos9olj",
            "score": 391,
            "text": "Is reproducing the famous Hubble Ultra Deep Field photo on the agenda?",
            "title_similarity": "0.48732096"
        },
        {
            "id": "hosa954",
            "score": 7,
            "text": "Now that it is ready to launch how do you plan to fill the void that this project must have occupied for years of your life?  Do you get time off, do you move straight onto the next project, or is the project really just starting for you?",
            "title_similarity": "0.44899544"
        },
        {
            "id": "hosaamw",
            "score": 2,
            "text": "Hi Team, thanks for doing this AMA. My question is, what will JWST’s images “look” like? Will they be similiar to the inherently beautiful imagery from Hubble, or will their beauty need to be interpreted differently?",
            "title_similarity": "0.37354553"
        },
        {
            "id": "hosadeo",
            "score": 2,
            "text": "Not a question you want to be asked or answer but, what is the probability of a successful launch and deployment of the James Webb Telescope? Thanks and good luck!",
            "title_similarity": "0.57117766"
        },
        {
            "id": "hosaevt",
            "score": 3,
            "text": "There has been much talk of how this will image distant objects, but will it have any utility nearer to us? Specifically, would it be able to get us a more clear image of Pluto or further away objects still within our solar system?",
            "title_similarity": "0.5629889"
        },
        {
            "id": "hosalzx",
            "score": 11,
            "text": "Hi! JWST is being sent to L2, but as far as I understand L2 is actually unstable meaning JWST will have to use up its fuel to stay there. If the goal is to shield JWST from the suns light why don’t we just send it farther away or to some other shielded spot that doesn’t require it to use up its fuel so it can last longer?\nThanks!",
            "title_similarity": "0.3961747"
        },
        {
            "id": "hosar70",
            "score": 4,
            "text": "Does the Webb unfold near earth while on its way to its destination or does it get to its destination then unfold? \nAnd a big congratulations to everyone that worked on this. This really is a pinnacle moment in history.",
            "title_similarity": "0.7130366"
        },
        {
            "id": "hosb0y3",
            "score": 3,
            "text": "How long is it expected to be before the public is able to see images that have been taken and adjusted into visible spectrum from this marvel.",
            "title_similarity": "0.44706014"
        },
        {
            "id": "hosbabw",
            "score": 16,
            "text": "Why was the JWST decided to be of this particular size? Could we send a larger telescope up there?",
            "title_similarity": "0.6287162"
        },
        {
            "id": "hosbvwh",
            "score": 4,
            "text": "When the telescope is successfully launched, positioned, and sends back it's first image, how loud will everyone on the team scream with joy? I know I'll be over the damn moon myself, so I can't imagine being an active member of the project.",
            "title_similarity": "0.74454904"
        },
        {
            "id": "hosc4s4",
            "score": 2,
            "text": "Will the JWST be used to take more accurate measurements for the study of relativity? If so what kind of objects/phenomena in space will provide the best insights on relativity for the JWST and what specifically would it look for?",
            "title_similarity": "0.5801821"
        },
        {
            "id": "hoscrs7",
            "score": 8,
            "text": "What's the plan in the worst case scenario of a launch failure with total loss of the satellite?\n\nRebuild and relaunch in 2040?\n\nShrug and move on?",
            "title_similarity": "0.46548092"
        },
        {
            "id": "hoscwnd",
            "score": 2,
            "text": "What will be the differences in what we are able to observe, from ground-based telescopes, to the Hubble, to the James Webb, then hypothetically to placing a telescope just beyond Saturn's orbit as has been discussed?\n\nThank you all for doing this!",
            "title_similarity": "0.69696814"
        },
        {
            "id": "hosd0u4",
            "score": 2,
            "text": "You hear alot about JWST being able to see further than ever before or even examining exoplanets.  \n\nBut what other cool amazing things are planned that we don't hear about as much?",
            "title_similarity": "0.6590166"
        },
        {
            "id": "hosd1lf",
            "score": 3,
            "text": "Is anyone planning to do a similar test a la Hubble deep field? Maybe even pointing to a black empty region from the hubble deep field itself?",
            "title_similarity": "0.3772273"
        },
        {
            "id": "hosd7mz",
            "score": 2,
            "text": "What do you, personally, hope to see?",
            "title_similarity": "0.12932214"
        },
        {
            "id": "hosdez0",
            "score": 2,
            "text": "What is the plan if something goes wrong?",
            "title_similarity": "0.08855958"
        },
        {
            "id": "hosdiy1",
            "score": 27,
            "text": "How much gold is used in the construction of this amazing instrument?",
            "title_similarity": "0.4651184"
        },
        {
            "id": "hosdst4",
            "score": 2,
            "text": "If the worst happens and the rocket blows up on launch. How long do you think it would take to get a JWST-II into space? Would it possible to launch 20 mini-Webb's for the same cost now that we have all the hard stuff mostly figured out?",
            "title_similarity": "0.6759049"
        },
        {
            "id": "hosdu8a",
            "score": 2,
            "text": "What happens if there is an error or the ship explodes? Would you build another and try again?",
            "title_similarity": "0.3899056"
        },
        {
            "id": "hosdv8n",
            "score": 2,
            "text": "How are any of you going to sleep at all between launch and deployment???",
            "title_similarity": "0.41306907"
        },
        {
            "id": "hosfen3",
            "score": 1,
            "text": "If you could quantify your level of nervousness in some humorous fashion, what would it be?",
            "title_similarity": "0.19829173"
        },
        {
            "id": "hosfskm",
            "score": 1,
            "text": "Are there any observation plans in place should it continue to function past it's estimated life span?",
            "title_similarity": "0.2079986"
        },
        {
            "id": "hosfzq6",
            "score": 2,
            "text": "When can we expect the first pictures and how many orders of magnitude of improvement do they promise over hubble?",
            "title_similarity": "0.40967938"
        },
        {
            "id": "hosg62t",
            "score": 1,
            "text": "What are you most anxious about with deployment? The launch damaging it? Any of the hundreds of mechanisms that have to deploy especially worry some?",
            "title_similarity": "0.5419881"
        },
        {
            "id": "hosgk8g",
            "score": 17,
            "text": "While I presume the odds of collision are astronomically low, does someone actively watch for small meteors that could collide for the next decade, or is this a non concern?",
            "title_similarity": "0.4713995"
        },
        {
            "id": "hosgmab",
            "score": 1,
            "text": "“Universe like we’ve never seen it before” which image do the crew wish to capture most from this launch?",
            "title_similarity": "0.660092"
        },
        {
            "id": "hosgnam",
            "score": 2,
            "text": "Will it be far enough away from the Sun to avoid any light interference? Or will there be a sun shade?\n\nPlease excuse any incorrect jargon.",
            "title_similarity": "0.09503654"
        },
        {
            "id": "hosh44u",
            "score": 2,
            "text": "What were the primary reasons behind the delays and cost overruns? How can those issues be mitigated in the future to ensure that we're advancing technologically and scientifically without breaking the bank, so to speak?",
            "title_similarity": "0.4554668"
        },
        {
            "id": "hosh5l8",
            "score": 1,
            "text": "How long will it be before we can start using it for imaging after launch?",
            "title_similarity": "0.45809096"
        },
        {
            "id": "hosh7vy",
            "score": 1,
            "text": "When will we get first images or videos?",
            "title_similarity": "0.229194"
        },
        {
            "id": "hoshxw6",
            "score": 6,
            "text": "JWST has been in development for multiple decades now. What are the largest complications that you've have to deal with during this project due to its duration? Changing administration/science goals, dealing with outdated technology/materials, etc?\n\nAlso, when's the real launch date? /s",
            "title_similarity": "0.64938116"
        },
        {
            "id": "hosi89v",
            "score": 2,
            "text": "If it blows up on the launch pad how pissed would you be and what do you do/where do you go from there?",
            "title_similarity": "0.49755344"
        },
        {
            "id": "hosimbb",
            "score": 2,
            "text": "If I remember correctly, the Hubble Telescope manage to capture the image of a galaxy 10-15 billions light years away. The big bang was approximately 13.8 billions years ago. Is it possible that the JWT could see the big bang or even further ? What are your thoughts on what there is to see that far away ?",
            "title_similarity": "0.61554915"
        },
        {
            "id": "hosit80",
            "score": 2,
            "text": "How confident are you that everything will work as intended? Seems like there is so much stuff that can go wrong from launch until fully operational!",
            "title_similarity": "0.57626116"
        },
        {
            "id": "hosivr4",
            "score": 27,
            "text": "Can you give me a rough explanation of how the Webb will be able to study the atmosphere of exoplanets?",
            "title_similarity": "0.57953846"
        },
        {
            "id": "hosj9ll",
            "score": 1,
            "text": "What does a project manager or deputy director of New Business job entail?",
            "title_similarity": "0.27260107"
        },
        {
            "id": "hosjf4z",
            "score": 1,
            "text": "Been looking forward to this for years now! I believe it will take several weeks/months to fully assemble, so when can we expect to see its first images?",
            "title_similarity": "0.50597966"
        },
        {
            "id": "hosjf7m",
            "score": 2,
            "text": "After the Webb is in position, and all of those moving parts have deployed perfectly, is there any way to recall it back closer to Earth for service from a crewed mission?",
            "title_similarity": "0.5955764"
        },
        {
            "id": "hoskcbj",
            "score": 2,
            "text": "Did you carry out any probabilistic analysis (fault trees/event trees) to study the reliability of the systems?",
            "title_similarity": "0.25390467"
        },
        {
            "id": "hoskhrx",
            "score": 1,
            "text": "What expectations do you have for the most game changing discovery?\n\nThanks for your work.",
            "title_similarity": "0.43255585"
        },
        {
            "id": "hosm92e",
            "score": 1,
            "text": "How well resolutioned picture will it be able to take of a galaxy about 1 billion ly away?",
            "title_similarity": "0.513839"
        },
        {
            "id": "hosn8qi",
            "score": 9,
            "text": "A question for Karl Saad: What was Canada's contribution to this project?",
            "title_similarity": "0.26601693"
        },
        {
            "id": "hoso2i2",
            "score": 1,
            "text": "What are you most excited to see from the telescope from a scientific perspective? How about just from a visual wow-factor?",
            "title_similarity": "0.66677797"
        },
        {
            "id": "hosoirt",
            "score": 1,
            "text": "I’ve heard years ago that the new tech JWST carries is able to more accurately measure the atmospheres of distant planets in certain conditions. If it comes back with an unexpected result that matches our expectation of life’s impact on the atmosphere, how certain could we be that it’s caused by an alien species or otherwise? \n\nNow that we have the accuracy and range JWST provides I’m wondering if our best guess at probabilities of there being life on certain planets will go up, though I know scientists have always been proposing other explanations for oddities in findings like that.",
            "title_similarity": "0.65907896"
        },
        {
            "id": "hosopzn",
            "score": 1,
            "text": "Hi ! You mentioned the studies of early stars and galaxies; Is the scientific community's waiting for specific images to confirm theorized phenomenons (like when they finally photographed a black hole) ? If so, would you care to explain these like a ELI5 :)\n\nBtw, AWESOME AMA !!",
            "title_similarity": "0.71694463"
        },
        {
            "id": "hosoqh7",
            "score": 1,
            "text": "Of all the technology developed for JWST, what advancement do you think will be most important for future projects?",
            "title_similarity": "0.52059305"
        },
        {
            "id": "hosp2pt",
            "score": 3,
            "text": "Now that it's completely built, how much of a deal would it be to build a second identical telescope?\n\nAnd would science benefit from having two identical telescopes?",
            "title_similarity": "0.66387296"
        },
        {
            "id": "hospf6n",
            "score": 1,
            "text": "If you turned it on Earth, at what resolution would you be able to see things? Would it be possible to see an ant on a sidewalk?",
            "title_similarity": "0.15933138"
        },
        {
            "id": "hospf93",
            "score": 2,
            "text": "What is the long-term plan for the Lockheed testing site near Santa Cruz, California?\n\nIt is home to 2 species of manzanita found only on the property, as well as a few other rare wildflowers. It would be a real shame if it were sold to developers when Lockheed shuts it down.",
            "title_similarity": "0.43898833"
        },
        {
            "id": "hospfjx",
            "score": 2,
            "text": "In the hubble telescope there is an option to maintain its cameras, add more powerful cameras etc, where as for webb as it will be one million miles away from earth will that option be available? if not what will be the life of such a costly engineering marvel? would be great if you could enlighthen",
            "title_similarity": "0.7384458"
        },
        {
            "id": "hospo32",
            "score": 1,
            "text": "Given the complexity of deploying in space, and the fact that we won't be able to send a shuttle to fix anything once it is on it's way. Was there ever consideration of launching it into lunar orbit first where we could feasibly reach it, deploy it there to ensure everything is correct, and then performing a burn to set course for L2?  What would be the major drawbacks of this approach?",
            "title_similarity": "0.6045444"
        },
        {
            "id": "hospqf0",
            "score": 3,
            "text": "I don’t have a particular question in mind right now, but I just want to wish you all the best. Godspeed to your team and JWST!",
            "title_similarity": "0.368237"
        },
        {
            "id": "hospsfk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.054252036"
        },
        {
            "id": "hosq7zk",
            "score": 2,
            "text": "What happens if there are complications in part of the unfolding process?  Other than the decades of preparation for a hopefully flawless execution, is there any contingency plan for malfunction?\n\nIs there any scenario in which a crewed mission could somehow intercept the telescope in the future?\n\nWho is the best actor of all time, and why is it Nicholas Cage?",
            "title_similarity": "0.66763663"
        },
        {
            "id": "hosqbzb",
            "score": 1,
            "text": "I have been following JWST and am super interested / worried I am also extremely interested as a high school student to do something in astrophysics, what would you recommend doing to get the opportunity to work on something as amazing as JWST.\n\nThanks for doing this!",
            "title_similarity": "0.6938814"
        },
        {
            "id": "hosqg10",
            "score": 1,
            "text": "I want to wish you all good luck with the launch.  I truly and I honestly mean this, I have never been as excited or nervous for a launch ever. I cannot imagine what emotions you all are going through. \n\nMy question is. What is the first thing you plan on focusing on once it's up and running and why?",
            "title_similarity": "0.6564567"
        },
        {
            "id": "hosqr7t",
            "score": 1,
            "text": "How stressed are you guys now?",
            "title_similarity": "0.13254476"
        },
        {
            "id": "hosqrvt",
            "score": 1,
            "text": "No question.  Just wanting to let the team know how much I personally appreciate the work and energy put into this project. The end product will produce information and push progress for our species.  Good luck on launch and final placement!",
            "title_similarity": "0.5402671"
        },
        {
            "id": "hosr2i5",
            "score": 1,
            "text": "Is there anything about the telescope that you see now and “say we should have done this differently”?\n\nAlso what are the mirrors made of and who made them and how were they made?",
            "title_similarity": "0.48449984"
        },
        {
            "id": "hosr9lr",
            "score": 2,
            "text": "What do you tell the people who ask \"why?\"",
            "title_similarity": "0.090916455"
        },
        {
            "id": "hosrklf",
            "score": 1,
            "text": "Will the general public be able to see the images captured by the telescope?",
            "title_similarity": "0.4224168"
        },
        {
            "id": "hosrov7",
            "score": 1,
            "text": "Did you really drop it?",
            "title_similarity": "-0.013674481"
        },
        {
            "id": "hosrvc9",
            "score": 1,
            "text": "You nervous? If yes how much? (I mean slight stomach churning kind of exciting nervousness vs lose your sleep and every second which passes is agony type of nervousness?)",
            "title_similarity": "0.33404112"
        },
        {
            "id": "hoss3iq",
            "score": 6,
            "text": "Hi! I'm somewhat familiar with the engineering work that goes into spacecraft, and in particular I'm wondering how one-off pieces of hardware like those in JWST are \"qualified\" to survive the rigours of launch and the environmental hazards that it will operate i\nAmongst. Typically I understand that space hardware has a duplicate item go through this testing. How does one correctly perform the tests on irreplaceable (maybe it's not irreplaceable) hardware, such as the mirror segments on the telescope?\n\nThanks so much! I'm looking forward to watching your work reach orbit on the 24th.",
            "title_similarity": "0.73219585"
        },
        {
            "id": "hoss5lf",
            "score": 7,
            "text": "Hi! I'm a massive fan of the JWST program and I've been following your progress for a while! In fact, this project is older than I am, and I am studying engineering in college!\n\nCan you tell me of one or two difficult engineering decisions you had to make during the course of the program?\n\nThank you so much!",
            "title_similarity": "0.6348938"
        },
        {
            "id": "hossp9l",
            "score": 3,
            "text": "Now that the JWST is complete, how much would it cost to build a second one?",
            "title_similarity": "0.36410654"
        },
        {
            "id": "hossxxf",
            "score": 2,
            "text": "Consodering the Hubble's tough start, what is your most realistic estimation for successful launch and deployment? I'm terrified for how complex the process will be, and the lagrange location (no chance to repair)",
            "title_similarity": "0.5741202"
        },
        {
            "id": "host6bo",
            "score": 1,
            "text": "So the telescope is ready to launch now but it’s waiting until December 24th? Are you saying that Big Christmas is behind this intentional delay?",
            "title_similarity": "0.5069364"
        },
        {
            "id": "hostkyj",
            "score": 1,
            "text": "When we will see the first images from the JWST?",
            "title_similarity": "0.29873717"
        },
        {
            "id": "hostngf",
            "score": 1,
            "text": "Will there be 8k Quality Space Photos, I can't wait for new wallpapers 😁",
            "title_similarity": "0.50319207"
        },
        {
            "id": "hosto9f",
            "score": 2,
            "text": "What are the unique biosignatures or technosignatures that the JWST will be able to see better than existing infrastructure?\n\nIs the schedule for the next 5 years already allocated more or less completely?",
            "title_similarity": "0.42733628"
        },
        {
            "id": "hostoqu",
            "score": 2,
            "text": "I'm waiting for an optical telescope built on the same design as the JWST.  Wouldn't that blow Hubble out of the sky?",
            "title_similarity": "0.58683586"
        },
        {
            "id": "hostsa0",
            "score": 2,
            "text": "How do you get the mirror so big and also so clear?",
            "title_similarity": "0.35990888"
        },
        {
            "id": "hosu5jl",
            "score": 6,
            "text": "Are you guys going to look into Tabby’s star?",
            "title_similarity": "0.38259286"
        },
        {
            "id": "hosu6v8",
            "score": 1,
            "text": "Will you be able to see me using my bathroom from space? Thanks.",
            "title_similarity": "0.39255998"
        },
        {
            "id": "hosuabn",
            "score": 2,
            "text": "I understand all instruments are able to work in parallel, how is that accomplished? Is the light somehow distributed to each instrument?",
            "title_similarity": "0.42756093"
        },
        {
            "id": "hosuaot",
            "score": 1,
            "text": "Why, of all the designs in the world, was it made to look like an Empire Star Destroyer from the bottom?",
            "title_similarity": "0.6132548"
        },
        {
            "id": "hosubem",
            "score": 2,
            "text": "If by chance just a slight malfunction renders the telescope useless and can be easily fixed(like hubble)\nWould nasa be able to send astronauts that far?",
            "title_similarity": "0.5904954"
        },
        {
            "id": "hosubpb",
            "score": 3,
            "text": "Can you give a boiled down explanation - like you're telling to a five year old - of why the telescope is such a big deal and what advances / new knowledge it will bring \n\nAnytime something big like this happens in the science world it's constantly proliferated in sensational articles that use it as nothing more than click bait and completely fail to inform the general public if it's significance.",
            "title_similarity": "0.68385714"
        },
        {
            "id": "hosugot",
            "score": 1,
            "text": "Do you wanna get dinner sometime?",
            "title_similarity": "0.12649499"
        },
        {
            "id": "hosukjx",
            "score": 1,
            "text": "Will JWST do a deep field picture in the same direction as Hubble so we can compare their pictures? I think this would be a great way to showcase the abilities and differences in the two telescopes.",
            "title_similarity": "0.52658236"
        },
        {
            "id": "hosuqrm",
            "score": 1,
            "text": "Will the telescope also look back at our solar system from this new perspective?",
            "title_similarity": "0.47361133"
        },
        {
            "id": "hosut6a",
            "score": 1,
            "text": "What do you think this telescope will discover first? I’m super interested in the dark matter and invisible galaxies that can only be seen with such an amazing powerhouse of a telescope.",
            "title_similarity": "0.71999633"
        },
        {
            "id": "hosuyhw",
            "score": 2,
            "text": "Hey, I'm here from the broadcast crew at GSFC. We just recorded our interview with Dr. John Mather today (which we plan on integrating into the launch coverage), and hopefully we see a few of you with us on launch day ;)\n\nAnyways, as for my question: While the increased capabilities of Webb will allow us to discover distant objects we've never seen before, it'll also help with objects we've observed in the past, but in greater detail. If you had to narrow it down to just a few things, what are some of the biggest questions of distant stars and planets previously observed with Hubble that you hope to now be able to answer with Webb?",
            "title_similarity": "0.7088421"
        },
        {
            "id": "hosv2hp",
            "score": 2,
            "text": "Is Hubble really mostly \"just\" an inverted Keyhole spy satellite? Or is that tenacious rumor just internet nonsense?\n\nIf (partly) true, can the same be (partly) said about the Webb?",
            "title_similarity": "0.41908193"
        },
        {
            "id": "hosv6cz",
            "score": 2,
            "text": "If James Webb is the telescopes secret identity, what would you give as the superhero name?",
            "title_similarity": "0.45732224"
        },
        {
            "id": "hosvblq",
            "score": 1,
            "text": "what are you expecting to find and what do you hope to see? are you going to observe any certain planets?",
            "title_similarity": "0.42084348"
        },
        {
            "id": "hosw7rc",
            "score": 2,
            "text": "If we were to build another one, with today's tech, now, how  much better would it be compared to the current JW ?",
            "title_similarity": "0.4256353"
        },
        {
            "id": "hoswacv",
            "score": 2,
            "text": "Can you take pictures of the moon?",
            "title_similarity": "0.4785612"
        },
        {
            "id": "hoswoel",
            "score": 1,
            "text": "Over the next two months - what events are you most concerned about? What are the biggest risks facing JWST?",
            "title_similarity": "0.41842562"
        },
        {
            "id": "hosx4uv",
            "score": 1,
            "text": "What sort of sensors do you use to make sure that things get deployed correctly? Is there a selfie cam on JWST?",
            "title_similarity": "0.31647623"
        },
        {
            "id": "hosx80r",
            "score": 1,
            "text": "What's the first photo you guys are planning to take?",
            "title_similarity": "0.25577274"
        },
        {
            "id": "hosxspm",
            "score": 1,
            "text": "What would you say is the most important goal of the James Webb? The most exciting assignment that everyone has their fingers crossed for?",
            "title_similarity": "0.5999814"
        },
        {
            "id": "hosy0om",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "-0.04217322"
        },
        {
            "id": "hosy3nu",
            "score": 1,
            "text": "What makes the Webb telescope different from other telescopes? How come it is able to see more? \n\nThanks for doing this AMA!! :) This is exciting :D",
            "title_similarity": "0.595964"
        },
        {
            "id": "hosyb3o",
            "score": 1,
            "text": "What is the plan when Webb can no longer maintain orbit around L2?",
            "title_similarity": "0.3793589"
        },
        {
            "id": "hosyc9c",
            "score": 1,
            "text": "Will james webb need more time to collect photons  than hubble? Regardless of the object observed.",
            "title_similarity": "0.37018347"
        },
        {
            "id": "hosymva",
            "score": 1,
            "text": "What is the expected bandwidth (kbps\\mbps\\gbss) from the JWST to the control center?",
            "title_similarity": "0.37527108"
        },
        {
            "id": "hosyrl1",
            "score": 1,
            "text": "I have heard that the deployment Process is quite intricate, out of all the steps involved which ones are you guys worried about the most?",
            "title_similarity": "0.50997"
        },
        {
            "id": "hosyuk8",
            "score": 1,
            "text": "What do we expect to learn about exoplanets from JWST?",
            "title_similarity": "0.49754858"
        },
        {
            "id": "hosyx2q",
            "score": 1,
            "text": "Would it be feasible to send a fuel tanker in 5 years to extend JWST lifespan?\nWas this possibility considered?",
            "title_similarity": "0.3501336"
        },
        {
            "id": "hosz0yp",
            "score": 1,
            "text": "Are any of you going to be at the launch site? And if so, where's the best lunch spot near there?",
            "title_similarity": "0.36985952"
        },
        {
            "id": "hosz1zg",
            "score": 1,
            "text": "I've heard several types of technologies were invented during the creation of the telescope. What technologies are you most proud of on Webb, or what new technology do you think is the most significant achievement (besides the observatory itself)?",
            "title_similarity": "0.7766181"
        },
        {
            "id": "hosz491",
            "score": 1,
            "text": "Who dropped it?",
            "title_similarity": "-0.01593069"
        },
        {
            "id": "hosz4vw",
            "score": 1,
            "text": "Lifelong space enthusiast here, I cannot you how excited I am at the JWST finally launching!\n\nWould it be possible to process/handle the volume of data the JWST transmits back with the current storage options available to us?",
            "title_similarity": "0.7995526"
        },
        {
            "id": "hosz7nz",
            "score": 1,
            "text": "When do you believe the general public would be able to see the first pictures from the JWST? From what I read, it’ll take about a monthish in ‘unpack’ and get into its orbit? Does this mean we could see pictures by the end of Jan 2022?",
            "title_similarity": "0.4717468"
        },
        {
            "id": "hoszaat",
            "score": 1,
            "text": "Cosmological constant problem. What can the JWST do? And what's going on with Tabby's star?",
            "title_similarity": "0.5183487"
        },
        {
            "id": "hoszapj",
            "score": 1,
            "text": "What would we see if we pointed the JWST at a star like Betelgeuse that was about to go supernova, or just after? What would it look like and what could we learn from these observations?",
            "title_similarity": "0.5487994"
        },
        {
            "id": "hoszibs",
            "score": 1,
            "text": "I don't have a question, just wanted to say congratulations and amazing job to everyone involved. What a masterpiece. I haven't been this stoked about something for a long time. Good luck!",
            "title_similarity": "0.43169025"
        },
        {
            "id": "hosznoi",
            "score": 1,
            "text": "Once the satellite is fully extended, calibrated, and ready for observations, what is the first thing that is planned on being studied?",
            "title_similarity": "0.55483305"
        },
        {
            "id": "hoszuid",
            "score": 1,
            "text": "How many man-hours went into this project?",
            "title_similarity": "0.33331698"
        },
        {
            "id": "hoszy69",
            "score": 1,
            "text": "The United States has passed Legislation to create a permanent research office to study UAP most common known as UFOs. Will James Web telescope be able to detect and record these objects?",
            "title_similarity": "0.6169288"
        },
        {
            "id": "hot00tx",
            "score": 1,
            "text": "Why did it take so long to build?\n\nNow that we have built the one, can we build another one faster?",
            "title_similarity": "0.42784598"
        },
        {
            "id": "hot096q",
            "score": 1,
            "text": "What are the top 10 things you would point the telescope at first if you could choose? \n\nWhat are the teams views on UFOs?",
            "title_similarity": "0.67503744"
        },
        {
            "id": "hot0wnm",
            "score": 1,
            "text": "Hi all. When that clamp let go earlier this month was any helpful unexpected data gained ? Thanks for all your work.",
            "title_similarity": "0.4772818"
        },
        {
            "id": "hot0yly",
            "score": 1,
            "text": "I have literal anxiety from hoping everything goes ok.   I can only imagine what the folks working on it feel",
            "title_similarity": "0.3854868"
        },
        {
            "id": "hot19x5",
            "score": 1,
            "text": "In the case there is a malfunction of come sort after the JWST has reached its destination, would a mission to repair the telescope be 100% out of the question? How long would it take to get there if we did decide to go and fix any issues? (Knock on wood)\n\nThanks!",
            "title_similarity": "0.61051226"
        },
        {
            "id": "hot1krr",
            "score": 1,
            "text": "Will the JWST help us in better understanding dark matter and/or dark energy? If yes, how? What kind of observations would help? And if not, what is the coolest thing you are awaiting data on?",
            "title_similarity": "0.4990465"
        },
        {
            "id": "hot1r5k",
            "score": 1,
            "text": "Just how nervous are you that something will go wrong?  What a nail biter!",
            "title_similarity": "0.24002478"
        },
        {
            "id": "hot2gof",
            "score": 1,
            "text": "Space has fascinated me since young and becoming an astrophysicist has always been a childhood dream. I've just finished high school and have yet to enter college or university. What do I have to do to achieve this dream, and what are my odds of doing so?",
            "title_similarity": "0.6198134"
        },
        {
            "id": "hot2x09",
            "score": 1,
            "text": "Webb is about to change our lives !! \nThis is how we “officially makes contact with Aliens”",
            "title_similarity": "0.6287869"
        },
        {
            "id": "hot338j",
            "score": 2,
            "text": "Why did this thing cost 10 billion? Can we put together more of these observatories down the road for much cheaper? The reason why I ask this is because I worry that such pieces of technology seem to be affordable only once in a while when we could most definitely use more of them.",
            "title_similarity": "0.5271106"
        },
        {
            "id": "hot3ey9",
            "score": 1,
            "text": "What was the rationale for the chosen orbit?\n\nIt is going to orbit close to L2, a stable orbit colinear with the earth and sun. I'd understood this was to use the earth to shield interference from the sun. I was surprised to learn the craft was solar powered and would therefore need to orbit around L2 to stay in sunlight.\n\nIs there still some shielding effect from earth's magnetic field or was the orbit chosen for other reasons entirely?\n\nWas there any consideration given to a nuclear power craft orbiting at L2, availing of the full earth shielding effect?",
            "title_similarity": "0.56579524"
        },
        {
            "id": "hot3lhu",
            "score": 1,
            "text": "If all goes well, with no more delays, how long will it be before we can expect the first images from the JWST? And once in action, what can we expect beyond what we've already seen with Hubble?",
            "title_similarity": "0.40408814"
        },
        {
            "id": "hot3ss6",
            "score": 1,
            "text": "What were some of the interesting engineering challenges that had to be overcome for this project?",
            "title_similarity": "0.44980842"
        },
        {
            "id": "hot3zoh",
            "score": 1,
            "text": "If it fails to deploy, is there any chance that failure will finally make NASA stop funding these expensive multi-decade one-off projects, or will they just continue with this slow, expensive high-risk model reguardless?",
            "title_similarity": "0.55760413"
        },
        {
            "id": "hot41g1",
            "score": 1,
            "text": "how far can we look into the hidden corners of the universe than before?",
            "title_similarity": "0.36405247"
        },
        {
            "id": "hot4289",
            "score": 1,
            "text": "What’s one research project that each of Webb’s four instruments will contribute to? Will the instruments typically work in concert, or could different objectives be studied at the same time? Or am I completely misunderstanding how astronomical data is gathered",
            "title_similarity": "0.5361492"
        },
        {
            "id": "hot4561",
            "score": 1,
            "text": "ok so i often see extreme protective measures for those mirrors, clean room protocol etc - but i have a hard time believing its even possible to keep every last microscopic particle from hitting the mirrors, all the way into space.  so how critical is it if we use the telescope and discover a tiny fleck of dust is one one of the mirrors?",
            "title_similarity": "0.67597675"
        },
        {
            "id": "hot456r",
            "score": 1,
            "text": "What will the JWST be able to do to give us more accurate estimates of the density parameters of the universe, as well as the deceleration parameter?",
            "title_similarity": "0.478018"
        },
        {
            "id": "hot4664",
            "score": 1,
            "text": "Given the amount of money invested in this telescope, is there really no future plans to service the JWST like what was done to Hubble to extend its life multiple times?",
            "title_similarity": "0.6161876"
        },
        {
            "id": "hot4erh",
            "score": 1,
            "text": "What achievements will you promise after the launch of JWST? Thanks",
            "title_similarity": "0.4045499"
        },
        {
            "id": "hot4ewd",
            "score": 3,
            "text": "Good luck I love you all",
            "title_similarity": "0.26147056"
        },
        {
            "id": "hot4ne0",
            "score": 1,
            "text": "Where will we be able to find the photos it takes?",
            "title_similarity": "0.13765016"
        },
        {
            "id": "hot4ok2",
            "score": 1,
            "text": "Hey JWST Team, I love you and your giant brains. I live vicariously through you and thank you for embarking on this extraordinary journey that I can be a part of.\n\nCan the telescope record/view images not only from outside our solar system, but also perhaps the Andromeda Galaxy or the Local Cluster?\n\nWhat about black holes, even Sagittarius A the one at the center of our galaxy?\n\nWill the telescope aid in finding/proving dark matter or other cool space things that have only been theorized?\n\nWhy is the primary mirror \"iconic\" as you put it?\n\nThank you 🥰",
            "title_similarity": "0.80990577"
        },
        {
            "id": "hot4t5r",
            "score": 1,
            "text": "How long will it take to get a single image back? Like what's the exposure and processing time?",
            "title_similarity": "0.20657316"
        },
        {
            "id": "hot4wg1",
            "score": 1,
            "text": "As read, or at least as i remember what i read, the telescope is 10x stronger than Hubble. Does that mean we will be able to see the nearest star to us as we see the sun? Or would it at least be able to capture a picture of a planet of another solar system as clear as the photos of Jupiter and Saturn in the 70's or 80's?\n\nThank you and god speed.",
            "title_similarity": "0.70691544"
        },
        {
            "id": "hot4y01",
            "score": 1,
            "text": "How many applications from astronomers are lined up for the use of the telescope and what are the basis for a project to be selected over the others? How long usually will be the alloted time for a proposal?",
            "title_similarity": "0.6095287"
        },
        {
            "id": "hot504i",
            "score": 1,
            "text": "1. Will it be able to solve current astronomy puzzles humans ask more and more often?",
            "title_similarity": "0.56998205"
        },
        {
            "id": "hot52ub",
            "score": 1,
            "text": "Do you have an opinion on ufos now that the us government confirmed it’s real ?",
            "title_similarity": "0.51925224"
        },
        {
            "id": "hot59xs",
            "score": 1,
            "text": "If it sees aliens, could you guys just accidentally leak the photos online? Asking for a friend.",
            "title_similarity": "0.4209032"
        },
        {
            "id": "hot5a3k",
            "score": 1,
            "text": "What challenging part of the JWST are YOU specifically proud of?",
            "title_similarity": "0.33821696"
        },
        {
            "id": "hot5jqn",
            "score": 1,
            "text": "So i've heard JWST will be able to study exoplanet atmosphere compisitions, but how exactly? We can't even see exoplanets, we only detect them by them making their star's brightness go down by a miniscule amount. Wouldn't the sensors just be overwhelmed by the parent star which is hundreds of millions of times brighter?",
            "title_similarity": "0.61608744"
        },
        {
            "id": "hot5oya",
            "score": 1,
            "text": "I'm so freaking excited for this launch!  You're all amazing people doing incredible work!\n\nIs there an object or thing that you are most excited about viewing?",
            "title_similarity": "0.6120517"
        },
        {
            "id": "hot65my",
            "score": 1,
            "text": "Does the Webb have any external cameras looking at itself, so we can see video of it deploying all it's components? If not I'm real time, at least in some cool footage",
            "title_similarity": "0.52260524"
        },
        {
            "id": "hot67hs",
            "score": 1,
            "text": "How much of the sky can JWST pan around/observe at a time before the sunshield is unable to prevent the critical instruments from being exposed? Will that affect some observation arcs by having to wait for its orbit around the sun to change?",
            "title_similarity": "0.45849055"
        },
        {
            "id": "hot68cn",
            "score": 1,
            "text": "What kinds of information will the JWST be able to glean from exoplanets? Do you intend to study any expoplanets in the \"goldilocks zone\" for potential signs of life? Or for environments potentially suitable for life as we know it?",
            "title_similarity": "0.5304458"
        },
        {
            "id": "hot6m4g",
            "score": 1,
            "text": "I think I understand how it works, but I’ve always wanted to know. \n\nWhen you are taking pictures of the solar system, they aren’t traditional pictures that we take right? Like y’all don’t just see, on a screen, an earth like planet 2 solar systems away right? \n\nCan you explain how that process works?",
            "title_similarity": "0.6080661"
        },
        {
            "id": "hot6n0l",
            "score": 1,
            "text": "Any possibility of detecting primordial black holes?",
            "title_similarity": "0.3984246"
        },
        {
            "id": "hot6n9z",
            "score": 1,
            "text": "If you could launch the JSWT on a rocket as big as the SpaceX Starship, could the telescope itself be much cheaper because it would require less advanced folding to fit inside the fairing?",
            "title_similarity": "0.64689004"
        },
        {
            "id": "hot6oh3",
            "score": 1,
            "text": "Will it be used in interferometry in tandem with other telescope(s)? Or is it redundant?",
            "title_similarity": "0.43719113"
        },
        {
            "id": "hot6oq7",
            "score": 1,
            "text": "What are the probabilities of failure during deployment?",
            "title_similarity": "0.17501265"
        },
        {
            "id": "hot6sbx",
            "score": 1,
            "text": "Will you be able to use gravitational lensing as was utilized with Hubble? Is that an effective technique with IR telescopes? Thanks!",
            "title_similarity": "0.59614587"
        },
        {
            "id": "hot6xs1",
            "score": 1,
            "text": "Is it theoretically possible to observe extraterrestrial bio-markers or byproducts of another civilization with the sensor suite?",
            "title_similarity": "0.44819355"
        },
        {
            "id": "hot6yw4",
            "score": 1,
            "text": "In dumb me terms, how much better is this telescope than the Hubble telescope",
            "title_similarity": "0.4721101"
        },
        {
            "id": "hot73ol",
            "score": 1,
            "text": "When will this goddamn thing finally go to space?",
            "title_similarity": "0.52014685"
        },
        {
            "id": "hot73rq",
            "score": 1,
            "text": "Why was this design chosen? What came first, design or engineering?",
            "title_similarity": "0.313523"
        },
        {
            "id": "hot761y",
            "score": 1,
            "text": "Hello, first of all... Good luck with the mission since it's getting really close to the launch. Now, my question, what if a foreign object (ex. micrometeorite) hit the mirrors? How would that affect the mission? Thank you and sorry for my English. Greetings from Czech Republic.",
            "title_similarity": "0.59187865"
        },
        {
            "id": "hot7jvw",
            "score": 1,
            "text": "What are the challenges that come with zero g engineering? And having to test on earth with earth's gravity?",
            "title_similarity": "0.5769156"
        },
        {
            "id": "hot7qxs",
            "score": 1,
            "text": "Are you people looking into the *Methuselah star?* It's history is literally crazy and I'm curious about this part...",
            "title_similarity": "0.5758405"
        },
        {
            "id": "hot7rmm",
            "score": 1,
            "text": "Will this telescope allow us to see further into the universe/as far as light allows or will it just allow for more detailed pictures of these far away galaxies?",
            "title_similarity": "0.5434545"
        },
        {
            "id": "hot7s09",
            "score": 1,
            "text": "That woud make for one extraordinarily expensive explosion",
            "title_similarity": "0.47206092"
        },
        {
            "id": "hot7umt",
            "score": 1,
            "text": "So, you are saying that's it is really happening? No more postponding?",
            "title_similarity": "0.15497015"
        },
        {
            "id": "hot7yr1",
            "score": 1,
            "text": "Just a quick question. Just how do you handle the fact that you are collectively, the most badass and simultaneously the most beautiful people on the planet?\n\nSeriously, thank you for creating such a marvel of science.",
            "title_similarity": "0.66273963"
        },
        {
            "id": "hot8dtb",
            "score": 1,
            "text": "I saw the reflector sheets are thin and folded. How will they survive if get hit by space debris. Sorry for bad English.",
            "title_similarity": "0.48897338"
        },
        {
            "id": "hot8i8b",
            "score": 1,
            "text": "If (touch wood) anything goes south, and JWST is lost during launch, how much time would it take to re-create it, and how much money would it need?\n Would the fact that we already know how to build it decrease these significantly?",
            "title_similarity": "0.40047622"
        },
        {
            "id": "hot8j3q",
            "score": 1,
            "text": "What is a potential discovery that would be mind-blowing for the general public, but expected or unalarming for researchers and your team?",
            "title_similarity": "0.35619515"
        },
        {
            "id": "hot8shg",
            "score": 1,
            "text": "If we point it at proxima, will it be able to see any sort surface details of any planets or will these still just be points of light?",
            "title_similarity": "0.41443163"
        },
        {
            "id": "hot8u4y",
            "score": 1,
            "text": "Were there plans to upgrade computers as time went along in design process? It seems ridiculous to build an advanced Instrument such as the JWST based on 1990's technology. If not, is this something that will be designed into future projects?",
            "title_similarity": "0.45520794"
        },
        {
            "id": "hot8vpr",
            "score": 1,
            "text": "Will the JWST look at the Trappist system? And if so, when?",
            "title_similarity": "0.22345832"
        },
        {
            "id": "hot94wz",
            "score": 1,
            "text": "Hi,\n\nI seen in the comments you are limited by fuel... are there not resupply fuel missions in the pipe line? If not why, just seems like you could get another 10 years use from a refill.\n\n&#x200B;\n\nIs there any chance of you finding this supposedly rogue planet in our solar system?\n\n&#x200B;\n\nDo you have a second telescope built incase this one has rocket problems?\n\n&#x200B;\n\nWhat is the telescopes main objective? Black holes, Finding signs of life...",
            "title_similarity": "0.63681096"
        },
        {
            "id": "hot997z",
            "score": 1,
            "text": "What has helped the most in getting teams spread across the world to work together effectively on a project with so little room for error?",
            "title_similarity": "0.45447662"
        },
        {
            "id": "hot9ddk",
            "score": 1,
            "text": "Super excited for this!",
            "title_similarity": "0.37851357"
        },
        {
            "id": "hot9q6s",
            "score": 1,
            "text": "Considering the rather complex unpacking procedure, when do you expect to get to a point where you can say \"we successfully made it\"",
            "title_similarity": "0.44444507"
        },
        {
            "id": "hota840",
            "score": 1,
            "text": "What are you most excited about with this new telescope?\n\nThe distance it can see?\n\nPlanet atmosphere?\n\nThe unknown things you may find?\n\nSomething else?",
            "title_similarity": "0.71831423"
        },
        {
            "id": "hotac2e",
            "score": 1,
            "text": "My question is for Mei Li Hey. What were her day-to-day tasks as mechanical design engineer for the project? \n\nWish you guys all the best for the launch and everything to come after it. I simply cannot wait for the new chapters that will be written as a result of humans building a 'time machine' and sending it a million miles away from our planet. Godspeed!",
            "title_similarity": "0.73413765"
        },
        {
            "id": "hotb6ka",
            "score": 1,
            "text": "Hi! Two quick questions - \n\n1. Can the telescope be refuelled somehow by a throwaway space craft? \n2. Will this give us colored images?",
            "title_similarity": "0.5973535"
        },
        {
            "id": "hotbmqa",
            "score": 1,
            "text": "Possibly a silly question, although there’re no plans to service the JWST, in the hypothetical situation that technology for a manned mission to reach the L2 point is developed in the near future, would it be possible to service it and extend its life? We all would love to see it lasting decades like the Hubble.",
            "title_similarity": "0.62354046"
        },
        {
            "id": "hotbqpo",
            "score": 1,
            "text": "Do you think that we'll ever find evidence of aliens of any sort?",
            "title_similarity": "0.4447624"
        },
        {
            "id": "hotbr5c",
            "score": 1,
            "text": "If you had had an unlimited budget, what additional features would you have potentially added to this telescope? What are the features that got left on the cutting room floor due to financial constraints (if any), as it were?",
            "title_similarity": "0.6140078"
        },
        {
            "id": "hotbrrs",
            "score": 1,
            "text": "Is there one celestial object that you are really looking forward to seeing that you think might exist but current telescopes just can't see?",
            "title_similarity": "0.4588632"
        },
        {
            "id": "hotbrx2",
            "score": 1,
            "text": "Will JWST be able to do any extrasolar planetary imaging too or is it not built for that? If so, what targets will you aim for first?",
            "title_similarity": "0.5790409"
        },
        {
            "id": "hotbu03",
            "score": 1,
            "text": "I don’t want to jinx the launch, but what are the chances that JWST won’t make it to L2? What are the factors most likely to cause something to go wrong?",
            "title_similarity": "0.36216503"
        },
        {
            "id": "hotc838",
            "score": 1,
            "text": "Are you pessimists when it comes to alien life? Is that something you really think about in regards to this next step forward? Is that going to be one of the first things you consider when turning the lens?",
            "title_similarity": "0.4093637"
        },
        {
            "id": "hotc8dx",
            "score": 1,
            "text": "How are you planning to ever repair or bring back JWST if there's an incident that requires it to happen? and does the JWST have any measures to course correct its orbit if something happens?",
            "title_similarity": "0.40057403"
        },
        {
            "id": "hotco3n",
            "score": 1,
            "text": "This might sound stupid. But if the JWST can see galaxies billions of light years away, could it see close solar systems with higher clarity?",
            "title_similarity": "0.5431813"
        },
        {
            "id": "hotcxsl",
            "score": 1,
            "text": "Can't wait to see what you'll show us. So now the JWST is folded before being launch, did you use any model from nature to work on the folding? What are the \"sheets\", at the base of the JWST, for? Why trianlges? Thank you!",
            "title_similarity": "0.46963263"
        },
        {
            "id": "hotd3uz",
            "score": 1,
            "text": "So the hubble telescope is probably the most influential thing in astronomy for my entire generation. Like there will be pitchforks once it's decided to deorbit it.\n\nAre you expecting James Webb to be as \"influential\" culturally or is this just a instrument for science without much pr potential once launched and operating.",
            "title_similarity": "0.8197465"
        },
        {
            "id": "hotda9e",
            "score": 1,
            "text": "Whos your favorite Star Trek Captain?",
            "title_similarity": "0.5485961"
        },
        {
            "id": "hotdbjl",
            "score": 1,
            "text": "Will there be a first « engineering » image before the first scientific image ?",
            "title_similarity": "0.42759278"
        },
        {
            "id": "hotdc3g",
            "score": 1,
            "text": "What did you have for breakfast",
            "title_similarity": "0.15963677"
        },
        {
            "id": "hotdh2e",
            "score": 1,
            "text": "How can you possibly prioritize the many many possibilities of things to look at and study? There must be so many.",
            "title_similarity": "0.44237092"
        },
        {
            "id": "hotdncf",
            "score": 1,
            "text": "What are you guys most excited to see?",
            "title_similarity": "0.38688517"
        },
        {
            "id": "hotdofh",
            "score": 1,
            "text": "How many of you had heart attacks When the clamp band released early? Is she communicating normally again? Is she going to hit Santa? Will you respond to me and make my entire life? Got any response from Tory Bruno now i need you guys... 😂",
            "title_similarity": "0.49996135"
        },
        {
            "id": "hotet0a",
            "score": 1,
            "text": "How much and what kind of information will Webb be able to analyze from exoplanets? (Atmosphere, size, etc) Will we be able to actually image exoplanets if close enough to Earth in any kind of way?",
            "title_similarity": "0.597492"
        },
        {
            "id": "hotf13x",
            "score": 1,
            "text": "How do you feel about Las Vegas taking options on mission failure?",
            "title_similarity": "0.33803725"
        },
        {
            "id": "hotf7m3",
            "score": 1,
            "text": "How can the general public interested in processing images get access to said data?",
            "title_similarity": "0.27859375"
        },
        {
            "id": "hotfdv2",
            "score": 1,
            "text": "I wonder if it'll be able to detect Earth like planets as they're small and close into the star?",
            "title_similarity": "0.4616491"
        },
        {
            "id": "hotfoji",
            "score": 1,
            "text": "What kind of music do you listen to while working on the telescope?",
            "title_similarity": "0.43833315"
        },
        {
            "id": "hotgcmn",
            "score": 1,
            "text": "Why are you launching it from French Giana",
            "title_similarity": "0.29266492"
        },
        {
            "id": "hoth0vq",
            "score": 1,
            "text": "Is it possible we got it all wrong?  What if we look back 13.6 billion years and see different galaxies that are already 10 billion years old?  Or is our science sure enough that's not possible?",
            "title_similarity": "0.53931725"
        },
        {
            "id": "hoth34n",
            "score": 1,
            "text": "Since the majority of cost for a project of this sort is R&D and expert personnel developing the technology, why not build two sets of hardware side by side like previous programs?",
            "title_similarity": "0.58707213"
        },
        {
            "id": "hothky6",
            "score": 1,
            "text": "maybe a weird question,\n\nbut what is the most advanced thing JWST can do?\n\ngood luck on the launch!",
            "title_similarity": "0.66947484"
        },
        {
            "id": "hothnbk",
            "score": 1,
            "text": "What specific engineering challenge are you proudest to have overcome?",
            "title_similarity": "0.507023"
        },
        {
            "id": "hothts5",
            "score": 1,
            "text": "Will blueprints of the telescope be available, asking for a friend...",
            "title_similarity": "0.47451752"
        },
        {
            "id": "hoti683",
            "score": 1,
            "text": "There is something in the JWST that uses Shape Memory Alloys?",
            "title_similarity": "0.26433158"
        },
        {
            "id": "hoti7u6",
            "score": 1,
            "text": "Talk about how operations will be conducted. How many people are there. What are the primary tasks? Who does them? How are they accomplished?",
            "title_similarity": "0.3394989"
        },
        {
            "id": "hotidu0",
            "score": 1,
            "text": "What compromise has been made on Webb that won't be acceptable for future IR observatories?",
            "title_similarity": "0.27912706"
        },
        {
            "id": "hotip5r",
            "score": 1,
            "text": "Exactly where and how will the public have access to the data?",
            "title_similarity": "0.24432495"
        },
        {
            "id": "hotiu3w",
            "score": 1,
            "text": "no one wants to ask, but would it be possible to service JWST via a suicide mission? if something were to go terribly wrong, could we theoretically send an astronaut on a suicide mission to fix it?",
            "title_similarity": "0.50303346"
        },
        {
            "id": "hotiwm7",
            "score": 1,
            "text": "Do you find that the increase in satellites in orbit disrupts your observations?",
            "title_similarity": "0.49178562"
        },
        {
            "id": "hotj6et",
            "score": 1,
            "text": "I would like to add onto another question that may be interesting to answer. If we are able to see into the past with this machine would we be able to see into the earth's past like a time machine or even look at other planets past?",
            "title_similarity": "0.4912963"
        },
        {
            "id": "hotj7cp",
            "score": 1,
            "text": "Why is Webb stationed in a Lissajous orbit around the Sun-Earth L2 Lagrange point, and not L4 or L5? The \"triangular\" Lagrange points are inherently stable, and thus station-keeping would be theoretically minimized.",
            "title_similarity": "0.46405134"
        },
        {
            "id": "hotjj6s",
            "score": 1,
            "text": "Spectroscopy in astronomy is used primarily to determine the chemical makeup of the object. Each element has a sort of fingerprint or unique signature in the wavelengths of light that it absorbs rather than reflects. You can look at something and literally tell what is in it.\nInfrared is very useful here because the wavelengths are so long that they can bypass/get around much of the cosmic dust that makes up galaxies. Almost like having X-ray vision that allows you to peer into things that would otherwise be obscured. It’s also useful here because Webb will be looking at objects that are so far away that they have red-shifted beyond the visible light spectrum and into infrared.\nHope this helps!",
            "title_similarity": "0.6086887"
        },
        {
            "id": "hotk1z5",
            "score": 1,
            "text": "This is a question for each of you if possible: Which of your contributions to the project are you most individually proud of? \n\nAlso, is there any equipment on the JWST that is notable besides what most people would think about? Any equipment/facilities back home that was designed to analyze, preprocess, or process the information coming from the JWST?\n\nThank you for your time.",
            "title_similarity": "0.5558944"
        },
        {
            "id": "hotk2fi",
            "score": 1,
            "text": "Ft 5(,5(555(555(5(5(55(55(5(55(5(55(5(55(55(55(55(55(55(55(5,(55(5( tf tttfttfttftfttfttftfttftttfttfttftttftfcfttf fix txt -s/1/34:4:rest;r esec2.z2",
            "title_similarity": "0.26489437"
        },
        {
            "id": "hotk6is",
            "score": 1,
            "text": "Why Webb is not to be checked after launch but still near Earth to make sure everything works fine before her long journey to L2?",
            "title_similarity": "0.4757868"
        },
        {
            "id": "hotk8tp",
            "score": 1,
            "text": "I get that looking far away is like looking back in time b/c the light we collect from far away has been traveling for a long time. And I think I understand that universe expansion is part of why we get redshift. But I don't really know how to think about it all together. If we look back with Webb as far back as we think we will be able to, how big will the universe have been back then compared to how big it might be today? Is expansion the main reason things are further away than they were back then? Where was this point in space where we are now back then? Is that something we can see or can we only see things that are old that were also very far away from \"us\"?",
            "title_similarity": "0.6349022"
        },
        {
            "id": "hotkx3t",
            "score": 1,
            "text": "Is nasa already working on a successor? If so, what will it be able to do that jwst cant do?",
            "title_similarity": "0.52610993"
        },
        {
            "id": "hotl18l",
            "score": 1,
            "text": "Can you launch me with it?",
            "title_similarity": "0.3105715"
        },
        {
            "id": "hotle8j",
            "score": 1,
            "text": "Lets say the light has been travelling for so long that it's past near infrared and turned into radio waves if it's possible. Can James Webb decent those signals?",
            "title_similarity": "0.5491574"
        },
        {
            "id": "hotlvey",
            "score": 1,
            "text": "Will you be looking at potential habitable planets for biosignatures and if so, when. Also will you be even posting it since of the UFO conspiracies have said that you like to cover up the existence of intelligence aliens visiting our planet. Don’t have to answer the latter question",
            "title_similarity": "0.56376994"
        },
        {
            "id": "hotm1xk",
            "score": 1,
            "text": "its been delayed again from the 22nd !?",
            "title_similarity": "0.17314036"
        },
        {
            "id": "hotm3kr",
            "score": 1,
            "text": "This thread and the answers made me feel something positive amidst all the bad we are facing. Can't wait!",
            "title_similarity": "0.35000208"
        },
        {
            "id": "hotmb3n",
            "score": 1,
            "text": "When it comes to exoplanet research with JWST, how much of an improvement can we see over Kepler and its cohorts? Are there things jwst can do that they can't?",
            "title_similarity": "0.5539645"
        },
        {
            "id": "hotmzf2",
            "score": 1,
            "text": "Will you be able to upgrade this in later years?",
            "title_similarity": "0.1530891"
        },
        {
            "id": "hotn6cp",
            "score": 1,
            "text": "Will you release any signs of Aliens you find? I just don't want to be alone, even if this is a dark forest thing.",
            "title_similarity": "0.403613"
        },
        {
            "id": "hotn8ew",
            "score": 2,
            "text": "What will you do if the webb won't reach the orbit of itself  and becomes unusable?  Are you going to build a new telescope?",
            "title_similarity": "0.5553433"
        },
        {
            "id": "hotndbj",
            "score": 1,
            "text": "Why is JWST launched with Ariane and not a US launcher?",
            "title_similarity": "0.39629072"
        },
        {
            "id": "hotnklt",
            "score": 1,
            "text": "Thank you for doing this AMA !  \nWhich programming language is the software for JWST written in, how many people have contributed to the code and how many lines is it approximately (just to get a grasp of the incredible software it takes)",
            "title_similarity": "0.59870577"
        },
        {
            "id": "hotnqp4",
            "score": 1,
            "text": "How much faith does the team have that the unfolding process will go smoothly??? Is there any plans in place if it does not??\n\nHope you all get some well deserves rest during that time, tough as it may be.",
            "title_similarity": "0.33358514"
        },
        {
            "id": "hoto77e",
            "score": 1,
            "text": "Hello, will JWST be able to help with the hunt for planet-9 if it exists?\nThank you",
            "title_similarity": "0.5727556"
        },
        {
            "id": "hoto87c",
            "score": 1,
            "text": "What's in the box ?",
            "title_similarity": "0.09504563"
        },
        {
            "id": "hotocqv",
            "score": 2,
            "text": "Thanks for doing this, folks.\n\nThe Hubble pictures are some of the most inspiring pictures I've ever seen",
            "title_similarity": "0.54966915"
        },
        {
            "id": "hotof0t",
            "score": 1,
            "text": "If anything were to go wrong in flight on the Ariane 5 (which is highly unlikely given that vehicles launch record) or during deployment of the satellite, what would be the impact? Could another JWST be assembled from spare components?",
            "title_similarity": "0.53030777"
        },
        {
            "id": "hotpbv0",
            "score": 1,
            "text": "Why is it not possible to do the most critical deployment sequences for JWST in low earth orbit, in case there is a repair necessary, before boosting to L2?",
            "title_similarity": "0.51937675"
        },
        {
            "id": "hotq4qj",
            "score": 1,
            "text": "What are the first images we can expect to see?",
            "title_similarity": "0.2427025"
        },
        {
            "id": "hotq81p",
            "score": 1,
            "text": "Who dropped it?",
            "title_similarity": "-0.01593069"
        },
        {
            "id": "hotqh0z",
            "score": 1,
            "text": "Will there be visible light images like Hubble?",
            "title_similarity": "0.25411412"
        },
        {
            "id": "hotqt54",
            "score": 1,
            "text": "Are you guys already planning for a replacement of the James Webb Telescope?",
            "title_similarity": "0.5254991"
        },
        {
            "id": "hotqyuj",
            "score": 3,
            "text": "If the public should know and understand any aspect of this project, which is the most important or most exciting aspect?",
            "title_similarity": "0.4638213"
        },
        {
            "id": "hotr6lj",
            "score": 1,
            "text": "Will it be possible to see Webb using amateur* telescopes from Earth?\n\n* I have a 5\" Schmidt-Cassegrain.",
            "title_similarity": "0.48138502"
        },
        {
            "id": "hotrije",
            "score": 1,
            "text": "I am grinding my own 10 inch mirror. Grits and all. Wish me luck. Question: How do you achieve a curve with multiple mirrors? Why is it not a thing for small telescopes?",
            "title_similarity": "0.5891727"
        },
        {
            "id": "hots18n",
            "score": 1,
            "text": "If we are able to look so far back in time to the earliest light epoch, ~13.5Byr iirc, could this help us work out which direction the Big Bang was in?\nMetaphorically we are on the surface of an expanding balloon with everything expanding around us, will being able to see so far allow us to probe the structure and distribution of matter in the observable universe in this way? Is this task simply too big? \nTIA!",
            "title_similarity": "0.6835169"
        },
        {
            "id": "hotse4v",
            "score": 1,
            "text": "When will it be launching after the next delay?",
            "title_similarity": "0.25641257"
        },
        {
            "id": "hottb8i",
            "score": 1,
            "text": "Suppose there was a hypothetical dyson swarm out there that looked like a star covered by dust with our current telescopes. Could JWST discern the difference dust an artificial megastructures?",
            "title_similarity": "0.5870415"
        },
        {
            "id": "hotter5",
            "score": 1,
            "text": "I can only imagine the generations of folks to come who will be inspired by the work you are all doing today, but what inspires you?\n\nWhat are your biggest hopes for this project and what are you most excited to see?",
            "title_similarity": "0.53494066"
        },
        {
            "id": "hottnmr",
            "score": 1,
            "text": "Do you have to worry about micrometeoroids hitting the sunshield/other objects?",
            "title_similarity": "0.31373653"
        },
        {
            "id": "hotu2gc",
            "score": 1,
            "text": "How is the data received from JWST? What are the facilities and equipment on earth like?",
            "title_similarity": "0.40540677"
        },
        {
            "id": "hotv6d4",
            "score": 1,
            "text": "Engineering student here. Question for Karl.\n\nWhat does the JWST project mean for the space industry in Canada? With the development now wrapped up and operations starting soon meaning the focus is moving from engineering to science, what other projects will the CSA and its partners be focusing on in the coming years?\n\n~~Also can I have a job pls~~",
            "title_similarity": "0.6188169"
        },
        {
            "id": "hotv9gz",
            "score": 1,
            "text": "Why couldn't you test the unfolding on the reachable near-Earth orbit and then send it flying to L2 in the \"open\" position with an external thruster?",
            "title_similarity": "0.5934892"
        },
        {
            "id": "hotvzx9",
            "score": 1,
            "text": "First, want to say, amazing work being done here and all the best for the launch!\n\nI was wondering what the chances of JWST being damaged by specs of space dust from comets or meteorites were, and how much damage there could be. Also, how critical would any of that damage be if something were to happen, and how could it be migitated?\n\nThanks, and good luck! :)",
            "title_similarity": "0.7580855"
        },
        {
            "id": "hotw5lw",
            "score": 1,
            "text": "We have seen pretty epic footage of launches nowadays, as like with Space X.  \nSince this telescope will go through the amazing unfolding maneuver that it needs to, are cameras designed and included around the telescope for this purpose?   \n\n\nIt would be pretty awesome to see it deploy and unfold for sure.",
            "title_similarity": "0.8398725"
        },
        {
            "id": "hotxypa",
            "score": 1,
            "text": "What parts of design of Webb are made public, for learning purpose (payload, etc.)?",
            "title_similarity": "0.30827945"
        },
        {
            "id": "hotzab0",
            "score": 1,
            "text": "What are the first three things she will survey?",
            "title_similarity": "0.17406604"
        },
        {
            "id": "hotzqi7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.054252036"
        },
        {
            "id": "hou0x9q",
            "score": 1,
            "text": "I'm probably too late, but how does everyone deal with the stress of a launch like this? \n\nYou've been working on it for years and years and I'm sure everyone's pretty confident about the engineering of the thing itself, but what about the launch? \n\nThat's got to be incredibly stressful and it's completely out of your hands.",
            "title_similarity": "0.64558417"
        },
        {
            "id": "hou1qf6",
            "score": 1,
            "text": "My dad asks if we find aliens will you tell us?",
            "title_similarity": "0.49491724"
        },
        {
            "id": "hou2pl5",
            "score": 1,
            "text": "Just how gutted will everyone be if the rocket fails? Seriously, whats the procedure if it does, is the telescope insured so a replacement gets built, obviously a huge investment in time would be lost as well as the fiscal side, what would happen?",
            "title_similarity": "0.57110417"
        },
        {
            "id": "hou35c0",
            "score": 1,
            "text": "Is there a specific website where I can see raw data or early pictures from the JWST? \nI would love to just keep in touch with the telescope that's been in development since I was born",
            "title_similarity": "0.67318696"
        },
        {
            "id": "hou35cv",
            "score": 1,
            "text": "How long do NASA predict this giant space telescope will collect data for them?\nAnd how far can it open our vision in the deep space?",
            "title_similarity": "0.7448544"
        },
        {
            "id": "hou5p7u",
            "score": 1,
            "text": "Once the fuel is gone, what's the plan ? Refueling is envisageable ?\n\nAlso, for future telescopes, is there a plan to use nuclear power or ion propulsion for longer operation ?",
            "title_similarity": "0.48653686"
        },
        {
            "id": "hou6oys",
            "score": 1,
            "text": "Forst of all, thank you all for the work you have done to make this launch a reality!!!  I'm very excited to see what JW will send back to us once its up and running. My question would be: since the JWST has a rather short life span due to the amount of fuel it can carry, is there a possibility that a future refueling mission could take place?",
            "title_similarity": "0.68972933"
        },
        {
            "id": "hou6r6n",
            "score": 1,
            "text": "The biggest day for human history is approaching. Will we be able to research more about dark matter and energy ?",
            "title_similarity": "0.6210552"
        },
        {
            "id": "hou6zi6",
            "score": 2,
            "text": "I just want to say very proud of you all and thank you for keeping one of my favorite subjects alive NASA♥️",
            "title_similarity": "0.60435927"
        },
        {
            "id": "hou73b1",
            "score": 1,
            "text": "What kinds of planetary science observations (such as asteroid surveys) are planned for within our solar system?",
            "title_similarity": "0.569036"
        },
        {
            "id": "hou8ct9",
            "score": 1,
            "text": "Are you gunna find aliens!??",
            "title_similarity": "0.5062963"
        },
        {
            "id": "hou8fc1",
            "score": 1,
            "text": "Please, make sure you don't bump into Santa or his reindeer if you're launching on the 24th!",
            "title_similarity": "0.28074342"
        },
        {
            "id": "hou8xlq",
            "score": 2,
            "text": "I dunno if you'll see this but I just want to say that I've been following this for years and I am sooo excited. I hope it all goes to plan. I'll be cheering for you all from Scotland. Thank you for opening a new window to the universe <3",
            "title_similarity": "0.57859623"
        },
        {
            "id": "hou9gjc",
            "score": 1,
            "text": "If something wrong happens with the launch are you prepared to make a second version of the telescope?",
            "title_similarity": "0.4741387"
        },
        {
            "id": "hou9xp9",
            "score": 1,
            "text": "What type of gyroscopes are being used? And who makes them? Thank you",
            "title_similarity": "0.4517038"
        },
        {
            "id": "houa09w",
            "score": 1,
            "text": "I assume most parts are custom engineered so if anything where to go wrong during launch, would you have to start from scratch?",
            "title_similarity": "0.5509124"
        },
        {
            "id": "houap1n",
            "score": 1,
            "text": "I know its stupid. But is there any plan in place incase life is found. Does nasa have a play book for that?",
            "title_similarity": "0.5073261"
        },
        {
            "id": "houb3nl",
            "score": 1,
            "text": "Whats your opinion on the dark forest theory?",
            "title_similarity": "0.12796025"
        },
        {
            "id": "houc95q",
            "score": 1,
            "text": "Are you nervous? I’m so nervous but I trust you all as well🙂\nSorry about being nervous, you got this.",
            "title_similarity": "0.29928863"
        },
        {
            "id": "houdwi9",
            "score": 1,
            "text": "Hypothetically what would be the most significant discovery the JWST could be capable of making?",
            "title_similarity": "0.4997751"
        },
        {
            "id": "houene9",
            "score": 1,
            "text": "How nervous are you prior to launch?",
            "title_similarity": "0.3471613"
        },
        {
            "id": "hougfv6",
            "score": 1,
            "text": "I don't have a question I just want to thank you for being freak'n amazing!",
            "title_similarity": "0.34225923"
        },
        {
            "id": "hougvr9",
            "score": 1,
            "text": "How soon can the first set of data be released?  \n\nI was an engineer on JWEST, so I'm super curious as to how it will perform.",
            "title_similarity": "0.5607805"
        },
        {
            "id": "houhfmk",
            "score": 1,
            "text": "What will you do in the event it is destroyed upon liftoff?",
            "title_similarity": "0.3162645"
        },
        {
            "id": "houjrkf",
            "score": 1,
            "text": "As you surely know, There is a theory about a hypothetical planet X/ planet 9 going around recently. Now, my question is with a telescope as powerful as Webb will we be able to see beyond the oort cloud and actually look for it!?",
            "title_similarity": "0.73649436"
        },
        {
            "id": "houn4j5",
            "score": 1,
            "text": "Although there is a point for connecting a space craft I've heard there are no plans to fix the telescope to lengthen its life. Will this change in the future or is pretty much set in stone this will only last around 10yrs?",
            "title_similarity": "0.5107381"
        },
        {
            "id": "houpkvg",
            "score": 1,
            "text": "Do you plan on checking the mirrors before launching this time? *Cough Hubble cough*",
            "title_similarity": "0.37984014"
        },
        {
            "id": "housa4p",
            "score": 1,
            "text": "Why didn't you just make 10 of them ?",
            "title_similarity": "0.317463"
        },
        {
            "id": "housd5m",
            "score": 1,
            "text": "You experts rule. Keep up the good work!",
            "title_similarity": "0.33203453"
        },
        {
            "id": "houtvsm",
            "score": 1,
            "text": "cool pics of stuff would be cool to see, so I have few expectations aside from all the cool new knowledge the craft can provide. I guess my only Question would be, is Antlia-Sextans Group on the list (or just Sextans A & B, aka UGCA205 and UGC5373), and if, how far down on the list of targets are they. Or is the craft only able to focus on stuff in the milkyway?",
            "title_similarity": "0.56958026"
        },
        {
            "id": "houvfhe",
            "score": 1,
            "text": "Tell me more about planet x? Will you see it? How sure are its a planet and not another Pluto?",
            "title_similarity": "0.5063135"
        },
        {
            "id": "hov0ri8",
            "score": 1,
            "text": "Will James Webb space telescope have a problem like hubble",
            "title_similarity": "0.57447577"
        },
        {
            "id": "hov2hev",
            "score": 1,
            "text": "I am curious if it will be able to observe organic/alien molecules on other planets?",
            "title_similarity": "0.3857084"
        },
        {
            "id": "hov2w3j",
            "score": 1,
            "text": "No question to ask but I'm so excited to see the JWST mission play out. Congratulations to those that worked on it thus far and I have high hopes for the future!",
            "title_similarity": "0.46288955"
        },
        {
            "id": "hov4jia",
            "score": 1,
            "text": "Why are all planets round",
            "title_similarity": "0.4594707"
        },
        {
            "id": "hov4kul",
            "score": 1,
            "text": "Can you guys be more epic? \n\nCan't wait to see what comes from this!! Ty experts!!",
            "title_similarity": "0.5486853"
        },
        {
            "id": "hov5kqa",
            "score": 1,
            "text": "The stress of the launch and deployment sounds both exhilarating and exhausting. What self-care and support network strategies do you have queued up and ready to go? 😁",
            "title_similarity": "0.54429734"
        },
        {
            "id": "hov6cmi",
            "score": 1,
            "text": "Since there are so many moving parts and sequences that have to go right in order for this to work, what is the likely hood of failure? And what is the most probable source of that failure? Also, what is the likely hood of this crashing into something along the way? I’m guessing the movement is all automated with sensors of some sort vs. being controlled remotely?",
            "title_similarity": "0.46932024"
        },
        {
            "id": "hov6mwx",
            "score": 1,
            "text": "Is it actually ready to launch though? I was reading an article this morning about still needing time to fix it",
            "title_similarity": "0.3987978"
        },
        {
            "id": "hov7w1b",
            "score": 1,
            "text": "So sad I missed this today.  I absolutely cannot wait for you guys to collect data on the early universe.  Leaning about the universe helped leave the catholic church and I’m happier than I’ve ever been. I’m free!  Okay, My question is, How can I help support this historic launch? 🚀",
            "title_similarity": "0.5570016"
        },
        {
            "id": "hov8kx0",
            "score": 1,
            "text": "If you guys find a planet shaped like a fried chicken leg will you tell the public?",
            "title_similarity": "0.47007942"
        },
        {
            "id": "hova66h",
            "score": 1,
            "text": "Can it see bofa?",
            "title_similarity": "0.06963049"
        },
        {
            "id": "hovaglz",
            "score": 1,
            "text": "What are you gonna do in the very possible event that james webb has an unresolvable problem? Is it just done for at that point?",
            "title_similarity": "0.26485288"
        },
        {
            "id": "hovb179",
            "score": 1,
            "text": "Will we be able to see behind our own galaxy's black hole?",
            "title_similarity": "0.45639232"
        },
        {
            "id": "hovd3a3",
            "score": 1,
            "text": "How often do you floss",
            "title_similarity": "0.24120268"
        },
        {
            "id": "hovdyjo",
            "score": 1,
            "text": "Since the amount of thrust needed is so small, why can’t solar powered fans work?\n\nIs it because there’s no atmosphere to push against?\n\nEven if it’s just a super super teeny tiny amount of thrust - isn’t that better than nothing after 10 years?",
            "title_similarity": "0.46258038"
        },
        {
            "id": "hove380",
            "score": 1,
            "text": "Is there really a patch of space that's like a super sphere of darkness?",
            "title_similarity": "0.3959605"
        },
        {
            "id": "hovfzer",
            "score": 1,
            "text": "What’s the first thing it’ll observe that wasn’t previously visible with older tech?",
            "title_similarity": "0.30255383"
        },
        {
            "id": "hovgttb",
            "score": 1,
            "text": "Spending 10 BILLION on a project thats been delayed for 15 years only for it to have an expected operation time of 10 years with no ability to externally extend lifespan SMH.\n\n&#x200B;\n\nWith how long this project has taken im curious how old the tech is thats been used in it vs whats been recently made",
            "title_similarity": "0.47448236"
        },
        {
            "id": "hovi79c",
            "score": 1,
            "text": "Hope u make it to my bday party!",
            "title_similarity": "0.38744736"
        },
        {
            "id": "hovjbwv",
            "score": 1,
            "text": "What happens when u find the barcode at the edge of the universe? Will we try to return for store credit or can we get a full refund?",
            "title_similarity": "0.43506193"
        },
        {
            "id": "hovm42u",
            "score": 1,
            "text": "When will we know it has worked as planned and is sending back images from the dawn of creation?",
            "title_similarity": "0.40826672"
        },
        {
            "id": "hovntxl",
            "score": 1,
            "text": "How do you guys communicate with Hubble when it was in commission?\n\nHas the communication process changed for JWST?\n\nHard to understand we can get HD photos (albeit slowly I’d imagine) from space when I can barely download jpgs on earth.",
            "title_similarity": "0.58651984"
        },
        {
            "id": "hovq669",
            "score": 1,
            "text": "NASA stated JWST would orbit around L2. How is it possible to orbit around an empty point in space with no mass in its center?",
            "title_similarity": "0.5413469"
        },
        {
            "id": "hovt5hz",
            "score": 1,
            "text": "What da dog doin ?",
            "title_similarity": "0.113370165"
        },
        {
            "id": "hovtx4z",
            "score": 1,
            "text": "If you looked at a person 20 miles away, what would you see? Like could a hair follicle take up the entire view?",
            "title_similarity": "0.29201496"
        },
        {
            "id": "hovwpjf",
            "score": 1,
            "text": "Why was the JWST designed with so many single point failure deployments? Was it just too big to launch without them?",
            "title_similarity": "0.5556778"
        },
        {
            "id": "how1nc7",
            "score": 1,
            "text": "Not a question, just please don't drop it lol",
            "title_similarity": "0.053142264"
        },
        {
            "id": "how3cv2",
            "score": 1,
            "text": "Will it be able to see my penis?",
            "title_similarity": "0.22750314"
        },
        {
            "id": "how632w",
            "score": 1,
            "text": "Would it have been possible to do the launch in several stages; the first to Earth Orbit where everything could be unfolded and tested (and potentially fixed, like Hubble) before firing its engine toward L2?  This seems within the current engineering possibilities.  Thanks!",
            "title_similarity": "0.6968583"
        },
        {
            "id": "how9tdm",
            "score": 1,
            "text": "Will the public have access to all of the data?",
            "title_similarity": "0.34832743"
        },
        {
            "id": "hown03y",
            "score": 1,
            "text": "🦠If each of you had to guess, what percentage chance is there we will find (biosignatures of) life on an exoplanet through jwebb? What portion of time is (likely) dedicated to exoplanet observation?  🪐\n\n🙏Is there a possibility for a fuel resupply mission (likely robotic) to refuel jwebb when its fuel is exhausted? 🚀 (Hoping yes)  \n\n🔮(Assuming they exist,) Will jwebb be any helpful in finding planet 9 (x)? More local dwarf planets (tno)?   \n\nExtra 🤔 Qs: \n🚫 Are there sections of space jwebb will never observe?  Can jwebb solve mysteries on geologically active jovian moons (from gravitational forces), of subsurface oceanic warmth and starting/ending depths?  \n\nWhat are some possible uses of jwebb observation/tools that would surprise us?  \n\nHow is the corkscrew l2 orbit corrected for in observations? Why doesn’t the movement interfere with observation?",
            "title_similarity": "0.6817206"
        },
        {
            "id": "howtnec",
            "score": 1,
            "text": "Do you guys from nasa are expecting to find some new information about our universe? How about alien life?",
            "title_similarity": "0.56028223"
        },
        {
            "id": "howxyu6",
            "score": 1,
            "text": "Howdy,  \n\n\nWill the JWST be able to look into \"our\" own black hole (or the center of our Galaxy) although it is not a part of the mission (I think). Thanks for your kindly attention.",
            "title_similarity": "0.50509655"
        },
        {
            "id": "howy6cf",
            "score": 1,
            "text": "Why build such intricate folding systems on JWT and then launch from Earth? Why not build it part by part in LEO (like ISS) and then launch to L2 from there?",
            "title_similarity": "0.65932477"
        },
        {
            "id": "hox2lww",
            "score": 1,
            "text": "How are you doing with all the problems that can happen due to the long wait for the JWST to be launched? I hope everything goes smoothly 🙏",
            "title_similarity": "0.56243086"
        },
        {
            "id": "hoxc7ch",
            "score": 2,
            "text": "i listen that you are making this telescope from 20 years   \nso my question is   \nthe technology used is 20 years old Or its using the latest technolgy",
            "title_similarity": "0.47608298"
        },
        {
            "id": "hoxuz12",
            "score": 1,
            "text": "Hola a qué hora comienza el Streaming: dónde confirman la fecha y hora de lanzamiento del telescopio James WeBB???",
            "title_similarity": "0.3044994"
        },
        {
            "id": "hoxyrbh",
            "score": 1,
            "text": "Can it trace the entire space journey of a spacecraft from start to end of reaching Mars if used to observe from launching pad?",
            "title_similarity": "0.61341715"
        },
        {
            "id": "hoxz0zg",
            "score": 1,
            "text": "If we look into dark space will it differ on new moon and full moon days?",
            "title_similarity": "0.50592554"
        },
        {
            "id": "hoyee08",
            "score": 2,
            "text": "Amazing work guys! I’m looking forward to the results",
            "title_similarity": "0.40853846"
        },
        {
            "id": "hoz2ftf",
            "score": 1,
            "text": "Will the launch vehicles have webcams on them?  And does the Webb sat portion have one to take pictures of itself?",
            "title_similarity": "0.3953191"
        },
        {
            "id": "hp1gkhf",
            "score": 1,
            "text": "When we will see the first image of James Webb?",
            "title_similarity": "0.25214428"
        },
        {
            "id": "hp2aaoh",
            "score": 1,
            "text": "¿ Cómo es el sistema de apertura del carenado?",
            "title_similarity": "0.15012076"
        },
        {
            "id": "hp2ymhc",
            "score": 1,
            "text": "I've been waiting for literally 10 years for this moment. Can't wait!",
            "title_similarity": "0.50286394"
        },
        {
            "id": "hp3skcs",
            "score": 1,
            "text": "are there any plans in case:\n1. moving parts incorrectly positioned\n2. Accident during the flight to Earth orbit - do you have any media release prepared?",
            "title_similarity": "0.52619565"
        },
        {
            "id": "hp815c9",
            "score": 2,
            "text": "I have a ton of questions I have been willing to ask\n\n1) How come we can’t have a refueling mission to increase the lifespan of the telescope? We put men on the moon, put a rover on Mars, and have sent spacecraft to Pluto. You’re telling me we can’t send an automated refueling vehicle to the telescope? \n\n2) Why did we build only one JWST and not 3 or 4? Considering we spent billions of design and research, the actually building an manufacturing was much smaller. We could have build multiple telescopes and then more scientists would be able to use them. I understand they are expensive, but I would happily wait a year for multiple telescopes instead of just 1. \n\n3) If something malfunctions on the telescope, can the person who was assigned to that particular part be sued under the US court of law? Someone should be held responsible for screwing up this mission that cost billions of dollars and decades of work. If an investigation proves that the person was careless or had no idea what the hell they are doing, then I expect someone to sue them for negligence.",
            "title_similarity": "0.6898011"
        },
        {
            "id": "hp88o9h",
            "score": 1,
            "text": "Too bad this wasn’t announced in r/jameswebb",
            "title_similarity": "0.1544177"
        },
        {
            "id": "hp8gt8c",
            "score": 2,
            "text": "Does anyone know where we can watch the launch? Will it be streamed on YouTube, tv, nasas website or etc?",
            "title_similarity": "0.5289415"
        },
        {
            "id": "hpasifa",
            "score": 1,
            "text": "What is the purpose of  those golden hexagons",
            "title_similarity": "0.33693108"
        },
        {
            "id": "hpg3d35",
            "score": 1,
            "text": "What specifically about the launch and/or telescope keeps you up at night?",
            "title_similarity": "0.49336755"
        },
        {
            "id": "hpg3thi",
            "score": 1,
            "text": "If you were a gambling man,  what would you put the over/under at this thing succeeding ?",
            "title_similarity": "0.25238603"
        },
        {
            "id": "hpy52d3",
            "score": 1,
            "text": "(Preface: I’ve been following this project for years and am very excited about this launch!)\n\nWith the design of JWST being done in the 90s and the construction finishing in 2007 (from my understanding), is the technology on Webb not already considered ‘outdated’? \n\nHave any parts bern upgraded over the last several years? Such as stronger computer processors?\n\nIs a next-gen device already in design? Or will that depend on some of the findings that Webb will make over the next few years?",
            "title_similarity": "0.62760496"
        },
        {
            "id": "hq17qeh",
            "score": 1,
            "text": "Where can I find the most up to date and detailed timeline for JWST?  It would also be vey nice if the planned times are in UTC please.\n\nThe best one I could find is at [https://spaceexplored.com/2021/12/25/how-to-track-james-webb-space-telescope-mission-timeline/](https://spaceexplored.com/2021/12/25/how-to-track-james-webb-space-telescope-mission-timeline/) but the times are still relative and nothing has been updated since the launch.",
            "title_similarity": "0.6398464"
        },
        {
            "id": "hqa0x8v",
            "score": 1,
            "text": "The best and most up-to-date timeline I could find is at [https://spaceexplored.com/2021/12/27/how-to-track-james-webb-space-telescope-mission-timeline/](https://spaceexplored.com/2021/12/27/how-to-track-james-webb-space-telescope-mission-timeline/)\n\nIs there a better mission timeline available?",
            "title_similarity": "0.7693061"
        },
        {
            "id": "hqhrd52",
            "score": 1,
            "text": "yay to the recent news on NASA under-promising and over delivering on fuel expectations for JWST. \n\nQ: Have been trying to find out online and haven’t found a convincing resource on it - is nuclear fuel part of the onboard energy sources for James Webb? If not, why? \nAre there possible limitations from using nuclear fuel to keep the spacecraft/telescope at ultra low temperatures to continue being sensitive to IR wavelengths?\nNot like nuclear fuel is new to NASA given the extensive use of radioisotope power systems through Apollo, Voyager and Perseverance missions.",
            "title_similarity": "0.67731154"
        },
        {
            "id": "hr8jci3",
            "score": 1,
            "text": "Every comment is a big brain comment and I'm sitting here like huh. Ok new words. But I'm learning. All that matters.",
            "title_similarity": "0.57160777"
        },
        {
            "id": "hruekkz",
            "score": 1,
            "text": "How or what were the reasons that Webb was launched from where it was launched from?",
            "title_similarity": "0.30967182"
        },
        {
            "id": "i3rq4wt",
            "score": 1,
            "text": "Is there a good reason why Webb doesn't have a far infrared instrument like spitzer?",
            "title_similarity": "0.32890135"
        }
    ]
}