{
    "There are lots of well-characterised genetic conditions in humans, are there any rare mutations that confer an advantage?\nGenerally we associate mutations with disease, I wonder if there are any that benefit the person. These could be acquired mutations as well as germline. \n\nI think things like red hair and green eyes are likely to come up but they are relatively common.\n\nThis post originated when we were discussing the [Ames test](https://www.eurofins.com.au/biopharma-services/genetic-toxicology/the-ames-test/) in my office where bacteria regain function due to a mutation in the presence of genotoxic compounds. Got me wondering if anyone ever benefitted from a similar thing. \n\nEdit: some great replies here I’ll never get the chance to get through thanks for taking the time!": [
        {
            "id": "huf35u4",
            "score": 7,
            "text": "Intelligence has a strong genetic component. So if someone has an extremely high intelligence, this is likely to be the result of some mutation in human history. \n\n(Of course, intelligence in general is the result of mutations, but you asked for a positive, rare mutation. That's why high intelligence is an example.)",
            "title_similarity": "0.6278075"
        },
        {
            "id": "huf3myl",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.056558214"
        },
        {
            "id": "huggarc",
            "score": -1,
            "text": "\"Mutations\" are simply differences in genes between individuals that can't be directly traced to their ancestors, and we *all* have them, nobody's 100% identical to anyone in their family, which includes parents, siblings and twins. There's also the issue of epigenetic (how genes \"express\" within an environment), but let's stick to \"raw\" genes.\n\nYou first need to define what is \"advantageous\", is it something that furthers survival of the species or of the individual? That confers advantages for athletic performances? Etc\n\nSome famous \"athletic\" mutations, like Michael Phelps' famous XXY chromosomes is often credited as being a big part of his physical performance, but it's also correlated with infertility. [1](https://en.wikipedia.org/wiki/Klinefelter_syndrome) So it's not exactly great for the species, but it *can* mean that this one individual survives longer.\n\nThen we have the issue of the \"natural\" environment. Should human genetic quality still be evaluated according to physical abilities given its near uselessness in today's world? Is intelligence the only important factor now? How about emotional stability?\n\nOne who's genetics make him prone to chronic depression in a less physically demanding world may not have time to pass down their genes if they kill themselves first...\n\nOne feature can have negative *and* positive impacts, depending on the individual, the circumstances, the environment, etc.\n\nAs for \"diseases\", the limit's pretty blurry too. Is a lack of hairs covering our body a *disease?* If not, then what's alopecia? [2](https://en.wikipedia.org/wiki/Hair_loss) If so, then do you consider people without hairs covering their entire body as being riddled with a disease?\n\nAnd if you say \"well, a disease is usually something that kills you\", then sure, but cancer mostly affects older people, who were most likely dead by the time they could develop cancer just 500 years ago. In Canada, a whopping *88%* of cancers develop after 50 years of age. [3](https://www.canada.ca/en/public-health/services/publications/diseases-conditions/fact-sheet-cancer-canada.html)\n\nSo was cancer a disease 500 years ago, when most people didn't even live long enough to develop one? Well, yes, but given that it overwhelmingly does not prevent one from passing their genes, then, who is it a disease for? The individual or the species?\n\nBottom line, your very ability to ask this question; your human intelligence, is the key to all of these. Our intelligence has changed us, it has changed the planet and it has *literally* changed our cosmos, and you could even say it changed the universe, given how we have sent stuff there, be it radio waves, light waves or objects.\n\nSo anything can be an advantage, depending on how we adapt it, and I think we can safely say that we'll adapt to most things.",
            "title_similarity": "0.60937655"
        },
        {
            "id": "huexz1j",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "0.056558207"
        },
        {
            "id": "hugmukx",
            "score": 3,
            "text": "Marfan Syndrome might of made Michael Phelps a swimming machine. I guess it causes physical changes such as being tall and thin with extra long limbs and fingers and super flexible joints, but the draw back being that connective tissues in the heart and eyes are weak.\n\nAnother would be ultra marathon runners, they don't build up lactic acid in the muscles the same way normal person and can run a 100 miles or more.",
            "title_similarity": "0.5452601"
        },
        {
            "id": "huexqdl",
            "score": 188,
            "text": "There's a village in Italy where most of the residents are completely immune to cholesterol. They can't get cholesterol build up. They smoke and drink and can have terrible diets - and are healthy and fit.\nIt's a hereditary genetic anomaly.\n\nAlso places with high numbers of centenarians have been studied and there is a big family/hereditary factor.",
            "title_similarity": "0.56325305"
        },
        {
            "id": "hufcban",
            "score": 4,
            "text": "Their is evidence of genetic anomalies among a certain phenotype of freckled, red haired ppl of Scottish descent. Individuals with this phenotype do not feel pain the way others do. I believe there was also soMe research re: resistance to HIV infection in this phenotype.",
            "title_similarity": "0.7329354"
        },
        {
            "id": "huf16gd",
            "score": 10,
            "text": "People with sickle cell anemia have less chance of getting and dying from malaria. Something to do with Plasmodium dying out quicker in people with abnormal Red Blood cells. Somewhat advantageous in malaria endemic areas.",
            "title_similarity": "0.6777421"
        },
        {
            "id": "huf3gr4",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.056558207"
        },
        {
            "id": "hug446l",
            "score": 5,
            "text": "There's some south east Asian culture that can hold their breath for a very long time. They build less carbon dioxide in their lungs. \n\nLike almost all of the top long distance runners come from a village in Kenya \n\nPeople from Nepal have better breathing in high altitudes\n\nNorthern Europe can consume dairy. (Previously mentioned)\nAnd almost all world's strongest man champions are european\n\nAlmost all cultures have an advantage somewhere",
            "title_similarity": "0.4845256"
        },
        {
            "id": "huf8bpe",
            "score": 1,
            "text": "In a town in Northern Italy there are, or were when the article was written, a few people [immune to fatty arterial deposits due to mutation. ](https://www.latimes.com/archives/la-xpm-1994-10-17-mn-51362-story.html) It’s an old article and probably debunked by now but I remembered reading about them. All traced back to one mutant two centuries ago.",
            "title_similarity": "0.62687546"
        },
        {
            "id": "huf6aro",
            "score": 22,
            "text": "\\- There's a Scottish woman whose skin has superhuman regeneration. She also doesn't feel pain the way other people do.\n\n\\- Some Asians never grow fat, because apparently they have a gene that converts excess fat to muscle mass. Similar rare mutations have been recorded in Europe where young children develop excessive muscles due to gene that boosts muscle growth.",
            "title_similarity": "0.5671727"
        },
        {
            "id": "huez3pj",
            "score": 8,
            "text": "All prevalent genotypes have been subject to positive selection and therefore advantageous in certain contexts, while they may be disadvantageous in other contexts. Often we do not know the full extent of this contextuality. For example we know of several genotypes that are associated with increased disease risk, also before the normal age of procreation. This means that these genotypes must have conferred an advantage in some context at some point in time.\nThere are a few exceptions to this.\nGenetic loci in close genomic proximity to other genotypes that are selected for can have some carryover selection, due to crossover at meisis.\nHistoric population bottlenecks can concentrate certain genotypes without outright selection. I.e. if a population is reduced to few individuals from disaster, it is likely that certain genotypes will be over- or underrepresented compared to the previous population distribution.\n\nBut to give specific examples. The genotype that causes sickle cell anemia is concentrated in subsaharan populations as it also confers resistance to malaria\n\nThe ACTN R557X genotype is associated with increased explosive strength and is literally indispensable for Olympic level sprinters and jumpers. The only disadvantage seems to be a lower relative muscle endurance.",
            "title_similarity": "0.727438"
        },
        {
            "id": "hufqtai",
            "score": 16,
            "text": "I guess a big one is often attributed to ADHD on some scenarios. People diagnosed with ADHD are often great at dealing with situations that become rapidly stressful. This confers an advantage against neurotypical people when it comes to jobs that require that often like: surgeon, firefighter, cop, paramedic, drug dealer, and many others",
            "title_similarity": "0.6046553"
        },
        {
            "id": "hufjkbx",
            "score": 10,
            "text": "A few years ago they found a family in Afghanistan that lacked the ability to feel pain. By studying them they were finally able to figure out how the body experiences pain and are using that knowledge to build the next generation of pain medication ( that don’t get you high)",
            "title_similarity": "0.52611786"
        },
        {
            "id": "hufkgmk",
            "score": 2,
            "text": "This one is both obscure and waiting on more data, but there's a small percentage of people (around 2%, in the studied populations) that a professor at the University of Utah has dubbed \"supertaskers.\"  \n\nThese people are characterized by a genuine ability to split their attention, unlike normal people who simply move their attention back and forth quickly or efficiently when \"multitasking.\" (Fun fact, ADHD is associated with a reduced ability to do this).  \n\n\"Supertaskers\" suffer almost no penalty in reaction time for shared attention, such as measured time to brake in a simulated driving emergency while carrying a conversation. Neurotypical people will take nearly twice as long to press the brake pedal while distracted.  \n\nResearch is still in the process of collecting enough DNA samples from people who pass these tests to narrow down any genetic markers for the trait.",
            "title_similarity": "0.5564488"
        },
        {
            "id": "hufrmkl",
            "score": 2,
            "text": "This is not the post I’m thinking of, but this talks about a genetic mutation that reduces severity of COVID infection.  Weirdly also found out I have this via 23andMe \n\nhttps://www.reddit.com/r/News_HealthBiotech/comments/s9kx7w/small_children_getting_less_sick_from_omicron/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.7807925"
        },
        {
            "id": "huf778e",
            "score": 11,
            "text": "These are all I can remember:\n\n- Sickle cell heterozygousy is likely an adaptation against malaria; IIRC thalassemias as well\n\n- Cystic fibrosis heterozygousy can be an adaptation against respiratory infections\n\n- Diabetes* can possibly be an adaptation to better survive hunger (read about the Pima people),\n\n- SAD* and bipolar disorder* can be adaptations to winter summer cycles of high latitudes\n\n- ADHD* and schizophrenia* may boost creativity\n\n*those illnesses are multifactorial, but in some cases have high heritability",
            "title_similarity": "0.69650674"
        },
        {
            "id": "huh52ch",
            "score": 4,
            "text": "Tetrachromacy - 4 cone cell types instead of 3.  Better color perception.  Rare in humans",
            "title_similarity": "0.43236023"
        },
        {
            "id": "hug8ycy",
            "score": 6,
            "text": "Some forms of colorblindness  can surprisingly  confer a greater ability to detect camouflage than normal vision due to the greater importance placed on contrast and shape vs color and tone. People with the condition were occasionally recruited by the military to look at aerial maps during WWII to help and identify camouflage. Interestingly with modern tech like thermal imaging there’s no reason to use colorblind individuals in this way any more and the condition will bar you from many if not most military positions.",
            "title_similarity": "0.6260692"
        },
        {
            "id": "huf2z5f",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "0.056558214"
        },
        {
            "id": "huexd08",
            "score": 58,
            "text": "All human variation started as a mutation, and the beneficial ones spread through the population so are more or less normal, at least within people living in an environment where they confer a benefit. An example is light skin. Dark skin is protective against some of the harmful effects of UV in sunlight, but reduces the ability to produce vitamin D. In high latitudes like Europe, humans mutated to have paler skin as the less intense sunlight was less of a problem but also reduced vitamin D production, so people mutated to have paler skin and lighter hair color.\n\nA more direct example of what is a specific and sometimes harmful mutation is sickle cell disease. If you have one chromosome with the mutation for sickle cell disease it offers significant resistance to the parasite that causes malaria, but two copies is extremely harmful. This is why that mutation is widespread in populations that historically lived in areas with a high incidence of malaria but is rare in other populations.",
            "title_similarity": "0.65394384"
        },
        {
            "id": "hueyqws",
            "score": 63,
            "text": "I think there are many mutations that confer an advantage to humans - these are the mutations that generated many of the things we take for granted, i.e., the glycolysis pathway. These pathways all had to evolve from somewhere. \n\nBut I suspect you're asking about things that are more recent and rarer. These do exist. In some cases, the same mutation that causes disease is semi-protective against something else (hence why it can continue to exist in the population at some steady level). For example, sickle cell trait is caused by a mutation that confers an advantage against malaria. This is because malaria infects RBCs and sickled RBCs are harder to infect for some reason. However, if you get 2 copies of that mutated gene, you get sickle cell disease which obviously is a morbid condition.",
            "title_similarity": "0.8081826"
        },
        {
            "id": "hufmfop",
            "score": 9,
            "text": "There are people with six fully functional fingers on each hand, tetrochromats who have extra receptors in their eyes who can see millions more colors than normal, supertasters, and I assume all kinds of other cool stuff.",
            "title_similarity": "0.39626482"
        },
        {
            "id": "hugdhb2",
            "score": 8,
            "text": "Others have posted lots of good examples of rare variants. So I'm going to jump to remind y'all that *everything* in the human genome was, at one point, a mutation. \n\nOur big intelligent brains that give us adaptive advantages? They are a mutation (actually dozens of mutations) that changed us from the other apes.  Our skin that can sweat to let us thermoregulate, making us the best long-distance runners on the planet - a mutation. \n\n Eyes for seeing, immune system for keeping you alive, opposable thumbs, skin that heals quickly, shoulders that can throw objects with high accuracy ... Every one of these came about as mutations that some animal ancestor, at some point in time, didn't have.",
            "title_similarity": "0.6876813"
        },
        {
            "id": "huhoq10",
            "score": 8,
            "text": "One thing to keep in mind is that there is no such thing as an absolute \"advantage\". There are only advantages within specific contexts or environments. Without specifying a context, there is technically no way to answer your question. \n\nOf course we will naturally fill in the blank to figure out what we assume the context should be, but this is at the heart of a lot of miscommunication. Gene mutations can definitely affect our biology and can affect the outcomes of our lives. However whether these changes are advantageous depends on the context.\n\nFor example a series of genetic mutations that lead people to gain weight and increase fat tissue mass more quickly could be an advantage in a population of people living in a cold environment, however the same set of mutations could be a disadvantage to a population living in a very hot environment.",
            "title_similarity": "0.7069283"
        },
        {
            "id": "huex670",
            "score": 704,
            "text": "[removed]",
            "title_similarity": "0.056558207"
        },
        {
            "id": "hufccyh",
            "score": 24,
            "text": "Cultures who practice dairying (harvesting the milk of another species) have developed lactose persistance, otherwise the default is to become lactose intolerant in adulthood. \n\nThat is why lactose intolerance is persistant in places like china, where milk products are scarce, and while it hardly exists in white and middle eastern countries.",
            "title_similarity": "0.5615767"
        },
        {
            "id": "huf5wkp",
            "score": 35,
            "text": "The fact that some people can drink milk and eat cheese way past infancy is absolutely crazy, and due to a mutation in the lactase gene. Conferred a massive advantage in very cold or very dry climates where food crops wouldn't grow, and you had to rely on animals.\n\nIn more recent times, the amount of \"brown fat\" you have (fat cells whose only job is to burn fat and generate heat) could also be considered an advantage, because there's cheese cakes and pork chops everywhere.",
            "title_similarity": "0.64345455"
        },
        {
            "id": "huffn9p",
            "score": 12,
            "text": "The ability to digest lactose as an adult is a mutation which only occurred a few thousand years ago in Northern Europe.\n\nHere's the first site that appeared on google - https://www.npr.org/sections/thesalt/2012/12/27/168144785/an-evolutionary-whodunit-how-did-humans-develop-lactose-tolerance",
            "title_similarity": "0.48799753"
        },
        {
            "id": "hugmcjy",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.056558207"
        },
        {
            "id": "hufslbp",
            "score": 42,
            "text": "Other commenters have answered more thoroughly, but it's also worth noting that you should be careful when defining the term \"advantage\". From an evolutionary standpoint, Huntington's disease confers an advantage: it increases reproductive behavior for a few years and therefore has a higher chance of passing on the genes. From any rational standpoint though, it's just a brutally horrific illness.",
            "title_similarity": "0.68644977"
        },
        {
            "id": "huf2kj4",
            "score": 16,
            "text": "I mean as a point some of the genes we associate with genetic disease are actually somewhat beneficial. for example the gene that causes Sickle cell anaemia also confers malaria resistance when the person is only carrying one copy of the gene, but causes the disease when an individual gets two copies.",
            "title_similarity": "0.7615292"
        },
        {
            "id": "huf206v",
            "score": 16,
            "text": "The recessive sickle cell gene confers immunity to malaria, so as long as you only have one gene it's advantageous. If you get two you get sickle cell anemia, so it's playing genetic Russian roulette, but there is an advantage.",
            "title_similarity": "0.6818749"
        },
        {
            "id": "hufqv76",
            "score": 19,
            "text": "theres a tribe in the south pacific that subsists mostly on the bounty of the sea, to the point that they live on boat flotillas.\n\nMost of what they gather is done through free-diving, and has for generations.  as a result, they have apparently adapted (mutated) to see better underwater, and have a lung capacity twice that of an average human.",
            "title_similarity": "0.4056418"
        },
        {
            "id": "huf8tcm",
            "score": 245,
            "text": "Myostatin-related muscle hypertrophy, it’s a rare genetic condition that causes people to have like twice the normal muscle mass, and less body fat. Nothing adverse is associated with this. It’s just really easy to gain muscle and not fat. \nExample:\n\nhttps://www.mlive.com/news/muskegon/2009/01/liam_hoekstra_3_is_all_muscle.html",
            "title_similarity": "0.54269063"
        },
        {
            "id": "huexisq",
            "score": 469,
            "text": "One example of a gene / mutation leading to an advantage is in Tetrachromacy. People (only female) with this mutation can distinguish many more colours compared to normal people.\n\nAnyhow, a lot of mutations are advantages, that's how humans became humans through evolution. Though the change of these events happening are somewhat rare, since in our species we have very little generic variability.",
            "title_similarity": "0.66516757"
        },
        {
            "id": "hugxhda",
            "score": 48,
            "text": "I went to high school with a guy who was incredibly smart (honors classes, 36 on ACT, etc). Humble, quiet dude. Pretty unassuming, but clever and funny if you struck up a conversation with him.\n\nHe wrote an article for the school paper his senior year where he admitting to having a mental/genetic disorder where his brain actively color coded information for him, which gave him more or less a photographic memory as well as the ability to recall more or less anything he ever read. I talked to him about it afterwards and he said that he didn't really study, he just read every page in the text books once and was good to go after that. Blew my mind.\n\nLast I checked he got his PH.d in neuroscience at like 26 or something. Closest thing to a superhero I'll probably ever meet.\n\nI cant remember what its called, and google just keeps returning articles about being colorblind. If anyone can add the name into the comments that would be great.  \n\n\nEdit: The disorder is called Synesthesia",
            "title_similarity": "0.53672147"
        },
        {
            "id": "huf10vn",
            "score": 1183,
            "text": "Two really cool I can think of.\n\n1) People in the Himalayas have genes that allow them to use oxygen more efficiently, allowing them to still feel alright in high altitudes. As a result, many actually work as helpers (carrying materials) for people climbing Everest.\n\n2) Another people (in Indonesia if I recall correctly) have been outcasted out of the land for generations. Nowadays, these people can remain underwater for a very long time (from what I recall, well over 10 minutes) as a result of a genetic mutation.\n\nInterestingly, the genetic mutations these people have are also sometimes found randomly in other people elsewhere on Earth, but only in these people does it encompass the whole population.",
            "title_similarity": "0.54599667"
        },
        {
            "id": "huggdfh",
            "score": 48,
            "text": "There's a mutation that causes hard ear wax in exchange for minimal body odour. ABCC11\n\nI've got it. It's nice to never have to buy deodourants, but also sucks digging out hard ear wax all the time. I often dig around with (the loop side of) a bobby pin in my ear to pull wax towards the exit -- yes, I know it's risky, but it just builds up these solid hunks of wax...",
            "title_similarity": "0.5506778"
        },
        {
            "id": "huf2k16",
            "score": 376,
            "text": "There is a super rare gene which allows someone to sleep for only 1-3 hours a day and get the same as a normal human would from 7-9 hours sleep. But it's incredibly rare. A lot of \"hard workers\" may assume they have it but most people are just so used to the symptoms of sleep deprivation they don't realise.",
            "title_similarity": "0.4484792"
        },
        {
            "id": "huf96wr",
            "score": 68,
            "text": "Some people who drank [arsenic contaminated water over generations](https://www.dailymail.co.uk/sciencetech/article-2979234/The-people-eat-ARSENIC-Remote-village-Andes-developed-tolerance-toxic-chemical.html), developed a particular AS3MT gene variant which gives them a [higher resistance to the poison.](https://ehp.niehs.nih.gov/doi/10.1289/EHP8152)",
            "title_similarity": "0.71980226"
        },
        {
            "id": "huez0wm",
            "score": 401,
            "text": "Michael Phelps has a bunch of odd things that make him a better swimmer, which has worked out very much to his advantage.  \n\nhttps://observer.com/2012/07/michael-phelps-wins-most-olympic-medals-ever-teaches-children-that-being-a-pot-smoking-genetic-mutant-can-make-dreams-come-true/",
            "title_similarity": "0.5963201"
        },
        {
            "id": "huf2cr6",
            "score": 174,
            "text": "Theres a mutation/genetic condition that gives people vastly increased bone density which in turn makes it incredibly difficult for them to sustain life threatening skeletal injuries. The only downside is that they'll drown if they ever try to swim in deep water",
            "title_similarity": "0.5666862"
        },
        {
            "id": "huf5bod",
            "score": 338,
            "text": "Gilbert's syndrome, a genetic condition that leads [to increased levels of bilirubin](https://www.nhs.uk/conditions/gilberts-syndrome/) (and some occasional short mild jaundice spells, but nothing serious), looks like it protects against [cardiovascular disease](https://pubmed.ncbi.nlm.nih.gov/23110860/) and [lung cancer](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7569373/).  \n\nBilirubin is yellowish pigment that's created in the normal breakdown of red blood cells (it's what colours your bruises yellow a few days after you get them). Some people are slower to break it down to the next stages, meaning they have slightly increased levels in their blood (which occasionally might get high enough to give them some mild jaundice).  \n\nIt's quite a common genetic disorder with about 1 in 20 people affected in the UK. It might be so common because bilirubin has some antioxidant properties and could lower risks of CVD and lung cancer.",
            "title_similarity": "0.7235682"
        },
        {
            "id": "huf1mve",
            "score": 2524,
            "text": "People with sickle cell trait (i.e., just one copy of the sickle cell gene) have an advantage of being less susceptible to malaria. CCR5-Δ32 provides protection against HIV as does TNPO3. Outside of well-known mutations like these there are likely lots of mutations that provide survival benefits that aren't outwardly obvious. A certain population of people living longer than average likely will have at least some mutations that confer an advantage. Certain populations have other mutations that allow them to dive for longer, live at higher altitudes or have more brown fat to better tolerate the cold as well as further examples.",
            "title_similarity": "0.6855047"
        },
        {
            "id": "huf5nmt",
            "score": 419,
            "text": "Tetrachromacy - https://en.m.wikipedia.org/wiki/Tetrachromacy\n\n\"One study suggested that 15% of the world's women might have the type of fourth cone whose sensitivity peak is between the standard red and green cones, giving, theoretically, a significant increase in color differentiation.\"",
            "title_similarity": "0.54490805"
        },
        {
            "id": "hufge58",
            "score": 298,
            "text": "Polydactyly humans - those who are born with a 6th finger on each hand - _can_ have an advantage with grip dynamics (depending on how it manifests).\n\nIn some cases, this mutation can lead to the thumbs having [ball joints instead of saddle joints](https://www.nature.com/articles/s41467-019-10306-w), ensuring a greater degree of flexibility and dexterity. In addition, the supernumerary finger also has a saddle joint and manifests muscles similar to what a typical thumb would have - allowing a spherical range of motion not usually present in a typical finger.\n\nAll in all, this allows for a greater grip strength and dexterity. As such, tasks which would usually require two hands can be performed with one hand!",
            "title_similarity": "0.54618007"
        },
        {
            "id": "hueyr2n",
            "score": 939,
            "text": "If I recall there is a (rare) gene mutation in Europe/new england which gives partial/full immunity to one of the mechanisms of HIV. It has something to do with a mutation which originated from the time of the black death which gave some people an immunity to that. Apparently that has some attack vector in common with HIV and so the gene provides immunity/resistance to both.\n\nEdit: https://en.m.wikipedia.org/wiki/CCR5\n\nThis one, specifically the Delta 32 version of it",
            "title_similarity": "0.7680699"
        },
        {
            "id": "huf8hc1",
            "score": 2220,
            "text": "Not really rare, but it's always interesting. Being able to consume milk into adulthood (lactase persistence) was a genetic mutation, likely occurring during the time we started domesticating animals, including cows. Being able to drink milk helped us get through depressions and times of famine because milk is high in protein, fat and other nutrients that are beneficial to humans.\n\nWhat's even more interesting, there are two different genetic mutations that allowed this to happen. One mutation from Europe, and one mutation from Africa.",
            "title_similarity": "0.70280075"
        },
        {
            "id": "huf4b91",
            "score": 2359,
            "text": "Many! [Here's a query on SNPedia for all \"good\" variants sorted by subjective magnitude](https://snpedia.com/index.php?title=Special:Ask&limit=500&offset=0&q=%5B%5BRepute%3A%3AGood%5D%5D&p=format%3Dbroadtable%2Flink%3Dall%2Fheaders%3Dshow%2Fsearchlabel%3D...-20further-20results%2Fclass%3Dsortable-20wikitable-20smwtable&po=%3FSummary%0A%3FMagnitude%0A&sort=Magnitude&order=desc&eq=yes#search)\n\nFor example:\n\n* [rs1042522(C;C)](https://snpedia.com/index.php/Rs1042522(C;C)) is associated with living 3 years longer on average - and chemotherapy is more effective \n* [rs3816873(C;C)](https://snpedia.com/index.php/Rs3816873(C;C)) is associated with a significantly lower risk of type 2 diabetes.",
            "title_similarity": "0.5457085"
        },
        {
            "id": "hufnr8j",
            "score": 1045,
            "text": "In a town called Limone in Italy, there was a couple that moved there in the 18th century that brought with them a genetic mutation that almost completely prevented cholesterol buildup. Now there’s an estimated ~38 people descended from this couple that carry the gene. \n\nThe gene in question: Apolipoprotein A-1 Milano",
            "title_similarity": "0.55833817"
        },
        {
            "id": "huf8mta",
            "score": 96,
            "text": "Large biobank studies have identified several loss-of-function mutations that instead of making people more sick are actually protecting people from getting conditions. These mutations basically turn off otherwise functional genes and can protect from coronary artery disease, diabetes, obesity etc. [Here](https://www.nature.com/articles/s41467-018-03911-8) is a paper from the UK Biobank study. One of the first (if not first, I'm just not sure) to describe this phenomen is Daniel MacArthur and his lab's [site](https://macarthurlab.org/) has some information on it.",
            "title_similarity": "0.85949314"
        },
        {
            "id": "huf8r5t",
            "score": 31,
            "text": "The ability to digest lactose as an adult is the result of a genetic mutation that was thought to have developed in humans in response to having domesticated animals like cows and goats. This obviously gave these humans an evolutionary advantage, as they had the ability to gain nutrients from milk.",
            "title_similarity": "0.6303445"
        },
        {
            "id": "hufb19s",
            "score": 10,
            "text": "Lactose tolerance in adulthood used to be a rare thing until we self selected for it, mostly in Europe. Until we domesticated livestock it actually used to be pretty rare to be lactose tolerant, but because it was so advantageous for European societies to use milk as a source of nutrition, as a population we gradually began carrying the lactase production gene in higher and higher percentages of the population until it became the overwhelming majority of people. Now in the West lactose tolerance is present in  I think 90% of the population, whereas I think in Asia it's around 50%, and I think in some areas its as low as 20%. \n\nUntil we domesticated livestock there was just no need to be able to digest lactose after weaning, so that gene was a weird mutation that served no purpose. Now we live in a world where milk is a component of about half our foods. It's pretty wild when you think about it.",
            "title_similarity": "0.598753"
        },
        {
            "id": "hufi3wy",
            "score": 13,
            "text": "East Africans genetics likely do give them an advantage in distance running, they will tend to have biomechanically more efficient gaits. West African dominance of speed events probably also has some genetic basis to it, but exactly what that is there is no consensus on.",
            "title_similarity": "0.53215325"
        },
        {
            "id": "hufiter",
            "score": 1,
            "text": "People with G6PD (X linked) deficit are more resistant to Malaria infections. They are more prone to emolisis due to having lost an anti oxidant enzyme (the g6pd) and a crisis can happen when they eat Broad Beans (it is also called Favism for this reason) or take some therapies which can make it manifest. But this weakness in anti oxidation seems helpful against malaria and the reason may be because the plasmodium falciparum itself is very susceptible of oxidation (some treatments exploit that weakness themselves), hence suffering itself from their same disease. A truckload of people have this mutation which is super common in some areas (more than 400m people on earth) and they concentrate mostly on the subsaharian africa precisely because in that part of the world malaria is endemic, so that mutation has been selected positively through the ages. \n\nThen as others have said also Sickle Cells anemia & a thalassemic trait can help against malaria.",
            "title_similarity": "0.71524704"
        },
        {
            "id": "hufj0m5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.056558207"
        },
        {
            "id": "hufjk67",
            "score": 4,
            "text": "The genes responsible for producing lactase past the breast feeding stage- which lets you digest dairy as an adult, is just about universal in Scandinavia, and way less in other areas in the world where dairy consumption has been less common historically.",
            "title_similarity": "0.535999"
        },
        {
            "id": "hufku5q",
            "score": 13,
            "text": "Yes, Syndactyly.\n\nA condition that makes you swim slightly faster like Aquaman \n\n&#x200B;\n\nhttps://www.cedars-sinai.org/health-library/diseases-and-conditions/s/syndactyly.html#:\\~:text=Syndactyly%20is%20a%20condition%20present,or%20toes%20are%20joined%20together.",
            "title_similarity": "0.50407416"
        },
        {
            "id": "hufnzb0",
            "score": 42,
            "text": "Hereditary Hemochromatosis is a genetic condition characterized by absorption of too much dietary iron. Without intervention in our modern diets it may lead to iron overload, which can cause damage to the joints and certain organs, such as the liver, skin, heart, and pancreas. \n\nPerhaps a useful trait if you had less access to iron rich foods. Perhaps enough to stave off anemia and other iron deficiency diseases in old age, migration etc....\n\nOne treatment is through regular blood withdraws/bleeding, so umm.... it also makaes you Vampire compatible?  ;) \n\n1 in 250 in northern Europeans.",
            "title_similarity": "0.72060084"
        },
        {
            "id": "hufse12",
            "score": 1,
            "text": "There is a variant for being immune to several strains of Norovirus, but you have several downsides as a result!\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4173944/ - Immune to Norovirus  \nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3098274/ - Effects on gut microbiome",
            "title_similarity": "0.8054769"
        },
        {
            "id": "hufsgc0",
            "score": 1,
            "text": "Some people, predominantly women, have a gene/mutation that allows for a fourth type of cone in their eyes to see color. \n\nThey see many, many more variations of color than us normies with only three (red green blue).",
            "title_similarity": "0.5333656"
        },
        {
            "id": "hufuwc1",
            "score": 3,
            "text": "Rare mutations in the PCSK9 gene confer an up to 80% reduction in the risk of heart attacks due to a lower build-up of cholesterol. Some biotech companies ( e.g Verve therapeutics) are working on gene-editing medicines that would essentially edit this mutation into the rest of the population (starting with those at high risk of heart attacks, but then expanding to anyone who wants it). It is really exciting to think that rare advantageous mutations like this can now feasibly be gifted to ALL HUMANS!",
            "title_similarity": "0.715219"
        },
        {
            "id": "hufvt6w",
            "score": 1,
            "text": "If they confer an advantage and are rare they are likely just recent ones. There are many genes that give situational advantages, like paler skin in northern climates to improve vitamin D production where we have less exposure to sunlight or the ability to handle lower air pressure at high altitude,but these are not rare in the local population because they give an advantage and would have been subject to positive selection pressure.",
            "title_similarity": "0.6293083"
        },
        {
            "id": "hufwva8",
            "score": 3,
            "text": "There's a gene in some Tibetans which helps combat mountain sickness.\n\nIn most people, the hypoxia at high altitudes stops the breakdown of a protein which raises haematocrit (effectively red blood cell count).\n\nThis is good for oxygen carrying but if your haematocrit is chronically higher (ie the mountains is where you live instead of just somewhere you're visiting) you can start to suffer some cardiovascular issues due to the increase in blood viscosity increasing strain on the heart.\n\nThe Tibetan gene mutates so the initial step is less sensitive to hypoxic conditions, thus protecting against chronic mountain sickness\n\nEdit:\n\nAlso this one's more well known but the prevelance of cystic fibrosis (notably healthy cystic fibrosis carriers) is linked to advantages of malfunctional CFTR channel when infected with cholera.\n\nCholera normally causes an overactivity of chloride secretion in the small intestine which causes the characteristic diarrhoea of cholera since water follows into the gut and is excreted. \n\nIn healthy carriers the maximum rate of transport of chloride through CFTR here can be lessened, so the water loss is less extreme. Conveniently enough though, only about 40% of CFTR function is actually required for normal physiological function. \n\nThus being a carrier of some CFTR mutations gives little negative consequence and protects against extreme cholera",
            "title_similarity": "0.5948545"
        },
        {
            "id": "hufxqdb",
            "score": 2,
            "text": "Mutations in the SCN9A gene cause congenital insensitivity to pain. The SCN9A gene provides instructions for making one part (the alpha subunit) of a sodium channel called NaV1.7. Sodium channels transport positively charged sodium atoms (sodium ions) into cells and play a key role in a cell's ability to generate and transmit electrical signals. NaV1.7 sodium channels are found in nerve cells called nociceptors that transmit pain signals to the spinal cord and brain. \n\nThe SCN9A gene mutations that cause congenital insensitivity to pain result in the production of nonfunctional alpha subunits that cannot be incorporated into NaV1.7 channels. As a result, the channels cannot be formed. The absence of NaV1.7 channels impairs the transmission of pain signals from the site of injury to the brain, causing those affected to be insensitive to pain.",
            "title_similarity": "0.6293917"
        },
        {
            "id": "hufya5l",
            "score": 7,
            "text": "\nMyostatin related muscular hypotrophy is a condition where the affected has much greater than normal muscle mass and strength. Less of a real world advantage now, but would have been very useful to have steroid levels of muscle during the hunter gatherer years.\n\nAnother condition that would have offered us a real world advantage is the one Dean Karnaezes has. His lactate threshold is significantly higher than the average mans, meaning his muscles are hyper efficient at getting rid of lactic acid. His muscles litteraly never get tired. This allows him to preform insane feats of endurance such as running for 3 days non stop.\n\nAs for modern humans with physical attributes not being advantageous anymore, conditions such as photographic memory are the only ones that offer a significant advantage in day to day life.",
            "title_similarity": "0.53400135"
        },
        {
            "id": "hufzwk8",
            "score": 25,
            "text": "Yes there is a major one. Generations and generations of people being born at high altitude in Nepal have left one group with a gene that allows for operating at about half oxygen. \n\nhttps://www.npr.org/sections/goatsandsoda/2017/05/28/530204187/the-science-behind-the-super-abilities-of-sherpas",
            "title_similarity": "0.42306438"
        },
        {
            "id": "hug0ffb",
            "score": 3,
            "text": "Mutations being seen as a negative is because most of the time they apply a negative effect superior to its positive benefits, there are mutations or course that have a more positive than negative effect, for example there is a case in which peoples bodies don’t produce lactic acid when exercising! This means they don’t get that burning feeling in the muscles that most people do when exercising.",
            "title_similarity": "0.5781927"
        },
        {
            "id": "hug0p4o",
            "score": 1,
            "text": "1/4 of Marfan syndrome cases are the result of a mutation in the FBN1 gene. The condition can be used to one’s advantage, such as in the cases of volleyball player Flo Hyman and violin virtuoso Niccolò Paganini\n\nAlso, evolution as a whole is thought to be a result of genetic mutations that make an organism more fit for an environment, allowing it to survive and reproduce faster and more than their non-mutated counterparts, causing population and species change.",
            "title_similarity": "0.6935853"
        },
        {
            "id": "hug0pcv",
            "score": 5,
            "text": "As a guy who has red hair and green eyes, I'd like to know how these are advantageous? I feel like I sometimes get a drink faster at a crowded bar with the red hair (more noticeable) but I'm also less likely to get away with crime, or be able to sneak anywhere without people recognizing me.",
            "title_similarity": "0.5978198"
        },
        {
            "id": "hug1e2b",
            "score": 1,
            "text": "Hemochromatosis, the body can't lose iron, it's absorbed again by the intestines, so very good 1000s of years ago when you couldn't find any meat and only live on plants for long period of time.\n\nBut kinda bad nowadays when we in the western part of the world live with meat in abundance. The liver does not like to much iron.",
            "title_similarity": "0.5969732"
        },
        {
            "id": "hug1hlj",
            "score": 32,
            "text": "About 1 in 11 people aren't allergic to poison oak / poison ivy.  \n\nNot hugely rare, and possibly not a huge selective advantage.  \n\nBut anyone who has had a case of poison oak would definitely say it's an advantage.",
            "title_similarity": "0.49860364"
        },
        {
            "id": "hug6lu3",
            "score": 1,
            "text": "Loss of function mutations of PCSK9, whose protein product is involved with regulating LDL receptors, result lower LDL concentrations in blood and a lower risk of cardiovascular disease.      There are even [some cases](https://journals.lww.com/md-journal/fulltext/2020/08210/loss_of_function_mutation_of_pcsk9_as_a_protective.54.aspx) of people who would otherwise be expected to have high cholesterol (because of an inherited hypercholesterolemia) who do not because they have a loss of function variant of PCSK9. As you might expect, finding inhibitors of PCSK9 is an active area of research. The first generation of these, antibody drugs like alirocumab, are already available, though there is controversy over how much benefit they actually provide (especially given their high cost).",
            "title_similarity": "0.6951611"
        },
        {
            "id": "hug7ei0",
            "score": 1,
            "text": "Yes, kind of. Generally they have some drawbacks. If you take endurance athletes, there is a mutation that makes your body produce excessive hemoglobin, which is useful if you want to run a long distance. Very few people actually have this condition, plus you’d need to luck out genetically to get all the right genes to be a pro athlete. It’s discovery was about 10 years ago and the person studied was a Norwegian? cross country skier. \n\nDrawback: when you unknowingly have this mutation your blood is thicker and people usually die at a youngish age ~50yo. Also, your skin turns a reddish color.",
            "title_similarity": "0.6313708"
        },
        {
            "id": "hug9dfd",
            "score": 2,
            "text": "A certain mutation of one of the copies of the CFTR gene has been statistically linked to providing a strong defense against tuberculosis - two mutations of that one and you've got yourself a case of cystic fibrosis. Those areas, mostly in Europe, where TBC was especially prevalent in the old times now have a significant occurence of CF patients.",
            "title_similarity": "0.7353994"
        },
        {
            "id": "huga31l",
            "score": 1,
            "text": "With exercise we build up lactate in our muscles which limit our ability to continue. There are some people who have a mutation that allows them to clear the lactate more quickly. One example is Dean Karnazes. You can look him up and read about how advantageous it is for your muscles to not get tired.",
            "title_similarity": "0.6648112"
        },
        {
            "id": "hugams4",
            "score": 1,
            "text": "So, from an evolution standpoint, many harmful mutations contain benefits that are actually the reason they continue on. If you think about it, if a mutation kills it’s host, or makes death more likely, it will be selected against and eventually vanish. Genetic conditions like sickle cell anemia actually make the subject immune to malaria, which is why it’s more common in black and African populations that originated from areas with high malaria infection rates. Another lesser known example, psoriasis, actually helps subjects heal faster as skin cells are replaced at something like 20x the normal rate. So while they suck in one regard, they help in another that evens out or gives a slight advantage overall",
            "title_similarity": "0.75734115"
        },
        {
            "id": "hugc2fo",
            "score": 1,
            "text": "There are mutations that allow for more fast twitch muscle fibers, which is why we have pro- level athletes. \n\nThere are mutations that provide bigger lungs. Michael Phelps’ feet angled an additional 15%. \n\nThere are tons of mutations around us.",
            "title_similarity": "0.5393802"
        },
        {
            "id": "hugc9dd",
            "score": 4,
            "text": "A small percentage of females are tetrachromats, which means they can see additional spectrums of color the rest of us cannot. \n\nThe ironic thing is that since our brains are centered around language, if the words don’t exist to describe a thing, it’s hard to conceive of it, even as you’re looking right at it. So many tetrachromats don’t realize what they are seeing - in part because there are no words for those colors. \n\nFor a more common example of this, you can [read about how long various cultures took to invent the word “blue.”](https://www.ancient-origins.net/unexplained-phenomena/color-blue-0010720)\n\n[Or if you want the whole deep dive, you can listen to this Radio Lab episode.](https://www.wnycstudios.org/podcasts/radiolab/episodes/211119-colors)",
            "title_similarity": "0.5054678"
        },
        {
            "id": "hugdoqe",
            "score": 2,
            "text": "The problem with a wholly beneficial mutation in your above scenario is that it will either have a helpful phenotype that is not clearly apparent, and thus will remain rare or limited to environmental conditions where it is apparent, or it will simply become less rare by virtue of its inherent benefits + positive selection -- thus excluding it from your topic.\n\n*Sickle Cell* is a good example because it's harmful in most situations as a heterozygote (one mutant and one normal gene), very damaging as a homozygote (two mutant genes), and very helpful as a heterozygote in the specific environmental condition of being surrounded by malaria.\n\nThe calculus shifts a little too depending on if it's a novel / *de novo* mutation and thus hasn't had time to spread yet. But even in such a case, the *de novo* mutation must pop up in the germ line or it will simply arise and die out in the person it occurred in. To give a less common example than sickle cell (or HIV, which fits the OP much better, but I'm sure has been mentioned by others): *the prion protein* has naturally evolved to make itself resistant to all prions in actual humans, this is the *G127V protective variant.*\n\nIt's just that this occurred during the *Kuru epidemic in Papua New Guinea*, and people there *no longer practice ritualistic cannibalism*, so this awesome gene that could make everyone immune to random prion disease, genetic prion disease, and infectious prion disease, will never really spread, and very possibly just die out in Papua New Guinea due to *genetic drift* \\-- especially considering the time frame for prion disease, which would never occur early enough to impact selective pressure *unless everyone is snacking on their dead relatives from an early age.*",
            "title_similarity": "0.6999012"
        },
        {
            "id": "huge412",
            "score": 3,
            "text": "That's something that can only really be seen in the rear view mirror. What makes a mutation advantageous, is that it allows the one having it, a better chance to procreate, and pass it on, changing it from rare, to common.\n\nEven if we could know all the mutations that are out there in humanity right now, it wouldn't be possible to say if any of them provide an advantage or not, until we see if they're spread throughout the population.",
            "title_similarity": "0.7071742"
        },
        {
            "id": "hugi0cc",
            "score": 4,
            "text": "XYY syndrome comes to mind. This is the condition of a man with two Y chromosomes. It is mostly asymptomatic, however, these men do grow taller than their genetics would normally allow. For example, if a man with the exact same genetic information had a single Y chromosome he might grow to 5 ft 9 in. But with the second Y chromosome, he will develop to reach a height of 6 ft 2 in.\n\nSo if you think height is an advantage, an error in cell division turns out to be a benefit. Sometimes mild learning disabilities accompany the height, and aggressive, testosterone-linked behavior.",
            "title_similarity": "0.53446305"
        },
        {
            "id": "huglr8g",
            "score": 3,
            "text": "There was a gene (dec12 ?) that allows you to get away with 6 hours of sleep instead of 8. Certain tibetans have a trait where they need less oxygen, and olympic athletes often carry the same gene. Some women can see in more colors. Certain humans have myostatin deficiency, and build more muscle than they need. I don’t know that these are all 100% upside, nature is complex, but I can certainly see what the advantages would be.",
            "title_similarity": "0.5611397"
        },
        {
            "id": "huglx4x",
            "score": 3,
            "text": "Actually... context matters too.\n\n Sickle cell anemia for example is overall bad for a person. But, we see it very common in areas with malaria.\n\nGuess what sickle cell Animia gives resistance too...\n\nJust because a mutation is bad in many situations doesn't mean it doesn't convey an advantage in others. Sadly in our global world and such more often we don't get to see or make use of the advantage because we later our environment.",
            "title_similarity": "0.69961727"
        },
        {
            "id": "hugmx47",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.09186256"
        },
        {
            "id": "hugp4vx",
            "score": 48,
            "text": "Pectus carinatum (pigeon chest)\n\nEnds up allowing lungs to be larger (when I was measured as a kid I had 30% larger lung capacity than normal)\n\nNot that it matters anymore but it also makes your rib cage the shape of medieval armor which is better at deflecting blows.",
            "title_similarity": "0.45853472"
        },
        {
            "id": "hugq4dd",
            "score": 4,
            "text": "Certain populations of people have a genetic mutation conferring higher oxygen saturation in high-altitude environments\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC5241213/\n\nhttps://www.science.org/content/article/tibetans-inherited-high-altitude-gene-ancient-human\n\nThat there is proof of evolution through natural selection in humans.",
            "title_similarity": "0.60567474"
        },
        {
            "id": "hugteck",
            "score": 3,
            "text": "Well, it depends.  \n\nADHD appears to be caused by specific genetic mutations and/or is heritable.\n\n* https://psychcentral.com/lib/the-genetics-of-adhd#1\n* https://scholar.google.com/scholar?q=adhd+chromosome\n\nIt has a wide host of negative issues, including much higher chance of get fired, get divorced/cheat, smoking, and jail time than the general population.\n\nhttps://www.additudemag.com/statistics-of-adhd/\n\nHowever, the benefit I guess, is that the energy, hyperfocus on interesting tasks, creativity, and risk taking is beneficial for entrepreneurship.\n\nhttps://www.additudemag.com/entrepreneurship-adhd-business-research-traits-stories/",
            "title_similarity": "0.7753477"
        },
        {
            "id": "hugtoxt",
            "score": 2,
            "text": "Some humans who have extra copies of a certain gene (amylase genes, or AMY1) can digest starches more easily than humans with fewer copies.\n\nIt is believed that human ancestors who first had this mutation 4 million years ago had an advantage because they could get energy from starches much more easily than other animals -- and this extra energy possibly allowed human ancestors to thrive and eventually lead to us.",
            "title_similarity": "0.6115254"
        },
        {
            "id": "huguw42",
            "score": 5,
            "text": "Not a very scientific answer but a friend of mine had no armpit hair and her mother also did not. Quite a good mutations when society expects you to have no hair I guess. Saves some time. And yes I know it catches your sweat but that function isnt really nescesary when wearing a shirt.",
            "title_similarity": "0.44484624"
        },
        {
            "id": "hugy7yo",
            "score": 1,
            "text": "Mutations can confer advantage based on the environment in which they are used. Maybe you have a mutation that makes you sweat more. Not helpful if you work in an office but maybe helpful if you live in a hot environment. \n\nAs our society and environment change there may be mutations that aren't helpful now that might prove helpful later. It's really down to the specific mutation and the changes that occur.",
            "title_similarity": "0.6900986"
        },
        {
            "id": "huh5g0r",
            "score": 37,
            "text": "If you look at ultra runners, people who can run 50miles in a day, you'll find that they have genetic mutations that clear out lactate faster than normal. \n\nSo in other words, they can run faster for longer without ever getting that \"burn\" that you feel when you're sprinting. \n\nTheir energy systems are more efficient.",
            "title_similarity": "0.50425404"
        },
        {
            "id": "huh5ybi",
            "score": 5,
            "text": "The gene for the lactase enzyme that allows people to continue to digest lactose into adulthood.  Most mammals can only digest lactose when they are young & breastfeeding. Certain human populations have a higher instance of this gene.  In populations that have animal milk as part of their diet, having this gene gave you a better chance at survival than someone else who could not digest lactose.",
            "title_similarity": "0.5726542"
        },
        {
            "id": "huh9lom",
            "score": 4,
            "text": "Cross Country Skier Eero Mäntyranta had a mutation which caused them to produce excess red blood cells. This was originally thought to be EPO blood doping, but it was just a result of a natural mutation, which in turn made them one of the most dominant X-country skiers in the world   \n\n\n[https://blog.helix.com/rare-genetics-athleticism-eero-mantyranta/](https://blog.helix.com/rare-genetics-athleticism-eero-mantyranta/)",
            "title_similarity": "0.65648854"
        },
        {
            "id": "huhasrz",
            "score": 11,
            "text": "Read \"the survival of the sickest\".  In it the author talks about some diseases that may help you live long enough to procreate, but eventually kill you. \n\nI remember reading about 20 or 30 years ago about this village in Italy where the people all lived to like 90 or 100.  They did testing and determined that they had this giant protein that would inhibit arteriosclerosis.   \n\nThere are some mutations that may be beneficial, but not necessarily in an evolutionary sense.   There's a woman who has four kinds of cone cells in her eyes.  She can distinguish something like 10 million colors while the rest of us may only be able to distinguish 1 million.   That may be beneficial as an artist or something, but will it make you more likely to pass on your genes?   \n\nEven as an artist, if no one else can distinguish the colors, would it really help you?",
            "title_similarity": "0.74017584"
        },
        {
            "id": "huhf65x",
            "score": 5,
            "text": "There is a gene which promotes wound healing:\n\n[https://www.eurekalert.org/news-releases/484499](https://www.eurekalert.org/news-releases/484499)\n\nAnd another one which reduces bleeding.  Factor 5 Leiden\n\nIf \n\nyou only got one copy of it, when you got injured - you are less likely to bleed out and most people with one copy never experience a significant blood clot, which is the flip side with two copies. \n\n[https://medlineplus.gov/genetics/condition/factor-v-leiden-thrombophilia/](https://medlineplus.gov/genetics/condition/factor-v-leiden-thrombophilia/)\n\n&#x200B;\n\nHumanity is well on it's way to Wolverine type abilities",
            "title_similarity": "0.69034594"
        },
        {
            "id": "huhn1gz",
            "score": 13,
            "text": "Ashkenazi Jews have a lot of genetic mutations which makes them more likely to develop certain illnesses, because they usually reproduced with other Jews, creating a kind of gene pool bottle neck. \n\nWhether these mutations have any benefits has been heavily discussed. I believe there was a study of high IQ in Ashkenazi Jews.",
            "title_similarity": "0.7689152"
        },
        {
            "id": "huhuj2l",
            "score": 9,
            "text": "There was a group of people at the top of South America that Darwin ran into on his voyage. These people from Tierra del Feugo could reportedly see much farther than the sailors on Darwin ship.  \n  \nThey are also a people who some people believe to be descended from Austral-Asians who crossed the Pacific long before the Bering migration. Indigenous people of Australia at the time of White settlement also had vision that was much better than European arrivals.",
            "title_similarity": "0.47403413"
        },
        {
            "id": "huhzb9s",
            "score": 8,
            "text": "Having one copy of the cystic fibrosis gene supposedly protects someone from tuberculosis while also having negligible to no impact on health.   \n\n\nWhile this may not be useful in the modern day it would have been highly beneficial earlier in history when tuberculosis was more common. The same is true of Sickle Cell, and there are surely other diseases that confer some sort of advantage that explain their prevalence.",
            "title_similarity": "0.68191683"
        }
    ]
}