{
    "Russian Cosmonauts Wear Yellow and Blue When Arriving on ISS.\n": [
        {
            "id": "i17tf5d",
            "score": 1,
            "text": "Users often report submissions from this site and ask us to ban it for sensationalized articles. At /r/worldnews, we oppose blanket banning any news source. Readers have a responsibility to be skeptical, check sources, and comment on any flaws.\n\nYou can help improve this thread by linking to media that verifies or questions this article's claims. Your link could help readers better understand this issue. If you do find evidence that this article or its title are false or misleading, contact the moderators who will review it\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/worldnews) if you have any questions or concerns.*",
            "title_similarity": "0.18566905"
        },
        {
            "id": "i17ymvd",
            "score": -2,
            "text": "It's hard to believe they were able to break through Earth's gravitational pull with balls that big.",
            "title_similarity": "0.30746746"
        },
        {
            "id": "i17xhux",
            "score": -1,
            "text": "Soooo ballsy. I have a ton of respect.",
            "title_similarity": "0.010757752"
        },
        {
            "id": "i17xs6p",
            "score": -4,
            "text": "Balls, great big russian balls.",
            "title_similarity": "0.20348406"
        },
        {
            "id": "i17v565",
            "score": 29,
            "text": "Didn’t think the ISS was big enough to accommodate the massive balls of three cosmonauts.\nDon’t drink the tea packets, comrades.",
            "title_similarity": "0.4696163"
        },
        {
            "id": "i18n5uu",
            "score": 28,
            "text": "You people believe anything.",
            "title_similarity": "0.08871038"
        },
        {
            "id": "i18ykeh",
            "score": 8,
            "text": "These are high vis space suits. Lmao y'all will try to spin anything.",
            "title_similarity": "0.46067792"
        },
        {
            "id": "i18hgq0",
            "score": 10,
            "text": "You guys are literally not getting the symbolism: It is a Russian Flag over Ukrainian colors- it means they are one and Ukraine is not separate from Russia, or an end to their sovereignty.",
            "title_similarity": "0.37551206"
        },
        {
            "id": "i1964b2",
            "score": -4,
            "text": "I love how everyone is fired up because the people being attacked are white. It’s a step in a direction to feeling outrage over humans being hurt. Keep going.",
            "title_similarity": "0.13684772"
        },
        {
            "id": "i17wkko",
            "score": 3,
            "text": "Good thing they’re in space.  If they got caught wearing that in Russia, they’d be tossed in the gulag.  Oh wait, did I say Russia?  I meant Koch Industries.",
            "title_similarity": "0.5578038"
        },
        {
            "id": "i17yk93",
            "score": -4,
            "text": "Straight to the gulag for you",
            "title_similarity": "0.34464255"
        },
        {
            "id": "i18f6i9",
            "score": 49,
            "text": "You people are morons, this looks like a standard cosmonaut suit. It literally has the Russian flag on it ffs.",
            "title_similarity": "0.55791783"
        },
        {
            "id": "i18zqgq",
            "score": 0,
            "text": "After this move, the Cosmonauts' families are gonna *Rus(h)* out of the country.",
            "title_similarity": "0.40419248"
        },
        {
            "id": "i192p2r",
            "score": 0,
            "text": "Some people are about to mysteriously disappear",
            "title_similarity": "0.032121297"
        },
        {
            "id": "i192vhn",
            "score": 0,
            "text": "Giga chads. Much respect to them 🙏🏽",
            "title_similarity": "0.053996578"
        },
        {
            "id": "i194fca",
            "score": 0,
            "text": "I guess Elon bringing them back to the US.",
            "title_similarity": "0.20782265"
        },
        {
            "id": "i1952gm",
            "score": 0,
            "text": "What happens to these guys when they come back down to earth? Does Putin have them arrested?  Are they even gonna land in Russia?",
            "title_similarity": "0.42190284"
        },
        {
            "id": "i1966v0",
            "score": 0,
            "text": "They hope to land in Miami…",
            "title_similarity": "0.20069933"
        },
        {
            "id": "i196dqm",
            "score": 0,
            "text": "Got to love the cosmonauts. Don't give a shit about crap politics in their home country and even defy for the sake of science and comraderie.",
            "title_similarity": "0.3793641"
        },
        {
            "id": "i18p3xd",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.014970249"
        },
        {
            "id": "i17vv3q",
            "score": 2,
            "text": "Hopefully they won't jump from the ISS balcony",
            "title_similarity": "0.38985017"
        },
        {
            "id": "i185bzm",
            "score": 137,
            "text": "This article is bunk. Nothing in the article indicates that this was an intentional statement, and the uniforms themselves have massive Russian flags emblazoned on them. The uniforms were made by the space agency, probably weeks or months in advance, and were probably approved by the higher ups. I don't think there's room for sneaking in a political message like that.\n\nEdit: Apparently they're high visibility flight suits",
            "title_similarity": "0.53004795"
        },
        {
            "id": "i180vcc",
            "score": -3,
            "text": "Holy shit.",
            "title_similarity": "-0.008933436"
        },
        {
            "id": "i18uzla",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.0005105231"
        },
        {
            "id": "i17wtyz",
            "score": 1,
            "text": "I guess they're hoping Putin will be deposed before they return to earth. And good on them!",
            "title_similarity": "0.29042304"
        },
        {
            "id": "i18diqm",
            "score": 1,
            "text": "Could it just be that the suits are those colors for no significant reason",
            "title_similarity": "0.18236677"
        },
        {
            "id": "i18eetb",
            "score": 1,
            "text": "ledgend has it, putin is already planning the abort and subsequent burn up on re-entry.  \n\n\nor the suits are just a ploy into making the americans think nothing is gonna go wrong, meanwhile they undock every russian module from the ISS at the same time.",
            "title_similarity": "0.4915601"
        },
        {
            "id": "i18l4vl",
            "score": 1,
            "text": "Pardon my skepticism, but does anyone have clarity on whether this photo is doctored or not? \n\nIt seems like the white cable in the photo frequently turns yellow, as if someone painted over the original image, but then again it could just be the poor quality photo on the article.",
            "title_similarity": "0.20946503"
        },
        {
            "id": "i199jpj",
            "score": 1,
            "text": "Mass formation psychosis at it's finest.",
            "title_similarity": "0.067441866"
        },
        {
            "id": "i19a3sc",
            "score": 1,
            "text": "Despite all known laws of physics, these folks fell out of a window while in orbit and fell to their death",
            "title_similarity": "0.3937208"
        },
        {
            "id": "i18xm8s",
            "score": 19,
            "text": "Jesus Christ. **Do Redditors really think that cosmonauts don suits like they choose dinner outfits?** Far more likely is that these suits were prepared long ago and had nothing to do with this war. It's the obvious explanation for everyone who is not a fucking idiot. My god.\n\nEdit: those suits are not yellow and blue. They are just yellow. With various patches on them. Good grief, people.",
            "title_similarity": "0.4033289"
        },
        {
            "id": "i18kcd0",
            "score": -16,
            "text": "[removed]",
            "title_similarity": "-0.0005105231"
        },
        {
            "id": "i184x1j",
            "score": 25,
            "text": "i dont think this was a pro ukrainian political statement- those suits are not made in five minutes... lets see it with other eyes: russia thought they would take ukraine in a few days... and this suits were probably planned as some kind of statement a la: hey ukraine welcome back were u belong- to russia.\n\nand as mentioned before since u cant make those suits in 5 minutes they had no other option then to use this suits in the flight now.\n\nthe astronaut gave a weird answer when asked about the colors... they probably dont wanna be seen as pro russian i mean astronauts are after all pretty smart people,highly educated.",
            "title_similarity": "0.48949888"
        },
        {
            "id": "i185s0y",
            "score": 6,
            "text": "Damn. That is next level trolling. I am so utterly impressed. Good for them. I hope they aren't punished.",
            "title_similarity": "0.09087747"
        },
        {
            "id": "i18vz6y",
            "score": 6,
            "text": "... For wearing their normal cosmonaut suits? You guys don't believe [mirror.co.uk](https://mirror.co.uk) when talking about brexit, but will believe any bullshit they say now just because it goes with your political views?\n\nGive me a break, fuck.",
            "title_similarity": "0.32313886"
        },
        {
            "id": "i17ubya",
            "score": -2,
            "text": "They're setting the stage for Salisbury 2: In Space.",
            "title_similarity": "0.5859935"
        },
        {
            "id": "i18db3p",
            "score": 2,
            "text": "They just magically all got yellow flight suits?\n\nI want to believe this is what actually happened, but I don’t.",
            "title_similarity": "0.39898106"
        },
        {
            "id": "i18wg3m",
            "score": -2,
            "text": "just a stunt for the west",
            "title_similarity": "0.05264064"
        },
        {
            "id": "i197ncg",
            "score": -2,
            "text": "Literally even the Russian people do not support putin so why do republicans?  How are they so deranged?",
            "title_similarity": "0.19580245"
        },
        {
            "id": "i18czpq",
            "score": 7,
            "text": "This is just a coincidence. Seriously calm down people.",
            "title_similarity": "0.049938455"
        },
        {
            "id": "i18g1jv",
            "score": 5,
            "text": "That being a coincidence seems far more likely than astronauts smuggling their secret protest spacesuits onto a rocket that is probably inspected tens of times before launch, and especially so in times when Russia is extremely paranoid about well, everything. We should remember that for Russia the state of Ukraine is not an enemy in itself, so having a ukrainian flag on something wouldnt be such a powerful statement.\n\nThey claim that Ukraine is illegally overtaken by nazis and needs to be liberated by their loving brothers in the east. (aka made back into the puppet state it was before Euromaidan)\n\nI would prefer to believe the romantic defiance narrative, but it falls apart pretty quickly if you rationally think about the logistics of it all.\n\nI dont assume the kosmonauts support the war but they are scientists who want to do science work, and the ISS is not the place to take political stances against the only people who can get you back down to earth.\n\nIts a pretty funny coincidence though, and i bet Putin is still pretty mad about it being reported this way.",
            "title_similarity": "0.41595304"
        },
        {
            "id": "i18e8zz",
            "score": 16,
            "text": "My Ukrainian friend said this is just a standard cosmonaut uniform and doesn’t signify anything",
            "title_similarity": "0.44393966"
        },
        {
            "id": "i17wala",
            "score": 2,
            "text": "Nice!!!",
            "title_similarity": "-0.013990123"
        },
        {
            "id": "i185433",
            "score": 4,
            "text": "Aren’t these their regular flight suits with their own flag on it?\n\nI fail to see how this was a sign or nod to Ukraine. It literally has the Russian flag plastered on it, not “blue”.",
            "title_similarity": "0.5086881"
        },
        {
            "id": "i18lvba",
            "score": -2,
            "text": "This is fake like the moon landing!",
            "title_similarity": "0.41451478"
        },
        {
            "id": "i18pg1i",
            "score": 2,
            "text": "I feel bad for these scientists. No matter how much good work they do for their society and science when they comeback to earth they'll be put in jail for going against their regime. Never underestimate Russians ability to withstand pain & suffering",
            "title_similarity": "0.25246674"
        },
        {
            "id": "i17ymbi",
            "score": 6,
            "text": "Ballsy and virtuous. If there’s any trouble with securing their return home to Earth, I bet Father Elon will help",
            "title_similarity": "0.25162673"
        },
        {
            "id": "i18q3ix",
            "score": 7,
            "text": "Just yellow. With navy blue on special parts, those parts are always dark blue or grey. On vac suites they are also blue.\nDark blue, not light blue.\nSo it is not about Ukraine.",
            "title_similarity": "0.46895647"
        },
        {
            "id": "i17yjrv",
            "score": -23,
            "text": "This photo was not taken on the ISS, I am sorry to say.",
            "title_similarity": "0.36783034"
        },
        {
            "id": "i18t6b8",
            "score": 7,
            "text": "There is a big chance it was just a coincidence",
            "title_similarity": "0.022410374"
        },
        {
            "id": "i17y3ks",
            "score": 0,
            "text": "Putin:  \"What do you mean they cancelled the counter-astronaut program in 1973?\"",
            "title_similarity": "0.4641977"
        },
        {
            "id": "i187ihg",
            "score": 5,
            "text": "We are seeing many Ukranians and few Russians (these included) remind the world what courage looks like.",
            "title_similarity": "0.35103118"
        },
        {
            "id": "i18c8ex",
            "score": 0,
            "text": "Is this real? I thought they were pro Russian last week.",
            "title_similarity": "0.29505384"
        },
        {
            "id": "i18c96l",
            "score": 0,
            "text": "Well they’ll all be killed probably lol",
            "title_similarity": "0.06064965"
        },
        {
            "id": "i18dw7l",
            "score": -4,
            "text": "Elon needs to send up a dragon and pick these guys up. Great addition to his program.",
            "title_similarity": "0.37058008"
        },
        {
            "id": "i18emjf",
            "score": 0,
            "text": "That's one way to get Putin to shoot the ISS off orbit with a missile.",
            "title_similarity": "0.5752596"
        },
        {
            "id": "i18g2sj",
            "score": 0,
            "text": "Careful, they may invade the station..",
            "title_similarity": "0.2451536"
        },
        {
            "id": "i18g9al",
            "score": 0,
            "text": "That has got to chaff Uncle Vlad's ass",
            "title_similarity": "0.05504814"
        },
        {
            "id": "i18rrf4",
            "score": 0,
            "text": "Haha, what else were they gonna do? Anything less would've caused some real resl awkward tension up there with all those other astronauts. You know how weird it must be for them right now?",
            "title_similarity": "0.29424864"
        },
        {
            "id": "i18rz0q",
            "score": 0,
            "text": "Just.  Beautiful.",
            "title_similarity": "-0.007780798"
        },
        {
            "id": "i18rzxd",
            "score": 0,
            "text": "Wow",
            "title_similarity": "-0.043625634"
        },
        {
            "id": "i18s24w",
            "score": 0,
            "text": "Can’t hurt us up here Russia! Fuck you!",
            "title_similarity": "0.33979785"
        },
        {
            "id": "i18s3g4",
            "score": 0,
            "text": "Wow these dudes better hope they don't touchdown in Russian owned territory",
            "title_similarity": "0.2561379"
        },
        {
            "id": "i18s63f",
            "score": 0,
            "text": "Holy shit! Talk about brave, giving the finger to Putin while in space.",
            "title_similarity": "0.5780335"
        },
        {
            "id": "i18so9v",
            "score": 0,
            "text": "Enough to make a grown man cry",
            "title_similarity": "0.06718072"
        },
        {
            "id": "i18ur9c",
            "score": 0,
            "text": "This act of defiance is fucking awesome!",
            "title_similarity": "0.06184225"
        },
        {
            "id": "i18vtob",
            "score": 0,
            "text": "Huge gesture",
            "title_similarity": "-0.031955883"
        },
        {
            "id": "i18wdls",
            "score": 0,
            "text": "RIP 🥲",
            "title_similarity": "0.039822172"
        },
        {
            "id": "i18yt5i",
            "score": 0,
            "text": "They might fall out an open ISS window",
            "title_similarity": "0.33324632"
        },
        {
            "id": "i18zos4",
            "score": 0,
            "text": "If this is indeed a political statement and not an accident, these three will be charged with Russia's new 'extremist' laws and can be tried as terrorists when they return.",
            "title_similarity": "0.28990722"
        },
        {
            "id": "i1939ft",
            "score": 0,
            "text": "This would have taken considerable effort on the ground to produce these suits and have them approved for flight. It’s not as if you can just sneak suits onto the Soyuz before launch.",
            "title_similarity": "0.5060783"
        },
        {
            "id": "i193f7z",
            "score": 0,
            "text": "kkk love it !",
            "title_similarity": "0.010193537"
        },
        {
            "id": "i1943cq",
            "score": 0,
            "text": "Imagine if American astronauts were in support of one of the U.S.A’s “enemies”. Pretty wild.",
            "title_similarity": "0.45889497"
        },
        {
            "id": "i1948d8",
            "score": 0,
            "text": "rather well fed in space, I see",
            "title_similarity": "0.3404593"
        },
        {
            "id": "i195fpb",
            "score": 0,
            "text": "Russian space version of wearing jeans at the office cause you know your manager is gonna get shitcanned before he can reprimand you.",
            "title_similarity": "0.42706957"
        },
        {
            "id": "i195z7q",
            "score": 0,
            "text": "💯",
            "title_similarity": "0.0032669865"
        },
        {
            "id": "i196iho",
            "score": 0,
            "text": "Would imagine it's true, highly intelligent people wanting to have a planet to come back to....",
            "title_similarity": "0.26164103"
        },
        {
            "id": "i196mp0",
            "score": 0,
            "text": "“No one can hear you scream in space.” -Vladimir Putin",
            "title_similarity": "0.4394549"
        },
        {
            "id": "i197j7f",
            "score": 0,
            "text": "I did not expect that",
            "title_similarity": "0.0047275424"
        },
        {
            "id": "i19826s",
            "score": 0,
            "text": "I cant imagine what they were thinking when they heard all the threats made. They are scientists at the end of the day.",
            "title_similarity": "0.2504028"
        },
        {
            "id": "i1982qb",
            "score": 0,
            "text": "They might need a ride home",
            "title_similarity": "0.0451202"
        },
        {
            "id": "i198nxx",
            "score": 0,
            "text": "So far the news I’m most thankful for is Putin responding “no we’re not doing that” to the rumor that they might be stranding the American astronaut up in the ISS.\n\nSo at least he’s not FULLY fully gone totally off the deep end. Doing that shit, or really just doing anything below board to the American astronaut would 100% be the spark that starts WW3.",
            "title_similarity": "0.50963587"
        },
        {
            "id": "i199d01",
            "score": 0,
            "text": "I hope Russian cosmonauts won’t become clumsy when they come back to earth and start falling out of windows",
            "title_similarity": "0.58826524"
        },
        {
            "id": "i19a1l8",
            "score": 0,
            "text": "It's actually green suit.\nFactory forgot to mix it.",
            "title_similarity": "0.30157667"
        },
        {
            "id": "i19avng",
            "score": 0,
            "text": "Thats a heck of a height to get defenestrated from.",
            "title_similarity": "0.117341116"
        },
        {
            "id": "i19cc91",
            "score": 0,
            "text": "Very symbolic. But how did they get away with it without anyone noticing and reporting it? It’s not like they sew their own uniforms?",
            "title_similarity": "0.16497216"
        },
        {
            "id": "i19cs2s",
            "score": 0,
            "text": "致敬",
            "title_similarity": "0.003158562"
        },
        {
            "id": "i19d9ry",
            "score": 0,
            "text": "Astronauts are well educated and exist to advance humanity. They dont have for petty geopolitics",
            "title_similarity": "0.32815546"
        },
        {
            "id": "i19ee56",
            "score": 0,
            "text": "The Russian government did threaten to hurl them into into the earth.",
            "title_similarity": "0.35137996"
        },
        {
            "id": "i19g7p0",
            "score": 0,
            "text": "Putin is criminally insane - not smart at all.",
            "title_similarity": "0.11448178"
        },
        {
            "id": "i19q59j",
            "score": 0,
            "text": "So its for putler propaganda in media, like we Care, While in fact they bomb cities to the ground",
            "title_similarity": "0.15371424"
        },
        {
            "id": "i1a2tla",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.014970249"
        },
        {
            "id": "i1a3f8y",
            "score": 0,
            "text": "https://drive.google.com/file/d/1FlqNrLAm7Er_1D_vWxGJrPXrbpty5TCA/view",
            "title_similarity": "0.12157993"
        },
        {
            "id": "i1a4xnv",
            "score": 0,
            "text": "Lmao they shouldn't be allowed on the iss",
            "title_similarity": "0.35789257"
        },
        {
            "id": "i1a6gxh",
            "score": 0,
            "text": "All fake💯% earth is flat boys",
            "title_similarity": "0.22609197"
        },
        {
            "id": "i1a6sao",
            "score": 0,
            "text": "Who cares like that's stopping the war",
            "title_similarity": "0.11194273"
        },
        {
            "id": "i1abpcr",
            "score": 0,
            "text": "I just hope for their sake that their return ticket is confirmed and that there is no jail near the landing site.....",
            "title_similarity": "0.280202"
        },
        {
            "id": "i1bg07q",
            "score": 0,
            "text": "Photoshop! There are a lot of “Deep fakes” hitting the cyber space at the moment. The Russians secretary of defense just spoke to a “fake” Zelensky bot on the telephone.\nBesides,  everyone knows that the “Mirror” is Yellow Pages!",
            "title_similarity": "0.379193"
        },
        {
            "id": "i1bolni",
            "score": 0,
            "text": "But why?",
            "title_similarity": "0.0044836104"
        },
        {
            "id": "i1cyvys",
            "score": 0,
            "text": "Fuck all of you",
            "title_similarity": "0.070782416"
        },
        {
            "id": "i1cyz0h",
            "score": 0,
            "text": "Fuck you bastard",
            "title_similarity": "0.001350414"
        },
        {
            "id": "i17w6sj",
            "score": -15,
            "text": "[deleted]",
            "title_similarity": "0.014970249"
        },
        {
            "id": "i18iahp",
            "score": 20,
            "text": "You're all fucking idiots",
            "title_similarity": "-0.007019965"
        },
        {
            "id": "i17wlzs",
            "score": 5,
            "text": "They have the right stuff!",
            "title_similarity": "0.03730975"
        },
        {
            "id": "i17ydgb",
            "score": -4,
            "text": "I don’t want to assume gender here, but, dead men walking",
            "title_similarity": "0.060492683"
        },
        {
            "id": "i18pfwf",
            "score": 5,
            "text": "You guys know that's a standard uniform right? Its not just yellow n blue its yellow n the russian flag\n\nTheir space walk suits also come in yellow, or blue, or white",
            "title_similarity": "0.6982941"
        },
        {
            "id": "i18t4fq",
            "score": 5,
            "text": "Are the uniform colors just a coincidence? They look standard issue and I don’t see anyone else wearing the colors of their country’s flag.",
            "title_similarity": "0.2329636"
        },
        {
            "id": "i18yooe",
            "score": 5,
            "text": "I think this is just coincidence. They are sporting large Russian flags on a primarily yellow jumpsuit that just happens to have a few blue stripes.",
            "title_similarity": "0.52504605"
        },
        {
            "id": "i191acr",
            "score": 5,
            "text": "Nice irony, but I think it’s coincidence; space suits aren’t made in a day, nor do astronauts/cosmonauts get to pick their outfit colours like it’s a dress-down day at school.",
            "title_similarity": "0.45768535"
        },
        {
            "id": "i17vvnp",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "-0.0005105231"
        },
        {
            "id": "i17wkxe",
            "score": 11,
            "text": "Welp time to test the space missiles - Putler",
            "title_similarity": "0.5643985"
        },
        {
            "id": "i19oxpf",
            "score": -6,
            "text": "Show me in the article where this has anything to do with Ukraine. Morons over here jerking over standard hi vis space suits. You people really are that fucking dumb. You eat this shit like candy. Give it more awards! Lmaoooo",
            "title_similarity": "0.3466898"
        },
        {
            "id": "i17x3tu",
            "score": 1,
            "text": "These are just russian people with more than 100iq and no tv.",
            "title_similarity": "0.34825242"
        },
        {
            "id": "i180fji",
            "score": 1,
            "text": "“Try getting us up here Putler!”\n\n- this cosmonaut team",
            "title_similarity": "0.61722994"
        },
        {
            "id": "i184p55",
            "score": 1,
            "text": "If Putin is concerned with his legacy, knowing how universally revered Yuri Gagarin is, this has to hurt his tiny little heart to a gut wrenching degree.\n\nGood.",
            "title_similarity": "0.20699391"
        },
        {
            "id": "i185nuz",
            "score": 1,
            "text": "omg if this is real get fuck Putin KEKW 🤣",
            "title_similarity": "0.2687878"
        },
        {
            "id": "i185orh",
            "score": 1,
            "text": "The absolute stones on these guys. I would imagine they're gong to catch shit over this, but good on em!",
            "title_similarity": "0.12847176"
        },
        {
            "id": "i185xhd",
            "score": 1,
            "text": "That's sure to grind Mad Vlad's gears.",
            "title_similarity": "0.06744413"
        },
        {
            "id": "i186ku2",
            "score": 1,
            "text": "We’ll done those guys… proof, in case you need it, that spacefarers have a high IQ.",
            "title_similarity": "0.4087218"
        },
        {
            "id": "i186uhg",
            "score": 1,
            "text": "Ground control…are you still there….",
            "title_similarity": "0.2094696"
        },
        {
            "id": "i186y5v",
            "score": 1,
            "text": "Doesn't reporting this endanger the cosmonauts?",
            "title_similarity": "0.48169306"
        },
        {
            "id": "i188m9q",
            "score": 1,
            "text": "Serious: where the hell would they get a yellow and blue suit up there??? They don’t exactly have suit making supplies, na?",
            "title_similarity": "0.44270927"
        },
        {
            "id": "i188s23",
            "score": 1,
            "text": "That’s amazing",
            "title_similarity": "0.0013518045"
        },
        {
            "id": "i189sav",
            "score": 1,
            "text": "In followup news, Russian Cosmonauts do not return home.",
            "title_similarity": "0.5095586"
        },
        {
            "id": "i189ubh",
            "score": 1,
            "text": "oh man, my heartstring weren't ready for this. makes you believe in humanity again for a minute.\n\nvery brave statement from men who are trapped in a tiny metal box floating around the Earth. and very much needed right now.",
            "title_similarity": "0.32484132"
        },
        {
            "id": "i18alkl",
            "score": 1,
            "text": "Damn, didn’t realize Russian rockets could lift such a heavy payload of balls to the ISS",
            "title_similarity": "0.5871133"
        },
        {
            "id": "i18auc9",
            "score": 1,
            "text": "The First Intergalactic “You’re Burnttt”",
            "title_similarity": "0.24215652"
        },
        {
            "id": "i18b9ld",
            "score": 1,
            "text": "Defenestration will have a new meaning in space.",
            "title_similarity": "0.42479867"
        },
        {
            "id": "i18blcg",
            "score": 1,
            "text": "Oof, their balls should have their own gravitational field.",
            "title_similarity": "0.2839486"
        },
        {
            "id": "i18c22t",
            "score": 1,
            "text": "There not comin back 😂",
            "title_similarity": "0.08072156"
        },
        {
            "id": "i18c2ns",
            "score": 1,
            "text": "This is a big deal no? Wow good for those brave cosmonauts.",
            "title_similarity": "0.4273693"
        },
        {
            "id": "i18c89f",
            "score": 1,
            "text": "The rest of the world approves of the suits.",
            "title_similarity": "0.14514557"
        },
        {
            "id": "i18cbs8",
            "score": 1,
            "text": "Smart. Can't get arrested in space. I'm guessing they're not planning to land in Russia after this.",
            "title_similarity": "0.4156136"
        },
        {
            "id": "i18dfmh",
            "score": 1,
            "text": "Well done!  I salute you!",
            "title_similarity": "0.060546763"
        },
        {
            "id": "i18eda6",
            "score": 1,
            "text": "They did the only thing more deadly than going to space.",
            "title_similarity": "0.28276086"
        },
        {
            "id": "i18efk1",
            "score": 1,
            "text": "Putin must be feverishly trying to figure out how to conduct a purge in space",
            "title_similarity": "0.4045818"
        },
        {
            "id": "i18ehd7",
            "score": 1,
            "text": "BAD. ASS.",
            "title_similarity": "-0.020014452"
        },
        {
            "id": "i18eifg",
            "score": 1,
            "text": "I fear for them now.",
            "title_similarity": "-0.019337807"
        },
        {
            "id": "i18eksk",
            "score": 1,
            "text": "Believe it out not, straight to gulag.",
            "title_similarity": "0.25260955"
        },
        {
            "id": "i18epfo",
            "score": 1,
            "text": "‘He he he can’t push us out of a window in space!’",
            "title_similarity": "0.41061598"
        },
        {
            "id": "i18euct",
            "score": 1,
            "text": "Is there an emergency dose of Polonium on the ISS for these guys?  Asking for a friend.",
            "title_similarity": "0.441652"
        },
        {
            "id": "i18f5wr",
            "score": 1,
            "text": "I’m thinking mr Putin world is about to become difficult for himself",
            "title_similarity": "0.14672461"
        },
        {
            "id": "i18fdf1",
            "score": 1,
            "text": "I love this! This is direct action activism!\nSlava Ukraine",
            "title_similarity": "0.1906089"
        },
        {
            "id": "i18fk3d",
            "score": 1,
            "text": "r/space in shambles",
            "title_similarity": "0.11675685"
        },
        {
            "id": "i18g9s2",
            "score": 1,
            "text": "Russian media be like: https://i.imgur.com/mvkNZKE.jpg",
            "title_similarity": "0.3699488"
        },
        {
            "id": "i18ge9j",
            "score": 1,
            "text": "Defenestration on the ISS is a slippery slope.",
            "title_similarity": "0.32913792"
        },
        {
            "id": "i18gs9p",
            "score": 1,
            "text": "Russia is likely to leave them there. I don't think that Putin will like this one little bit.",
            "title_similarity": "0.17958966"
        },
        {
            "id": "i18gter",
            "score": 1,
            "text": "Does Putin have remote control of the airlock?",
            "title_similarity": "0.5385263"
        },
        {
            "id": "i18h1aq",
            "score": 1,
            "text": "What's Putin gonna do? Send his military or police to space?",
            "title_similarity": "0.55781335"
        },
        {
            "id": "i18h1fl",
            "score": 1,
            "text": "Putin is probably going to make them change outfits when he see this. They gonna have white blue and red on but with really sad look on their faces.",
            "title_similarity": "0.2897942"
        },
        {
            "id": "i18h302",
            "score": 1,
            "text": "It will be fun to see how Putin tries to place these guys on house arrest",
            "title_similarity": "0.23231071"
        },
        {
            "id": "i18hr84",
            "score": 1,
            "text": "What a surprise. Mild shock",
            "title_similarity": "0.036884043"
        },
        {
            "id": "i18hvov",
            "score": 1,
            "text": "Will they be allowed back home?",
            "title_similarity": "0.0635961"
        },
        {
            "id": "i18hy6v",
            "score": 1,
            "text": "Depending on how long they stay, Russia may have a new President by then.",
            "title_similarity": "0.304344"
        },
        {
            "id": "i18i2ug",
            "score": 1,
            "text": "Beautiful",
            "title_similarity": "-0.04735376"
        },
        {
            "id": "i18i51w",
            "score": 1,
            "text": "Science > Politics",
            "title_similarity": "0.23827025"
        },
        {
            "id": "i18i61e",
            "score": 1,
            "text": "Going to be very hard to find a return flight",
            "title_similarity": "0.14298043"
        },
        {
            "id": "i18i86k",
            "score": 1,
            "text": "Absolute lads.",
            "title_similarity": "0.039128367"
        },
        {
            "id": "i18i86q",
            "score": 1,
            "text": "For some reason this breaks my heart a little.  It’s brave, and noble, but also sort of desperate and pathetic (and I don’t mean that in mean way) like a big dog that’s been unfairly labeled as vicious trying to get someone to love him.",
            "title_similarity": "0.08953741"
        },
        {
            "id": "i18i9mc",
            "score": 1,
            "text": "It feels so good knowing that Rogozin must be crazy mad right now.",
            "title_similarity": "0.018107146"
        },
        {
            "id": "i18ic0p",
            "score": 1,
            "text": "Is that really new? I swear cosmonaut launch suits have been orange/yellow/pale blue for decades now?",
            "title_similarity": "0.59361935"
        },
        {
            "id": "i18izvh",
            "score": 1,
            "text": "Well folks, there’s going to be another article about cosmonauts being arrested in a bit here.",
            "title_similarity": "0.4432518"
        },
        {
            "id": "i18j096",
            "score": 1,
            "text": "Nice. A gamble to be sure. Will Putin be dead and gone by the time they land back on Earth? Will they ask for asylum if not?",
            "title_similarity": "0.2940776"
        },
        {
            "id": "i18jai4",
            "score": 1,
            "text": "Can’t push anyone out a window in space…wait no air that’s scarier",
            "title_similarity": "0.34574774"
        },
        {
            "id": "i18k3f1",
            "score": 1,
            "text": "This season on “Lost In Space”",
            "title_similarity": "0.45357892"
        },
        {
            "id": "i18k5m5",
            "score": -1,
            "text": "What if actually the new space Marines forced this at gunpoint, obviously ridiculous but if true we've gotten more use out of it than I thought",
            "title_similarity": "0.25660744"
        },
        {
            "id": "i18k708",
            "score": 1,
            "text": "This sounds like a new take on the old joke. “Three cosmonauts walk into the ISS and the murderous dictator says…",
            "title_similarity": "0.5665598"
        },
        {
            "id": "i18k7m7",
            "score": 1,
            "text": "I hope they don't try to go back to Russia ☠️",
            "title_similarity": "0.24535203"
        },
        {
            "id": "i18kxzx",
            "score": 1,
            "text": "Lads. Every single one of them.",
            "title_similarity": "0.09373619"
        },
        {
            "id": "i18kzdo",
            "score": 1,
            "text": "Where did they get it? Did they color it or somehow??",
            "title_similarity": "0.10331216"
        },
        {
            "id": "i18l3sb",
            "score": 1,
            "text": "Cosmonauts fell out of a window",
            "title_similarity": "0.47875005"
        },
        {
            "id": "i18l6ik",
            "score": 1,
            "text": "This will definitely air in Russia… in black and white",
            "title_similarity": "0.3857702"
        },
        {
            "id": "i18liw9",
            "score": 1,
            "text": "It is actually their university colours… this is not even the first time they have worn them…",
            "title_similarity": "0.23379257"
        },
        {
            "id": "i18lxnp",
            "score": 1,
            "text": "It’s actually a complete opposite. They should have celebrated an annexation of entire Ukraine alongside Crimea with this yellow and blue crap. Don’t underestimate the cynicism of Russians",
            "title_similarity": "0.36172405"
        },
        {
            "id": "i18m78l",
            "score": 1,
            "text": "Well somebody is staying in space",
            "title_similarity": "0.4315224"
        },
        {
            "id": "i18mhey",
            "score": 1,
            "text": "ISS Gulag is going to pick them up soon",
            "title_similarity": "0.2715009"
        },
        {
            "id": "i18mil7",
            "score": 1,
            "text": "Kremlin’s going to turn this into a blue suit silver suit soon.",
            "title_similarity": "0.50667435"
        },
        {
            "id": "i18o4rf",
            "score": 1,
            "text": "How do they get those big ass balls in those suits?!?!",
            "title_similarity": "0.24342182"
        },
        {
            "id": "i18oje2",
            "score": 1,
            "text": "Do you know the story of the Russian cosmonaut?",
            "title_similarity": "0.6202874"
        },
        {
            "id": "i18okti",
            "score": 1,
            "text": "These were later found missing in action.",
            "title_similarity": "0.098574564"
        },
        {
            "id": "i18oltr",
            "score": 1,
            "text": "The Hunt for Red ISS",
            "title_similarity": "0.062319055"
        },
        {
            "id": "i18osp6",
            "score": 1,
            "text": "Holy Molly, incredible! Brave souls. These guys are heros!",
            "title_similarity": "0.121655956"
        },
        {
            "id": "i18pm6n",
            "score": 1,
            "text": "Absolutely amazing.",
            "title_similarity": "0.032424517"
        },
        {
            "id": "i18q04q",
            "score": 1,
            "text": "🤔I got a feeling a lot of these Russians are clout chasing. I might be wrong",
            "title_similarity": "0.14435339"
        },
        {
            "id": "i18qh2z",
            "score": 1,
            "text": "There you go all you fuckers who thought Russia’s space program was full evil Russians. Space belong to all mankind.",
            "title_similarity": "0.35355955"
        },
        {
            "id": "i18qkod",
            "score": 1,
            "text": "I hope they'll be ok and won't all suddenly get in a totally legit accident and die. Pretty brave of them.",
            "title_similarity": "0.13712244"
        },
        {
            "id": "i18qlyx",
            "score": 1,
            "text": "Beautiful to see some Russians standing up against Putin's bullshit. I bet this had him boiling over with anger.",
            "title_similarity": "0.2211357"
        },
        {
            "id": "i18qu3d",
            "score": 1,
            "text": "Please stay safe, courageous cosmonauts!",
            "title_similarity": "0.41180158"
        },
        {
            "id": "i18qypm",
            "score": 1,
            "text": "Has anyone ever requested political asylum in space?",
            "title_similarity": "0.50417596"
        },
        {
            "id": "i18r6bs",
            "score": 1,
            "text": "Perspective.",
            "title_similarity": "-0.052203707"
        },
        {
            "id": "i18rdsb",
            "score": 1,
            "text": "So proud of y’all.  Have a safe stay for the next 12 months.",
            "title_similarity": "0.16828385"
        },
        {
            "id": "i18rv12",
            "score": 1,
            "text": "Best thing about this is they can’t kill themselves by shooting the back of their heads twice!",
            "title_similarity": "0.232415"
        },
        {
            "id": "i18sh67",
            "score": 1,
            "text": "Good thing the ISS doesn't have any windows that open... there could be an accident.",
            "title_similarity": "0.30235183"
        },
        {
            "id": "i18sl10",
            "score": 1,
            "text": "Let’s hope these people don’t fall out of windows",
            "title_similarity": "0.17906272"
        },
        {
            "id": "i18sl1a",
            "score": 1,
            "text": "Are they going to be in serious danger upon returning?",
            "title_similarity": "0.03317663"
        },
        {
            "id": "i18tq3k",
            "score": 1,
            "text": "WOW. If this is true as reported then this is a huge rebellion and win against Putin.",
            "title_similarity": "0.21032521"
        },
        {
            "id": "i18u6d8",
            "score": 1,
            "text": "And just like that Cosmonauts are disappeared.",
            "title_similarity": "0.34387377"
        },
        {
            "id": "i18u6mk",
            "score": 1,
            "text": "Science must prevail",
            "title_similarity": "0.20510045"
        },
        {
            "id": "i18ua7q",
            "score": 1,
            "text": "Fucking awesome 😎",
            "title_similarity": "0.029968292"
        },
        {
            "id": "i18uqvx",
            "score": 1,
            "text": "They had to get the suits made, and that tells us a lot. This isn't just the cosmonauts protesting, it'd go a fair way up and back in the supply chain.",
            "title_similarity": "0.47208554"
        },
        {
            "id": "i18usbh",
            "score": 1,
            "text": "Why don’t we call them astronauts? I bet that’s a good story!",
            "title_similarity": "0.42017698"
        },
        {
            "id": "i18v9hv",
            "score": 1,
            "text": "Woah. I was expecting to see like.. Yellow and blue armbands or patches or something. That's a full outfit. BIG props, and not just to the cosmonauts. The entire launch crew involved with them deserves it.",
            "title_similarity": "0.5645453"
        },
        {
            "id": "i18w2ju",
            "score": 1,
            "text": "Oooooo they.. they aren’t coming back down..",
            "title_similarity": "0.06662804"
        },
        {
            "id": "i18w59j",
            "score": 1,
            "text": "Departing ISS their will be a freak accident.",
            "title_similarity": "0.18753277"
        },
        {
            "id": "i18yq4c",
            "score": 1,
            "text": "No idea how these legends got past any snitches, but I hope they found Starfleet soon",
            "title_similarity": "0.30589753"
        },
        {
            "id": "i18ys2c",
            "score": 1,
            "text": "Next headline after Russia shoots the ISS out of orbit: _Catastrophic failure of American-made equipment causes ISS crash out of orbit_",
            "title_similarity": "0.5384626"
        },
        {
            "id": "i18zdeu",
            "score": 1,
            "text": "How? They’re in space. Did another country just shoot these suits into space?",
            "title_similarity": "0.58265996"
        },
        {
            "id": "i190gsd",
            "score": 1,
            "text": "Hmmmm, almost as if millions of Russians have family and friend connections in Ukraine",
            "title_similarity": "0.24997137"
        },
        {
            "id": "i192cw8",
            "score": 1,
            "text": "Immediately made me think of the pale blue dot speech by Carl Sagan: https://www.youtube.com/watch?v=wupToqz1e2g",
            "title_similarity": "0.43336874"
        },
        {
            "id": "i192gqz",
            "score": 1,
            "text": "......this implies that despite it supposedly costing thousands for every pound of materials we send into space that there's been enough funding over the years to create sets of seasonal color ensembles for the astronauts on the ISS.....at least enough color combos for yellow and blue parts of jumpsuits to be available.",
            "title_similarity": "0.49740344"
        },
        {
            "id": "i192qkl",
            "score": 1,
            "text": "Lmao gotem , fuck you Putin",
            "title_similarity": "0.1771589"
        },
        {
            "id": "i193bp4",
            "score": -1,
            "text": "But earth is flat!! No space station🤣🤣🤣🤣",
            "title_similarity": "0.20079485"
        },
        {
            "id": "i193iv1",
            "score": 1,
            "text": "It's a propaganda PR move and nothing less.",
            "title_similarity": "0.057802778"
        },
        {
            "id": "i193pbg",
            "score": 1,
            "text": "I know it's not the main point, but when I saw the American was returning after a 355 days, I couldn't help buy wonder why they didn't work the schedule so he could have a full year in space",
            "title_similarity": "0.4346289"
        },
        {
            "id": "i1941ji",
            "score": 1,
            "text": "Did they bring those with them?",
            "title_similarity": "0.01553952"
        },
        {
            "id": "i1955cx",
            "score": -1,
            "text": "That takes some balls….RIP.",
            "title_similarity": "-0.016216118"
        },
        {
            "id": "i195f13",
            "score": 1,
            "text": "Where did they get the outfits?",
            "title_similarity": "0.16573393"
        },
        {
            "id": "i195gmo",
            "score": -1,
            "text": "Slava Ukraini",
            "title_similarity": "0.09934704"
        },
        {
            "id": "i195nm6",
            "score": 1,
            "text": "“Russian astronauts stuck in space indefinitely due to malfunctions”",
            "title_similarity": "0.47323292"
        },
        {
            "id": "i195pty",
            "score": 1,
            "text": "Smile boys we dont wanna get kicked off the ship",
            "title_similarity": "0.22349389"
        },
        {
            "id": "i19622p",
            "score": -1,
            "text": "I guess space is far enough away from Putin to be safe from his wrath",
            "title_similarity": "0.21162121"
        },
        {
            "id": "i197brj",
            "score": -1,
            "text": "Watch out guys, that’s an awful high window to fall out of…",
            "title_similarity": "0.11887285"
        },
        {
            "id": "i198mpy",
            "score": 1,
            "text": "Say it with me now....Prop-uhhh-gahn-duhh",
            "title_similarity": "0.078546"
        },
        {
            "id": "i198vqx",
            "score": -1,
            "text": "Nobody knows if they’re wearing “Ukrainian coloured suits” or just yellow suits for another reason.",
            "title_similarity": "0.36638486"
        },
        {
            "id": "i198x75",
            "score": -1,
            "text": "They are not falling that many stories… They are going to be fired upon and shot out off space by Russia because they are genociding plants up there?",
            "title_similarity": "0.5087941"
        },
        {
            "id": "i198ymk",
            "score": -1,
            "text": "The entire crew fell out of the 47th floor window of the ISS",
            "title_similarity": "0.48012897"
        },
        {
            "id": "i199czr",
            "score": 1,
            "text": "And I really doubt any of Putin's goons are up there to poison them. Nicely done, guys, stay safe.",
            "title_similarity": "0.16102204"
        },
        {
            "id": "i19av61",
            "score": -1,
            "text": "All 3 went to the same school.. and I guess these are the colors🤷‍♂️ but who f#cking knows anything anymore😵😵😵",
            "title_similarity": "0.21173304"
        },
        {
            "id": "i19cbu5",
            "score": 1,
            "text": "When did they board? How did the suits get made so quickly?",
            "title_similarity": "0.26687574"
        },
        {
            "id": "i19t2yv",
            "score": -1,
            "text": "What about Palestinian huh!? Everyone is just talking about Ukraine and ignoring Palestinian which is still in war !",
            "title_similarity": "0.16663887"
        },
        {
            "id": "i1a5yku",
            "score": 1,
            "text": "You mean they didn't send them a shuttle home cancelling them from the ISS?!? I'm appalled!..... Lawl",
            "title_similarity": "0.43536007"
        },
        {
            "id": "i1a60nl",
            "score": 1,
            "text": "It’s a yellow suit with a Russian flag. Stop trying to find something that doesn’t exist.",
            "title_similarity": "0.42694414"
        },
        {
            "id": "i1a6fxd",
            "score": 1,
            "text": "Russian nazis",
            "title_similarity": "0.372981"
        },
        {
            "id": "i1a8zva",
            "score": 1,
            "text": "it's a fucking yellow suit",
            "title_similarity": "0.32774246"
        },
        {
            "id": "i1aab09",
            "score": 1,
            "text": "You are being lied to.",
            "title_similarity": "-0.056617327"
        },
        {
            "id": "i1ad4vh",
            "score": 1,
            "text": "Coincidence. Nothing more.",
            "title_similarity": "0.018562946"
        },
        {
            "id": "i1alop5",
            "score": -1,
            "text": "Why even let them enter the iss.",
            "title_similarity": "0.5742941"
        },
        {
            "id": "i1bc6y9",
            "score": 1,
            "text": "This yellow was the official colours of the university they graduated.\n\nSource:\n https://www.reuters.com/world/europe/russia-ridicules-idea-that-cosmonauts-wore-yellow-support-ukraine-2022-03-19/",
            "title_similarity": "0.58104455"
        },
        {
            "id": "i1bjisw",
            "score": 1,
            "text": "They are just wearing yellow, why would anyone show support to Azov Nazis ??",
            "title_similarity": "0.31786203"
        },
        {
            "id": "i1cfy58",
            "score": 1,
            "text": "Is the colors of the state university that all 3 cosmonauts attended.",
            "title_similarity": "0.5934886"
        },
        {
            "id": "i1crz6j",
            "score": 1,
            "text": "It's pretty nice of the media to put these men's lives in danger to say they're spreading a political message that they aren't. A total lack of ethics and responsibility.",
            "title_similarity": "0.094064444"
        },
        {
            "id": "i1cunbz",
            "score": 1,
            "text": "This is a propaganda spin\n\nThey flew these colors on 2014. These are official colors of the MGTU which is the Moscow government technology university.\n\nThese are made and supplied by the Russian gov. Why tf would the gov oppose it's own war? \n\nDon't just believe everything on the internet",
            "title_similarity": "0.4126518"
        },
        {
            "id": "i1cwfp3",
            "score": -1,
            "text": "international fake station . people still believe this is a real thing?",
            "title_similarity": "0.16299358"
        },
        {
            "id": "i1cz0hs",
            "score": -1,
            "text": "Are you scared with herpies",
            "title_similarity": "0.0077173626"
        },
        {
            "id": "i17ycf7",
            "score": -8,
            "text": "I doubt they did this without approval... Don't assume they made this choice. Optics are important.",
            "title_similarity": "0.09245888"
        },
        {
            "id": "i17z9xp",
            "score": 6,
            "text": "I'm pretty sure those clothing items were sent up there with them and are likely approved uniforms.",
            "title_similarity": "0.23396221"
        },
        {
            "id": "i182ocy",
            "score": 2,
            "text": "They are going to be wearing body bags when they get home.",
            "title_similarity": "0.20449421"
        },
        {
            "id": "i182z8p",
            "score": 2,
            "text": "Get home to find their families all committed suicide with multiple gunshots to the head",
            "title_similarity": "0.13903704"
        },
        {
            "id": "i18428e",
            "score": 2,
            "text": "Be careful; Russia may shoot it down and claim it’s a Ukraine terrorist attack.",
            "title_similarity": "0.2985956"
        },
        {
            "id": "i184w8v",
            "score": 2,
            "text": "Amazing humans. Scientists will support one another.  They don't have a beef with their American colleagues,  they literally have to trust one another with their lives up there. They are smart people that know what's going on even from space.  I hope they will be safe.",
            "title_similarity": "0.32137236"
        },
        {
            "id": "i186b3d",
            "score": 2,
            "text": "They are going to fall out windows!",
            "title_similarity": "0.16116518"
        },
        {
            "id": "i1891uz",
            "score": 2,
            "text": "There has to be trade- We will gladly take these three fine individuals but you have to take back your “strategically planted” Russian operatives starting with treasonous Trump and his shit head spawn.",
            "title_similarity": "0.2674044"
        },
        {
            "id": "i189ein",
            "score": 2,
            "text": "I don't get it. Their jump suits are the only thing that is yellow. This would imply that they had special suits fabricated for the trip which would implicate A LOT of people on the ground.\n\nIs it possible that they wear yellow suits sometimes?",
            "title_similarity": "0.35242805"
        },
        {
            "id": "i18deh9",
            "score": 2,
            "text": "Won't be going home ever. Brave men.",
            "title_similarity": "0.14858276"
        },
        {
            "id": "i18dlgo",
            "score": 2,
            "text": "They are literally above this petty bullshit.",
            "title_similarity": "0.0632119"
        },
        {
            "id": "i18dxm8",
            "score": 2,
            "text": "> You develop an instant global consciousness, a people orientation, an intense dissatisfaction with the state of the world, and a compulsion to do something about it. From out there on the moon, international politics look so petty. You want to grab a politician by the scruff of the neck and drag him a quarter of a million miles out and say, 'Look at that, you son of a bitch.'\n>\n> \\- Astronaut Edgar Mitchell",
            "title_similarity": "0.38980258"
        },
        {
            "id": "i18eydk",
            "score": 2,
            "text": "Holy shit. That's brave as hell. They are dead when and if they return home. Maybe.",
            "title_similarity": "0.12110063"
        },
        {
            "id": "i18grjj",
            "score": 2,
            "text": "Real heroes, both for being in space and for openly protesting Putin’s regime, which is certainly life threatening for Russians these days.",
            "title_similarity": "0.36971655"
        },
        {
            "id": "i18gs6u",
            "score": 2,
            "text": "This is awesome. \n\nI hope when they return they don't back go to Russia since they'll likely face prison or worse. These guys and their families deserve automatic citizenship to a better country.",
            "title_similarity": "0.2797252"
        },
        {
            "id": "i18hju8",
            "score": 2,
            "text": "While I want to believe that this is a show of support for Ukraine,,,, the way the Russia flag is worked in on the chest... Could this have an different meaning then most are suggesting?\n\nLike Ukraine is part of Russia connotation?\n\nIf it is a show of support for Ukraine,  good on them and all that were part of this.  I hope that this is the case.",
            "title_similarity": "0.34977752"
        },
        {
            "id": "i18iy2d",
            "score": 2,
            "text": "Wow, I dunno why but that got me choked up.",
            "title_similarity": "-0.02448728"
        },
        {
            "id": "i18jl3s",
            "score": 2,
            "text": "Looks like they're wearing a uniform with a Russian flag on it to me. I fucking hate journalism.",
            "title_similarity": "0.28587496"
        },
        {
            "id": "i18k2e7",
            "score": 2,
            "text": "Uuuuuuuhhhhhhh, that’s yellow, with bit Russian. Flags on it, yellow, white blue and red is more like it…",
            "title_similarity": "0.4005879"
        },
        {
            "id": "i18k7xq",
            "score": 2,
            "text": "I sure hope the ISS can stay in orbit with three sets of giant steel balls.",
            "title_similarity": "0.5043018"
        },
        {
            "id": "i18k8sy",
            "score": 2,
            "text": "What are the police gonna do, fly up to where they have no jurisdiction lol! Right on guys",
            "title_similarity": "0.34354603"
        },
        {
            "id": "i18kd1o",
            "score": 2,
            "text": "Science wins.",
            "title_similarity": "0.17038724"
        },
        {
            "id": "i18km6j",
            "score": 2,
            "text": "Real MVPs",
            "title_similarity": "0.04493591"
        },
        {
            "id": "i18kqt6",
            "score": 2,
            "text": "It is no joke if some die after speaking out.   Frightening!!!",
            "title_similarity": "0.06996768"
        },
        {
            "id": "i18kr8n",
            "score": 2,
            "text": "Chads",
            "title_similarity": "0.09270705"
        },
        {
            "id": "i18kwx1",
            "score": 2,
            "text": "Daaaang",
            "title_similarity": "0.012965122"
        },
        {
            "id": "i18l2nd",
            "score": 2,
            "text": "That is so gutsy I can barely believe it.",
            "title_similarity": "0.0018716315"
        },
        {
            "id": "i18m3k7",
            "score": 2,
            "text": "Inb4 first mass suicide outside earth's orbit. Putin tried so hard to prevent it.",
            "title_similarity": "0.3970077"
        },
        {
            "id": "i18m5bn",
            "score": 2,
            "text": "also in the news, a group of Russian cosmonauts fell out of a third story window of the ISS",
            "title_similarity": "0.6236372"
        },
        {
            "id": "i18m9gd",
            "score": -2,
            "text": "Space departments of every country should be neutral. As there should be mcdonals in russian camp if they want. Those ppl dont give a fuck about some stupid politics or conquests. They are literally rocket engineers.",
            "title_similarity": "0.44601008"
        },
        {
            "id": "i18micu",
            "score": 2,
            "text": "“I know a few people who aren’t coming back to Earth ever”\n\n  -Russian Space guy, probably",
            "title_similarity": "0.5496677"
        },
        {
            "id": "i18njxg",
            "score": 2,
            "text": "Scientists don’t play along with political bullshit. Their moral compass is better than politicians’.",
            "title_similarity": "0.13507688"
        },
        {
            "id": "i18ofso",
            "score": 2,
            "text": "Can't get pushed out of a window on the ISS... that easily",
            "title_similarity": "0.3978121"
        },
        {
            "id": "i18pka6",
            "score": 2,
            "text": "Borders don't exist in the vacuum of space. Humanity is the bond you have.",
            "title_similarity": "0.3882408"
        },
        {
            "id": "i18q8xk",
            "score": 2,
            "text": "Quick way out the airlock- I wonder if this was not part of the celebration for annexation of Crimea?   \n\nHope war ends soon.",
            "title_similarity": "0.33037698"
        },
        {
            "id": "i18rmbd",
            "score": 2,
            "text": "Good luck going back home… Russia will either kill you or disown you",
            "title_similarity": "0.24193434"
        },
        {
            "id": "i18u37s",
            "score": 2,
            "text": "Reddit posts about how most Russians support the war and are brainwashed are pure propaganda, absolutely no regular person genuinely supports this war or believes any of Putin's talking points. \n\nPublicly might be a bit different, but I assure you the vast, vast majority are completely against it, which is why videos like AS feel very patronizing, even though his heart is in the right place, and it wasn't as bad as I expected.\n\nI wish people were a bit less openly giddy about the Russian pop suffering right now, Anton the construction worker didn't attack Ukraine any more than you did, and the fact people are happy about Russians in general being miserable is kinda gross",
            "title_similarity": "0.20048706"
        },
        {
            "id": "i18v9u3",
            "score": 2,
            "text": "Are they planning to live the rest of their lives in space? Putinsky aint going to let them back in Russia.",
            "title_similarity": "0.5066859"
        },
        {
            "id": "i18wrmh",
            "score": 2,
            "text": "Where’s the blue?",
            "title_similarity": "0.2825809"
        },
        {
            "id": "i18z7og",
            "score": 2,
            "text": "But they are just in yellow overalls with the Russian flag on them",
            "title_similarity": "0.5011123"
        },
        {
            "id": "i18zqfa",
            "score": 2,
            "text": "It's their uniform isnt it ? With a big ass Russian flag on the right chest ?",
            "title_similarity": "0.4020512"
        },
        {
            "id": "i18zqhc",
            "score": 2,
            "text": "Well holy shit, lets fucking go citizens of planet earth!",
            "title_similarity": "0.3635798"
        },
        {
            "id": "i191e6g",
            "score": 2,
            "text": "That’s really putting a thumb in Putins eye",
            "title_similarity": "0.21991807"
        },
        {
            "id": "i192d15",
            "score": 2,
            "text": "Easy to make an honest political statement when you are so far from the mother land.",
            "title_similarity": "0.07589747"
        },
        {
            "id": "i193bkz",
            "score": 2,
            "text": "How? I thought all items they taking up there are being checked on the ground. Means, the ground team also stands with them?",
            "title_similarity": "0.19435798"
        },
        {
            "id": "i193ebh",
            "score": 2,
            "text": "They best hope Putin is dead or deposed by the time they come back to Earth.",
            "title_similarity": "0.28896868"
        },
        {
            "id": "i193nf5",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.014970249"
        },
        {
            "id": "i194wll",
            "score": 2,
            "text": "People who have gone to space have seen the nonsense that is drawing lines over the planet",
            "title_similarity": "0.4376918"
        },
        {
            "id": "i194z68",
            "score": 2,
            "text": "Cosmonauts are like today’s peek at Star Trek ethics, where (or better, when) human beings and even other species work and feel as one, without all the needless and illogical fights.",
            "title_similarity": "0.45397186"
        },
        {
            "id": "i195io4",
            "score": 2,
            "text": "Looks like the same suits they've been using for at least 6 years.\n\nNo image linked to give you any excuse to remove my comment this time.",
            "title_similarity": "0.30221546"
        },
        {
            "id": "i1968sa",
            "score": 2,
            "text": "Where did they get yellow garments?",
            "title_similarity": "0.2614196"
        },
        {
            "id": "i196tid",
            "score": 2,
            "text": "Now THIS is a message",
            "title_similarity": "0.02277514"
        },
        {
            "id": "i197jfw",
            "score": 2,
            "text": "Well.  There goes that Russian threat of Cosmonaut violence.  I feel the crew of the ISS is safe and I am grateful.\n\nMaybe we can live in a world where we continue to prosper, grow and learn while our leaders can slap box or something.\n\nWar fucking sucks.  Fuck Putin.",
            "title_similarity": "0.48182887"
        },
        {
            "id": "i197nsr",
            "score": 2,
            "text": "I was just talking to my gf about how awkward the ISS must be rn.\n\nDidnt expect this level of absolute badassery from them.",
            "title_similarity": "0.20103288"
        },
        {
            "id": "i197txx",
            "score": 2,
            "text": "That’s basically the only place that’s technically still a part of Russia , where u can hit those kind of licks , without immediately beeing detained for 23 years… so good for them 🤣🙏",
            "title_similarity": "0.40088218"
        },
        {
            "id": "i197xy4",
            "score": 2,
            "text": "we will see an exodus of academics from russia the same way as 1930s nazi germany",
            "title_similarity": "0.29422516"
        },
        {
            "id": "i1983yk",
            "score": 2,
            "text": "Risking getting on Putin's bad side when Russia is doing most or all of the space flights is ballsy, but I suppose it would be pretty awkward spending months on the station with Western astronauts without expressing some displeasure with Putin's invasion.",
            "title_similarity": "0.4253974"
        },
        {
            "id": "i199ytz",
            "score": 2,
            "text": "Man. Absolutely did not expect to watch that video with tears in my eyes. How they’re welcomed on board by their fellow crew members.",
            "title_similarity": "0.24586356"
        },
        {
            "id": "i19aj80",
            "score": 2,
            "text": "Russian Cosmonauts are gonna go missing I asume",
            "title_similarity": "0.4698942"
        },
        {
            "id": "i19ckp3",
            "score": 2,
            "text": "It's such a brave and laudable gesture\n\nLooking forward to our American representatives being inspired by this in future US invasions",
            "title_similarity": "0.15308674"
        },
        {
            "id": "i19cr7p",
            "score": 2,
            "text": "It's not like they dyed them those colors on the way up. That has to be the colors they were given by the Russian government no? If not - how did they change the colors?",
            "title_similarity": "0.37360582"
        },
        {
            "id": "i19dib9",
            "score": 2,
            "text": "Probably visibility clothing for emergency rescue purposes (like safety orange clothing).",
            "title_similarity": "0.2566086"
        },
        {
            "id": "i19s83j",
            "score": -2,
            "text": "Who cares\nNation of criminals",
            "title_similarity": "0.07650056"
        },
        {
            "id": "i1a2e8p",
            "score": -2,
            "text": "Oh quick...look squirrel...I mean Covid...I mean Ukraine...I mean...yeah what even next is the distraction.",
            "title_similarity": "0.15044892"
        },
        {
            "id": "i1a5leb",
            "score": -2,
            "text": "Now, the Hungarians of Transcarpathia can be part of a war they had nothing to do with. Why should they fight alongside an oppressive Ukrainian government when they are being oppressed too? Therefore, they can no longer trust anything but Putin's quick victory. He is now seen by the international and domestic media as a terrorist aggressor because he is standing up to his own oppressed people and going against America. NATO is now on hold because Ukraine is not a NATO member. But let us not forget that Russia has sided with China and Iran. Russia alone would bullshit NATO. But together with China and Iran, it would also sweep America. So now it has given the world a lesson. Now everyone is waiting, while Russia is threatened with international sanctions. But it's no good to get China riled up either, because that would have incredible economic consequences. Now they've given the Russians checkmate, but the Russians have actually given them checkmate. Right now NATO is more afraid than the Russians. It is a shame for America to interfere. It always shows up when it has an economic interest. See Kuwait, Iraq, Afghanistan, or in its time Vietnam or Korea. Now they have to defend Ukraine. America is already bleeding to death.",
            "title_similarity": "0.22145037"
        },
        {
            "id": "i1a61nn",
            "score": -2,
            "text": "Two people from Berehovo and Uzhhorod, who live there, told me what the Hungarians in Transcarpathia think about Putin, that we should pray here in the motherland that Putin will win!!!-Ukraine has a terrorist government based on nationalism. In Donbass they have been killing Russians for years and making it impossible for them to live. The minority is ignored. See Ukrainian language law. Practically human rights are completely undermined by a country in Europe who legally write their own minority. All this with America, the home of democracy, knowing full well. Hungarians are persecuted in the same way as Russians. Many have emigrated, but there are still 200,000 of our fellow Hungarians living there. The Ukrainian government had eight years to settle the minority issue peacefully. It has failed. Putin has had enough. He stands by his own people, regardless of which side of the border they live. For him, the Russians in Donbas are like the Szeklers in Transylvania for us. The difference is that he stands up for them. So now the Hungarians of Transcarpathia can only trust Putin. Unfortunately, there is nothing to expect from politicians in the mainland.Putin is extremely popular. If, God forbid, Putin falls, the aggressive Ukrainian government will wipe minorities off the map for good. That is why they are confident that he will win. Ukraine does not want Hungarians. Unfortunately, here in the stoned country, they don't need them again. It is the same situation as in Romania. The Romanian calls the Szekler a bozgor. And the Hungarian here calls the Szekler a Romanian. Thus, the Hungarians who have broken away have been left to fend for themselves everywhere. Sadly, the people of Transcarpathia are now looking to a foreign power for salvation. And that is Putin. They are not afraid of the Russians, and they are not afraid of the bombing of Ungvár or Mukachevo. They are afraid of their own government and of forced repression.kurucPista",
            "title_similarity": "0.23308358"
        },
        {
            "id": "i1cboui",
            "score": 2,
            "text": "Kinda a stretch with this one. That’s just the color of the suits.",
            "title_similarity": "0.1999307"
        },
        {
            "id": "i17ysjx",
            "score": 50,
            "text": "we’re sure that’s not the normal suit colour?",
            "title_similarity": "0.15150198"
        },
        {
            "id": "i17u66f",
            "score": 164,
            "text": "Gutsy. Looks like they all got a piece of Zelenskyy's steel balls.",
            "title_similarity": "0.21867871"
        },
        {
            "id": "i18zgz8",
            "score": -11,
            "text": "[deleted]",
            "title_similarity": "0.014970249"
        },
        {
            "id": "i184f8u",
            "score": 11,
            "text": "How did they get those yellow suit made in time for the flight? I would think they would need to be ordered months in advance.",
            "title_similarity": "0.40639752"
        },
        {
            "id": "i18eu9e",
            "score": 3,
            "text": "This is why I want to become an astronaut. Awesome workplace environment, awesome research, and most importantly awesome coworkers. :)",
            "title_similarity": "0.42770737"
        },
        {
            "id": "i18kel9",
            "score": 2,
            "text": "To be a cosmonaut probably takes an extreme amount of intelligence and awareness. Not surprising they see past the short sightedness of the current Russian leadership.",
            "title_similarity": "0.4211319"
        },
        {
            "id": "i18l65m",
            "score": 3,
            "text": "Big. Dick. Energy.",
            "title_similarity": "0.05751957"
        },
        {
            "id": "i18lzeb",
            "score": 4,
            "text": "Fucking legends.",
            "title_similarity": "-0.013810532"
        },
        {
            "id": "i18mgt4",
            "score": 4,
            "text": "This is a massive, massive statement. Cosmonauts are high profile people. And the fact that they had space suits fabricated and dyed to these colors means a not-insignificant portion of Roscosmos was in on the job. \n\nThank you to the Russian space agency. This is not going to go under the radar.",
            "title_similarity": "0.56257224"
        },
        {
            "id": "i18o86k",
            "score": 3,
            "text": "This pretty much the entire space agency in protest. You don't just sneak matching uniforms into space. A long line of people just looked the other way.",
            "title_similarity": "0.46086693"
        },
        {
            "id": "i18px8o",
            "score": 3,
            "text": "I hope the Soyuz has manual control for the trip home. That’s one extremely high window to fall out of.",
            "title_similarity": "0.4669868"
        },
        {
            "id": "i18woyc",
            "score": 4,
            "text": "I'm surprised the ISS doesn't drop out of the sky with the weight of their balls",
            "title_similarity": "0.41022742"
        },
        {
            "id": "i18ziip",
            "score": -3,
            "text": "Now that's called forward minded thinking which can be truly appreciated.\n\nHow many Americans wore Iraqi or Afghani flags after America slaughtered them in cold blood.",
            "title_similarity": "0.18017341"
        },
        {
            "id": "i192gqq",
            "score": 4,
            "text": "Weird that educated professional people with standards do not support the russian regime, huh?",
            "title_similarity": "0.20010701"
        },
        {
            "id": "i199xd2",
            "score": 2,
            "text": "hahahahaha\n\n\nHAHAHAHAHAA\n\n\n\nFUCK YOU PUTIN *YOUR OWN ASTRONAUTS* HATE YOU",
            "title_similarity": "0.27372217"
        },
        {
            "id": "i182art",
            "score": 74,
            "text": "Do we know this is a statement? Major news orgs that reported on this did briefly mention yellow suits, but nobody but The Mirror is implying this is a purposeful protest",
            "title_similarity": "0.31506085"
        },
        {
            "id": "i17u059",
            "score": 84,
            "text": "Enjoy living in space.",
            "title_similarity": "0.3489914"
        },
        {
            "id": "i17vi38",
            "score": 162,
            "text": "Breaking news: a window on the ISS has dislodged and the Russian Cosmonauts have fallen out of it.",
            "title_similarity": "0.5883771"
        },
        {
            "id": "i190d75",
            "score": -4,
            "text": "You mean in the studio once they have their harnesses hooked up.",
            "title_similarity": "0.3342802"
        },
        {
            "id": "i1d06tr",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.0005105231"
        },
        {
            "id": "i17ulo8",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.014970249"
        },
        {
            "id": "i18eg2t",
            "score": 6,
            "text": "BREAKING: Three Cosmonauts have fallen from the top story window of the ISS.",
            "title_similarity": "0.6161559"
        },
        {
            "id": "i18op2j",
            "score": 4,
            "text": "Wait, is no one gonna ask where those came from? Space suits aint easy! We spend millions on those... howd they just produce them?",
            "title_similarity": "0.38762456"
        },
        {
            "id": "i18ptzs",
            "score": 5,
            "text": "Ofc. Russian people aren’t responsible for putin being an absolutely fucking insane reincarnation of Stalin. The cosmonauts have always loved their American comrades in space and the same is true for the Americans feelings towards the cosmonauts. In space we are Ally’s because there is no room or practical use for enemies. I’m not surprised at all to see the cosmonauts expressing solidarity with their Ukrainian brothers and sisters below.",
            "title_similarity": "0.41343492"
        },
        {
            "id": "i19fikv",
            "score": 5,
            "text": "I'm truly confused by this story. I'm sure these uniforms are very customized and purposeful specifically for space travel. So where did they come from? It's not like sneaking on a little flag. We're they supplied by the Russian government or space agency? Or are the cosmonauts transported by another entity?",
            "title_similarity": "0.58671874"
        },
        {
            "id": "i187154",
            "score": 170,
            "text": "This article: [https://www.cbsnews.com/news/cosmonauts-launch-to-international-space-station-nasa-chief-touts-us-russia-cooperation/](https://www.cbsnews.com/news/cosmonauts-launch-to-international-space-station-nasa-chief-touts-us-russia-cooperation/) \n\nhas a photo caption that says the colors are from the University they attended, but that's the only thing I've seen reference that so far. So that makes it seem like its a coincidence but who knows.",
            "title_similarity": "0.60196304"
        },
        {
            "id": "i192c9f",
            "score": -6,
            "text": "Tratiors... How much money did US pay to you?",
            "title_similarity": "0.05743658"
        },
        {
            "id": "i197nc7",
            "score": -8,
            "text": "denaZification, I’m the only one not brainwashed by Russian or American media geez, and the Russian media is actually half right while American media isn’t, what a shame downvote me ban me whatever",
            "title_similarity": "0.3233831"
        },
        {
            "id": "i17x12h",
            "score": 769,
            "text": "Further proving that the actual decent human beings that are Russian are not behind Putin’s bullshit.\n\nPeople have been talking about being in Ukraine and speaking with their family members in Russia who deny what’s really happening - that’s not denial, it’s FEAR.",
            "title_similarity": "0.32213712"
        },
        {
            "id": "i1800gg",
            "score": 7,
            "text": "Does anyone have a source other than Mirror that this happened? I’m not doubting but I can’t find anything online about this other than this article",
            "title_similarity": "0.14624271"
        },
        {
            "id": "i18uocp",
            "score": -8,
            "text": "Of course, Russia should not have attacked Ukraine violently. If this is violence, why do they respond violence by violence? Why are Biden, the European Union, FIFA … blocking the dialogue doors?  Why does everyone unite to take revenge with sanctions? Why don't they talk?  Why do you give weapons instead of dialogue to kill more Ukrainians in this unequal war? And to further destroy the infrastructure of Ukraine. The United States and its allies can spend money, on the ceasefire and  mediation on the peace between Russia and Ukraine.  But they pay for the weapons to keep Ukraine in an unequal war. Are we in the age of agriculture? Do politicians behave properly in the information age?\nCan such leaders solve the world's great problems, such as climate change?\nhttps://youtu.be/cud2VAxEMhk",
            "title_similarity": "0.22377685"
        },
        {
            "id": "i18d18w",
            "score": 10,
            "text": "Genuine question. Isn’t what is brought up to space tightly controlled? How were the able to sneakily bring these on board?",
            "title_similarity": "0.48317444"
        },
        {
            "id": "i19m36o",
            "score": -9,
            "text": "I wonder why they are supporting Nazi ukraine",
            "title_similarity": "0.2084204"
        },
        {
            "id": "i18d0yn",
            "score": 34,
            "text": "*in space, no one can hear Putin scream*",
            "title_similarity": "0.44134933"
        },
        {
            "id": "i18cehu",
            "score": -13,
            "text": "Ok, this is just stupid now. They should have just focused on their jobs and not get drag into stupid politics.",
            "title_similarity": "0.064378865"
        },
        {
            "id": "i17zy80",
            "score": -15,
            "text": "They should have removed that disgusting flag, it is symbol of nazzies, not sure why WhatsApp has not removed it yet, they may want to put a swastika at this point. Russia has to be brought back to medieval time until they get rid of Putin.",
            "title_similarity": "0.24656713"
        },
        {
            "id": "i182x2d",
            "score": 44,
            "text": "Where do you get a yellow and blue spacesuit? Do you… just happen to have one?",
            "title_similarity": "0.6576026"
        },
        {
            "id": "i17xhqp",
            "score": 81,
            "text": "Putin's lackeys are trying to come up with an answer for when he asks if space laser can hit ISS.\n\nAnd, BTW, this is simply fucking awesome.",
            "title_similarity": "0.53968877"
        },
        {
            "id": "i180yvm",
            "score": 80,
            "text": "Just a friendly reminder on what the dumbass Russian Space head [said yesterday.](https://futurism.com/rogozin-iss-fighting-mood/amp)\n\nBoy was he wrong.",
            "title_similarity": "0.43040776"
        },
        {
            "id": "i17yei3",
            "score": 666,
            "text": "Astronauts were always a spark of sanity  no matter their nationality",
            "title_similarity": "0.30207765"
        },
        {
            "id": "i17u6nn",
            "score": 511,
            "text": "[deleted]",
            "title_similarity": "0.014970249"
        },
        {
            "id": "i18bs0l",
            "score": 28,
            "text": "Fucken great. As an engineer, it is truly a spectacular moment when a group of engineers can come together to collaborate without bureaucracy and politics… just sheer determination and human ingenuity.",
            "title_similarity": "0.22033444"
        },
        {
            "id": "i18ny9y",
            "score": 176,
            "text": "If there's anybody who truly understand how ridiculous our imaginary borders are, it's astronauts.",
            "title_similarity": "0.43061155"
        },
        {
            "id": "i17u7nu",
            "score": 1924,
            "text": "Where did they get Ukrainian colour space suits? Seems an arbitrary thing to have on hand..",
            "title_similarity": "0.48333144"
        },
        {
            "id": "i17x6j3",
            "score": 557,
            "text": "That is truly beautiful. The ISS, like science in general, is a human endeavor. Happy to see that they are standing up for what is right. It was similar during the space race, Soviet and American scientist while competing, did collaborate a lot- politics aside.\n\n\nI hope they start a colony in space because it’s straight to the gulag if they come back.",
            "title_similarity": "0.5096591"
        },
        {
            "id": "i183kyl",
            "score": 104,
            "text": "It's just a coincidence, Putin. These are actually Swedish space suits!",
            "title_similarity": "0.5067263"
        },
        {
            "id": "i17tw2z",
            "score": 5203,
            "text": "At least they can't fall from a balcony in space.",
            "title_similarity": "0.3613035"
        },
        {
            "id": "i17xlef",
            "score": 17441,
            "text": "Right after this\n\n*hey uhh.. americans… mind if we fly back to your country when we leave… Thanks*\n\nEdit:\nWow 7 years and i finally got a gold. Excuse me nerds im gunna go hangout with the cool kids in r/lounge",
            "title_similarity": "0.29926783"
        },
        {
            "id": "i17yxlm",
            "score": 1197,
            "text": "That’s going to frost some pickles in the Kremlin.",
            "title_similarity": "0.27756503"
        },
        {
            "id": "i17z6mu",
            "score": 74,
            "text": "This is the best tl;dr I could make, [original](https://www.mirror.co.uk/news/world-news/breaking-three-russian-cosmonauts-wear-26505649) reduced by 79%. (I'm a bot)\n*****\n> The Russian team arrived aboard the International Space Station after launching from Kazakhstan and were wearing space suits of yellow and blue- the colours of Ukraine.\n\n> Three Russian cosmonauts have arrived at the International Space Station wearing the colours of the Ukrainian flag.\n\n> Remaining aboard the space station with the newcomers until the next rotation a couple months later are NASA astronauts Tom Marshburn, Raja Chari and Kayla Barron and German crewmate Matthias Maurer of the European Space Agency.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/thir40/russian_cosmonauts_wear_yellow_and_blue_when/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~634442 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Space**^#1 **Russian**^#2 **Nasa**^#3 **Hei**^#4 **Vande**^#5",
            "title_similarity": "0.70638686"
        },
        {
            "id": "i1868wv",
            "score": 5090,
            "text": "That’s one small step for a man, one giant embarrassment for Putin.",
            "title_similarity": "0.20495752"
        },
        {
            "id": "i17tsdz",
            "score": 2782,
            "text": "Russian cosmonauts deported to outer space.",
            "title_similarity": "0.63158405"
        },
        {
            "id": "i17w4ud",
            "score": 17035,
            "text": "That’s an impressive show of support for the Ukraine citizenry and absolutely crushing optics for the buffoonish psychopath back home.",
            "title_similarity": "0.15048584"
        },
        {
            "id": "i17xmwl",
            "score": 9882,
            "text": "Watch Russian state media shift colors on footage with them.",
            "title_similarity": "0.37109"
        },
        {
            "id": "i186wir",
            "score": 5976,
            "text": "> They were asked about the color of the suits, and [one of them] answered, **there was too much yellow fabric accumulated in the warehouse**.\n\n[[source](https://twitter.com/katlinegrey/status/1504944113468256257)]",
            "title_similarity": "0.36174464"
        },
        {
            "id": "i17x8wj",
            "score": 5,
            "text": "Those might be Ukrainian astronauts pretty soon!",
            "title_similarity": "0.44561398"
        },
        {
            "id": "i17xgpr",
            "score": 11,
            "text": "Anyone know how high profile cosmonauts are in Russia? Feels like this might be quite significant.",
            "title_similarity": "0.49451947"
        },
        {
            "id": "i17y00l",
            "score": 1,
            "text": "Can't wait to see what Rogozin has to comment about this",
            "title_similarity": "0.1837053"
        },
        {
            "id": "i17zoy7",
            "score": 1,
            "text": "You got to admire someone in a totalitarian country who risks their safety and livelihood doing this",
            "title_similarity": "0.08632996"
        },
        {
            "id": "i17zpvo",
            "score": 1,
            "text": "If you've ever wondered why astronauts are always looking like they're slouching somehow while wearing Sokol spacesuits (the white an blue one, not the yellow and blue flightsuits), it's because they were designed to be comfortable in the seats of a Soyuz capsule during the launch.\n\nThey were never meant to walk around in, and are apparently notoriously uncomfortable when trying to do so.\n\nI.e. you can't really stand up straight in them...",
            "title_similarity": "0.54730606"
        },
        {
            "id": "i17zw9v",
            "score": 1,
            "text": "They have escaped to the one place where no one can stop them SPACE!\n\n*and yes you most likely did read that internally in tim curry’s voice*",
            "title_similarity": "0.29474473"
        },
        {
            "id": "i1802sz",
            "score": 1,
            "text": "Space gulag for you",
            "title_similarity": "0.5340357"
        },
        {
            "id": "i1803ch",
            "score": 1,
            "text": "I mean, why not they all know they ain’t going to space anymore or have a valid citizenship.",
            "title_similarity": "0.26534122"
        },
        {
            "id": "i18049o",
            "score": 3,
            "text": "Does anyone have a source other than Mirror that this happened? I’m not doubting but I can’t find anything online about this other than this article",
            "title_similarity": "0.14624271"
        },
        {
            "id": "i1806ic",
            "score": 3,
            "text": "I hope the outbound shuttle \"malfunctions\" so they have to wait for Elon to send his Space Uber for them. Imagine the cosmonauts being \"unable to return\" to Russia citing the ongoing hostilities?",
            "title_similarity": "0.44447958"
        },
        {
            "id": "i1809bs",
            "score": 1,
            "text": "Fuck yeah that's awesome",
            "title_similarity": "-0.006750793"
        },
        {
            "id": "i180f00",
            "score": 1,
            "text": "Human solidarity - in times like these, you love to see it.",
            "title_similarity": "0.059934743"
        },
        {
            "id": "i180foz",
            "score": 1,
            "text": "Was that a protest or was that Russian information warfare?",
            "title_similarity": "0.21149445"
        },
        {
            "id": "i181oyb",
            "score": 1,
            "text": "They should be welcome in USA should they decide to defect upon their return.",
            "title_similarity": "0.17919886"
        },
        {
            "id": "i181yed",
            "score": 1,
            "text": "Does the space station have a balcony they can fall from?",
            "title_similarity": "0.5693011"
        },
        {
            "id": "i181yej",
            "score": 3,
            "text": "Putin: *They did what?! Bring them to the gulag!*\n\nGeneral: *But sir, they’re in space.*",
            "title_similarity": "0.611943"
        },
        {
            "id": "i181yzy",
            "score": 1,
            "text": "I wonder what launch control was thinking when they heard of their plan to suit up like this.",
            "title_similarity": "0.37361124"
        },
        {
            "id": "i181zcw",
            "score": 1,
            "text": "Are there 10- story windows to fall out of on the ISS?\n\nBut seriously, I admire this crew. ISS was always supposed to be politics free, but this statement is admirable.",
            "title_similarity": "0.4147234"
        },
        {
            "id": "i1826vr",
            "score": 1,
            "text": "guy on the right lookin’ like Regina George",
            "title_similarity": "0.087242216"
        },
        {
            "id": "i182d63",
            "score": 1,
            "text": "Initiate “controlled” descent sequence with all aboard in 3, 2, 1 ignite thrusters!",
            "title_similarity": "0.48988342"
        },
        {
            "id": "i182l7n",
            "score": 31,
            "text": "355 days on the space station. He sure missed a lot of craziness on Earth.",
            "title_similarity": "0.39737612"
        },
        {
            "id": "i182w1f",
            "score": 1,
            "text": "Putin be like: \"Quick somebody throw them off a window in the ISS!\"",
            "title_similarity": "0.49552637"
        },
        {
            "id": "i182wgs",
            "score": 1,
            "text": "So Minion cosplay",
            "title_similarity": "0.106138125"
        },
        {
            "id": "i1837l3",
            "score": 1,
            "text": "Theyre going to be up there for 6 to 12 months, so they should be safe for a while",
            "title_similarity": "0.20504571"
        },
        {
            "id": "i1837u5",
            "score": 1,
            "text": "They definitely can’t fall out of the windows!",
            "title_similarity": "0.25433928"
        },
        {
            "id": "i183bpl",
            "score": 1,
            "text": "What would leaving that one guy stranded on the ISS actually look like? Are margins too tight to sustain one extra person?",
            "title_similarity": "0.46802008"
        },
        {
            "id": "i183k3n",
            "score": 2,
            "text": "Wow, hope we have a way for Spacex to bring them all back to the US. Not sure going back to Russia will be a good idea. Good for them.",
            "title_similarity": "0.5551516"
        },
        {
            "id": "i183kem",
            "score": 1,
            "text": "Don’t send them back to their country let them escape and use their expertise for the better",
            "title_similarity": "0.13609505"
        },
        {
            "id": "i183nw2",
            "score": 1,
            "text": "So did they sneak the yellow suits up there?",
            "title_similarity": "0.39351654"
        },
        {
            "id": "i183t0n",
            "score": 1,
            "text": "    \"In space, no Putin can make you scream...\"",
            "title_similarity": "0.46290106"
        },
        {
            "id": "i183v0l",
            "score": 1,
            "text": "what color are their space suits normally? is this just a weird coincidence?",
            "title_similarity": "0.4606989"
        },
        {
            "id": "i1840yh",
            "score": 1,
            "text": "Fun fact: even with the unaided eye you can see the balls on these guys from your back yard!",
            "title_similarity": "0.05131198"
        },
        {
            "id": "i184afy",
            "score": 1,
            "text": "destination of their next mission : gulag",
            "title_similarity": "0.32066503"
        },
        {
            "id": "i184eak",
            "score": 2,
            "text": "ooooo they aint goin home boaaa",
            "title_similarity": "0.0722653"
        },
        {
            "id": "i184gf1",
            "score": 2,
            "text": "They are like Putin can't get us up here.... can he?",
            "title_similarity": "0.21682574"
        },
        {
            "id": "i184wwv",
            "score": 1,
            "text": "Gigantic balls and quite a high profile display of solidarity. I hope they and their family don't get screwed",
            "title_similarity": "0.09975364"
        },
        {
            "id": "i185s0z",
            "score": 1,
            "text": "It's not like they just went to the Cosmonaut Uniform Store and asked \"Do you have yellow and blue?\" I'm curious all is behind this, logistically and politically. As a political statement, it's super ballsy.",
            "title_similarity": "0.5805978"
        },
        {
            "id": "i1867pu",
            "score": 1,
            "text": "I don’t want to be a party pooper but…I feel like this isn’t what we hope it is 😞",
            "title_similarity": "0.045187637"
        },
        {
            "id": "i186a6a",
            "score": 1,
            "text": " Does Putin have a button to destroy the Russian part of the ISS?  Hope not.",
            "title_similarity": "0.44818252"
        },
        {
            "id": "i186lbo",
            "score": 1,
            "text": "Chads",
            "title_similarity": "0.09270705"
        },
        {
            "id": "i186n92",
            "score": 1,
            "text": "Is this essentially them defecting?",
            "title_similarity": "0.020969877"
        },
        {
            "id": "i186x8f",
            "score": 1,
            "text": "I just hope they don’t go home to Russia, they seem like decent humans.",
            "title_similarity": "0.18849792"
        },
        {
            "id": "i1870ps",
            "score": 1,
            "text": "Do we now need to worry about the ground staff who procured those suits??",
            "title_similarity": "0.26307356"
        },
        {
            "id": "i1872v9",
            "score": 1,
            "text": "“Their arrival comes amid strong tensions between the US and Russia over the invasion of Ukraine.”\n\nYeah that’s one way to put it.",
            "title_similarity": "0.2776696"
        },
        {
            "id": "i1873yj",
            "score": 1,
            "text": "I was wondering what was going on at the ISS because of all this.",
            "title_similarity": "0.42760986"
        },
        {
            "id": "i187fm6",
            "score": 2,
            "text": "American spy satellites have opened with a 50%off Ukrainian uniform sale \nGod bless the American war machine 🏆",
            "title_similarity": "0.36395374"
        },
        {
            "id": "i187q5o",
            "score": 1,
            "text": "Can they take out the Kremlin satellite while they’re up there.",
            "title_similarity": "0.56185764"
        },
        {
            "id": "i187xxx",
            "score": 1,
            "text": "That's... Gonna be a hard window for them to \"fall out of\"",
            "title_similarity": "0.09028309"
        },
        {
            "id": "i1881e8",
            "score": 1,
            "text": "Sorry that they will get fired",
            "title_similarity": "0.023823656"
        },
        {
            "id": "i18820c",
            "score": 2,
            "text": "So if there was a nuclear war on earth and everybody dies, the lady in space would be humanity last chance.",
            "title_similarity": "0.43644646"
        },
        {
            "id": "i1887by",
            "score": 1,
            "text": "Now make sure you stay there until Putin is out of office ok?",
            "title_similarity": "0.24782269"
        },
        {
            "id": "i18884w",
            "score": 1,
            "text": "Where do they even get that",
            "title_similarity": "0.04987532"
        },
        {
            "id": "i188aml",
            "score": 1,
            "text": "Should of 3 former cosmonauts,  now there learning how to hide a shank in there rectum in a comfy gulag in Siberia.",
            "title_similarity": "0.46263993"
        },
        {
            "id": "i188ect",
            "score": 3,
            "text": "Heroes. Hope they’re ok when they land :/",
            "title_similarity": "0.17524311"
        },
        {
            "id": "i188eux",
            "score": 1,
            "text": "I am consistently impressed with the balls many Ukrainians and Russians have shown during this clusterfuck.",
            "title_similarity": "0.20861673"
        },
        {
            "id": "i188f1k",
            "score": 1,
            "text": "Spaceballs!",
            "title_similarity": "0.36961415"
        },
        {
            "id": "i188jkn",
            "score": 1,
            "text": "Next headline *Putin accuses the ISS of war crimes*",
            "title_similarity": "0.2766438"
        },
        {
            "id": "i188mmv",
            "score": 1,
            "text": "Well done cosmonauts! And good luck with that",
            "title_similarity": "0.40703332"
        },
        {
            "id": "i188pdp",
            "score": 1,
            "text": " Those aren't typical space suits for the cosmonauts, which are typically all blue - but would be interesting as to how they got those uniforms.",
            "title_similarity": "0.54848826"
        },
        {
            "id": "i188qx9",
            "score": 1,
            "text": "Them bois my heros",
            "title_similarity": "0.03930092"
        },
        {
            "id": "i189av2",
            "score": 1,
            "text": "BIG OL BALLS",
            "title_similarity": "0.00703685"
        },
        {
            "id": "i189exp",
            "score": 1,
            "text": "Small Peen energy Pootie is gonna be mad",
            "title_similarity": "0.019087162"
        },
        {
            "id": "i189qzv",
            "score": 1,
            "text": "Is that seat occupi.....take.....err....can I sit there?",
            "title_similarity": "0.15353414"
        },
        {
            "id": "i189vbj",
            "score": 1,
            "text": "Wow, that's ballsy of them",
            "title_similarity": "-0.04909797"
        },
        {
            "id": "i189vjv",
            "score": 1,
            "text": "If this were truly a political statement the blue wouldn't be so dark, and there wouldn't be any red.",
            "title_similarity": "0.25675297"
        },
        {
            "id": "i18aerc",
            "score": 1,
            "text": "Reminds me of Wreck It Ralph.  Just because you’re a bad guy, doesn’t mean you’re a bad guy.",
            "title_similarity": "0.08455344"
        },
        {
            "id": "i18ah1h",
            "score": 4,
            "text": "That's a paddlin'",
            "title_similarity": "-0.033657975"
        },
        {
            "id": "i18ahou",
            "score": 5,
            "text": "Dunno if they're supporting Ukraine, or implying Ukraine is part of russia",
            "title_similarity": "0.3277141"
        },
        {
            "id": "i18ako4",
            "score": 2,
            "text": "Political or not, I’m just glad they weren’t wearing big white Zs on their chests.",
            "title_similarity": "0.14670327"
        },
        {
            "id": "i18aktv",
            "score": 1,
            "text": "Putin will kill every single one of them.",
            "title_similarity": "0.16213842"
        },
        {
            "id": "i18ap8m",
            "score": 1,
            "text": "After all that crap the head of their space agency was talking",
            "title_similarity": "0.4585057"
        },
        {
            "id": "i18aqg1",
            "score": 1,
            "text": "That is HUGE.\n\nBravo!",
            "title_similarity": "0.03729366"
        },
        {
            "id": "i18aqg3",
            "score": 1,
            "text": "Hope they don’t fall out of a window in the station.",
            "title_similarity": "0.2737884"
        },
        {
            "id": "i18ardh",
            "score": 1,
            "text": "Skeptical.   Some Russians due to be stuck in a metal tube in space for months.  They aren't exactly going to come draped in Russian flags are they?",
            "title_similarity": "0.49683183"
        },
        {
            "id": "i18aztl",
            "score": 1,
            "text": "Any single soul who speaks Russian please translate what they are saying.",
            "title_similarity": "0.35999882"
        },
        {
            "id": "i18b6bo",
            "score": 1,
            "text": "Am I crazy for thinking they don't want to return to new the North Korea so they get the prosecuted in the home country status.",
            "title_similarity": "0.20354715"
        },
        {
            "id": "i18bjbs",
            "score": 1,
            "text": "I truly hope this is a real. I hope that Russia did not send this crew to cause damage to the ISS. I can see that shady MF sending these guys to sabotage everything. The blue and yellow suits would be a nice touch. I guess I’m too much into conspiracy.",
            "title_similarity": "0.4274668"
        },
        {
            "id": "i18bnsc",
            "score": 6,
            "text": "I wonder if they think about Sergei Krikalev (\"The last Soviet Citizen\") who was stuck for 311 days on Mir because the Soviet Union fell.",
            "title_similarity": "0.41900223"
        },
        {
            "id": "i18br0u",
            "score": 1,
            "text": "Unfortunate none survived reentry (to Russia)",
            "title_similarity": "0.38373494"
        },
        {
            "id": "i18bvpu",
            "score": 3,
            "text": "Brave, and I'm not surprised that they're sympathetic:\n\nhttps://en.wikipedia.org/wiki/Overview_effect",
            "title_similarity": "0.07359611"
        },
        {
            "id": "i18bxtu",
            "score": 1,
            "text": "They should put Putin out in space!!!!",
            "title_similarity": "0.54666805"
        },
        {
            "id": "i18c4s0",
            "score": 1,
            "text": "I Can hear the Kremlin's walls shaking from here.",
            "title_similarity": "0.26590714"
        },
        {
            "id": "i18c5ia",
            "score": 1,
            "text": "Scientists capable of critical thought are aware the war is bogus and cruel.  Who would have thought?  A shame most people are too stupid.",
            "title_similarity": "0.10297771"
        },
        {
            "id": "i18c5wy",
            "score": 3,
            "text": "Hey, cosmonauts. Don't leave Kazakhstan...",
            "title_similarity": "0.53293955"
        },
        {
            "id": "i18c9sc",
            "score": 3,
            "text": "Is outer space far enough away from Putin?",
            "title_similarity": "0.41542262"
        },
        {
            "id": "i18cb6p",
            "score": 1,
            "text": "Hard to fall out of a window on the ISS.",
            "title_similarity": "0.5371994"
        },
        {
            "id": "i18cc4l",
            "score": 1,
            "text": "Roscosmos leadership, go fuck yourself.\n\nCosmonauts, you're cool.",
            "title_similarity": "0.49204051"
        },
        {
            "id": "i18ccv6",
            "score": 1,
            "text": "Space flex",
            "title_similarity": "0.3903523"
        },
        {
            "id": "i18cd1m",
            "score": 1,
            "text": "I heard they were already missing",
            "title_similarity": "0.023665331"
        },
        {
            "id": "i18ce9a",
            "score": 3,
            "text": "Cosma-not any mores",
            "title_similarity": "0.09467769"
        },
        {
            "id": "i18ch15",
            "score": 2,
            "text": "How did they get yellow and blue suits?",
            "title_similarity": "0.5093477"
        },
        {
            "id": "i18ck9u",
            "score": 2,
            "text": "Not surprising. The peeps that get to the ISS are literally some of the best humans on the planet.",
            "title_similarity": "0.34502783"
        },
        {
            "id": "i18ckxq",
            "score": 2,
            "text": "Who's going to bring those Cosmonauts down again? SPACE FOOOORCE!!!",
            "title_similarity": "0.5544439"
        },
        {
            "id": "i18cl8s",
            "score": 2,
            "text": "Putin is about to leave the whole team there",
            "title_similarity": "0.198129"
        },
        {
            "id": "i18clop",
            "score": 2,
            "text": "At least the Germans were into their invasion. Literally only 1 man wants this nonsense.",
            "title_similarity": "0.25084326"
        },
        {
            "id": "i18cse6",
            "score": 2,
            "text": "I’m pretty sure this was not a planned show of support, but just the colors of the uniform.",
            "title_similarity": "0.18078867"
        },
        {
            "id": "i18cv33",
            "score": 1,
            "text": "Did…did they make those in space?",
            "title_similarity": "0.537663"
        },
        {
            "id": "i18czg3",
            "score": 1,
            "text": "Fuck yeah. A big, hearty, Fuck, Yeah.",
            "title_similarity": "0.042715352"
        },
        {
            "id": "i18d2eb",
            "score": 2,
            "text": "All of a sudden that drill hole that appeared out of nowhere a couple years ago is going to get bigger.",
            "title_similarity": "0.27247977"
        },
        {
            "id": "i18d8m7",
            "score": 3,
            "text": "So, according to the article they left in their ordinary suits, which were white?\n\n1. How did they hide the yellow suits?\n2. How did they get them made so quickly?\n3. They changed after liftoff but before docking?\n\nSo ... many ... questions.",
            "title_similarity": "0.46083987"
        },
        {
            "id": "i18db7u",
            "score": 2,
            "text": "Their last flight in space it seem.",
            "title_similarity": "0.51529527"
        },
        {
            "id": "i18dec7",
            "score": 2,
            "text": "their parachute fail during reentry. then, an investigation points out to a Roscosmos employ who has some personal beefs with one of the cosmonauts. a few days later police find his body in a suitcase. after a thorough investigation they conclude that it's a suicide",
            "title_similarity": "0.33412123"
        },
        {
            "id": "i18dk7w",
            "score": 1,
            "text": "Reddit in space",
            "title_similarity": "0.47322133"
        },
        {
            "id": "i18dl70",
            "score": 2,
            "text": "They bouta become astronauts real soon",
            "title_similarity": "0.4288553"
        },
        {
            "id": "i18dlka",
            "score": 2,
            "text": "\"Putin can't get to us here.\"",
            "title_similarity": "0.16968954"
        },
        {
            "id": "i18dnke",
            "score": 1,
            "text": "They all disappeared mysteriously, RIGHT after landing....",
            "title_similarity": "0.1907264"
        },
        {
            "id": "i18dpe2",
            "score": 2,
            "text": "Man..better hope Putin doesn't try to destroy the space station because of this",
            "title_similarity": "0.38809437"
        },
        {
            "id": "i18dtgj",
            "score": 1,
            "text": "They said \"we come in peace\".",
            "title_similarity": "0.068655916"
        },
        {
            "id": "i18dvmy",
            "score": 2,
            "text": "Those look like regular flight suits.  Are these the colors they usually use, or are people suggesting they had these specially made for the color?",
            "title_similarity": "0.35012516"
        },
        {
            "id": "i18dwxm",
            "score": 3,
            "text": "RIP their families",
            "title_similarity": "0.046915486"
        },
        {
            "id": "i18dycl",
            "score": 4,
            "text": "Now I'm worried about what will happen to them when they get home.",
            "title_similarity": "0.031401794"
        },
        {
            "id": "i18e2ei",
            "score": 2,
            "text": "I picked a really good time to catch up on For All Mankind.",
            "title_similarity": "0.11376718"
        },
        {
            "id": "i18e3l1",
            "score": 1,
            "text": "Space people are rarely not cool.",
            "title_similarity": "0.23819616"
        },
        {
            "id": "i18e6zl",
            "score": 1,
            "text": "I hope they don’t “go missing” :(",
            "title_similarity": "0.06824556"
        },
        {
            "id": "i18e7ai",
            "score": 2,
            "text": "Wowwww",
            "title_similarity": "-0.006016981"
        },
        {
            "id": "i18e7ez",
            "score": 1,
            "text": "I bet alot of the world's problems could be solved if people could just see our floating rock in space for themselves in person. Keep it up Space Cowboy.",
            "title_similarity": "0.5508014"
        },
        {
            "id": "i18eb4s",
            "score": 3,
            "text": "Nobody wants this war!!! 👍🇺🇦👏👏👏",
            "title_similarity": "0.08188799"
        },
        {
            "id": "i18edpe",
            "score": 1,
            "text": "Love it but also, doubt it...",
            "title_similarity": "-0.051101208"
        },
        {
            "id": "i18edzt",
            "score": 1,
            "text": "I met Artemyev in Moscow in January 2020! Great guy!  \nIronically, my first questions was how they handle politics \"up there\". I don't remember his exact words, but the message was that you don't talk politics in space. Huh, plot twist.",
            "title_similarity": "0.42648685"
        },
        {
            "id": "i18ehai",
            "score": 3,
            "text": "So, what's the over-under on them hitching a ride back on a spare Crew Dragon and requesting asylum, considering what they've got to come home to now?",
            "title_similarity": "0.36480492"
        },
        {
            "id": "i18eowa",
            "score": 3,
            "text": "Russia threatens to strand cosmonauts in ISS",
            "title_similarity": "0.63667035"
        },
        {
            "id": "i18eunu",
            "score": 1,
            "text": "https://youtu.be/9OCUgZJEVGc",
            "title_similarity": "0.15336451"
        },
        {
            "id": "i18ezcc",
            "score": 3,
            "text": "This just in, Russia has decided there will be no more return flights from the space station.",
            "title_similarity": "0.5534865"
        },
        {
            "id": "i18f9on",
            "score": 1,
            "text": "Better stay away from the windows",
            "title_similarity": "0.051635467"
        },
        {
            "id": "i18facx",
            "score": 1,
            "text": "I wonder how they snuck these colors into space since they launched from Russia. No way would Russia just be cool with them wearing this.",
            "title_similarity": "0.5461376"
        },
        {
            "id": "i18fb0x",
            "score": 1,
            "text": "I've been watching a few Soyuz missions from the last year and I'm still to see that yellow and blue jumper. It is very unlikely this is not a very conscious message sent by the crew, both in space and earth.",
            "title_similarity": "0.6249734"
        },
        {
            "id": "i18fgcj",
            "score": 1,
            "text": "My question is where did the flight suits come from?\n\nThis is obviously bigger than just these three cosmonauts.\n\nNot to sound dumb or cliche or corny, the fire is catching mr Putin.",
            "title_similarity": "0.4819631"
        },
        {
            "id": "i18fhda",
            "score": 1,
            "text": "They all went to the same university, and their colours were blue and yellow, apparently. So either that OR its a Ukraine thing OR very stupid astronauts.",
            "title_similarity": "0.61387056"
        },
        {
            "id": "i18g1d8",
            "score": 1,
            "text": "Hey I have a dumb question….. what’s the difference between an astronaut and a cosmonaut? I’m curious",
            "title_similarity": "0.53816515"
        },
        {
            "id": "i18gp6n",
            "score": 2,
            "text": "the trojan horse",
            "title_similarity": "0.20304222"
        },
        {
            "id": "i18gwjk",
            "score": 1,
            "text": "Please, god: let this result in an outer-spacey reboot of The Hunt for Red October many years down the road.",
            "title_similarity": "0.39814067"
        },
        {
            "id": "i18gyu4",
            "score": 1,
            "text": "Wait til they hear 'bout the Psychonauts.",
            "title_similarity": "0.17087187"
        },
        {
            "id": "i18h34s",
            "score": 1,
            "text": "This is very cool but how can a Russian cosmonaut get a custom suit made before taking off? Is the whole Russian space program in on this display?",
            "title_similarity": "0.67605317"
        },
        {
            "id": "i18h4yq",
            "score": 1,
            "text": "Hah.... sigh... \n\nRussia is really fucking up everything aren't they? They can't even be a proper successor to the nazis. \n\nI guess I can see why their military is using civilian coms for military purposes if something like this is happening. \n\nMight as well drop an FAE on the Kremlin. Cause they probably wouldn't even realize it was happening and it's as destructive but way safer than a nuke.",
            "title_similarity": "0.267559"
        },
        {
            "id": "i18h8kv",
            "score": 3,
            "text": "Tells a helluva' story regarding Russia's recent threats about de-orbiting the ISS and stranding other astronauts aboard.",
            "title_similarity": "0.5733439"
        },
        {
            "id": "i18haqo",
            "score": 1,
            "text": "Really, what would happen if one or all had been wearing their regular outfit or more importantly a Z on their chest like that Russian gymnast on the medals podium?\n\nNot allowed to take off? Not allowed to board the ISS? Awkward silences?",
            "title_similarity": "0.52939546"
        },
        {
            "id": "i18hxea",
            "score": 1,
            "text": "Surplus Ikea uniforms after they closed their Russian branches?",
            "title_similarity": "0.3452956"
        },
        {
            "id": "i18hywv",
            "score": 3,
            "text": "Slava Ukraine",
            "title_similarity": "0.20463505"
        },
        {
            "id": "i18i2vx",
            "score": 1,
            "text": "What color are the clothes usually?  Do they not specifically make them for space travel?",
            "title_similarity": "0.51360774"
        },
        {
            "id": "i18ifac",
            "score": 1,
            "text": "Smart ppl doing smart ppl things",
            "title_similarity": "-0.014251603"
        },
        {
            "id": "i18ifow",
            "score": 1,
            "text": "Their butthole bureau chief didn’t stop them?",
            "title_similarity": "0.08577473"
        },
        {
            "id": "i18ij21",
            "score": 1,
            "text": ">Vande Hei will have logged a NASA record-breaking 355 days in orbit by the time he returns to Kazakhstan with his two cosmonaut colleagues.\n\nLost in the story, but a year in space must be grueling. This is the astronaut Russia threatened to leave in space, but is coming back with two cosmonauts. Every sip of water is recycled pee, every breath a recycled fart. You have to really want it to go up there.",
            "title_similarity": "0.5224717"
        },
        {
            "id": "i18imco",
            "score": 3,
            "text": "I think the original plan from Russian agency that by this time Russia would occupy Ukraine. So this would look like agreement move.\nBur due to turn of events it looks opposite.",
            "title_similarity": "0.35354707"
        },
        {
            "id": "i18iw1e",
            "score": 2,
            "text": "Thanks! Slava Ukraini 🇺🇦💙💛🌻",
            "title_similarity": "0.14485165"
        },
        {
            "id": "i18ixdu",
            "score": 3,
            "text": "Fuck Putler.",
            "title_similarity": "0.024621576"
        },
        {
            "id": "i18j0c2",
            "score": 1,
            "text": "This is just me, I read the article. Question, where did they obtain space suits, a highly specific flight suit in this color? This seems like more Russian propaganda.",
            "title_similarity": "0.60445946"
        },
        {
            "id": "i18j0m1",
            "score": 6,
            "text": "Pray for their families back home.",
            "title_similarity": "0.068607986"
        },
        {
            "id": "i18j6a8",
            "score": 3,
            "text": "I just assume they got sent to space gulag after this.",
            "title_similarity": "0.55759054"
        },
        {
            "id": "i18j7ve",
            "score": 1,
            "text": "Respect. Its not easy to stick up to a dictator, let alone when you have a career, family, house, kids, car.",
            "title_similarity": "0.07101276"
        },
        {
            "id": "i18jfyh",
            "score": 2,
            "text": "We love you Russians. Putin must be held accountable.",
            "title_similarity": "0.28273928"
        },
        {
            "id": "i18jgpi",
            "score": 1,
            "text": "This makes me wonder… is the war visible from space in any way?",
            "title_similarity": "0.42430705"
        },
        {
            "id": "i18jlxt",
            "score": 1,
            "text": "I have a feeling this is coincidence.",
            "title_similarity": "0.025027407"
        },
        {
            "id": "i18jolk",
            "score": 2,
            "text": "*Putin sees red.",
            "title_similarity": "0.1717211"
        },
        {
            "id": "i18jtz8",
            "score": 1,
            "text": "Yo are people on this sub stupid? \n\nThere’s clearly a huge Russian flag printed across their suits.\n\nThey are just wearing yellow because it is a bright colour that provides visibility for rescue teams in case they need to bail out of their spacecraft during launch…",
            "title_similarity": "0.57010144"
        },
        {
            "id": "i18juv0",
            "score": 1,
            "text": "\"We are space brothers\" - Nanba Mutta",
            "title_similarity": "0.40707964"
        },
        {
            "id": "i18jwrf",
            "score": 1,
            "text": "Maybe it’s not related to this news but I understand mandarin and browsed Chinese TikTok (Douyin) all the time for cooking and funny vids. It’s so bizarre that the news they are spreading in China vs the rest of the world are so different. It’s like we are living in two different worlds lol",
            "title_similarity": "0.24855734"
        },
        {
            "id": "i18jyuf",
            "score": 1,
            "text": "I hope this wasn't photoshopped.  They look good now but they will all kinds of problems when they get back to Russia.",
            "title_similarity": "0.2554086"
        },
        {
            "id": "i18jzzv",
            "score": 2,
            "text": "Holy shit, that's quite the move of solidarity",
            "title_similarity": "0.07207042"
        },
        {
            "id": "i18k3ub",
            "score": 1,
            "text": "I hope the depth of the news article is true. That being said, is this misleading in some way?",
            "title_similarity": "0.079422146"
        },
        {
            "id": "i18kak1",
            "score": 10,
            "text": "This episode of For All Mankind is getting extra weird …\n\nIn all seriousness this is dope",
            "title_similarity": "0.061352156"
        },
        {
            "id": "i18kjdo",
            "score": 1,
            "text": "\"The overview effect is a cognitive shift in awareness reported by some astronauts during spaceflight, often while viewing the Earth from outer space.It is the experience of seeing first-hand the reality of the Earth in space, which is immediately understood to be a tiny, fragile ball of life, \"hanging in the void\", shielded and nourished by a paper-thin atmosphere. The effect may also invoke a sense of transcendence and connection with humanity as a whole, from which national borders appear petty.\"",
            "title_similarity": "0.6013193"
        },
        {
            "id": "i18kjyx",
            "score": 4,
            "text": "I say this with peace and love, I hope these guys stay in space.",
            "title_similarity": "0.3677638"
        },
        {
            "id": "i18l68q",
            "score": 2,
            "text": "Holy shit that’s a ton of people in space right now.",
            "title_similarity": "0.42957425"
        },
        {
            "id": "i18ldv5",
            "score": 3,
            "text": "I mean I guess they are in basically the only place that Putin can’t have them killed…\n\n…immediately",
            "title_similarity": "0.27087808"
        },
        {
            "id": "i18ldx6",
            "score": 1,
            "text": "Where did they get them and how did they get up there wearing them?",
            "title_similarity": "0.23786673"
        },
        {
            "id": "i18loxn",
            "score": 3,
            "text": "Russian children won't be allowed heroes anymore in Russia.\n\nFirst Arnold, now astronaut's...\n\nTo have a hero is to have someone who can stand up to tyranny and that cannot be allowed in Nazi Russia.",
            "title_similarity": "0.44558978"
        },
        {
            "id": "i18lqmp",
            "score": 3,
            "text": "It's time for scientists to run the world before the politicians kill us all.",
            "title_similarity": "0.28335983"
        },
        {
            "id": "i18lt96",
            "score": 1,
            "text": "r8",
            "title_similarity": "0.052073754"
        },
        {
            "id": "i18luuc",
            "score": 2,
            "text": "First Soyuz to land in Nevada?",
            "title_similarity": "0.51182103"
        },
        {
            "id": "i18lwcg",
            "score": 4,
            "text": "What a fuck you to Putin.  I love it.  The *one* place on earth they are safe... er... not on earth.",
            "title_similarity": "0.18767768"
        },
        {
            "id": "i18ma1f",
            "score": 5,
            "text": "These guys need to tell Putin that they better not see him when they come back.",
            "title_similarity": "0.18546656"
        },
        {
            "id": "i18mawt",
            "score": 2,
            "text": "They're doing Gangnam Style?!!!",
            "title_similarity": "0.1471878"
        },
        {
            "id": "i18mf4k",
            "score": 1,
            "text": "Was laundry day",
            "title_similarity": "0.04382704"
        },
        {
            "id": "i18mihb",
            "score": 2,
            "text": "Well damn",
            "title_similarity": "-0.037084296"
        },
        {
            "id": "i18mqhe",
            "score": 2,
            "text": "Not sure if anyone knew this, and maybe they may be trying to silently protest but they stated: \"it became our turn to pick a color. But in fact, we had accumulated alot of yellow material so we needed to use it. So that’s why we had to wear yellow,”",
            "title_similarity": "0.23733352"
        },
        {
            "id": "i18mr07",
            "score": 1,
            "text": "Are we sure they meant anything by it?",
            "title_similarity": "0.05726225"
        },
        {
            "id": "i18mzk6",
            "score": 3,
            "text": "how come when i google this nothing comes up",
            "title_similarity": "0.07841431"
        },
        {
            "id": "i18n0l8",
            "score": 2,
            "text": "SpaceX is gonna have to bring them back too",
            "title_similarity": "0.44988042"
        },
        {
            "id": "i18n0tf",
            "score": 1,
            "text": "I’m sure any country will be eager to accept these astronauts  if they need asylum.",
            "title_similarity": "0.37550616"
        },
        {
            "id": "i18n875",
            "score": 2,
            "text": "Legend",
            "title_similarity": "0.023607686"
        },
        {
            "id": "i18nfmf",
            "score": 2,
            "text": "Pretty sure I saw this movie.",
            "title_similarity": "0.11034483"
        },
        {
            "id": "i18nj2s",
            "score": 1,
            "text": "I was learning Russian to move there. But my family is dukobor. Russia hasn't changed. I'm out.",
            "title_similarity": "0.34467635"
        },
        {
            "id": "i18np6e",
            "score": 1,
            "text": "Not gunna lie… as much as I dislike a Drunkia, Astropolitan just sounds so much cooler than Cosmopolitan",
            "title_similarity": "0.13771643"
        },
        {
            "id": "i18ns4o",
            "score": 1,
            "text": "Yesss",
            "title_similarity": "0.021615125"
        },
        {
            "id": "i18ntk6",
            "score": 1,
            "text": "Why? So they can be easily distinguished from the American astronauts in their red and white suits?",
            "title_similarity": "0.44316158"
        },
        {
            "id": "i18nwix",
            "score": 3,
            "text": "Am I the only one concerned with where they got those yellow suits?",
            "title_similarity": "0.33621615"
        },
        {
            "id": "i18o847",
            "score": 1,
            "text": "where did they change because they were originally wearing white when boarding in Khazakestan?",
            "title_similarity": "0.34191227"
        },
        {
            "id": "i18obbz",
            "score": 2,
            "text": "The dream i had where i went up into space and Putin destroyed Mars and Saturn to try and kill me doesnt feel too ridiculous now",
            "title_similarity": "0.44607502"
        },
        {
            "id": "i18olpq",
            "score": 3,
            "text": "That's the ultimate \"What are you going to do about it?\" power play lmao.",
            "title_similarity": "0.13479242"
        },
        {
            "id": "i18otgj",
            "score": 3,
            "text": "What do you mean our ship back to Russia has been cancelled?",
            "title_similarity": "0.35655236"
        },
        {
            "id": "i18p8ck",
            "score": 1,
            "text": "***HOW????***",
            "title_similarity": "0.11029594"
        },
        {
            "id": "i18p8yo",
            "score": 1,
            "text": "Sooo where did they get the new outfits?",
            "title_similarity": "0.19225252"
        },
        {
            "id": "i18po2r",
            "score": 4,
            "text": "Surprised the weight of their massive balls aren’t changing the trajectory of orbit.",
            "title_similarity": "0.31697977"
        },
        {
            "id": "i18qac7",
            "score": 3,
            "text": "Well...i guess those cosmonauts are going to need to find a new job.",
            "title_similarity": "0.370143"
        },
        {
            "id": "i18qtmh",
            "score": 2,
            "text": "Hopefully they won't be sent to the gulags upon their return... this is reminiscent of the handshake in space scene  in  for all mankind season 2 finale where the pursuit of human achievement trumped political bickering",
            "title_similarity": "0.50194687"
        },
        {
            "id": "i18qziu",
            "score": 4,
            "text": "Can they go back to Russia after this?",
            "title_similarity": "0.3525489"
        },
        {
            "id": "i18r8ny",
            "score": 3,
            "text": "Please hang Putin",
            "title_similarity": "0.26555347"
        },
        {
            "id": "i18rsge",
            "score": 2,
            "text": "Putin now with an opening to become Hitler and a Bond villain rolled into one. Lost in space….",
            "title_similarity": "0.4399501"
        },
        {
            "id": "i18rwk5",
            "score": 1,
            "text": "It’s amazing to me that there was even a wardrobe choice. I’m glad it worked out in that favor",
            "title_similarity": "0.13698144"
        },
        {
            "id": "i18rx4w",
            "score": 1,
            "text": "Since when have 10 people lived on the space station?",
            "title_similarity": "0.5513111"
        },
        {
            "id": "i18rynj",
            "score": 1,
            "text": "Cool?",
            "title_similarity": "-0.017958349"
        },
        {
            "id": "i18s4h0",
            "score": 1,
            "text": "Who gave them the outfit bruh...",
            "title_similarity": "0.10522106"
        },
        {
            "id": "i18s63r",
            "score": 1,
            "text": "Either the biggest show of support or the biggest mockery yet.",
            "title_similarity": "0.08515457"
        },
        {
            "id": "i18s8t3",
            "score": 4,
            "text": "If shooting smart people into space at great expense is our best way to show our shared humanity, it’s worth every penny.",
            "title_similarity": "0.31852686"
        },
        {
            "id": "i18sa7x",
            "score": 1,
            "text": "Respect.",
            "title_similarity": "-0.019229572"
        },
        {
            "id": "i18salw",
            "score": 1,
            "text": "This reminds me of For All Mankind.",
            "title_similarity": "0.13275746"
        },
        {
            "id": "i18sati",
            "score": 1,
            "text": "~~6-12 months~~ indefinitely",
            "title_similarity": "0.21207052"
        },
        {
            "id": "i18scht",
            "score": 1,
            "text": "They goin to the gulag soon as they splash down",
            "title_similarity": "0.2473759"
        },
        {
            "id": "i18sfjp",
            "score": 1,
            "text": "**little man putin**: “Where is the nearest Ukranian orphanage?  Let’s *adjust* the re-entry coordinates a bit.  And they won’t be needing that parachute, will they?  Let’s cut it loose before re-entry…”",
            "title_similarity": "0.3002332"
        },
        {
            "id": "i18sxlj",
            "score": 1,
            "text": "That might be one of the most brave things we have seen yet from behind the iron curtain. They could possibly return home to chains, or their families lost to them forever. Well done gentlemen.",
            "title_similarity": "0.2112585"
        },
        {
            "id": "i18szsx",
            "score": 1,
            "text": "This is good wag to get stuck up there 😳",
            "title_similarity": "0.059015196"
        },
        {
            "id": "i18t3tp",
            "score": 1,
            "text": "Wow. That is huge.",
            "title_similarity": "-0.0033595506"
        },
        {
            "id": "i18tpyk",
            "score": 1,
            "text": "Also important because this is the first only Russian flight of cosmonauts to the station on a Soyuz",
            "title_similarity": "0.6873048"
        },
        {
            "id": "i18ts3r",
            "score": 5,
            "text": "I'm kind of curious about the logistics behind this. Like, these aren't just regular clothes. I wonder how you go about requesting particular colors on space clothes and have it ready within three weeks time. Or maybe they already had them on hand?",
            "title_similarity": "0.43923926"
        },
        {
            "id": "i18uhg0",
            "score": 2,
            "text": "Come at me Putin",
            "title_similarity": "0.22533174"
        },
        {
            "id": "i18uno2",
            "score": 1,
            "text": "What a beautiful gesture.",
            "title_similarity": "-0.014262492"
        },
        {
            "id": "i18uo0h",
            "score": 1,
            "text": "It's probably a weird attempt to say they are part of Russia already.",
            "title_similarity": "0.2835872"
        },
        {
            "id": "i18uq8r",
            "score": 1,
            "text": "Vlad isn’t gonna be happy. I’m pleasantly surprised at how ineffective his internal security apparatus has been in suppressing and intimidating enough of these protesters before they even started. Xi could definitely teach him a thing or two.",
            "title_similarity": "0.15009668"
        },
        {
            "id": "i18uq90",
            "score": 1,
            "text": "“Gnatronauts”",
            "title_similarity": "0.05904355"
        },
        {
            "id": "i18v6vr",
            "score": 1,
            "text": "Dead Men Floating",
            "title_similarity": "0.14060308"
        },
        {
            "id": "i18vc49",
            "score": 1,
            "text": "Serious question. How did they get the new suits?",
            "title_similarity": "0.26845795"
        },
        {
            "id": "i18ve6t",
            "score": 1,
            "text": "Do they keep extra material and a sewing machine on the iss. Where did they get the colors",
            "title_similarity": "0.43188155"
        },
        {
            "id": "i18vjuk",
            "score": 1,
            "text": "They are just staying in space now right? They will fall out of the space shuttles window as soon as they land.",
            "title_similarity": "0.55913293"
        },
        {
            "id": "i18vn73",
            "score": 1,
            "text": "We’re these suddenly designed. I dont get it",
            "title_similarity": "0.10953085"
        },
        {
            "id": "i18vy7w",
            "score": 1,
            "text": "strong yuri gagarin energy here, hopefully they don't wind up the same way.",
            "title_similarity": "0.24036343"
        },
        {
            "id": "i18vyal",
            "score": 1,
            "text": "I bet they are just so happy to be together and work. No hostilities and nothing but complete understanding. Stunning professionalism.",
            "title_similarity": "0.07760352"
        },
        {
            "id": "i18vz3o",
            "score": 1,
            "text": "Upgangdam style",
            "title_similarity": "0.07593445"
        },
        {
            "id": "i18w1sp",
            "score": 1,
            "text": "Scientist rarely see borders and divisions… the know at a molecular level we are all the same… astronauts go to the iss and see a world without borders…",
            "title_similarity": "0.6083795"
        },
        {
            "id": "i18w507",
            "score": 1,
            "text": "Hi BJj",
            "title_similarity": "0.11932743"
        },
        {
            "id": "i18w5hm",
            "score": 1,
            "text": "Fuck you mother russia.  What are you going to do to us up here.",
            "title_similarity": "0.2580108"
        },
        {
            "id": "i18w6p3",
            "score": 1,
            "text": "I bet Putin feels like a real dick right now",
            "title_similarity": "0.14206293"
        },
        {
            "id": "i18wmp2",
            "score": 1,
            "text": "I hope their balls dont weigh down the space station",
            "title_similarity": "0.50745726"
        },
        {
            "id": "i18ws6g",
            "score": 1,
            "text": "yo its 2006",
            "title_similarity": "0.08402318"
        },
        {
            "id": "i18wugi",
            "score": 1,
            "text": "Jesus christ I guess even Stalin couldn't get them in space. God hopes Putin is gone before they have to come down.",
            "title_similarity": "0.3808577"
        },
        {
            "id": "i18ww1r",
            "score": 1,
            "text": "Oh shit",
            "title_similarity": "-0.028269473"
        },
        {
            "id": "i18wwuz",
            "score": 1,
            "text": "Am I the only one who is concerned how they got these flight suits? Don't get me wrong this is a hilarious gesture! \nI just can't believe they smuggled them on board and let them produce secretly without noitce .... As I know these suits are pretty expensive ... \nJust my two cents.",
            "title_similarity": "0.21818486"
        },
        {
            "id": "i18wy0q",
            "score": 1,
            "text": "The war is so unpopular that even the obvious propaganda is kinda believable.",
            "title_similarity": "0.055224396"
        },
        {
            "id": "i18x9kf",
            "score": 1,
            "text": "putin is 69. this could be the way to give him an aneurysm.",
            "title_similarity": "0.33252597"
        },
        {
            "id": "i18xbbz",
            "score": 1,
            "text": "Id be terrified to be related to those astronauts back home. Those russians will be PISSED.",
            "title_similarity": "0.29759386"
        },
        {
            "id": "i18xfxc",
            "score": 1,
            "text": "Oh cool! Oleg stands with Ukraine! He has a Youtube channel where he posts videos of him working aboard the ISS. Friendly dude! Friends with many of the Astronauts and Cosmonauts that are on board the ISS.",
            "title_similarity": "0.59242785"
        },
        {
            "id": "i18xthr",
            "score": 1,
            "text": "an elaborate way to commit suicide to be sure, either they know something and aren't worried, or they aren't coming down with russia's help.",
            "title_similarity": "0.17077944"
        },
        {
            "id": "i18xwi5",
            "score": 1,
            "text": "I mean what is Russia going to do about it? Make em come back down?",
            "title_similarity": "0.28949142"
        },
        {
            "id": "i18y1hw",
            "score": 1,
            "text": "At first glance, I thought they were all doing the Gangnam Style dance 😂",
            "title_similarity": "0.23955032"
        },
        {
            "id": "i18ycb5",
            "score": 1,
            "text": "That seems like a good way to get left out there",
            "title_similarity": "-0.018816281"
        },
        {
            "id": "i18ypik",
            "score": 1,
            "text": "It looks like they’re up there doing Gangnam style",
            "title_similarity": "0.19666503"
        },
        {
            "id": "i18yr0p",
            "score": 1,
            "text": "They'll be floating in a most peculiar way outside of their tin can one day soon.",
            "title_similarity": "0.21813342"
        },
        {
            "id": "i18yz83",
            "score": 1,
            "text": "True Russians!\n\nCongratulations.",
            "title_similarity": "0.29915464"
        },
        {
            "id": "i18z3er",
            "score": 2,
            "text": "Well they are some beautiful Russians, that’s the attitude guys and with luck that attitude is contagious.",
            "title_similarity": "0.20450972"
        },
        {
            "id": "i18zcuo",
            "score": 1,
            "text": "Wow.",
            "title_similarity": "-0.028912703"
        },
        {
            "id": "i1901q1",
            "score": 1,
            "text": "ancient colours of the kievan russia",
            "title_similarity": "0.37791118"
        },
        {
            "id": "i19070s",
            "score": 1,
            "text": "RIP to their families.",
            "title_similarity": "0.0830336"
        },
        {
            "id": "i190ajl",
            "score": 1,
            "text": "Okay  this is some \"For All Mankind\"- level thing.",
            "title_similarity": "0.18843096"
        },
        {
            "id": "i190g2l",
            "score": 2,
            "text": "Wow. Insignificant in the grand scheme of things. But damn what an act of defiance! And not insignificant for them as it could get them all imprisoned!",
            "title_similarity": "0.08733525"
        },
        {
            "id": "i190y6i",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0005105231"
        },
        {
            "id": "i1916xw",
            "score": 1,
            "text": "How screwed are they now on a scale of 1-10?",
            "title_similarity": "0.17541046"
        },
        {
            "id": "i191r5o",
            "score": 2,
            "text": "It’s like they WANT to be left up there.",
            "title_similarity": "0.037471935"
        },
        {
            "id": "i191tof",
            "score": 1,
            "text": "1",
            "title_similarity": "0.042447545"
        },
        {
            "id": "i193dge",
            "score": 1,
            "text": "did they knit it in space?",
            "title_similarity": "0.4903549"
        },
        {
            "id": "i19407r",
            "score": 2,
            "text": "Absolutely stellar move <3",
            "title_similarity": "0.029037833"
        },
        {
            "id": "i1942mw",
            "score": 2,
            "text": "Well, blue and yellow are also the colours of the Kazakh flag. 🇰🇿",
            "title_similarity": "0.5457922"
        },
        {
            "id": "i1944yv",
            "score": 2,
            "text": "That takes more courage than the rocket trip itself.",
            "title_similarity": "0.15191457"
        },
        {
            "id": "i194t64",
            "score": 2,
            "text": "When there is no gravity you say and do as you please as you no longer have to fear windows.",
            "title_similarity": "0.10089135"
        },
        {
            "id": "i196y4b",
            "score": 1,
            "text": "[Called it!](https://www.reddit.com/r/worldnews/comments/t35aj1/mit_severs_ties_with_russian_school_after_ukraine/hyquoko/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)",
            "title_similarity": "0.36429146"
        },
        {
            "id": "i197cub",
            "score": 2,
            "text": "Massive props to them for this. That’s awesome!!!",
            "title_similarity": "0.061892938"
        },
        {
            "id": "i19896i",
            "score": 1,
            "text": "If they have any concerns about going home, I'm sure that there's countries aplenty that'd welcome them to a new one. That's an awesome trio right there.",
            "title_similarity": "0.1518026"
        },
        {
            "id": "i199kit",
            "score": 1,
            "text": " Disguise",
            "title_similarity": "-0.05321235"
        },
        {
            "id": "i199r1z",
            "score": 1,
            "text": "Awww so no space war then?",
            "title_similarity": "0.34573677"
        },
        {
            "id": "i19a20b",
            "score": 2,
            "text": "I like how chill the worlds scientists are, never taking a side and just trying to work together.",
            "title_similarity": "0.13189769"
        },
        {
            "id": "i19a7tl",
            "score": 2,
            "text": "They are in a fighting mood.",
            "title_similarity": "0.059803702"
        },
        {
            "id": "i19adfn",
            "score": 2,
            "text": "Guys can I have a lift down in your Dragon capsule, I do not think I am welcomen back to Russia.",
            "title_similarity": "0.5732704"
        },
        {
            "id": "i19afxy",
            "score": 10,
            "text": "🤣 first the ghost of Kiev now this",
            "title_similarity": "0.19413334"
        },
        {
            "id": "i19akz1",
            "score": 5,
            "text": "Science has no homeland, who said that? \n-------",
            "title_similarity": "0.2161828"
        },
        {
            "id": "i19awr8",
            "score": 3,
            "text": "Went up as russian cosmonauts, will go down as american cosmonauts if they wanna live on earth again.",
            "title_similarity": "0.59531295"
        },
        {
            "id": "i19bf3r",
            "score": 2,
            "text": "That’s going to piss Putin off big time.",
            "title_similarity": "0.08533033"
        },
        {
            "id": "i19bn7j",
            "score": 1,
            "text": "We will be landing in America.\nSomething to do with instruments.",
            "title_similarity": "0.3567425"
        },
        {
            "id": "i19bo61",
            "score": 1,
            "text": "\"Hey, US, we don't need ammunition, we need a ride.\"",
            "title_similarity": "0.11863094"
        },
        {
            "id": "i19bpe8",
            "score": 1,
            "text": "Upon arrival, immediately made it clear that they would need a lift back down to a different country.",
            "title_similarity": "0.32268167"
        },
        {
            "id": "i19brvb",
            "score": 2,
            "text": "I can’t be the only one who first thought the astronaut in the middle was doing the gangnam style dance",
            "title_similarity": "0.47225562"
        },
        {
            "id": "i19btru",
            "score": 3,
            "text": "I think they'll be computing their own re-entry trajectory after the mission...",
            "title_similarity": "0.3251288"
        },
        {
            "id": "i19byod",
            "score": 3,
            "text": "Can’t fall out of a window if there is no gravity!",
            "title_similarity": "0.27353626"
        },
        {
            "id": "i19c02z",
            "score": 1,
            "text": "didnt they say that the cosmonauts there were going to abandon the one american?",
            "title_similarity": "0.42175967"
        },
        {
            "id": "i19ccim",
            "score": 1,
            "text": "Nice username",
            "title_similarity": "-0.006319236"
        },
        {
            "id": "i19cgyt",
            "score": 2,
            "text": "Sick power move",
            "title_similarity": "0.017102037"
        },
        {
            "id": "i19chge",
            "score": 1,
            "text": "Looks like the taking a taxi flying back and forth that often…",
            "title_similarity": "0.19535887"
        },
        {
            "id": "i19cm06",
            "score": 1,
            "text": "It’s going to be interesting how they explain they fell out of windows in space",
            "title_similarity": "0.47365344"
        },
        {
            "id": "i19ctk1",
            "score": 1,
            "text": "Huh. They look like they're ready to break into gangnam style",
            "title_similarity": "0.13479891"
        },
        {
            "id": "i19d64j",
            "score": 1,
            "text": "Oh look, scientists condemned needless violence!  ❤️",
            "title_similarity": "0.17372297"
        },
        {
            "id": "i19dp80",
            "score": 1,
            "text": "Hopefully the states offers these people sanctuary. They could be great additions to American space programs.",
            "title_similarity": "0.40698618"
        },
        {
            "id": "i19dprt",
            "score": 2,
            "text": "Hopefully the states offers these people sanctuary. They could be great additions to American space programs.",
            "title_similarity": "0.40698618"
        },
        {
            "id": "i19dq1m",
            "score": 1,
            "text": "luckily iss doens't have balconies",
            "title_similarity": "0.16956216"
        },
        {
            "id": "i19ds27",
            "score": 1,
            "text": "Well, Putin picked up the one American. Whether or not he'll pick up these three Russians when it's time for them to come home is a lot more iffy...",
            "title_similarity": "0.34287965"
        },
        {
            "id": "i19e5wg",
            "score": 1,
            "text": "Knock knock\n\nWho’s there?\n\nThe KGB.",
            "title_similarity": "0.2848044"
        },
        {
            "id": "i19ecqi",
            "score": 2,
            "text": "They know Russia won't be able to afford to come get them home and they'll need to hitch a ride. Look at the photos, they're even carrying their own gas cans.",
            "title_similarity": "0.26380324"
        },
        {
            "id": "i19ee4c",
            "score": 5,
            "text": "The best Russia has to offer to humanity is telling Putin to fuck off very publicly.\n\nThat is huge. \n\nThey definitely deserve a ride home on a good ol American broomstick.",
            "title_similarity": "0.2876888"
        },
        {
            "id": "i19eeo7",
            "score": 3,
            "text": "Putin can’t do shit to them up there",
            "title_similarity": "0.19176966"
        },
        {
            "id": "i19eg5p",
            "score": 1,
            "text": "So who’s gunna be the one to tell him ? I would not want to be that person.",
            "title_similarity": "0.07537124"
        },
        {
            "id": "i19ei32",
            "score": 1,
            "text": "Oleg Artimiev, one of those cosmonauts, seems awesome. \n\nHe has a [Youtube Channel](https://youtube.com/c/OlegMKS) where he posts random things going on up there on the ISS, kind of like an off the cuff Russian Chris Hadfield. I think there's a video of a Zero-G ping pong game in there somewhere.",
            "title_similarity": "0.4903144"
        },
        {
            "id": "i19f387",
            "score": 1,
            "text": "Well done boy’s",
            "title_similarity": "0.03065601"
        },
        {
            "id": "i19f3bf",
            "score": 1,
            "text": "I Love Earth.",
            "title_similarity": "0.05305056"
        },
        {
            "id": "i19fhm2",
            "score": 2,
            "text": "So they left Russia and supported other regimes, they’re gonna be getting cleansed.",
            "title_similarity": "0.25620896"
        },
        {
            "id": "i19g713",
            "score": 2,
            "text": "Those are some serious Space Balls",
            "title_similarity": "0.33953083"
        },
        {
            "id": "i19gedj",
            "score": 2,
            "text": "You guys ROCK!!!!!!",
            "title_similarity": "0.116462156"
        },
        {
            "id": "i19gmnw",
            "score": 2,
            "text": "So for common sense and to escape the TV propaganda, you only gotta go to space.  \nGood move guys!",
            "title_similarity": "0.4499435"
        },
        {
            "id": "i19gtd3",
            "score": 3,
            "text": "Russian News: “Due to... Hmm… Cosmic rays or something, the images from space make their snow white suits appear yellow”",
            "title_similarity": "0.67049277"
        },
        {
            "id": "i19gy5m",
            "score": 2,
            "text": "Ladies and gentlemen were looking at the first Russian cosmonauts to live permanently on the Iss",
            "title_similarity": "0.7629261"
        },
        {
            "id": "i19h43r",
            "score": 1,
            "text": "Its not the first act of defiance against their bullshit government. The cosmonauts are decent.",
            "title_similarity": "0.34071994"
        },
        {
            "id": "i19h6m3",
            "score": 1,
            "text": "How did they get that into their flight! I'm pretty sure some higher ups at Roscosmos wouldn't like that!",
            "title_similarity": "0.34640843"
        },
        {
            "id": "i19h711",
            "score": 1,
            "text": "Someone is either very naive and will end up having an accident or they know something we don't and are not worried about the world they will be returning to.",
            "title_similarity": "0.10822155"
        },
        {
            "id": "i19h7in",
            "score": 4,
            "text": "They then tragically fell out a window in space.",
            "title_similarity": "0.45428056"
        },
        {
            "id": "i19h9xe",
            "score": 1,
            "text": "Genuine question: what is the significance of this?",
            "title_similarity": "0.040928125"
        },
        {
            "id": "i19ha8k",
            "score": 1,
            "text": "Highly doubtly that yellow-blue suits are about Ukraine. \n\nAll 3 cosmonauts are graduates of BMSTU university in Moscow. The official colors of that university are yellow and blue, just look at its emblem\n\nhttps://ru.wikipedia.org/wiki/Московский\\_государственный\\_технический\\_университет\\_имени\\_Н.\\_Э.\\_Баумана#/media/Файл:Герб\\_МГТУ\\_имени\\_Н.\\_Э.\\_Баумана.svg",
            "title_similarity": "0.68672484"
        },
        {
            "id": "i19hcea",
            "score": 5,
            "text": "Pretty sure Russian Cosmonauts are used to their country collapsing mid-mission.\n\nThey probably figured there'd be no government to worry about by the time they get back.",
            "title_similarity": "0.3664713"
        },
        {
            "id": "i19hiws",
            "score": 1,
            "text": "Indeed, these are all made to measure",
            "title_similarity": "0.12157759"
        },
        {
            "id": "i19hoh0",
            "score": 2,
            "text": "Even Russians are against russia.",
            "title_similarity": "0.2555995"
        },
        {
            "id": "i19i6wy",
            "score": 1,
            "text": "That's especially noticeable since the head of the Russian space agency said this 3 days ago.\nhttps://futurism.com/the-byte/rogozin-iss-fighting-mood",
            "title_similarity": "0.5803989"
        },
        {
            "id": "i19iedo",
            "score": 2,
            "text": "I bet coming back on earth will be risky now, better take a spacex flight back",
            "title_similarity": "0.4455946"
        },
        {
            "id": "i19ieyc",
            "score": 1,
            "text": "And everyone liked that",
            "title_similarity": "-0.0340268"
        },
        {
            "id": "i19ilg1",
            "score": 1,
            "text": "They will have nice view if nuclear war breaks out.",
            "title_similarity": "0.287862"
        },
        {
            "id": "i19ilwk",
            "score": 1,
            "text": "Special clothing operation",
            "title_similarity": "0.14046103"
        },
        {
            "id": "i19imzb",
            "score": 1,
            "text": "Haha, I love it",
            "title_similarity": "-0.019639645"
        },
        {
            "id": "i19ir3u",
            "score": 5,
            "text": "“Can ya’ll drop us off in America when it’s time to go.. big man back home won’t be too happy with us”",
            "title_similarity": "0.16791236"
        },
        {
            "id": "i19iz05",
            "score": 2,
            "text": "Yeah fucking tell us how they’re gonna abandon their colleague in space again. \n\nThis has probably been said more than a billion times today, but fuck Putin. The most fucked man since Stalin or Hitler (as in fuck them). \n\nAll 3 of these cosmos need a medal from the UN. Massive respect for standing up while the government can fuck you over at a whim. \n\n#ihopeputingetsrapedbyagiantscorpion\n\nLet’s get this trending",
            "title_similarity": "0.40127623"
        },
        {
            "id": "i19j7ul",
            "score": 1,
            "text": "Looks like we see these folks for the last time. 🙁",
            "title_similarity": "0.083802916"
        },
        {
            "id": "i19j7wg",
            "score": 2,
            "text": "Either exactly the brilliant sentiments everyone is pushing, or extreme trolling under cover of everyone's good will.",
            "title_similarity": "0.11510816"
        },
        {
            "id": "i19ji7b",
            "score": 3,
            "text": "THIS is why we need an ISS - about ti get scuttled in favour of private space corps :(",
            "title_similarity": "0.50348186"
        },
        {
            "id": "i19jnam",
            "score": 2,
            "text": "Huge balls",
            "title_similarity": "-0.030759001"
        },
        {
            "id": "i19k8yb",
            "score": 3,
            "text": "Brilliant. Well done Russia. Out of this world display of fuck you putin.",
            "title_similarity": "0.2947324"
        },
        {
            "id": "i19kpxy",
            "score": 2,
            "text": "*Putin chokes on his tea*",
            "title_similarity": "0.23651688"
        },
        {
            "id": "i19kqju",
            "score": 1,
            "text": "Slava Ukraini!",
            "title_similarity": "0.1406821"
        },
        {
            "id": "i19l50s",
            "score": 1,
            "text": "Something tells me the oxygen module may suffer some kind of malfunction....",
            "title_similarity": "0.24694633"
        },
        {
            "id": "i19l58s",
            "score": 2,
            "text": "Do we have a confirmation that this was on purpose and not something they would get to wear anyways?",
            "title_similarity": "0.101012185"
        },
        {
            "id": "i19l7vw",
            "score": 1,
            "text": "Quick, close all the windows on the ISS",
            "title_similarity": "0.5004653"
        },
        {
            "id": "i19l837",
            "score": 2,
            "text": "Heroes",
            "title_similarity": "0.0009225346"
        },
        {
            "id": "i19l8hy",
            "score": 1,
            "text": "If anyone is gonna realise the futileness of war it’s the guys who can see the Earth hanging like a fucking bauble in an infinite black void",
            "title_similarity": "0.20108706"
        },
        {
            "id": "i19m2lt",
            "score": 3,
            "text": "They had to get these suits because the old ones were not big enough for their balls",
            "title_similarity": "0.16166931"
        },
        {
            "id": "i19m76q",
            "score": 2,
            "text": "Russian Cosmonauts Arrive at International Space Station\n\nThis is an amazing photograph released yesterday. The three Russain cosmonauts are taking a massive risk but in doing so show that there are Russians who do know what is happening, can think for themselves, and are brave enough to shown this in such a manner.\n\nCan you imagine Putin having his morning brief today, expecting to hear the glorious news of his cosmonauts arriving in the ISS? He’d have been itching to show how this is a prime example of Russia showing the way, at the pinnacle of world events and using it to bring Russians together agaisnt Ukraine. Instead he sees his elite cosmonauts dressed in suits in Ukrainian national colours. I hope they’d start growing sunflowers up there next.\n\nPutin’s blood pressure must have literally rocketed!! Time for a heart attack - so many hope and pray… preferably induced by polonium and novichok!",
            "title_similarity": "0.5827474"
        },
        {
            "id": "i19mean",
            "score": 2,
            "text": "whelp, at least when they come down to Earth maybe this zhit will be moot cuz the PuStain could be neutralized...but I dont think Russia is where they should land. Can they defect while on the ISS?",
            "title_similarity": "0.514897"
        },
        {
            "id": "i19mm1e",
            "score": 2,
            "text": "How did they get these suits…..???",
            "title_similarity": "0.25991583"
        },
        {
            "id": "i19nbte",
            "score": 1,
            "text": "This gives me hope",
            "title_similarity": "0.001019707"
        },
        {
            "id": "i19nly4",
            "score": 2,
            "text": "Uh… you can apply for asylum from the ISS, right?",
            "title_similarity": "0.5925913"
        },
        {
            "id": "i19no8u",
            "score": 2,
            "text": "People don’t see this sh!t is a circus? How did we become this gullible, sad af.",
            "title_similarity": "0.07699883"
        },
        {
            "id": "i19ohre",
            "score": 2,
            "text": "So, are they willing to kill Putin? I’ll do it for $100,000,000. If I do t survive, my wife keeps 50%. Any takers? CIA; anyone?",
            "title_similarity": "0.2875507"
        },
        {
            "id": "i19oog4",
            "score": 1,
            "text": "Outstanding.. - This is the way..!",
            "title_similarity": "0.037978277"
        },
        {
            "id": "i19otgl",
            "score": 4,
            "text": "Kgb agent floats up and taps on the window to open coms. \"Nowhere is safe.\"",
            "title_similarity": "0.48654678"
        },
        {
            "id": "i19p3fg",
            "score": 1,
            "text": "“Come get, bitch”",
            "title_similarity": "-0.0069990642"
        },
        {
            "id": "i19pt88",
            "score": 1,
            "text": "Musk is going to have to pick them up.",
            "title_similarity": "0.09852332"
        },
        {
            "id": "i19q6ps",
            "score": 5,
            "text": "\"Cosmonauts accidentally get sucked out the airlock when Space Station hacked by Ukranian Nazis\" -- Russian State Media",
            "title_similarity": "0.5095794"
        },
        {
            "id": "i19quxa",
            "score": 1,
            "text": "Yellow Amongus",
            "title_similarity": "0.101502985"
        },
        {
            "id": "i19rclq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0005105231"
        },
        {
            "id": "i19s0p8",
            "score": 1,
            "text": "It's because they are of BOKITAAAAA DAAAAALEEE BOOOOOOOOOOOOO DAALE DAAAAAALEEEE  BOOOOOOOOOOOOOOOOOOOO",
            "title_similarity": "0.056282878"
        },
        {
            "id": "i19shz7",
            "score": 1,
            "text": "Well now they are merican astronauts. Or the iss will crash into the atmosphere any day now.",
            "title_similarity": "0.5903495"
        },
        {
            "id": "i19u416",
            "score": 1,
            "text": "I love Mother Russia and Russians but at this time too much children and women blood shed  both sides say untruths but pictures from sky must be truth murder by a state is no for love of country",
            "title_similarity": "0.18988332"
        },
        {
            "id": "i19u5js",
            "score": 2,
            "text": "It's a trap",
            "title_similarity": "0.032419734"
        },
        {
            "id": "i19ubz5",
            "score": 2,
            "text": "Guess who‘s staying on the ISS indefinetly",
            "title_similarity": "0.3105719"
        },
        {
            "id": "i19uefa",
            "score": 2,
            "text": "Because Putin's bullshish is so massive, it's visible from space.",
            "title_similarity": "0.54090226"
        },
        {
            "id": "i19v8wa",
            "score": 5,
            "text": "And the among us live action experiment begins.",
            "title_similarity": "0.22481872"
        },
        {
            "id": "i19veao",
            "score": 2,
            "text": "I can only imagine how Russia will spin this news",
            "title_similarity": "0.35686257"
        },
        {
            "id": "i19vnqx",
            "score": 2,
            "text": "Cosmonauts were always made from a different cloth",
            "title_similarity": "0.391124"
        },
        {
            "id": "i19vnrg",
            "score": 1,
            "text": "Boca juniors fans, intolerable.",
            "title_similarity": "0.0678368"
        },
        {
            "id": "i19w97s",
            "score": 3,
            "text": "Oh great, Putin is gonna have the ISS shot down",
            "title_similarity": "0.47359693"
        },
        {
            "id": "i19wuwx",
            "score": 2,
            "text": "How did they get the suits sent up there? Who made them?",
            "title_similarity": "0.35232317"
        },
        {
            "id": "i19xucy",
            "score": 3,
            "text": "I wasn't surprised to see Oleg Artemyev named as one of the cosmonauts. I've been following him on YouTube for a couple of years and he seems like a good man with lots of love in his heart.",
            "title_similarity": "0.31808287"
        },
        {
            "id": "i19ytyh",
            "score": 1,
            "text": "Love it",
            "title_similarity": "-0.04622449"
        },
        {
            "id": "i19zit1",
            "score": 2,
            "text": "Welp, hopefully they are welcomed home...",
            "title_similarity": "-0.008684095"
        },
        {
            "id": "i19zy3s",
            "score": 3,
            "text": "That’s some fucking balls. I can honestly say the Russian people taking action have really impressed me considering the monumental risk it puts their very lives at because of Putins apparatus.",
            "title_similarity": "0.22118706"
        },
        {
            "id": "i1a038g",
            "score": 1,
            "text": "in space, colors may appear different, and no one can hear you scream.",
            "title_similarity": "0.33417302"
        },
        {
            "id": "i1a0n5a",
            "score": 3,
            "text": "I’m pretty sure they didn’t leave in those suits lol.",
            "title_similarity": "0.2140875"
        },
        {
            "id": "i1a0pnf",
            "score": 2,
            "text": "“ ok were far enough now” lol",
            "title_similarity": "0.01707081"
        },
        {
            "id": "i1a160i",
            "score": 1,
            "text": "That rocket ain't comin back.",
            "title_similarity": "0.23086292"
        },
        {
            "id": "i1a1p0f",
            "score": 1,
            "text": "But what happens when they arrive in the ocean?",
            "title_similarity": "0.22596394"
        },
        {
            "id": "i1a2jj6",
            "score": 1,
            "text": "Hmmm, I guess they figure you can’t get “suicided” in space",
            "title_similarity": "0.40416574"
        },
        {
            "id": "i1a2mkl",
            "score": 2,
            "text": "Slava Ukraini",
            "title_similarity": "0.09934704"
        },
        {
            "id": "i1a2slp",
            "score": 1,
            "text": "Russian Spacecraft disappears like Malaysia Airlines flight 370…….",
            "title_similarity": "0.5396749"
        },
        {
            "id": "i1a360y",
            "score": 1,
            "text": "Tribute or taunt?",
            "title_similarity": "-0.0021801032"
        },
        {
            "id": "i1a3vvn",
            "score": 2,
            "text": "Looks like the iSS is about to have 3 permanent residents...",
            "title_similarity": "0.49610233"
        },
        {
            "id": "i1a4noy",
            "score": 1,
            "text": "I love how this can be spun both ways. It could fall under the \"we arent associated with the Kremlin's war machine\" Or \"This is how the Russians sneak onto the ISS\" narrative. Depends how cyncical or optimistic you are.",
            "title_similarity": "0.43722782"
        },
        {
            "id": "i1a4x4x",
            "score": 1,
            "text": "Hero",
            "title_similarity": "0.002270002"
        },
        {
            "id": "i1a55qx",
            "score": 1,
            "text": "Putin: now you get down from there at once and go to your room! I said get down!",
            "title_similarity": "0.2645989"
        },
        {
            "id": "i1a5bom",
            "score": 1,
            "text": "I see someone's gonna speed run their US greencard",
            "title_similarity": "0.13759372"
        },
        {
            "id": "i1a69si",
            "score": 3,
            "text": "I think the bigger thing to look at here is why tf is Russia sending ppl to the iss while threatening a nuclear war if anyone intervenes with their war crimes. The Ukrainian colors are a distraction from that first thing I said, even being a thing rn.",
            "title_similarity": "0.4431701"
        },
        {
            "id": "i1a6n2d",
            "score": 3,
            "text": "Love to see it. Even the citizens of Russia know what's going on and most of them don't like it.",
            "title_similarity": "0.14664948"
        },
        {
            "id": "i1a73ou",
            "score": 2,
            "text": "Sorry my ignorance, but what is it means?",
            "title_similarity": "0.022131493"
        },
        {
            "id": "i1a7ita",
            "score": 2,
            "text": "Hopefully Putin can’t poison them while they are up there",
            "title_similarity": "0.26444694"
        },
        {
            "id": "i1a7rnw",
            "score": 2,
            "text": "It's not blue and yellow, it's black and yellow....\nhttps://www.usatoday.com/story/news/nation-now/2015/02/26/dress-color-black-blue-swiked-tumblr/24094913/",
            "title_similarity": "0.36818448"
        },
        {
            "id": "i1a8uqp",
            "score": 2,
            "text": "Yall realize they don't choose their own outfits right?  Why would putin approve these uniforms? Unless..?",
            "title_similarity": "0.26802278"
        },
        {
            "id": "i1a9anx",
            "score": 2,
            "text": "There had to be a lot of cooperation from the space agency to make this happen.",
            "title_similarity": "0.37464863"
        },
        {
            "id": "i1a9l27",
            "score": 2,
            "text": "Apparently, those are the colors of the university they all went to.",
            "title_similarity": "0.31603345"
        },
        {
            "id": "i1a9or7",
            "score": 1,
            "text": "Putin propaganda",
            "title_similarity": "0.20751092"
        },
        {
            "id": "i1a9tij",
            "score": 1,
            "text": "Condor Flugdienst GmbH flying Russian troops and supplies !",
            "title_similarity": "0.48984572"
        },
        {
            "id": "i1a9tpd",
            "score": 2,
            "text": "Could these suits have been made with the idea that, Ukraine would have fallen by now with the puppet government. And by showing the Ukraine colors, they can claim that, they see Ukraine as part of Russia.",
            "title_similarity": "0.34828606"
        },
        {
            "id": "i1aant3",
            "score": 1,
            "text": "We be putin you in space, but when you get back we be putin you in jail!",
            "title_similarity": "0.5195985"
        },
        {
            "id": "i1ab4at",
            "score": 2,
            "text": "Most cost effective way to get a ride on the dragon",
            "title_similarity": "0.21842775"
        },
        {
            "id": "i1abm8g",
            "score": 1,
            "text": "Putin:  nobody likes u gurl.  Pack it up sis, time to go",
            "title_similarity": "0.15660518"
        },
        {
            "id": "i1adctx",
            "score": 1,
            "text": "Let me just said, coming back from space, these astronauts should plan other destinations than Russia. Putin will be upset with them to put it mildly.",
            "title_similarity": "0.4111404"
        },
        {
            "id": "i1adfyz",
            "score": 1,
            "text": " Ooooooooooooo. Shade! 🇺🇦",
            "title_similarity": "0.08095755"
        },
        {
            "id": "i1aeab4",
            "score": 1,
            "text": "That was actually terrible math, idk why they told y'all a story was but it's considered 10 ft",
            "title_similarity": "0.15619192"
        },
        {
            "id": "i1aelxl",
            "score": 1,
            "text": "The new direction of Russian propaganda:  we are actually ok with you staying Ukrainians, we just saved you from the Nazi and now we want to be your best friends. Don’t be afraid of us, dear Ukrainians. All meanwhile counting how many mord oligarchs and riches can be made off Ukrainians to spend in the west. Oh actually there is not going to be spending $ in the west. Still beware of Russian propaganda. The most dangerous thing in the world. They have the smartest people in Russia thinking all this shit up, strategizing how to best poison peoples brains. Z for zombie state",
            "title_similarity": "0.27620682"
        },
        {
            "id": "i1aev6b",
            "score": 1,
            "text": "Time to  Float the Russians",
            "title_similarity": "0.3423879"
        },
        {
            "id": "i1aexag",
            "score": 1,
            "text": "I can only hope it's in support of opposing this stupid Brazen war",
            "title_similarity": "0.078755185"
        },
        {
            "id": "i1af77u",
            "score": 1,
            "text": "Proof that not every russian person likes putin",
            "title_similarity": "0.209799"
        },
        {
            "id": "i1ag30p",
            "score": 1,
            "text": "Looks like a yellow suit with white, blue and red horizontal striped flags on them to me.",
            "title_similarity": "0.39507812"
        },
        {
            "id": "i1ag3ix",
            "score": 2,
            "text": "I guess they’re all stuck up there now",
            "title_similarity": "0.008140076"
        },
        {
            "id": "i1agkfv",
            "score": 1,
            "text": "Former Russian Cosmonauts Wear Yellow and Blue When Arriving on ISS.*",
            "title_similarity": "0.94684696"
        },
        {
            "id": "i1agp5f",
            "score": 1,
            "text": "Keep reading this as Russian Coconuts.",
            "title_similarity": "0.300865"
        },
        {
            "id": "i1agrss",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.014970249"
        },
        {
            "id": "i1ags0u",
            "score": 1,
            "text": "God bless the Russian people, God damn the Russian government.",
            "title_similarity": "0.29461244"
        },
        {
            "id": "i1agsmv",
            "score": 1,
            "text": "They better be careful. They might get left up there.",
            "title_similarity": "0.07136187"
        },
        {
            "id": "i1ah047",
            "score": 1,
            "text": "I feel kinda bad for them, because whenever they return back to Russia their gonna get their heads cut off, because they are going against Putin, which makes them traitors to the Russia, sad",
            "title_similarity": "0.1635116"
        },
        {
            "id": "i1ah1aq",
            "score": 1,
            "text": "So did the astronauts from the USA return home safely? I remember some talk about Putin saying he would leave the US astronauts stranded on the ISS, or something to that effect… *??*",
            "title_similarity": "0.57405126"
        },
        {
            "id": "i1ahnmn",
            "score": 1,
            "text": "So they were just able to \"sneak\" those on there? 🤔",
            "title_similarity": "0.0789494"
        },
        {
            "id": "i1ain6y",
            "score": 1,
            "text": "Tomorrow's news: Biden offers Cosmonauts support and clearance to land in the US.",
            "title_similarity": "0.59130436"
        },
        {
            "id": "i1aitwa",
            "score": 1,
            "text": "This absolutely filled my heart up to overflowing. 99.9% of people just want peace & contentment so it's time to stand for it NO MATTER WHAT. Enough of what lying politicians and their paid-for propaganda news channels! Do your own research instead of trusting a-holes with an agenda and let's love each other for our differences and learn from them instead of persecuting them. I love you all 💖",
            "title_similarity": "0.18473291"
        },
        {
            "id": "i1aiyxi",
            "score": 1,
            "text": "I'm sure he had to say something of the sort to avoid being arrested when he gets home",
            "title_similarity": "0.14722171"
        },
        {
            "id": "i1aj2xp",
            "score": 1,
            "text": "They're making sure that they are counted for \nWhenever they had arrive",
            "title_similarity": "0.14268191"
        },
        {
            "id": "i1aj3wu",
            "score": 1,
            "text": "Putin can’t get them in space….. yet.",
            "title_similarity": "0.4070608"
        },
        {
            "id": "i1ajh6g",
            "score": 2,
            "text": "I guess they are our cosmonauts now. Russia may refuse to get them back. Glad they are on the side of humanity.",
            "title_similarity": "0.4676847"
        },
        {
            "id": "i1ajnq1",
            "score": 1,
            "text": "They are simply wearing yellow suits with the Russian flag on it.",
            "title_similarity": "0.52482724"
        },
        {
            "id": "i1ajt5w",
            "score": 2,
            "text": "Minions.",
            "title_similarity": "0.024356842"
        },
        {
            "id": "i1akdpr",
            "score": 3,
            "text": "Because they’re scientists, they’re intelligent. An astronaut isn’t the person I’d see just blindly following political propaganda without questioning it.",
            "title_similarity": "0.34601474"
        },
        {
            "id": "i1akjes",
            "score": 3,
            "text": "Turns out people who spend all their lifes persuing science dont have a thing for International Conflict",
            "title_similarity": "0.2237244"
        },
        {
            "id": "i1alpvm",
            "score": 2,
            "text": "This speaks volume!!",
            "title_similarity": "0.008485632"
        },
        {
            "id": "i1ap1ox",
            "score": 1,
            "text": "Damn sucks to hear about their deaths",
            "title_similarity": "0.022302974"
        },
        {
            "id": "i1ap3h9",
            "score": 2,
            "text": "The reason they are wearing those colors is because they are the Bauman Moscow State Technical University school colors. Not sure if everyone is aware of this or not.",
            "title_similarity": "0.35734504"
        },
        {
            "id": "i1apz25",
            "score": 1,
            "text": "Family’s cannot be reached for comment",
            "title_similarity": "0.11400846"
        },
        {
            "id": "i1aq5c0",
            "score": 1,
            "text": "Much respect to those guys. Makes me almost proud to be a human",
            "title_similarity": "0.031620204"
        },
        {
            "id": "i1ar0kj",
            "score": 2,
            "text": "They better say that their president is a murderer and a psychopath",
            "title_similarity": "0.08424614"
        },
        {
            "id": "i1aretb",
            "score": 1,
            "text": "Has anyone checked on their families?",
            "title_similarity": "0.091362625"
        },
        {
            "id": "i1arkgi",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.0005105231"
        },
        {
            "id": "i1as03j",
            "score": 1,
            "text": "I hope these guys don’t wind up in a brig when they get back",
            "title_similarity": "0.19491312"
        },
        {
            "id": "i1auq90",
            "score": 1,
            "text": "And will be promptly imprisoned or shot when they return home. Putin could save face with his war. By Freeing all Russian people & make Russia a Free world Super Power, like Most of the world.",
            "title_similarity": "0.3533645"
        },
        {
            "id": "i1ax0bp",
            "score": 1,
            "text": "No doubt Putin will say, they have all been brainwashed by western nazi space air or something dog shit crazy like that",
            "title_similarity": "0.2698842"
        },
        {
            "id": "i1axk68",
            "score": 2,
            "text": "In other words, fuck you Putin. - Cosmonauts",
            "title_similarity": "0.42732882"
        },
        {
            "id": "i1axpt8",
            "score": 2,
            "text": "Regardless of whether this was an intentional stunt, astronauts have reported a cognitive shift when seeing the earth from outer space - coined the \"overview effect.\"  It makes sense how seeing Earth from the cosmos would put into perspective how precious this planet is... and how futile humanity's quarrels are.",
            "title_similarity": "0.5144908"
        },
        {
            "id": "i1aytq4",
            "score": 1,
            "text": "I thought they were just going to have brought something to tie around their arm or some tape or something, not bring a whole yellow suit. That means that a large part of Roscosmos must be anti-war.",
            "title_similarity": "0.20393398"
        },
        {
            "id": "i1azdpn",
            "score": 3,
            "text": "Turns out it's [just a coincidence](https://twitter.com/NeoPagliacci/status/1505193742524989452). They've worn that color before.\n\n&#x200B;\n\nEdit: although, I suppose it could still be intentional",
            "title_similarity": "0.14260566"
        },
        {
            "id": "i1b07na",
            "score": 1,
            "text": "You insinuated that they wore this because they were smart and independent. Please stop trying to cover your intentions. It’s very dangerous",
            "title_similarity": "0.09183291"
        },
        {
            "id": "i1b0ciw",
            "score": 1,
            "text": "Insulting",
            "title_similarity": "-0.076583385"
        },
        {
            "id": "i1b0i1n",
            "score": 1,
            "text": "❤️",
            "title_similarity": "0.0032669865"
        },
        {
            "id": "i1b0oyz",
            "score": 1,
            "text": "Easy to see once ejected into space I suppose",
            "title_similarity": "0.33015746"
        },
        {
            "id": "i1b1ixx",
            "score": 1,
            "text": "Is it just to troll? Or show they wont crash the iss",
            "title_similarity": "0.3527555"
        },
        {
            "id": "i1b1xnq",
            "score": 1,
            "text": "ukraine can into space",
            "title_similarity": "0.57403904"
        },
        {
            "id": "i1b23tz",
            "score": 1,
            "text": "Lol, how big you think their wardrobe choices are.",
            "title_similarity": "0.12443843"
        },
        {
            "id": "i1b2j5e",
            "score": 1,
            "text": "USA and Europe should help us stop this war right now. By the united actions of the adequate people from civilized countries, we can protect the world together. Speak up to your politicians, call for actions, not just words of support! Help us close the sky over Ukrainian cities and civilians.",
            "title_similarity": "0.29892296"
        },
        {
            "id": "i1b2qye",
            "score": 2,
            "text": "They might be staying up there a lot longer than expected",
            "title_similarity": "0.08033385"
        },
        {
            "id": "i1b2zvy",
            "score": 1,
            "text": "I wonder if Putin will jail them?",
            "title_similarity": "0.21139061"
        },
        {
            "id": "i1b5t4a",
            "score": 2,
            "text": "But Russian government can just go ahead and take the lives from Ukraine with zero respect for their livelihood.",
            "title_similarity": "0.31897885"
        },
        {
            "id": "i1b62aq",
            "score": 1,
            "text": "You have the power to help stop this war if you act right now. By the united actions of the adequate people from civilized countries, we can protect the world together. Speak up to your politicians, call for actions, not just words of support!",
            "title_similarity": "0.21352488"
        },
        {
            "id": "i1b63ze",
            "score": 1,
            "text": "Wink wink, nudge nudge, knowwutImeaneh?",
            "title_similarity": "0.091196254"
        },
        {
            "id": "i1b64lo",
            "score": 2,
            "text": "That’s one way to Emigrate",
            "title_similarity": "0.11178071"
        },
        {
            "id": "i1b7x52",
            "score": 2,
            "text": "What type of retribution will they face? Ballsy move, and I love it",
            "title_similarity": "0.048591048"
        },
        {
            "id": "i1bhpto",
            "score": 1,
            "text": "WE PEOPLE OF EARTH WANT PEACE!!! ☮️ I AINT NO HIPSTER WE JUST NEED TO GET ALONG!!! WAR FAMINE PLAGUE ONLY CURSES FUTURE GENERATIONS!",
            "title_similarity": "0.19162944"
        },
        {
            "id": "i1bjndc",
            "score": 1,
            "text": "S\nZ Z1an. Ws",
            "title_similarity": "0.13900267"
        },
        {
            "id": "i1bk5qq",
            "score": 1,
            "text": "They couldn't openly condemn russia for it's actions but they did what they could.",
            "title_similarity": "0.17356785"
        },
        {
            "id": "i1bkr7k",
            "score": 1,
            "text": "THIS IS AWESOME!! ...but they better fuck'n stay up there or defect",
            "title_similarity": "0.17412841"
        },
        {
            "id": "i1blc4a",
            "score": 1,
            "text": "Russian Gov: Ok comrades, time to come back.\nCosmonauts: we’re good on that",
            "title_similarity": "0.5574133"
        },
        {
            "id": "i1blgd5",
            "score": 1,
            "text": "I would do the same if I were as far away as possible from putin",
            "title_similarity": "0.18474193"
        },
        {
            "id": "i1brxj6",
            "score": 1,
            "text": "It's scary to think that re-entry through the atmosphere may be the safest part of returning to Earth for them because they decided to show support for 🇺🇦.",
            "title_similarity": "0.3385849"
        },
        {
            "id": "i1bsi8q",
            "score": 1,
            "text": "Say what you like about Russia, but how many other countries would the astronauts be able to get a local seamstress to knock up a set of custom space suits at short notice.\n\nOr perhaps those spacesuit were made months ago and the colors are pure coincidence...",
            "title_similarity": "0.5304357"
        },
        {
            "id": "i1bu5yt",
            "score": 1,
            "text": "This is the same colors they have been wearing for like 8years",
            "title_similarity": "0.20240179"
        },
        {
            "id": "i1c20b3",
            "score": 1,
            "text": "Good luck suiciding them when they're in space Putin!",
            "title_similarity": "0.55742055"
        },
        {
            "id": "i1c5416",
            "score": 1,
            "text": "Hey",
            "title_similarity": "0.0038384385"
        },
        {
            "id": "i1c54lg",
            "score": 1,
            "text": "3333",
            "title_similarity": "0.084872484"
        },
        {
            "id": "i1cefxs",
            "score": 1,
            "text": "This makes me so happy. Just like when we are at sea we don’t leave people  behind, no matter the politics. \n\nPlease don’t leave our man behind in space! Thank you cosmonauts for taking care of fellow humans first and foremost!!!",
            "title_similarity": "0.4026539"
        },
        {
            "id": "i1cijgh",
            "score": 1,
            "text": "Bandera's shortcomings and their Anglo-Saxon sponsors no longer know what to come up with in their information war against Russia",
            "title_similarity": "0.1990609"
        },
        {
            "id": "i1cn486",
            "score": 1,
            "text": "They've had these suits since 2014: https://www.instagram.com/p/qFkwz9QKPT/",
            "title_similarity": "0.24533445"
        },
        {
            "id": "i1crhaf",
            "score": 1,
            "text": "Nice show of support for Ukraine.",
            "title_similarity": "0.16213876"
        },
        {
            "id": "i1ctmzo",
            "score": 1,
            "text": "They're going straight to the gulag",
            "title_similarity": "0.35455084"
        },
        {
            "id": "i1cwddb",
            "score": 1,
            "text": "putin : zhopa!",
            "title_similarity": "0.24782313"
        },
        {
            "id": "i1d2wut",
            "score": 1,
            "text": "They've worn these suits before....",
            "title_similarity": "0.2556887"
        },
        {
            "id": "i1d4m7f",
            "score": 1,
            "text": "They always wear that",
            "title_similarity": "0.07172413"
        },
        {
            "id": "i1d8skx",
            "score": 1,
            "text": "They’ve worn these since 2015.. The blue is of the Russian Flag.. Are y’all really this gullible and have political opinions ?",
            "title_similarity": "0.4244522"
        },
        {
            "id": "i1dow13",
            "score": 1,
            "text": "There is a lot of Emily’s in this thread, what a hoot",
            "title_similarity": "0.01819353"
        },
        {
            "id": "i1dv8m9",
            "score": 1,
            "text": "Ez pzy for russia to photoshop it haha",
            "title_similarity": "0.39120418"
        },
        {
            "id": "i1e8ctl",
            "score": 1,
            "text": "#killputin",
            "title_similarity": "0.102991685"
        },
        {
            "id": "i1ecyz2",
            "score": 1,
            "text": "A little curious... what do their uniforms usually look like",
            "title_similarity": "0.12838411"
        },
        {
            "id": "i1fhga1",
            "score": 1,
            "text": "That's... Gonna be a hard window for them to \"fall out of\"",
            "title_similarity": "0.09028309"
        },
        {
            "id": "i1foju3",
            "score": 1,
            "text": "RUSSIAN COSMONAUTS WEARING YELLOW AND BLUE UKRAINE 🇺🇦COLORS YOUR BRAVEHEART THAT REALLY AWESOME 😎👏👏💙💛💙💛",
            "title_similarity": "0.6862203"
        },
        {
            "id": "i1g5htr",
            "score": 1,
            "text": "Redditards are Olympic champions at jumping to conclusions. It's a yellow suit. If it was red would you say they were supporting Japan or China?",
            "title_similarity": "0.3183009"
        },
        {
            "id": "i1rp3x0",
            "score": 1,
            "text": "Man, it’s time to read those again!!",
            "title_similarity": "0.07841976"
        },
        {
            "id": "i1uols1",
            "score": 1,
            "text": "Some of the brightest and most skilled out of the planet too.",
            "title_similarity": "0.16995832"
        }
    ]
}