{
    "Zelenskyy says 'horrors' of Russian invasion could have been avoided if world leaders had punished Putin's annexation of Crimea in 2014\n": [
        {
            "id": "i2vd9i2",
            "score": 32,
            "text": "Or perhaps the horrors would have been avoided if did not try to join NATO multiple times and increase your military and be hostile towards your neighbor Russia.",
            "title_similarity": "0.828327"
        },
        {
            "id": "i2v3qbk",
            "score": -10,
            "text": "It's true. We did nothing in 2014. It was barely reported in the media.",
            "title_similarity": "0.36007118"
        },
        {
            "id": "i2vjdof",
            "score": 31,
            "text": "Zelenskyy is a corrupt immoral tyrant.",
            "title_similarity": "0.40807337"
        },
        {
            "id": "i2vlwc1",
            "score": 39,
            "text": "Zelenskyy loves to project his problems to someone else. What does the world owes Ukraine? Why is he ALWAYS crying for someone to help him? \n\nYeah Zelenskyy, time travel is such the topic for you to be wandering about while your country gets bombed because you can't be an effective politician even with your citizens dying because of your incompetence in this chair.\n\nPutin may be all the evils, but damn we need to stop shielding Zelenskyy's incompetence as president, this guy needs to wake up and find compromise to end this conflict but this is way above his head.",
            "title_similarity": "0.66426516"
        },
        {
            "id": "i2vg6te",
            "score": 4,
            "text": "He’s right, and I liked Obama. But ALL the western leaders should’ve instilled harsher sanctions the first time. Just like US Congress not punishing or holding certain members accountable for their roles in the insurrection; if you don’t hold people accountable it will always happen again, and maybe worse.",
            "title_similarity": "0.7003479"
        },
        {
            "id": "i2v2n9l",
            "score": -18,
            "text": "Horrors of every war could have been avoided if we had focused on education.",
            "title_similarity": "0.6878053"
        },
        {
            "id": "i2v5imu",
            "score": 7,
            "text": "So much bs",
            "title_similarity": "0.15846023"
        },
        {
            "id": "i2wgmlx",
            "score": 1,
            "text": "This guy needs to STFU already\n\nThe world is not responsible for protecting Ukraine. Ukraine is responsible for protecting Ukraine. \n\nYemen has been invaded for 5+ years wtf has be done ?!\n\nWhat an absolute crybaby he turned out to be. The whole world is helping him out and all he does is bitch and moan",
            "title_similarity": "0.5445185"
        },
        {
            "id": "i2vhafd",
            "score": 11,
            "text": "Actually. We wouldn’t be in this mess if nazìs like Schwab and Soros were executed after WWII for their crimes against humanity. But they weren’t. They were brought to Canada and the US and given land and money. Now we face WWIII because of them.",
            "title_similarity": "0.67082036"
        },
        {
            "id": "i2v9m13",
            "score": 47,
            "text": "Or maybe the US could have not backed the coup attempt earlier that year?",
            "title_similarity": "0.61291414"
        },
        {
            "id": "i2vh80p",
            "score": 6,
            "text": "Even though Zelinskyy and the Ukraine have received billions and billions in humanitarian aid, military and infrastructure aid, he never once says „thank you“.",
            "title_similarity": "0.3748364"
        },
        {
            "id": "i2vkujq",
            "score": 29,
            "text": "Man screw this guy, maybe he could take an ounce of personal responsibility for steering his country into war instead of shaming everyone else and trying to drag us into it. This guy isn't the hero the TV is telling you he is. Seriously f him.",
            "title_similarity": "0.6728592"
        },
        {
            "id": "i2v78ej",
            "score": 3,
            "text": "He's right that the West was painfully weak on the Crimea annexation - but I don't think harsher punishment would've stopped him",
            "title_similarity": "0.7477108"
        },
        {
            "id": "i2vyh0y",
            "score": -1,
            "text": "The cold war was gone, the threat was gone, why did the US target to expand NATO to former soviet-block states and non-aligned Slovenia and Croatia in Europe? At the same time Ireland, Malta, Austria, Sweden, Switzerland and Finland kept their neutrality.",
            "title_similarity": "0.63777083"
        },
        {
            "id": "i2vjhof",
            "score": 17,
            "text": "Oh waaaaahhh! If only everybody else took care of your country for you, then you wouldnt be so inconvenienced right now! Waaaaaaaahhh!",
            "title_similarity": "0.53222704"
        },
        {
            "id": "i2vhmfa",
            "score": 9,
            "text": "Okay Zelensky need to give up.  This is over and he needs to save his people from throwing their lives away.",
            "title_similarity": "0.58569264"
        },
        {
            "id": "i2v9p83",
            "score": 19,
            "text": "Yeah, I felt so disturbed when the dickhead just illegally took a massive chunk of strategic land for lolz and nobody let out a peep, trying to maintain a sense of normalcy through all of it. Gave me some actual cognitive dissonance. The more experienced and knowledgeable individuals knew what was coming even before 2014.",
            "title_similarity": "0.56316364"
        },
        {
            "id": "i2vg7tf",
            "score": -19,
            "text": "If youre from the west, you have to take the L on this one and admit Zelenskys right. We should have listened, we should have done something when it happened in 2014. We cant throw around excuses. Not stopping Putin was a global failure.",
            "title_similarity": "0.826072"
        },
        {
            "id": "i2v972h",
            "score": 4,
            "text": "yea, no shit. leaders from germany, france, uk, and usa kept kissing Putin's ass and kept sucking Putin' energy pipelines even after Crimea debacle. \n\nwhat Putin has shown is you dont deal with fascist dictators by appeasement. or you pay a heavy price in future.",
            "title_similarity": "0.6817072"
        },
        {
            "id": "i2vfr6f",
            "score": 2,
            "text": "'horrors' of Russian invasion could have been avoided if world leaders had pushed Zelensky to actually implement Minsk agreements instead of sabotaging it.",
            "title_similarity": "0.86059165"
        },
        {
            "id": "i2vglmt",
            "score": 6,
            "text": "I’m starting to not care anymore. I don’t like his attitude.",
            "title_similarity": "0.30534947"
        },
        {
            "id": "i2vjwfn",
            "score": 8,
            "text": "2014, we had not been subjected to five years of 'round the clock anti-Russian propaganda.",
            "title_similarity": "0.4950028"
        },
        {
            "id": "i2vpog2",
            "score": 1,
            "text": "He's absolutely right and we all know it.",
            "title_similarity": "0.018509338"
        },
        {
            "id": "i2va9fa",
            "score": 42,
            "text": "He wants Russia to be punished because the people of Crimea choose to side with Russia? Yeah right",
            "title_similarity": "0.7429338"
        },
        {
            "id": "i2w5xvn",
            "score": 5,
            "text": "I literally watched the Crimean referendum happen with my own two eyes as an international election observer. The results (overwhelming support for accession to the Russian Federation) have been confirmed by Western polling firms over and over. Putin didn’t invade Crimea, he protected the secession referendum of an autonomous republic exercising its sovereignty from the illegal dissolution of its parliament by Ukraine. It’s pretty pathetic to see people whining about Russian propaganda all day when you’re nothing but a puppet for the other side. If there wasn’t support for accession then why hasn’t there been a single significant protest or uprising? Why no civil war there like in Donetsk?",
            "title_similarity": "0.72132945"
        },
        {
            "id": "i2vb1tv",
            "score": -1,
            "text": "European politicians are weak, Just as they were in 1938, the same repeats here. They try to appease a man who tests their limits. Right now it is even more pathetic, NATO can't even work out a response because some of its members support Putin!",
            "title_similarity": "0.63826597"
        },
        {
            "id": "i2vjvrn",
            "score": 0,
            "text": "Daily what-ifs of this dude are boring already, maybe u shouldnt be prorussian dogs and join NATO years before 2014",
            "title_similarity": "0.5788787"
        },
        {
            "id": "i2vqkub",
            "score": 1,
            "text": "Another failure of the Obama administration (and yes, the Trump admin as well).\n\nBut man, what an utter disappointment Obama was. From ChAnGe yoU cAn bEliEve iN to  standard neoliberal whose corporate-friendly policies presided over the loss of the House, Senate, Supreme Court, 1000+ state legislature and govenor seats,  and presidency over 8 years.\n\nArguably one of the biggest presidential busts in American history.",
            "title_similarity": "0.49442294"
        },
        {
            "id": "i2vwzqg",
            "score": 1,
            "text": "Maybe so. But it (also) could have been avoided if the U.S. (NATO) had agreed to not put military bases near Russian borders. We wouldn't tolerate USSR bases in Cuba, why should Russia tolerate enemy bases in its back yard?",
            "title_similarity": "0.7747514"
        },
        {
            "id": "i2v4pu4",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.17211807"
        },
        {
            "id": "i2vjatq",
            "score": 25,
            "text": "Honestly? At this point Zelinsky can fuck off already\n\nI hate putin, whats happening in ukraine is terrible, it really is. But for fucks sake, he keeps acting like we should all go to fucking war with russia because they attacked a country we aren't even in an alliance with, this isn't how it works\n\nYes, it sounds extremely harsh, and maybe it is. But the entire world isn't going to a war with russia over Ukraine, Im sorry, its not happening",
            "title_similarity": "0.70312256"
        },
        {
            "id": "i2vilnu",
            "score": -2,
            "text": "obama sucks",
            "title_similarity": "0.309407"
        },
        {
            "id": "i2vm7sz",
            "score": 2,
            "text": "Yep but Obama loved Putin and said Russia wasn’t Americas biggest threat.",
            "title_similarity": "0.5227363"
        },
        {
            "id": "i2vdlfc",
            "score": 34,
            "text": "Ukraine as a country is far from innocent as the news lets on",
            "title_similarity": "0.5204525"
        },
        {
            "id": "i2v5y3q",
            "score": -12,
            "text": "It also coulda been avoided if ukraine put more money into their military before russia invaded.",
            "title_similarity": "0.8166855"
        },
        {
            "id": "i2vg6p3",
            "score": 5,
            "text": "Not just Crimea, Russia also invaded Georgia and took part of it in 2008 and the world also did fuck all back then:\n\nhttps://en.wikipedia.org/wiki/Occupied\\_territories\\_of\\_Georgia",
            "title_similarity": "0.59933305"
        },
        {
            "id": "i2v7w8r",
            "score": 6,
            "text": "Yeah absolutely. I really feel like we should have given a hell of a lot more weaponry to Ukraine too.",
            "title_similarity": "0.6189922"
        },
        {
            "id": "i2var9g",
            "score": 6,
            "text": "Obama!",
            "title_similarity": "0.18071672"
        },
        {
            "id": "i2vhpdk",
            "score": 5,
            "text": "What about his own responsibility as a leader of a country? he had ample chance to come to an agreement, it is easy to  always blame it on others. Things like respecting Russian language rights and promosing to not join NATO could have held Russia off, now he will have to yield to these demands anyway but after thousands dead.",
            "title_similarity": "0.7186674"
        },
        {
            "id": "i2v6bib",
            "score": -3,
            "text": "He’s not necessarily wrong about that but they also could have been at least somewhat more prepared if he would have taken the threat more seriously in the months leading up to the invasion, instead of blaming the west and the media for creating panic. \n\n> \"There are signals even from respected leaders of states, they just say that tomorrow there will be war. This is panic - how much does it cost for our state?\" he told the press conference in Kyiv.\n\n> The \"destabilisation of the situation inside the country\" was the biggest threat to Ukraine, he said.\n\nhttps://www.bbc.com/news/world-europe-60174684",
            "title_similarity": "0.7333747"
        },
        {
            "id": "i2xdnjj",
            "score": 0,
            "text": "Zelensky you're just a clown, and you will be only reminded for being Biden ass licker.\nI really hope the Russian Federation to build missile bases in Mexico and Cuba and wait for the real terrorists on this planet (USA) reaction.",
            "title_similarity": "0.572461"
        },
        {
            "id": "i2v42fs",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.17211807"
        },
        {
            "id": "i2vb708",
            "score": 1,
            "text": "0bama. Can we say his name?",
            "title_similarity": "0.26888108"
        },
        {
            "id": "i2vcj97",
            "score": 3,
            "text": "Or Ukrainians could've done it....",
            "title_similarity": "0.47164375"
        },
        {
            "id": "i2vikh0",
            "score": 0,
            "text": "Zelensky needs to keep his mouth shut.",
            "title_similarity": "0.4006311"
        },
        {
            "id": "i2vxkw1",
            "score": 2,
            "text": "I wish Ukraine the best against Kremlin. But the reckless demands of the Ukrainian leadership starting from \"CLOSE THE SKIES\" all the way to \"GIVE US PLANES\", is getting really annoying. He's being armed to the teeth by the West. US alone has given 2 billion dollars during Biden administration. Shut the fuck up already. Stop trying to instigate a WW.",
            "title_similarity": "0.63749176"
        },
        {
            "id": "i2vb30j",
            "score": -5,
            "text": "he is right and the world should be ashamed of itself, this is how it always goes, there will be a huge war, then peace, then people forget and get greedy and then the cycle repeats. We really are a stupid species.\n\nedit: yes vote down you cry babies who always want to blame others for your own mistakes",
            "title_similarity": "0.54904294"
        },
        {
            "id": "i2vln6v",
            "score": 0,
            "text": "ObamaBros... he's lying right?",
            "title_similarity": "0.37889507"
        },
        {
            "id": "i2whixk",
            "score": -1,
            "text": "I’m kinda over Zelenskyy complaining all the time.\n\nLike yes, you’re 100% right, and we support you. Literally, billions of dollars in support at rapid speed. Like the single biggest show of universal western support in modern memory. Even a little token China support.\n\nCan we focus on the goals of the day and maybe save the blame game for the post mortem? I’m all for our collective leaders creating new protocols and a game plan once the dust settles and we know what the stakes are.",
            "title_similarity": "0.45425123"
        },
        {
            "id": "i2vbe4w",
            "score": -9,
            "text": "He is correct.  It was infuriating watching world leaders let Putin do it.  \n\nOh, right, Republicans were FOR Putin's actions.  Trump said the US should accept it.",
            "title_similarity": "0.6456208"
        },
        {
            "id": "i2vc1ae",
            "score": 16,
            "text": "And supported Azov Battalion to liquidate ethnic Russians 2014-21!",
            "title_similarity": "0.6356433"
        },
        {
            "id": "i2vg5nx",
            "score": 31,
            "text": "\\*Looks at US invading countries, bombing countries and staging coups to put dictators in place\\* yeeeeeah punishing super powers isn't really a thing that happens generally.",
            "title_similarity": "0.59338593"
        },
        {
            "id": "i2vin7e",
            "score": 3,
            "text": "You mean when the United States installed the nazi-sympathizing Maidan regime?",
            "title_similarity": "0.4234309"
        },
        {
            "id": "i2ve89u",
            "score": -5,
            "text": "Another example of a herd of theorists from the west regurgitating propaganda. If you guys actually followed happenings in Eastern Europe, Ukraine, Russia, etc you’d know that Putin is not the bad guy here and that Crimea had an 83% voter turnout and 97% of them voted to join the Russian federation. Same with inside Sevastopol. So tell me again how Russia “invaded” Crimea.\n\nhttps://en.m.wikipedia.org/wiki/2014_Crimean_status_referendum",
            "title_similarity": "0.6585499"
        },
        {
            "id": "i2v8evp",
            "score": 0,
            "text": "Gee, I forgot which former president applauded and agreed with the outcome of Crimea? Could it beeeee Cheeto Bandito?",
            "title_similarity": "0.661499"
        },
        {
            "id": "i2vksa2",
            "score": 0,
            "text": "Anyone who actually agrees with this should fight in the Ukraine :)\n\nThe only thing that could've prevented this and still can is concessions, after Russia because a nuclear power. \n\nWe will wait for the Ukraine to turn deeper into Afghanistan 2.0 before inevitably taking the negotiation table seriously.",
            "title_similarity": "0.7199051"
        },
        {
            "id": "i2w21ci",
            "score": -3,
            "text": "Obama just let them take it, and now Biden has let them take more. And yet they called Trump a Russian asset - fascinating projection.",
            "title_similarity": "0.6703718"
        },
        {
            "id": "i2vhrbp",
            "score": -8,
            "text": "Would of could of fight your own war",
            "title_similarity": "0.5119076"
        },
        {
            "id": "i2vogdq",
            "score": 6,
            "text": "Dude is literally a multi millionare comedian actor with 0 political experience or knowledge when he was voted in, and became a billionare from this war btw in which he sits in his comfy house watching from the sidelines idk why anyone takes this dude seriously. Ukraine is also at fault for this war just do some basic digging and also how they treat russian ethnics on there country.\n\nNot saying war is justified.",
            "title_similarity": "0.53123784"
        },
        {
            "id": "i2vpndj",
            "score": 11,
            "text": "Well, there is a long history of ignoring Russian wars:\n\n1991 - Georgia\n\n1992 - Moldova\n\n1994 - Chechnya\n\n1999 - Dagestan\n\n1999 - Chechnya\n\n2008 - Georgia \n\n2014 - Ukraine\n\n2015 - Syria\n\nAnd those are just wars Russia had since 1991. If we go back to USSR there will be more.",
            "title_similarity": "0.6430156"
        },
        {
            "id": "i2v94zd",
            "score": 115,
            "text": "The amount of people here ready to go to war is scary",
            "title_similarity": "0.3649161"
        },
        {
            "id": "i2vmcdb",
            "score": 4,
            "text": "Obama and Merkel are to blame for Putin appeasing policy at that time.",
            "title_similarity": "0.68255806"
        },
        {
            "id": "i2v7iod",
            "score": 0,
            "text": "This was back when the world assumed Russia had a powerful military though. Now we know better.",
            "title_similarity": "0.6104651"
        },
        {
            "id": "i2vltbl",
            "score": 1,
            "text": "Let's just face it democrats suck at foreign policy. The world just walks all over us when they are in office.",
            "title_similarity": "0.5231751"
        },
        {
            "id": "i2vmf7z",
            "score": 1,
            "text": "Why is the United States tasked with being the worlds police? We have plenty of our own issues in house to deal with ijs",
            "title_similarity": "0.3630778"
        },
        {
            "id": "i2vryt0",
            "score": 2,
            "text": "Who was president back then? 🤔",
            "title_similarity": "0.26316243"
        },
        {
            "id": "i2vu2ls",
            "score": 1,
            "text": "Ungrateful fuck. Despite how much support they've been given from the entire world, my own tax money included, and he dares claim this is our fault. What. An. Ungrateful. FUCK.",
            "title_similarity": "0.49128738"
        },
        {
            "id": "i2vxi03",
            "score": 1,
            "text": "There is also sentiment that Western Europe poked the bear by discussions of Ukraine entering NATO. We all knew Russia would see this as a direct threat to their sovereignty but we did it anyway. Do I think Ukraine should be allowed to join nato? Yes but my morals aren’t the same as Russia’s. Would america let mexico join some Chinese led NATO-like clone? HELL NO. When you look at the world through the lense of weighing strategic considerations you can then clearly see how the west has had some negative influence on Russia actions.",
            "title_similarity": "0.7829404"
        },
        {
            "id": "i2w720h",
            "score": 0,
            "text": "The Russian invasion could’ve been avoided if the US and NATO didn’t throw their little victory party in central and Eastern Europe 1992-2005. Post-1993 Yeltsin’s Russia/CIS was willing to become an ally of the West, and only wanted to be treated with the respect the USSR had. Instead the UK/US told Russia to go fuck themselves and danced on the eastern bloc’s grave. By the end of the 90s, Russians were tired of being pushovers and elected a hardliner who dreamt of seeing the Russian Empire restored to fight western domination.\n\nThere’s an alternate timeline somewhere wherein Clinton, Bush Jr, and Blair act like you would expect someone who actually wants to make a powerful ally to, Russia and it’s SOI are full allies of the west or at worst, tenuous partial allies like Turkey.",
            "title_similarity": "0.7948248"
        },
        {
            "id": "i2wkryn",
            "score": 0,
            "text": "I like this guy but not fond of him biting the hand that helps him",
            "title_similarity": "0.35723725"
        },
        {
            "id": "i2wvhf2",
            "score": 2,
            "text": "He’s right, but who was president at that time 🤔🤔🤔🤭",
            "title_similarity": "0.33388025"
        },
        {
            "id": "i2vcvhj",
            "score": -11,
            "text": "Then trump lifted the sanctions Obama put on Russia, and effectively gave Putin the red carpet into the rest of Ukraine. All while withholding aid to Ukraine for dirt on a political opponent.",
            "title_similarity": "0.76062906"
        },
        {
            "id": "i2wefis",
            "score": 0,
            "text": "I'm getting a little bit tired of Zelensky continually going on about all the stuff other countries should have done for Ukraine for all these years.  How about you stop being one of the most corrupt governments on the planet first and be worth throwing our money and lives at before you start pointing at everybody else telling them what they should have done for you before?\n\nHe's getting billions of dollars in aid right now from multiple countries.  The weapons he has been given have been THE deciding factor in how Ukraine has been able to resist this long.  How about he just tones down the rhetoric a little bit and starts to talk about what's going to change in his own house before going on and on about what we should give him.",
            "title_similarity": "0.66102666"
        },
        {
            "id": "i2xnun4",
            "score": 0,
            "text": "Annexation? You mean the 2014 crimean status referendum that saw ~96% of crimeans vote to join the Russian Federation after the ethnic cleansing of Russian-speaking peoples in Donbas? The same referendum that was reported as an invasion in the west because of a military presence that had been in that region since the Russo-Persian wars in 1804?\n\n Obvious propaganda is Obvious.",
            "title_similarity": "0.6765754"
        },
        {
            "id": "i2ygwd5",
            "score": 0,
            "text": "Go home Zelenskyy. You're drunk.",
            "title_similarity": "0.3416081"
        },
        {
            "id": "i2w3h7m",
            "score": 4,
            "text": "Ukraine should have also considered defending itself then. I’m very Anti-Russia in this conflict but Zelenskyy loves making this issue the world’s fault. As I recall, Russia faced no real resistance from Ukraine in the annexation of Crimea.",
            "title_similarity": "0.7682835"
        },
        {
            "id": "i2v8v6p",
            "score": -6,
            "text": "World leaders should consider stop being pussies.",
            "title_similarity": "0.5787542"
        },
        {
            "id": "i2vptsk",
            "score": 8,
            "text": "He’s not wrong.  Putin was allowed to slide",
            "title_similarity": "0.35553226"
        },
        {
            "id": "i2v843m",
            "score": 5,
            "text": "And he is absolutely correct.",
            "title_similarity": "-0.01665953"
        },
        {
            "id": "i2vio1h",
            "score": 3,
            "text": "I love the morons blaming Trump for this.\n\nFucking hilarious how stupid these comments are.",
            "title_similarity": "0.45282623"
        },
        {
            "id": "i2v75w1",
            "score": 23,
            "text": "Completely and totally agree with that.",
            "title_similarity": "-0.020914944"
        },
        {
            "id": "i2vimfn",
            "score": 24,
            "text": "The Obama administration did put sanctions on Russia and Russian Oligarchs after the Russian invasion of Crimea. It was Trump who removed them all, recognized Crimea as Russian and licked Putin’s taint whenever possible.",
            "title_similarity": "0.75477004"
        },
        {
            "id": "i2v5bza",
            "score": 39,
            "text": "Punish them how? Rússia was sanctioned for Crimea, and it was over too fast for anything else.",
            "title_similarity": "0.7245383"
        },
        {
            "id": "i2v5lov",
            "score": 4,
            "text": "True.",
            "title_similarity": "-0.07547066"
        },
        {
            "id": "i2vgz99",
            "score": -1,
            "text": "Ukrainians should just join Russia under the pretense of taking over the west. Seems like they’ll come to realize who fucks them over more in due time",
            "title_similarity": "0.70496786"
        },
        {
            "id": "i2vivie",
            "score": -1,
            "text": "Getting close to biting the hand there, Zelenskyy.",
            "title_similarity": "0.32412007"
        },
        {
            "id": "i2vwrf2",
            "score": -1,
            "text": "Obama",
            "title_similarity": "0.17466983"
        },
        {
            "id": "i2w0wyp",
            "score": -1,
            "text": "I feel like the weirdos on socials agreeing to every single thing this man says don’t realize that Zelensky is probably just blurting random things out in desperation. Most of his suggestions would be our un-doing.\n\nThere were sanctions and indirect support from the west back in 2014, the reason why things didn’t go beyond that is because direct military interference from a NATO member would be a big fucking problem that we are not ready to deal with.\n\nI urge people to stop fangirling over war victims in front of a computer screen and think about the consequences of “punishing” Russia with anything that goes beyond those aforementioned sanctions. \n\nDon’t tell me you want to fuck the world up just to help Ukraine. You do *not* think that.",
            "title_similarity": "0.75634354"
        },
        {
            "id": "i2wj5xl",
            "score": -1,
            "text": "That would be Obama",
            "title_similarity": "0.20058228"
        },
        {
            "id": "i2wx9ly",
            "score": -1,
            "text": "Listen. This guy is in a tough place but all he seems to do is blame everyone else for his country’s problems.\n\nI don’t admire his strategy unless he wants his country to become a puppet of anti-Russian aggression.\n\nHe’s basically asked the West (US primarily) to send their children to war on his behalf. I can’t support that.\n\nThe US is not responsible for the fact the USSR was a failed state.",
            "title_similarity": "0.6907413"
        },
        {
            "id": "i2xdleq",
            "score": -1,
            "text": "Or if NATO wasn’t 30 countries bordering Russia. NATO has expanded almost as far as the Nazis did during WWII. How are the Russian supposed to react? I don’t support the war btw.",
            "title_similarity": "0.66438174"
        },
        {
            "id": "i2xwxo6",
            "score": -1,
            "text": "He is right And we need to,prosecute Trump and insurrectionist or we will lose our democracy in the next election .   It will be all over.",
            "title_similarity": "0.67711955"
        },
        {
            "id": "i2vb8vr",
            "score": 22,
            "text": "its almost like appeasement doesnt work.",
            "title_similarity": "0.29736632"
        },
        {
            "id": "i2vdzra",
            "score": -4,
            "text": "to be honest and myself included the world did not seem to give a flying shit about the invasion by Russia back then.   We really failed Ukraine in a lot of ways",
            "title_similarity": "0.66827995"
        },
        {
            "id": "i2vfrju",
            "score": 3,
            "text": "Also if you Ukraine has kept their nukes it wouldn’t be happening either. Hindsight 2020",
            "title_similarity": "0.7320379"
        },
        {
            "id": "i2w6pim",
            "score": 4,
            "text": "I mean, the guy ain't wrong.",
            "title_similarity": "0.062317286"
        },
        {
            "id": "i2v2vl6",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.17211807"
        },
        {
            "id": "i2v6one",
            "score": 49,
            "text": "[removed]",
            "title_similarity": "0.17211807"
        },
        {
            "id": "i2v8w2g",
            "score": 5,
            "text": "Yup, give an inch and Russia will attempt to take a mile",
            "title_similarity": "0.4419573"
        },
        {
            "id": "i2vez4x",
            "score": 6,
            "text": "I actually don't agree with this statement.\n\nCrimea gave Putin a perfect playbook to follow: win over the population of a disputed territory through propaganda, occupy it (relatively) bloodlessly, and weather whatever sanctions came his way. He could have followed that playbook this time around by just invading separatist-controlled Donbas. The \"horrors\" of the current invasion probably wouldn't have happened if he'd done that.\n\nInstead he invaded all of Ukraine. That was a bonkers decision, and it would've been bonkers whether or not the West came down hard or easy on Russia after Crimea. Basically, if Putin was gonna be crazy anyway, I don't think it really matters what the West did.",
            "title_similarity": "0.82382023"
        },
        {
            "id": "i2vgacz",
            "score": 4,
            "text": "What the fuck is the author implying by putting the word ‘horrors’ in the brackets? I am quite sure they’d scream like a child and shit their pants if they had to spend 1 hour in Kharkiv or Mariupol",
            "title_similarity": "0.55989534"
        },
        {
            "id": "i2vcftu",
            "score": 1,
            "text": "This shouldn’t be a surprise to anyone who knows anything about Germany leading up to WWII",
            "title_similarity": "0.48602843"
        },
        {
            "id": "i2vjcwz",
            "score": 2,
            "text": "He is absolutely right.\nThe world did nothing and emboldened the Russian leadership.  Now is the time to continue fighting and supply Ikraine with weapons to not only push back the recent invasion but also to regain the Donbas and Crimea from the Russians these should all be held as conditions to end sanctions.  Leave all three or sanctions continue.",
            "title_similarity": "0.7256253"
        },
        {
            "id": "i2vjgjb",
            "score": -3,
            "text": "What's this? Reddit supporting Trump's foreign policy?",
            "title_similarity": "0.528634"
        },
        {
            "id": "i2vzpio",
            "score": -2,
            "text": "Yep, Obama failed to respond effectively. That's why you didn't see anything going on with russian expansion during Trump, but you did see with the other presidents in the 21st century.",
            "title_similarity": "0.65249324"
        },
        {
            "id": "i2w9t6y",
            "score": -2,
            "text": "Could also be avoided if Zelansky STFU",
            "title_similarity": "0.5153507"
        },
        {
            "id": "i2yfv4u",
            "score": 1,
            "text": "This is quite a shortcut.\n\nHowever illegal the annexation was, it was supported by an overwhelming part of the population in Crimea. Not even the West contests this. If one believes in people’s right to self-determine, this has to be taken into account.\n\nThen “separatists” asked for referendums to be held in Donbas (especially Donetsk and Luhansk) which is in the very same Eastern area, to decide upon their future through a vote on autonomy/independence. Not this surprising as this region is largely composed of Russian-speaking people with very close links to Russia, while the government is 100% turned towards the West.\n\nThey were supported by Russia but they are real Ukrainian people, and they were also at least partly supported by a few million people in the region. One just has to look at the public polls, even those carried out by pro-West organizations to get a better grasp on where the population sits.\n\nThey were met with a war that has lasted for 8 years. A 40-page UN report I read with care mentions that 1 million people fled Donbas to find refuge… in Russia in 2015-2016. Many human rights violations have been reported on both sides. That includes the Ukrainian government on his own people.\n\nSurely Ukraine could have handled the situation there with more care, for instance by handling referendums, why not under the international community oversight if the Ukrainian government had wished to.\n\nBanning Russian language in administration and education in 2019, which is the first language of most Eastern Ukrainians, is quite agressive and divisive one must agree. Not the best way to settle an 8-year war with separatists, and to unify a country.\n\nThe Russian invasion did not happened without a warning, Zelensky is right on this, but it was for Ukraine first to read the warnings. It is a bit easy to blame external parties for a war which has been precedented by 8 years of another war inside Ukraine itself.",
            "title_similarity": "0.65289533"
        },
        {
            "id": "i2v897g",
            "score": 62,
            "text": "I don’t think that statement is fair. It’s one thing to say that not enough was done back in 2014 to condemn Putin but to say this current invasion would have been prevented is quite irresponsible. This whole situation that’s been going on since basically Putin came into power is more complicated than just going back to 2014. Easy to make such a claim but put some details and it’ll look immature quickly. I get Zelenskys’ point but I don’t agree. All easier said than done. Super complicated, everyone is at fault in some sense but to say that is far fetched.",
            "title_similarity": "0.74463"
        },
        {
            "id": "i2v8u5w",
            "score": 5,
            "text": "We do not know that. I agree that the actions taken back then were not harsh enough, but then again, no one can see the future.",
            "title_similarity": "0.52462375"
        },
        {
            "id": "i2vie6s",
            "score": 15,
            "text": "Almost like appeasement is something we've had experience with before. Almost.",
            "title_similarity": "0.2485955"
        },
        {
            "id": "i2vorhg",
            "score": 16,
            "text": "While I agree, I'd also say that starting WWIII in 2014 would have led to a whole different set of horrors.",
            "title_similarity": "0.67155087"
        },
        {
            "id": "i2v4a8x",
            "score": -2,
            "text": "I agree with his statement. But, there will be no peace until we either kill each other off in a nuclear holocaust or until our natural extinction.",
            "title_similarity": "0.56078756"
        },
        {
            "id": "i2v67k5",
            "score": 3,
            "text": "Wasn’t Crimea where the biggest reaction the internet had was to fawn over the Russian official in charge of the invasion and meme her into an anime girl?",
            "title_similarity": "0.54997426"
        },
        {
            "id": "i2vfnkx",
            "score": 3,
            "text": "Obama should have droned the 'little green men' when Putin denied they were russian soldiers, then rolled in the cavalry to also get rid of the \"separatists\" in Donetsk and Luhansk. The one thing Trump actually did really well. He was brash or stupid enough to not give a shit about putin's ploys and just bombed the living shit out of stuff he was 'allowed' to bomb\n\nObama knew Putin was lying. Putin knew Obama knew he was lying. And he let him get away with it. A giant blunder that the world is now paying for.\n\nI mean... It should have ended that day, but evil was allowed to endure",
            "title_similarity": "0.7122102"
        },
        {
            "id": "i2vhd7z",
            "score": 3,
            "text": "And also didn't promise Ukraine lots of western stuff (like Nato membership) without following through. If you have a country that's RIGHT NEXT TO RUSSIA and which is a FORMER SOVIET STATE you can't half-ass these things.",
            "title_similarity": "0.7478563"
        },
        {
            "id": "i2vio92",
            "score": 2,
            "text": "That seems a pretty goddamn reasonable statement.",
            "title_similarity": "0.07335168"
        },
        {
            "id": "i2vkhhf",
            "score": 2,
            "text": "Whaaaat? You expect world leaders to lead the world by example?! Yall watching the wrong tv shows. This is the real world, if something accidentally moves forward, theres an entire political party ready to drag it back",
            "title_similarity": "0.55390775"
        },
        {
            "id": "i2vrsts",
            "score": 3,
            "text": "Yep, Obama did nothing.",
            "title_similarity": "0.21115184"
        },
        {
            "id": "i2vsm1m",
            "score": 3,
            "text": "Isnt Crimea mostly ethically Russian even with Ukrainian estimates? I was always under the impression that the people inside Crimea wanted to be in the Russian federation. Putin is a piece of shit and that doesn’t justify any if the horrible things he has done in the past but I’m just saying I dont think the Crimea situation is black and white.",
            "title_similarity": "0.7560035"
        },
        {
            "id": "i2vsz34",
            "score": 4,
            "text": "And there are people seriously claiming that the solution to the current invasion is \"compromise\" - people who presumably aren't Russian trolls. Their argument is the same as Putin's, fear-mongering.\n\nIf you want a better or just world, sometimes you have to say no.",
            "title_similarity": "0.7449772"
        },
        {
            "id": "i2vv5c5",
            "score": 3,
            "text": "It's hard for people to accept a narrative other than the one they've been fed. \n\nAll this could have been avoided if the west didn't plan and finance a coup so they could steal the energy reserves recently discovered in Ukraine. \n\nRussia is fighting for it's security and naval base while the people that put a comedian into power are fighting for oil and gas. Meanwhile the people of Ukraine suffer for no fault of the average citizen. They have no clue the geopolitics taking place with them as pawns. \n\nAnother energy war financed by the \"West\". Just like the natural gas pipeline they wanted to run through Syria. Look it up.",
            "title_similarity": "0.7183633"
        },
        {
            "id": "i2vy8p6",
            "score": -4,
            "text": "Could also be avoided if nato didnt expand east",
            "title_similarity": "0.63116133"
        },
        {
            "id": "i2w56ft",
            "score": -1,
            "text": "Who was in charge of White House Ukraine policy in 2014? Oh right, Joe Biden.\n\nWho was in the White House, and capitulated on Nordstrom 2, when Putin invaded this year? Hmm, seems like a pattern.",
            "title_similarity": "0.6176782"
        },
        {
            "id": "i2w60cr",
            "score": 3,
            "text": "He's not wrong.  I'm sick over this.  The ENTIRE world is standing against Putin, and yet all the leaders of the world are willing to stand there like bystanders and only passively get involved by supplying military hardware and weaponry and humanitarian aid to the Ukraine.  Meanwhile Russian forces - whether they are winning or not, are DESTROYING a once beautiful country full of culture and history.    \nWhats going to happen when there are no more Ukranian people to defend the country?  How are they ever going to rebuild from this?  And whats going to stop Russian leaders from doing this again?  President Zelensky, I am sorry.  I feel the world is letting Ukraine down.  But I don't know how to fix this.",
            "title_similarity": "0.710359"
        },
        {
            "id": "i2xotyp",
            "score": 3,
            "text": "Maybe Zelenskyy should stop cutting down those who are helping him.\n\nA little fucking gratitude.",
            "title_similarity": "0.5457998"
        },
        {
            "id": "i2v9t14",
            "score": 12,
            "text": "Syria \"red line\"\n\nCrimea 2014",
            "title_similarity": "0.5036563"
        },
        {
            "id": "i2v34sw",
            "score": 271,
            "text": "Horrors of next war in 2030s will be avoided if the world acts now and stops Russia for good this time!",
            "title_similarity": "0.7765732"
        },
        {
            "id": "i2v6egg",
            "score": 4,
            "text": "True! Preach!",
            "title_similarity": "0.06804522"
        },
        {
            "id": "i2vanf6",
            "score": 0,
            "text": "Very, very true.",
            "title_similarity": "-0.022534706"
        },
        {
            "id": "i2vbe4v",
            "score": 0,
            "text": "True, but also it could have been mitigated if he'd taken the US president's warning and prepared more.",
            "title_similarity": "0.63932455"
        },
        {
            "id": "i2vcf4k",
            "score": 0,
            "text": "To be fair, \"we\" (the world) did, but it's like a speeding ticket to a billionaire.",
            "title_similarity": "0.54336166"
        },
        {
            "id": "i2vcwxl",
            "score": 0,
            "text": "He's completely correct.\n\nWe should be ashamed of ourselves.",
            "title_similarity": "0.38681114"
        },
        {
            "id": "i2vh9my",
            "score": 0,
            "text": "Yeah, that was awful. I haven't been to my home in Crimea for 8 years already, and probably won't be able to come there ever again",
            "title_similarity": "0.43031973"
        },
        {
            "id": "i2vhqoz",
            "score": 0,
            "text": "This is so true.",
            "title_similarity": "-0.05486644"
        },
        {
            "id": "i2vj8xh",
            "score": 0,
            "text": "WAR WAR WAR WAR WAR WAR WAR WAR",
            "title_similarity": "0.33472455"
        },
        {
            "id": "i2vjz8d",
            "score": 0,
            "text": "On a completely unrelated note: Ezra Miller was arrested a couple days ago for assaulting a woman at a bar. As it happens, he also assaulted a woman at a bar 2 years ago but experienced no repercussions.",
            "title_similarity": "0.41769898"
        },
        {
            "id": "i2vknos",
            "score": 0,
            "text": "True. There were even international treaty according to which usa, UK and Russia were supposed to automatically declare war on anyone threatening territorial integrity of Ukraine (in exchange of Ukraine getting rid of nuclear weapons). But Obama decided to disregard it. So yeah, Obama hold 90% responsibility for this war.",
            "title_similarity": "0.7089324"
        },
        {
            "id": "i2vl5pn",
            "score": 0,
            "text": "When will this idiot understand that Russian oil is more precious than his tiny country to the World Leaders?",
            "title_similarity": "0.6500218"
        },
        {
            "id": "i2vldjg",
            "score": 0,
            "text": "Obama gave Putin the ultimatum of \"you stay out of Ukraine, we'll leave you alone in Syria.\"  Sleepy Joe didn't enforce that, we are where we are.",
            "title_similarity": "0.67826355"
        },
        {
            "id": "i2vli0k",
            "score": 0,
            "text": "Historically Crimea  belongs to the Russians. Additionally, the majority of people voted for the referendum to succeed.  Lots of good documentaries to help you understand the situation.",
            "title_similarity": "0.5397468"
        },
        {
            "id": "i2vme83",
            "score": 0,
            "text": "What’s an annexation?",
            "title_similarity": "0.179573"
        },
        {
            "id": "i2vn3er",
            "score": 0,
            "text": "or if Ukraine joined NATO.",
            "title_similarity": "0.39976454"
        },
        {
            "id": "i2vn6y3",
            "score": 0,
            "text": "I'll never quite understand why Germany after 2014 continued with gasprom and Nord stream 2\n\nGermany should've started construction on LNG terminals right after the Crimea invasion. We all knew Putin was not someone to trust even before crimea. Invaded Georgia, bombed the fuck outta Chechnya, poisoned political opposition etc etc etc",
            "title_similarity": "0.7539442"
        },
        {
            "id": "i2vn7i8",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.19564259"
        },
        {
            "id": "i2vnujb",
            "score": 0,
            "text": "Maybe if the US hadn't orquestrated the change of government in the Ukraine in 2014, Russia wouldn't have invaded. You know, when Victoria Nuland and Geoffrey Pyatt, the US ambassador to Ukraine had a phone chat about who they were putting in power in Ukraine when their revolution had ousted the then government, and later she said \"Fuck the EU\"??? Maybe if the US had kept it's fucking nose out there wouldn't be a war now.",
            "title_similarity": "0.82230353"
        },
        {
            "id": "i2vo618",
            "score": 0,
            "text": "Are they even a part of nato? They sure have control over nato for not even being a member",
            "title_similarity": "0.5207603"
        },
        {
            "id": "i2vo7i2",
            "score": 0,
            "text": "Or you smaller nations could conform to EU standards which are very reasonable and stop being shady so that you can get ally status and be protected from any invasion 🧐",
            "title_similarity": "0.59206593"
        },
        {
            "id": "i2vo7xn",
            "score": 0,
            "text": "and sanction america for 2008?",
            "title_similarity": "0.33579555"
        },
        {
            "id": "i2vojjl",
            "score": 0,
            "text": "For all of the deluded out there buying the message of \"he wants to reclaim Eastern Europe\" he doesn't. What he does want is Nato and the US the fuck away from Russia's border, which, coincidentally, they've been circling with regime changes in countries like Georgia, Ukraine and others for over the last decade.",
            "title_similarity": "0.6700275"
        },
        {
            "id": "i2vor9q",
            "score": 0,
            "text": "And Putin's Annexation of Crimea would have been avoided, if the West didn't insist on installing a Pro-western government, in place of the pro-Russian government.  \n\n\nTag your it.",
            "title_similarity": "0.89731675"
        },
        {
            "id": "i2vpvvk",
            "score": 0,
            "text": "I personally think zelenskys assessment is wrong\n\nI *totally* believe our world leaders *definitely* aren't at the wheel at all. They *totally care*.\n\n\nAlso, you mean to tell me that Putin has acted out of line in the past, and world leaders did *nothing* about it? Well now,**THAT** I just cannot believe.\n\nI **FULLY BELIEVE** that Putin just woke up one day after having a totally clean slate and said 'ay I just feel like doing an invasion today'.\n\nThat's **MUCH MORE** plausible and believable in my book, if I was being honest with you",
            "title_similarity": "0.60404813"
        },
        {
            "id": "i2vq73g",
            "score": 0,
            "text": "Ya Think ?",
            "title_similarity": "0.043333568"
        },
        {
            "id": "i2vqbw1",
            "score": 0,
            "text": "I guess they forces them to commit war crimes on those pow's.\n\nBet anything in the world he has said \"why do you make me do this\" to his spouse while beating them.",
            "title_similarity": "0.4788918"
        },
        {
            "id": "i2vrf10",
            "score": 0,
            "text": "Why do he keep begging someone to help he needs to stop being a pussy.",
            "title_similarity": "0.42756322"
        },
        {
            "id": "i2vsrux",
            "score": 0,
            "text": "Damn wonder who was president back in 2014 🤕",
            "title_similarity": "0.41091925"
        },
        {
            "id": "i2vt9na",
            "score": 0,
            "text": "What the fuck more would he want? A land war with a nuclear power? Get the fuck out of here. No way anyone wants to risk that over Crimea.",
            "title_similarity": "0.6292999"
        },
        {
            "id": "i2vts0z",
            "score": 0,
            "text": "Maybe Ukraine shouldn't have poked the Russian bear like Georgia thinking the US has their backs.",
            "title_similarity": "0.79896104"
        },
        {
            "id": "i2vttz9",
            "score": 0,
            "text": "Putin did what America would have done to the Panama Canal if it's interests were threatened. \n\nThis clown just needs to grow the hell up and stop bitching",
            "title_similarity": "0.6972774"
        },
        {
            "id": "i2vu250",
            "score": 0,
            "text": "Disgusting lie.  Crimea was pure liberation on scale of US invading France in WW2.  The world did punish with sanctions.  Disgusting filth promoting this US puppet to keep the US war down to the last Ukrainian.",
            "title_similarity": "0.69123286"
        },
        {
            "id": "i2vu5eh",
            "score": 0,
            "text": "Same goes for Zelenskyy, Russian invasion would be avoided if he didn't literally promote Russian hate domestically and enlist an known extremist nazi group (Look up Azov) into the official Ukranian military. Let's also not forget Ukraine voted against condemnation of Nazi in UN. Not saying Russia is the good guy here, but Ukraine is a fucking shithole of a country politcally.",
            "title_similarity": "0.81992626"
        },
        {
            "id": "i2vu81w",
            "score": 0,
            "text": "I do think that America and the west should take a good amount of the blame in terms of setting a precedent that Russia could follow after the illegal invasion of Iraq under a pretense not supported by the any cactus based and generally accepted evidence (supposed weapons of mass destruction) .\n\nOnce they did this they opened a Pandora box of options that could be taken by other powerful nations with the aims of invading other weaker countries on false claims of the same ilk america used in Iraq. \n\nPutin basically said that he's annexing Crimea for the sake of Russian stability (violence and tension close to her borders) as well as the supposed protection of Russian friendly citizens and forces in Crimea. \n\nThat shouldnt be enough to outright annex part of a national but I've always felt that America's invasion of Iraq would normalise such actions since its pretty much the same playbook. \n\nInvading nations due to apparent \"threats to neighboring states and communal interests\"\n\nPutin is still Putin though, so yeah.",
            "title_similarity": "0.8101334"
        },
        {
            "id": "i2vuyqj",
            "score": 0,
            "text": "Does this guy take any accountability?",
            "title_similarity": "0.24876145"
        },
        {
            "id": "i2vwrm0",
            "score": 0,
            "text": "Take note, US. \n\nJan 6 insurrectionists could easily skate away free of consequence. Then what?",
            "title_similarity": "0.47907075"
        },
        {
            "id": "i2vx2cx",
            "score": 0,
            "text": "I LOVE LEAN 💜💜💜💜💜",
            "title_similarity": "0.0008517895"
        },
        {
            "id": "i2vxy9o",
            "score": 0,
            "text": "Or it would have started earlier ya dummy",
            "title_similarity": "0.32157487"
        },
        {
            "id": "i2vyukx",
            "score": 0,
            "text": "Ukraine could’ve punished the Russians then just like they’re doing now. It’s like kids with a bully, yeah an adult or peer can step in and prevent a beating today but there’s only one way to stop a bully from bullying you tomorrow and that’s to stand up for yourself and fight back.",
            "title_similarity": "0.7480844"
        },
        {
            "id": "i2vzz4c",
            "score": 0,
            "text": "Or you know if Maidan didn’t happen.",
            "title_similarity": "0.2999534"
        },
        {
            "id": "i2w0370",
            "score": 4,
            "text": "He’s right. Appeasement never works.",
            "title_similarity": "0.39151177"
        },
        {
            "id": "i2w0t8u",
            "score": 0,
            "text": "God damn is this dude ever gonna stop blaming others lol you could’ve taken the proper steps in shit too but didn’t. Fuck off",
            "title_similarity": "0.6339934"
        },
        {
            "id": "i2w1w6g",
            "score": 0,
            "text": "[Obama's EO 13660, 13661, 13662, and 13685 were sanctions directly related to the 2014 invasion](https://www.visualcapitalist.com/history-us-sanctions-on-russia/).\n\nEdit: Yeah, love the downvoting of accurate information.",
            "title_similarity": "0.72906506"
        },
        {
            "id": "i2w4am5",
            "score": 0,
            "text": "Would it? Doubtful. He still would have invaded. All we can do is sanction them.",
            "title_similarity": "0.5458915"
        },
        {
            "id": "i2w4svm",
            "score": 5,
            "text": "Agreed, but that's a very easy claim to make, especially in hindsight, and no one has any appetite anymore for World Police.\n\nYou should hear the idiotic nonsense spoken in Arabic countries about American \"imperialism\". There are a lot of people out there making very incoherent arguments about how unfair it is that they are restrained from oppressing others.",
            "title_similarity": "0.5361524"
        },
        {
            "id": "i2w92m8",
            "score": 0,
            "text": "The horrors of Ukraine could have been avoided if it wasn't a fascist state.",
            "title_similarity": "0.78067815"
        },
        {
            "id": "i2waa72",
            "score": 0,
            "text": "So do something then Europe. Stop pussying around and waiting for the US to save your entire continent every time.",
            "title_similarity": "0.554057"
        },
        {
            "id": "i2wabom",
            "score": 0,
            "text": "There's no greater threat to world peace than democracy lmao.\n\nhttps://en.wikipedia.org/wiki/2014_Crimean_status_referendum#Results",
            "title_similarity": "0.6490648"
        },
        {
            "id": "i2wb285",
            "score": 0,
            "text": "Of course it's 2014's fault, of course.",
            "title_similarity": "0.46530685"
        },
        {
            "id": "i2wd5r2",
            "score": 0,
            "text": "There was only one administration where Putin didn't invade since in power again. During the last 18 months of that admin, he rectified 20 years of troubles and the Taliban did not take one US life. I wish the news would present that narrative. I miss those days.",
            "title_similarity": "0.5221623"
        },
        {
            "id": "i2wdmox",
            "score": 0,
            "text": "You can thank Obama for that one.",
            "title_similarity": "0.23751651"
        },
        {
            "id": "i2wdmz5",
            "score": 0,
            "text": "'Coulda, woulda, shoulda'",
            "title_similarity": "0.21731701"
        },
        {
            "id": "i2we421",
            "score": 0,
            "text": "The horrors of Israeli's army could've also been avoided if world leaders had punished them already but you are supporting them, Zelensky.",
            "title_similarity": "0.7267059"
        },
        {
            "id": "i2wex5q",
            "score": 0,
            "text": "I wonder how we'll react when China inevitably invades Taiwan. USA will come to their aid, and with that NATO article 5 will be triggered if China attacks American troops.",
            "title_similarity": "0.61501914"
        },
        {
            "id": "i2wgbvw",
            "score": 0,
            "text": "Sure wish the USA had chosen to not only be energy independent, but produce enough energy to supply NATO. Other than energy and fertilizer, we don’t need Russia. Treat them as if they were North Korea.",
            "title_similarity": "0.6534238"
        },
        {
            "id": "i2wgmcz",
            "score": 0,
            "text": "The amount of people on Reddit advocating for war these days is truly terrifying.\n\nEdit: spelling",
            "title_similarity": "0.479068"
        },
        {
            "id": "i2whwd2",
            "score": 0,
            "text": "Could Ukraine at that time have fought like today? I don't think so.",
            "title_similarity": "0.52641976"
        },
        {
            "id": "i2wi39g",
            "score": 0,
            "text": "Ok but we didn’t. dont live in the past",
            "title_similarity": "0.28526506"
        },
        {
            "id": "i2wi3j2",
            "score": 0,
            "text": "2014 feels like 3-years-ago...",
            "title_similarity": "0.23052967"
        },
        {
            "id": "i2wi5j0",
            "score": 0,
            "text": "And trying to place this guilt on world leaders will accomplish... what?",
            "title_similarity": "0.5238991"
        },
        {
            "id": "i2wivyx",
            "score": 0,
            "text": "HAHAHAHAHA, this guy is truly a comedian.",
            "title_similarity": "0.11705328"
        },
        {
            "id": "i2wjt1g",
            "score": 0,
            "text": "This is a hyper reality, digital selves, reality ended in the 90’s. Still the best decade.",
            "title_similarity": "0.27750748"
        },
        {
            "id": "i2wlpoo",
            "score": 0,
            "text": "Uhhh…",
            "title_similarity": "-0.027916001"
        },
        {
            "id": "i2wmx6t",
            "score": 0,
            "text": "hey what else happened in 2014 that lead to this",
            "title_similarity": "0.40835992"
        },
        {
            "id": "i2wmys1",
            "score": 0,
            "text": "The guy needs to be a little more grateful for the support he IS getting and a little less preachy. He's going to lose a lot of people's support if he keeps doing this. Not the first time.",
            "title_similarity": "0.48298097"
        },
        {
            "id": "i2wn7o0",
            "score": 0,
            "text": "This guy spouts continuous jargon",
            "title_similarity": "0.115325294"
        },
        {
            "id": "i2wnknc",
            "score": 0,
            "text": "It could also have been avoided if you got your civil war under control within 8 years.",
            "title_similarity": "0.6202148"
        },
        {
            "id": "i2wnz9s",
            "score": 0,
            "text": "his blame of everyone but ukraine is getting old. why didn’t ukraine? it’s their damn country.",
            "title_similarity": "0.53905"
        },
        {
            "id": "i2wpq2c",
            "score": 0,
            "text": "Who was in office then?",
            "title_similarity": "0.06272064"
        },
        {
            "id": "i2wptbs",
            "score": 0,
            "text": "Coulda, woulda ,shoulda",
            "title_similarity": "0.17503136"
        },
        {
            "id": "i2wr2cb",
            "score": -4,
            "text": "It’s his Country. Not the world leaders country. \nHe is obligated to defend it. I’m tired of seeing these entitled headlines. \nBoth him and Putin are shit leaders and it’s evident the quality of life of their people. \nStop posting about this glorified neighbor feud. \n\nI’m not sure what is worse. The incessant lying or demands made by both sides.",
            "title_similarity": "0.61553824"
        },
        {
            "id": "i2ws51m",
            "score": 0,
            "text": "I'm hearing him say the Judas McConnell from Kentucky has Ukrainian blood on his hands.",
            "title_similarity": "0.48415166"
        },
        {
            "id": "i2wtgyt",
            "score": 0,
            "text": "Captain obvious",
            "title_similarity": "0.051163245"
        },
        {
            "id": "i2wu3vy",
            "score": 0,
            "text": "Which red-line was that?  That commander-and-chief let every world power run roughshod over the USA",
            "title_similarity": "0.4608675"
        },
        {
            "id": "i2wwnjg",
            "score": 0,
            "text": "Hindsight is 20/20.... nothing is ever this simple",
            "title_similarity": "0.26547098"
        },
        {
            "id": "i2wx22p",
            "score": 0,
            "text": "Ya. Probably. But I’m not getting into a big brawl in a bar because a friend of a friend got sucker punched.",
            "title_similarity": "0.54144585"
        },
        {
            "id": "i2wxlws",
            "score": 0,
            "text": "LOL! Such a puppet!",
            "title_similarity": "0.099066176"
        },
        {
            "id": "i2wygk9",
            "score": 0,
            "text": "Remind me again who it was that orchestrated the coup of the Ukrainian government in 2014?",
            "title_similarity": "0.6236719"
        },
        {
            "id": "i2x4vpy",
            "score": 0,
            "text": "I'm pretty sure they had a vote in Crimea, and the people chose to join Russia",
            "title_similarity": "0.54266274"
        },
        {
            "id": "i2x6x0h",
            "score": 0,
            "text": "I only care if his rock hard nips were showing in his baby gap t shirt",
            "title_similarity": "0.37955955"
        },
        {
            "id": "i2x72h2",
            "score": 0,
            "text": "Or if world did anything about Ukrainian army shelling their own citizens in Donbas for 8 years",
            "title_similarity": "0.488347"
        },
        {
            "id": "i2x9czw",
            "score": 0,
            "text": "I agree with Zelensky.  In addition, world leaders should have punished NATO whenever they did anything like they did in Libya or Yugoslavia, but they didn't.  Interesting...",
            "title_similarity": "0.7184078"
        },
        {
            "id": "i2xa17p",
            "score": 0,
            "text": "And you should have admitted Trump pressured you, shut up.",
            "title_similarity": "0.6716323"
        },
        {
            "id": "i2xaway",
            "score": 0,
            "text": "He overestimates Ukraine’s worth to the world. At best they supply wheat and corn.",
            "title_similarity": "0.4430256"
        },
        {
            "id": "i2xcih2",
            "score": 0,
            "text": "ctrl + F \"Obama\" - 2 mentions\n\nctrl + F \"Trump\" - 13 mentions\n\nNever change, Reddit.",
            "title_similarity": "0.45863608"
        },
        {
            "id": "i2xckwo",
            "score": 0,
            "text": "Obama and Joe fucked it up.",
            "title_similarity": "0.34761742"
        },
        {
            "id": "i2xd623",
            "score": 0,
            "text": "That was Obama. Who had ZERO support from the Republithug party....and the entire WORLD knows what a shit show the next 4 yrs were...America is not the guardian of the galaxy...",
            "title_similarity": "0.48267096"
        },
        {
            "id": "i2xdc5o",
            "score": 0,
            "text": "This guy has the authority? What has he done to quell tensions?  Come on man",
            "title_similarity": "0.3636673"
        },
        {
            "id": "i2xe05m",
            "score": 0,
            "text": "Or he maybe, just maybe had an agreement with Russia, or maybe just maybe give up and stopped the war, but he doesn't care about goym, he sits in his castle while others die for nothing.",
            "title_similarity": "0.62469137"
        },
        {
            "id": "i2xep2s",
            "score": 0,
            "text": "Yep he’s totally right. Obama and Biden make democrats look weak rn. Biden needs to put Putin in his place",
            "title_similarity": "0.66165805"
        },
        {
            "id": "i2xiag7",
            "score": 0,
            "text": "Well, yes.",
            "title_similarity": "-0.08162792"
        },
        {
            "id": "i2xicre",
            "score": 0,
            "text": "I mean... yeah? I was only a high school Junior when this happened and I recall talking to a friend of mine about how it was clearly the first steps into a major global conflict that would come to be actualized no more than 10 years from then. It seemed pretty obvious.",
            "title_similarity": "0.36331698"
        },
        {
            "id": "i2xj6dg",
            "score": 0,
            "text": "The punishment for this 2022 invasion should be handing back Crimea to Ukraine, exiting all of Ukraine and setting up a 10 mile deep DMZ on the Russian side of the border.",
            "title_similarity": "0.6677997"
        },
        {
            "id": "i2xj76b",
            "score": 0,
            "text": "Yep, every one is so afraid to hold anyone accountable anymore!  It should have never stood and maybe this would have never happened.",
            "title_similarity": "0.52613485"
        },
        {
            "id": "i2xj7sm",
            "score": 0,
            "text": "As I am learning… I must agree.",
            "title_similarity": "0.08782823"
        },
        {
            "id": "i2xjst4",
            "score": 0,
            "text": "Not even a slap on the wrist, why the fuck not go a little further?",
            "title_similarity": "0.3488109"
        },
        {
            "id": "i2xl19m",
            "score": 0,
            "text": "The war would not have started if the West paid more attention to Belarus instead of “expressing concern”.",
            "title_similarity": "0.7066592"
        },
        {
            "id": "i2xl76y",
            "score": 0,
            "text": "I agree with this",
            "title_similarity": "-0.04370729"
        },
        {
            "id": "i2xlilp",
            "score": 0,
            "text": "\"The 1970s called and nobody answered.\"\n\n-Romney",
            "title_similarity": "0.2970248"
        },
        {
            "id": "i2xm593",
            "score": 0,
            "text": "100% correct.",
            "title_similarity": "-0.0135948025"
        },
        {
            "id": "i2xmj06",
            "score": 0,
            "text": "I agree",
            "title_similarity": "-0.07709621"
        },
        {
            "id": "i2xmtzf",
            "score": 0,
            "text": "As an American. The “war on Ukraine” is a much more noble and deserving war we should enter into. Not the damn iraq war on terror that they knew was never a thing. \n\nThey’re afraid of a nuclear war? Do you think Putin wants Russia nuked? Because that’s what would happen.. he isn’t going to nuke shit. Call him on his bluff and put Ukraine into NATO\n\nEdit: of course when I say noble, I mean fighting with Ukraine against Russia.",
            "title_similarity": "0.7729775"
        },
        {
            "id": "i2xn6as",
            "score": 0,
            "text": "He's not wrong.\n\nAnd the future horrors will be that much worse if we don't properly punish the current invasion.",
            "title_similarity": "0.65261126"
        },
        {
            "id": "i2xnhfe",
            "score": 0,
            "text": "Not only that, but we were and are in breach of the Budapest Agreement by not providing assistance.",
            "title_similarity": "0.5132549"
        },
        {
            "id": "i2xnkq8",
            "score": 0,
            "text": "That’s like saying all the death / conflict in Gaza could be avoided if the world just punish Israel occupation.\n\nAll true, but world mostly don’t care.",
            "title_similarity": "0.68400013"
        },
        {
            "id": "i2xq0h5",
            "score": 0,
            "text": "True that",
            "title_similarity": "-0.075294256"
        },
        {
            "id": "i2xtz7l",
            "score": 0,
            "text": "💯",
            "title_similarity": "-0.04726914"
        },
        {
            "id": "i2xu92d",
            "score": 0,
            "text": "Yup",
            "title_similarity": "-0.01758259"
        },
        {
            "id": "i2ynmnj",
            "score": 0,
            "text": "How would you punish a president who only wish to protect his country's interests and its people?",
            "title_similarity": "0.63160926"
        },
        {
            "id": "i2yoxi6",
            "score": 0,
            "text": "Horrors couldve been avoided if he didnt send his ppl and neonazis to fight along to die",
            "title_similarity": "0.6974596"
        },
        {
            "id": "i2yr6yc",
            "score": 0,
            "text": "Russian asset Trump was in power then",
            "title_similarity": "0.4863139"
        },
        {
            "id": "i2zcnbh",
            "score": 0,
            "text": "Not a single time have seen him speaking about so many problems of his country that have worsened under him, nazis problem, widespread racism, corruption, killings of civilians in Donetsk, Lugansk, .... never ever.",
            "title_similarity": "0.43778408"
        },
        {
            "id": "i2v3d54",
            "score": 336,
            "text": "He ain’t wrong. For too long did world leaders let Putin play dangerous games. Plenty of opportunity to put him in his place in the past. Dark part of Merkels legacy.",
            "title_similarity": "0.5870694"
        },
        {
            "id": "i2w5qge",
            "score": 9,
            "text": "Or you know.... invading Georgia\n\nOr poisoning people",
            "title_similarity": "0.44222438"
        },
        {
            "id": "i2v8dux",
            "score": 10,
            "text": "Possibly true, but not a very helpful statement.",
            "title_similarity": "0.327693"
        },
        {
            "id": "i2v81o9",
            "score": 66,
            "text": "Or in Syria …",
            "title_similarity": "0.17953381"
        },
        {
            "id": "i2vgmms",
            "score": 4,
            "text": "Gosh, it’s almost like appeasement didn’t work. If only we had some recent history in the last century to show us the error of that strategy…. 🤔",
            "title_similarity": "0.64964634"
        },
        {
            "id": "i2vun7r",
            "score": 5,
            "text": "They thought they could appease Hitler too, We never fucking learn.",
            "title_similarity": "0.5245697"
        },
        {
            "id": "i2vj5lr",
            "score": 5,
            "text": "NGL, when I saw Putin was trying to justify the invasion by saying Ukraine used to be part of Russia, I laughed out loud. Only because I recently got around to watching Vikings, and the leader of the Rus says the *exact* same thing about why he wants to invade Norway. Oddly prescient.",
            "title_similarity": "0.68858856"
        },
        {
            "id": "i2vqtqg",
            "score": -6,
            "text": "This is fake news.  Obama/Biden FULLY punished Putin for what he did.  Biden is the ONLY one that went toe to toe with Putin.\n\nTruth is that Putin is VERY scared of Biden and that's why Putin won't ever invade Ukraine.  This is all fake news from Trumpers, there is no invasion, they're just pissed they lost the election.",
            "title_similarity": "0.69371414"
        },
        {
            "id": "i2v8wey",
            "score": -1,
            "text": "Can anyone disagree??!",
            "title_similarity": "0.20885627"
        },
        {
            "id": "i2vac9i",
            "score": -1,
            "text": "Absolutely. He took Crimea without firing a single bullet. Had he did what he's doing right now just in Crimea, I think he would've been sanctioned just has hard.",
            "title_similarity": "0.7356399"
        },
        {
            "id": "i2vau4q",
            "score": 1,
            "text": "This is true. All of these fancy politicians who were swallowing putin's burps should be punished by their voters.",
            "title_similarity": "0.60038537"
        },
        {
            "id": "i2vcazp",
            "score": 1,
            "text": "And syria, and georigia, and chechenia.",
            "title_similarity": "0.29895246"
        },
        {
            "id": "i2vdlle",
            "score": -1,
            "text": "Europe and USA are going to shit with weak leaders from the left wing.\n\nRather have a right winger who will be buddy buddy with Putin but be firm in agresion like Trump was than these scared pussies who don't want agresion but are not willing to fight either.\n\nHe didn't dare try anything with Trump he respected him he knew where he could get favour and where not meanwhile the weakling s of today are being pushed around.",
            "title_similarity": "0.6960248"
        },
        {
            "id": "i2vev1f",
            "score": 1,
            "text": "It was one of the many failures of the Obama administration",
            "title_similarity": "0.35580024"
        },
        {
            "id": "i2vf5dg",
            "score": 1,
            "text": "Zelenskyy is telling an important truth here. We must remember this.",
            "title_similarity": "0.28346997"
        },
        {
            "id": "i2vfh6k",
            "score": -1,
            "text": "I disagree with this. If Russia got heavily sanctioned then like it is now they would have just invaded and taken over all of Ukraine. Ukraine was far weaker back then and would have easily been steamrolled by Russia. \n\nSo its better for Ukraine that Russia wasn't provoked to attack back then and is instead attack now when Russia is weaker and Ukraine is stronger.",
            "title_similarity": "0.81053233"
        },
        {
            "id": "i2vglca",
            "score": 1,
            "text": "And if the Western coalition doesn't effectively degrade Russia economically, technologically, diplomatically, and militarily (by ramping up arms and materiel aid to Ukraine) in 2022, the world will face an even more aggressive and imperialistic Russia bent on conquering its neighbors in another few years.",
            "title_similarity": "0.71502125"
        },
        {
            "id": "i2vi29g",
            "score": 1,
            "text": "Biden VP then, President now. Weird",
            "title_similarity": "0.34218028"
        },
        {
            "id": "i2vj8za",
            "score": 1,
            "text": "Failing that, any number of nations could have sent military aid to dissuade a Russian invasion",
            "title_similarity": "0.7016506"
        },
        {
            "id": "i2vjx3y",
            "score": 1,
            "text": "America was under russian cyber attack even back then but we didn'tk now.",
            "title_similarity": "0.70537823"
        },
        {
            "id": "i2vkft2",
            "score": 1,
            "text": "Dammit obama!",
            "title_similarity": "0.2696467"
        },
        {
            "id": "i2vli3l",
            "score": 1,
            "text": "Possibly stupid question: why didn’t Ukraine mount a similarly enthusiastic defense when Crimea was invaded? I know Zelenskyy wasn’t in power then; Is that the only factor that’s significantly different, or is there some other reason (geography, political leanings of that particular region, etc.)?",
            "title_similarity": "0.75655264"
        },
        {
            "id": "i2vljhg",
            "score": 1,
            "text": "Hindsight is always 20/20.",
            "title_similarity": "0.23482466"
        },
        {
            "id": "i2vlpsb",
            "score": 1,
            "text": "The inaction of the west in 2014 directly led to the Russian misinformation campaign to help elect Trump and push for Brexit. Putin is directly responsible for the erupt disruption of global order in the last decade.",
            "title_similarity": "0.75323486"
        },
        {
            "id": "i2vmb8z",
            "score": -1,
            "text": "Right now the world, and Russia is at a turning point. It’s been discovered that Russia is a paper tiger and they’ve had to re-adjust their objectives for this war they started. \n\nI’m that though what we’re seeing is Putin now making drastic internal changes. We have to assume that Putin is intelligent enough to enact changes that will not just rebuild the Russian armed forces, but also make it better and more capable. \n\nIt’s easy to laugh at how ineffective the Russian forces are now. To assume that they’re an ineffective fighting force and that Europe can breathe a collective sigh of relief. The reality is, given time and breathing room, the Russian armed forces can rebuild and become a competitive military force. They will learn and they will adapt. \n\nThe question that Europe, and the world needs to ask is: “Do we let them?”\n\nStrategically, it’s a mistake. We should not give them breathing room or quarter. The sanctions are doing a decent job of this. Ukraine should continue to be supported to the nth degree to push Russian forces off their soil completely and entirely. We should be funding separatist elements within Russia and within other contested regions Russia has be involved in to do the same. If we do not take advantage of their sorry state of affairs now, that opportunity may not exist later. \n\nRussia is not an ally, they will not be if their current form of governance and influence is allowed to exist then this will be a problem again in a decade. We will see them keep going back to soft projections by trying to influence elections, plying on social media, etc.",
            "title_similarity": "0.7057389"
        },
        {
            "id": "i2vmfvr",
            "score": 1,
            "text": "U rite u rite",
            "title_similarity": "0.07902536"
        },
        {
            "id": "i2vmxmv",
            "score": 1,
            "text": "Thanks Barack and Joe, back to back democrat simps for Russia.",
            "title_similarity": "0.55147684"
        },
        {
            "id": "i2vndrt",
            "score": 1,
            "text": "This is why I always laughed when Biden would say during the campaign that'd he'd be tough on Russia unlike Trump. Like my dude you were VP when we just let them take Crimea and they blew up a passenger jet just a few years after telling Russia you'd be more flexible after the 2012 election.",
            "title_similarity": "0.6535001"
        },
        {
            "id": "i2vnfty",
            "score": 1,
            "text": "He's not wrong. Also can we get to the part where we start noticing genocide / concentration camps in China?\n\nWhy are we doing a re-run of the 1930's?",
            "title_similarity": "0.4916484"
        },
        {
            "id": "i2vnzsq",
            "score": 1,
            "text": "This was, in my opinion, Obama’s greatest blunder.",
            "title_similarity": "0.42121017"
        },
        {
            "id": "i2vo1ce",
            "score": 1,
            "text": "Zelensky would also be correct.",
            "title_similarity": "0.20826682"
        },
        {
            "id": "i2vo2ab",
            "score": 1,
            "text": "And we wouldn't have crime if we would just make it illegal...",
            "title_similarity": "0.4676696"
        },
        {
            "id": "i2vo5kb",
            "score": 1,
            "text": "Another data point that shows Appeasement policies are irresponsible and that Neville chamberlain was never a good role model. Peace in our time, my ass.",
            "title_similarity": "0.55998284"
        },
        {
            "id": "i2vo9nn",
            "score": 1,
            "text": "Or the 2008 attack on Georgia.",
            "title_similarity": "0.397408"
        },
        {
            "id": "i2voz4t",
            "score": 1,
            "text": "Don't forget how everybody ignored them invading Georgia a few years before that. Appeasement is how WWII started.",
            "title_similarity": "0.50913054"
        },
        {
            "id": "i2vp3kz",
            "score": 1,
            "text": "Or Georgia or Chechnya",
            "title_similarity": "0.28027076"
        },
        {
            "id": "i2vppie",
            "score": 1,
            "text": "No, it could have been avoided if Ukraine would have joined NATO when they had the chance.",
            "title_similarity": "0.8055161"
        },
        {
            "id": "i2vq6sq",
            "score": 1,
            "text": "Thee truth is Putin wanted all of Ukraine but he didn't expect them to put up such a fight, what's he going to do? Nuke them? He can't ..so basically he's giving up and settling for Donbas and the border regions, while he's at it he might as well ruin their economy by bombing the shit out of them to the point that it will take decades to repair. The worst part about it is we are all going to pay for this invasion one way or another..either by higher oil prices or aid packages that could have been used to help your own people.",
            "title_similarity": "0.7375037"
        },
        {
            "id": "i2vq7om",
            "score": 1,
            "text": "He's not wrong.\n\nOk he's right.",
            "title_similarity": "0.04732978"
        },
        {
            "id": "i2vq7wv",
            "score": 1,
            "text": "He's 0% wrong.",
            "title_similarity": "0.176667"
        },
        {
            "id": "i2vq8pm",
            "score": 1,
            "text": "tbh if ukraine had kept their nuclear weapons this could also have been avoided. granted that’s not the best option, but the rest of the world has now been put on notice if they weren’t already.",
            "title_similarity": "0.7756425"
        },
        {
            "id": "i2vqi61",
            "score": -1,
            "text": "Iraq and africa did not cry this much",
            "title_similarity": "0.17496943"
        },
        {
            "id": "i2vqke6",
            "score": 1,
            "text": "Besides not punishing Russia in any meaningful way, many European countries became increasingly dependent on energy imports from Russia. Germany is particularly short sighted in their dealings with Russia and China. Now that the position becomes untenable, they find themselves in a difficult spot. \n\nPutin made a bet that the EU would be spineless as usual because, what, you gonna punish your main energy source? It backfired in his face, sure. But the EU will also have a difficult time ahead. This could have been mitigated. Perhaps Putin would have come to a different conclusion if the EU isn't so dependent on Russian oil and gas.",
            "title_similarity": "0.7097422"
        },
        {
            "id": "i2vr7pz",
            "score": 1,
            "text": "Obama dropped a lot of balls if we’re honest",
            "title_similarity": "0.4490569"
        },
        {
            "id": "i2vre99",
            "score": -1,
            "text": "[https://en.wikipedia.org/wiki/Euromaidan](https://en.wikipedia.org/wiki/Euromaidan)\n\nEuromaidan was Ukraine's January 6th. A minority overthrew the democratically elected president in 2014.\n\nLooking at the participants, you can see that it was the far-right and right that couped the government, while the center, left, and far-left opposed them.\n\nThis is who you're supporting.",
            "title_similarity": "0.6755035"
        },
        {
            "id": "i2vsbos",
            "score": 1,
            "text": "For someone who is leading a country that is currently being invaded, he seems to have an awful lot of free time to be putting out all these statements…",
            "title_similarity": "0.29923537"
        },
        {
            "id": "i2vsucn",
            "score": -1,
            "text": "Stupid Israeli puppet comedian doesn't know that nuclear war no one wants except him , Israel and USA",
            "title_similarity": "0.513377"
        },
        {
            "id": "i2vsw46",
            "score": 1,
            "text": "*Shoulda, woulda, coulda.  \nDidn’t.*\n\nThe moto of most governments.",
            "title_similarity": "0.37713233"
        },
        {
            "id": "i2vsy82",
            "score": 1,
            "text": "Truth be told",
            "title_similarity": "0.059929725"
        },
        {
            "id": "i2vt0hq",
            "score": 1,
            "text": "CTRL F \"Trump\" - 25 matches   \nCTRL F \"Obama\" - 14 matches  \nHmmm.",
            "title_similarity": "0.4088126"
        },
        {
            "id": "i2vtdpd",
            "score": 1,
            "text": "UK here: We did impose some sanctions, and Russia retaliated by heavily influencing the Brexit vote and fucking us over for decades to come.\n\nSee also: Trump in the US",
            "title_similarity": "0.6118517"
        },
        {
            "id": "i2vtfkq",
            "score": 1,
            "text": "That’s true. We sat on our big fat gold butts!",
            "title_similarity": "0.0843434"
        },
        {
            "id": "i2vtmq6",
            "score": 1,
            "text": "Yes.",
            "title_similarity": "-0.086177744"
        },
        {
            "id": "i2vtmx6",
            "score": 1,
            "text": "But there was this whole pre WW2 tradition called appeasement that worked so well",
            "title_similarity": "0.33765066"
        },
        {
            "id": "i2vtpua",
            "score": -1,
            "text": "Democrats were the ones in power....and no invasion or advancement happened under Trump, and now they invaded again under democrats. I'm just saying.",
            "title_similarity": "0.52740836"
        },
        {
            "id": "i2vtuy2",
            "score": 1,
            "text": "Lets be honest, if ukranians in Crimea resisted, like they are resisting now,  Russia would be punished to the level of current sanctions in 2014.",
            "title_similarity": "0.81847155"
        },
        {
            "id": "i2vu1xn",
            "score": 1,
            "text": "Why is everything Zelenskyy says news now?",
            "title_similarity": "0.3233958"
        },
        {
            "id": "i2vv8p0",
            "score": 1,
            "text": "Zelensky has a point.  \n\nBut the western world also started arming and training the Ukrainian troops, which is the reason why Putin’s war is failing now.",
            "title_similarity": "0.6721401"
        },
        {
            "id": "i2vvl2n",
            "score": 1,
            "text": "It was a failure of the Obama presidency. He did too little too late when it came to Russia and Putin. I am not a Republican or Trumpist, I liked a lot of things Obama accomplished but I thought the Russian aspect of his foreign policy sucked",
            "title_similarity": "0.694612"
        },
        {
            "id": "i2vw4od",
            "score": 1,
            "text": "Its seems Russia only makes moves when the US has a democrat in office. 🤷‍♂️",
            "title_similarity": "0.5769109"
        },
        {
            "id": "i2vwuay",
            "score": 1,
            "text": "Gonna have to agree with that one. But sometimes the US gets a loooooot of pushback when we try to meddle in world affairs, so I can't imagine it was an easy political climate to navigate.",
            "title_similarity": "0.5960957"
        },
        {
            "id": "i2vwzal",
            "score": 1,
            "text": "Obama was in charge. Putin was helping in Iraq/Syria plus the Ukrainian dictator was just ousted & Putin did nothing but later took Crimea.",
            "title_similarity": "0.7406244"
        },
        {
            "id": "i2vwzna",
            "score": 1,
            "text": "True.",
            "title_similarity": "-0.07547066"
        },
        {
            "id": "i2vx4ao",
            "score": -1,
            "text": "I just cant get my head straight to the fact that a dictator in a communist country is attacking full swing a democracy and the world is like…. Ngl doing much, but not enough. The entire west should be sending tanks, planes, SAMS, pile stocks of weapons. Everything needed to stop Putin. More!",
            "title_similarity": "0.63982195"
        },
        {
            "id": "i2vxci0",
            "score": -1,
            "text": "That’s only cuz we had the big pussy in the white house, the donald, who was to chicken to do anything about it. People forget that Russia went into the crimeria and was already meddling in the donbas when trump was in office.",
            "title_similarity": "0.6303528"
        },
        {
            "id": "i2vymt2",
            "score": 1,
            "text": "Well. That is true.",
            "title_similarity": "-0.07044381"
        },
        {
            "id": "i2vzje6",
            "score": 1,
            "text": "The comedian says he knows what is better after the fact. What a genius.",
            "title_similarity": "0.33936262"
        },
        {
            "id": "i2w12lq",
            "score": 1,
            "text": "He's right! This is what appeasement gets you. And yet there are still appeasers out there right now, alas.",
            "title_similarity": "0.2945708"
        },
        {
            "id": "i2w1gm3",
            "score": -1,
            "text": "crimea wanted to join russia",
            "title_similarity": "0.5746691"
        },
        {
            "id": "i2w1o57",
            "score": 1,
            "text": "That was Trump fault for not punishing Putin in 2014 when Crimea was invaded.",
            "title_similarity": "0.8353936"
        },
        {
            "id": "i2w1rjf",
            "score": -1,
            "text": "I wonder how Germans feel given their history of supporting genocides. First directly in WWII, and then indirectly during the last 8 years. \n\nOh, the shame of being German.",
            "title_similarity": "0.5421804"
        },
        {
            "id": "i2w2d48",
            "score": -1,
            "text": "This dude is trying to lose the support he has. I can’t believe he is blasting the rest of the world who are literally keeping his country alive. He needs to be quiet and be grateful the world is risking anything at all for him. My opinion of him has drastically changed since the start of the war.",
            "title_similarity": "0.5851716"
        },
        {
            "id": "i2w2jf6",
            "score": 1,
            "text": "He is correct.",
            "title_similarity": "-0.0011615613"
        },
        {
            "id": "i2w2pg1",
            "score": 1,
            "text": "Many who pointed this out earlier were downvoted to oblivion and accused of whataboutism.",
            "title_similarity": "0.365678"
        },
        {
            "id": "i2w327l",
            "score": 1,
            "text": "Agreed, but they didn't. So. What's next?",
            "title_similarity": "0.27929515"
        },
        {
            "id": "i2w37fc",
            "score": 1,
            "text": "News media played a huge part in that too, at least as far as I’m aware for the US. Just a quick cover piece and off to something else. Like, a whole ass invasion of another country isn’t top news worthy? WTAF.",
            "title_similarity": "0.5451241"
        },
        {
            "id": "i2w39ce",
            "score": 1,
            "text": "He’s not wrong…I wonder where else we’ve seen a lack of consequences creating a situation that emboldens extremists…",
            "title_similarity": "0.5208203"
        },
        {
            "id": "i2w3cd2",
            "score": 1,
            "text": "Umm... This is not going to get me a ton of upvotes, but really.. this has happened. We won't be able to change it anymore.\n\nThis could have been avoided if the West had taken a stronger stance during Crimea's occupation. Definitely true.\n\nBUT: then it's equally true that this whole mess would never have happened if Ukraine had not given up it's nukes in the nineties.\n\nUntil recently, the entire planet operated under the assumption that the Russians would not be a bunch of Serbia-level war criminals. And we were all wrong.\n\nSo.. yea.. we can all start pointing fingers at each other, but what is that going to achieve?",
            "title_similarity": "0.8030742"
        },
        {
            "id": "i2w3i0p",
            "score": -1,
            "text": "Coming from the guy that dammed the only water supply to the Crimea. Subsequently starving the what was supposed to be fellow Ukrainians.\n\nhttps://thehill.com/policy/equilibrium-sustainability/597910-how-a-ukrainian-dam-played-a-key-role-in-tensions-with/",
            "title_similarity": "0.59908605"
        },
        {
            "id": "i2w3qp6",
            "score": -1,
            "text": "The Crimean has been part of Russia proper longer than all major US bases put together. Punishing Russia would have brought on WWIII.",
            "title_similarity": "0.6258562"
        },
        {
            "id": "i2w48d9",
            "score": 1,
            "text": "Literally. We condemned it but didn't really care much more than that. We did the same thing with Yemen. Out of sight, out of mind.",
            "title_similarity": "0.5192798"
        },
        {
            "id": "i2w4seh",
            "score": 1,
            "text": "He's 100% correct. If the world doesn't get more aggressive with Putin this time around, Russia will feel like it can get away with absolutely anything.",
            "title_similarity": "0.5926557"
        },
        {
            "id": "i2w4y4m",
            "score": 1,
            "text": "I've thought that since all this kicked off. \n\nI never really understood why Obama just let it happen. \n\nI don't remember there even being much pushback other than \"Yep, Russia just did that. Jerks.\"",
            "title_similarity": "0.6282296"
        },
        {
            "id": "i2w4ya9",
            "score": 1,
            "text": "He is correct",
            "title_similarity": "0.004919216"
        },
        {
            "id": "i2w50mo",
            "score": 1,
            "text": "I mean, he has a point",
            "title_similarity": "0.10946527"
        },
        {
            "id": "i2w5cwc",
            "score": 1,
            "text": "Obama",
            "title_similarity": "0.17466983"
        },
        {
            "id": "i2w6f43",
            "score": 1,
            "text": "Us and uk shouldn’t have pro vacated Putin with ur help. Every day u become less heroic.",
            "title_similarity": "0.68033993"
        },
        {
            "id": "i2w75z6",
            "score": 1,
            "text": "Or go back even further to Putin's invasion of Georgia",
            "title_similarity": "0.64020777"
        },
        {
            "id": "i2w767n",
            "score": 1,
            "text": "This goes way back beyond that. Trump completely ruined the US and NATO from doing anything. Before that Obama drew a line in Syria and when Putin crossed it nothing happened. Why would he think anyone would do something when we've made veiled threats before then let him get away with everything he did?",
            "title_similarity": "0.7259215"
        },
        {
            "id": "i2w78lf",
            "score": 1,
            "text": "Correct",
            "title_similarity": "-0.06604809"
        },
        {
            "id": "i2w796l",
            "score": 1,
            "text": "Agreed.",
            "title_similarity": "-0.071089834"
        },
        {
            "id": "i2w7mhi",
            "score": -1,
            "text": "damn... you gotta wonder what bonehead was \"the leader of the free world\" at the time!",
            "title_similarity": "0.39067632"
        },
        {
            "id": "i2w82zi",
            "score": -1,
            "text": "Thank Obama and Biden for that.",
            "title_similarity": "0.20841347"
        },
        {
            "id": "i2w8v5a",
            "score": 1,
            "text": "He makes a legit point",
            "title_similarity": "0.18460949"
        },
        {
            "id": "i2w8v9g",
            "score": -1,
            "text": "I think he forgot who was president and vp of USA at the time. That’s why it’s happening again.",
            "title_similarity": "0.5369678"
        },
        {
            "id": "i2w93aa",
            "score": -1,
            "text": "hmmm, who was potus and vpotus during that take over?",
            "title_similarity": "0.21563724"
        },
        {
            "id": "i2wa4v8",
            "score": 1,
            "text": "Zelenskyy really needs to forget about Crimea, the people there do not want to live in Ukraine. They've been trying to leave Ukraine since the 90's, even if we ignore both referendums, independent EU done surveys shows vast majority support joining Russia. That was nothing like the attack on Ukraine since it wasn't an attack at all.",
            "title_similarity": "0.7353641"
        },
        {
            "id": "i2waekd",
            "score": 1,
            "text": "Excellent use of \"I told you so\".",
            "title_similarity": "0.094998725"
        },
        {
            "id": "i2waj95",
            "score": -1,
            "text": "I don’t care",
            "title_similarity": "0.124829546"
        },
        {
            "id": "i2wcnwc",
            "score": 1,
            "text": " Zelensky is right 100% on that one.",
            "title_similarity": "0.06803937"
        },
        {
            "id": "i2wcqtk",
            "score": 1,
            "text": "He's absolutely right. This is exactly why you don't let assholes like Putin get away with such transgressions. Same reason why Trump needs to be held accountable for his crimes.",
            "title_similarity": "0.69490826"
        },
        {
            "id": "i2wct1x",
            "score": 1,
            "text": "Better late than never but he is right",
            "title_similarity": "0.3138811"
        },
        {
            "id": "i2wcybc",
            "score": 1,
            "text": "As per usual:\n\nHe is not wrong, but it is also coming from the perspective of someone who is 100% invested in Ukraine specifically and not global stability.\n\nThe specter of nuclear war is what's underpinning the *global* responses to these events, which is naturally going to warrant cautious responses from third parties.\n\nHis stance is understandable, but so is the rest of the world's.\n\nHe wants us to set up a no-fly zone. Rest of the world is like \"uhh, and start a shooting war with a nuclear power?\" Obviously Ukraine is ALREADY in a shooting war, and doesn't care. The rest of the world has to care. The existential threat has already busted down Ukraine's door, and so naturally Ukraine and the rest of the world are going to have different priorities on a broader existential threat.\n\nHe wants more weapons. Again. Rest of the world is like \"and escalate a proxy conflict with a nuclear power?\" He's ALREADY in an escalated conflict with a nuclear power, and rightfully doesn't care. The rest of the world rightfully DOES care.\n\nIt is possible for both the Western world AND for the President of Ukraine to be rational and correct in their actions.",
            "title_similarity": "0.6636238"
        },
        {
            "id": "i2wd3pt",
            "score": -1,
            "text": "The 'horrors of Russian invasion' could have been avoided if:\n\n1. Maintain neutrality with Russia and NATO and reassure Russia that you won't host NATO troops on Russia's doorstep.\n(Doesn't mean you can't trade and build your economy though)\n\n2. Stop corruption from crippling your military so you can actually defend yourself instead of crying that someone else needs to do it for you. Weakness invites aggression.\n\n3. Crimea's lease on hosting Russian navy assets was about to expire, Russia didn't want to lose that. \n\nYou don't have to be subservient, but you should try not to piss them off either. The Nordic countries have been doing that for a while.",
            "title_similarity": "0.7895632"
        },
        {
            "id": "i2wdbij",
            "score": -1,
            "text": "We are still doing nothing, world is horrible place",
            "title_similarity": "0.2666549"
        },
        {
            "id": "i2wg874",
            "score": 1,
            "text": "Yeah I’ve been saying this for years. Everyone just let Crimea happen with zero repercussions. As we all know if a bully gets away with your lunch Day1, he’s more likely to go back for more",
            "title_similarity": "0.4581503"
        },
        {
            "id": "i2wg98j",
            "score": 1,
            "text": "He is correct",
            "title_similarity": "0.0049191955"
        },
        {
            "id": "i2wgeg7",
            "score": 1,
            "text": "And he ain't wrong",
            "title_similarity": "0.017958578"
        },
        {
            "id": "i2wgxg9",
            "score": 1,
            "text": "It doesn’t matter if world leaders did anything in 2014 or not Ukraine was going to happen either way.",
            "title_similarity": "0.5570214"
        },
        {
            "id": "i2wlepa",
            "score": -1,
            "text": "Or, perhaps if Ukraine had stuck to the Minsk agreement and weren’t so corrupt that neither NATO or the EU wanted them to join their respective clubs?",
            "title_similarity": "0.715335"
        },
        {
            "id": "i2wlj2h",
            "score": -1,
            "text": "To everyone who is saying, \"well duh\", wasn't the annexation kinda... legal?  Like it wasn't documented enough at the time to follow what his plan was.  People say tanks/army come in but relatively \"quiet\" and then a resolution to be annexed by Russia came out and the resolution passed.\n\nI remember very little violence and generally it seemed democratic.  It obviously wasnt with hindsight, but to a fast paced world it didn't seem quite obvious was happened until the resolution passed and it was done.\n\nI could be very very wrong, but the main stream opinion towards the whole thing wasn't Russia is invading and annexing a free countries land with impunity.  It was more, social unrest led to a vote which passed so I guess it's Russia's land now.  Once more, obviously wrong with hindsight but i don't remember seeing the opposite on main stream media.",
            "title_similarity": "0.6828794"
        },
        {
            "id": "i2wlzp3",
            "score": 1,
            "text": "Could also have been avoided if he simply stated that Ukraine will never join nato",
            "title_similarity": "0.7486876"
        },
        {
            "id": "i2wm38p",
            "score": 1,
            "text": "For real though why didn't we? I was 12 at the time I wasn't paying attention to world events",
            "title_similarity": "0.38763154"
        },
        {
            "id": "i2wnzre",
            "score": 1,
            "text": "Thank Joe Biden.  Obama and Joe let Putin get away with it.",
            "title_similarity": "0.4988757"
        },
        {
            "id": "i2wp1mx",
            "score": -1,
            "text": "Damn that sucks, anyways",
            "title_similarity": "0.1943256"
        },
        {
            "id": "i2wqpxy",
            "score": 1,
            "text": "Reminds me of the Sudetenland. \n\nHistory repeats itself",
            "title_similarity": "0.3534064"
        },
        {
            "id": "i2ws7mo",
            "score": 1,
            "text": "It’s important to understand Putin I’d not considering his war to be with Ukraine. He speaks of Ukraine abstractly as “territory “. \n\nPutin sees this as war against the USA and more broadly as war again nato and the west.",
            "title_similarity": "0.78942525"
        },
        {
            "id": "i2wt0xx",
            "score": 1,
            "text": "He is looking old by day",
            "title_similarity": "0.03570797"
        },
        {
            "id": "i2wtg17",
            "score": -1,
            "text": "Who was the President at this time??? I will wait...",
            "title_similarity": "0.33927405"
        },
        {
            "id": "i2ww7ot",
            "score": -1,
            "text": "I don’t love reading this. They are getting a lot of support and none of which they are owed. Don’t attack your allies, what good does that do. \n\nUkraine has been in a civil war for 8 years which is at a minimum the reason Russia is providing for the invasion. If the Donbas war hadn’t been going on then maybe Russia would not have invaded. Who knows but Ukraine doesn’t want to talk about it that’s for sure.",
            "title_similarity": "0.68760633"
        },
        {
            "id": "i2wy0l9",
            "score": -1,
            "text": "My ass",
            "title_similarity": "0.042933725"
        },
        {
            "id": "i2wyauq",
            "score": 1,
            "text": "Oh jeez, does that mean this is all Obama’s fault and not Trump’s or Biden’s fault over here in the US?",
            "title_similarity": "0.60416424"
        },
        {
            "id": "i2x6vs5",
            "score": 1,
            "text": "Defend your own country dumbass",
            "title_similarity": "0.4534938"
        },
        {
            "id": "i2x8c3t",
            "score": -1,
            "text": "Zelenskyy is a massive hypocrite, he support’s and praised Israel when they oppress and steal land but is now crying when he is the one on the receiving end.",
            "title_similarity": "0.4710076"
        },
        {
            "id": "i2x8k26",
            "score": -1,
            "text": "How about if Zelensky was pushed a little harder to abide by the Minsk Accords?",
            "title_similarity": "0.51139784"
        },
        {
            "id": "i2xi66v",
            "score": 1,
            "text": "The IS sanctions in 2014 totally fucked Russians economy. Zelensky’s beef should be with Europe. But mostly he’s just saying all this woulda coulda shoulda shit for morale, like his constant no-fly zone bs.",
            "title_similarity": "0.75377065"
        },
        {
            "id": "i2xihnj",
            "score": 1,
            "text": "Yeah but Obama needed flexibility to win the reelection lol.",
            "title_similarity": "0.495476"
        },
        {
            "id": "i2xioxh",
            "score": 1,
            "text": "I agreed with that in 2014 and still do",
            "title_similarity": "0.15934703"
        },
        {
            "id": "i2xipkm",
            "score": 1,
            "text": "This man makes me happy. A real leader. A role he was born to play.\nNetflix is running his Russian series now. It is good, and I see a lot of Abe Lincoln and Obama. The character in this show is what 74% of Ukrainians voted for. His popularity was in the mid twenties when the invasion started, which made Putin think it would be a piece of cake. Putin can take credit for uniting EU, NATO and most of the free world.",
            "title_similarity": "0.47589344"
        },
        {
            "id": "i2xk11w",
            "score": 1,
            "text": "True. Shame on the rest of the world. Shame on Obama. We all just made a lot of noise and went right back to business as usual. And now the Ukrainian people are paying for it with their lives and we've had to do what we should have done then anyway.",
            "title_similarity": "0.5687876"
        },
        {
            "id": "i2xn6md",
            "score": 1,
            "text": "He’s not wrong. Similar situation happened before WWII when the world sat back and let Hitler start carving up neighboring countries.",
            "title_similarity": "0.4789773"
        },
        {
            "id": "i2xrscs",
            "score": 1,
            "text": "It's time for the United States stands up to Russia and say enough is enough. We and our allies need to put our foot down before we actually hit.",
            "title_similarity": "0.6589207"
        },
        {
            "id": "i2xuozi",
            "score": 1,
            "text": "Blame that shit on the Obama administration and the puppet you guys had",
            "title_similarity": "0.5227785"
        },
        {
            "id": "i2z6se7",
            "score": 1,
            "text": "Putins doing what the united states does all the time and you’re all losing your shit because biased western media told you too. \n\nCongratulations you stupid fucks.",
            "title_similarity": "0.54776466"
        },
        {
            "id": "i2z8p4m",
            "score": -1,
            "text": "Zelensky instead of finding a solution to the exist problem, he talks about past history.",
            "title_similarity": "0.46944988"
        },
        {
            "id": "i2zdlhk",
            "score": 1,
            "text": "What about China and Tibet. Oh my bad there is no financial gain for EU or VS there.",
            "title_similarity": "0.4607517"
        },
        {
            "id": "i2zyqoo",
            "score": -1,
            "text": "A deplorable Zionist puppet is aborting idiotic ideas? He probably thinks he'll still be president a la longue.",
            "title_similarity": "0.5315498"
        },
        {
            "id": "i300mgv",
            "score": -1,
            "text": "Ungrateful cunt, it's not our duty to police and defend the world.",
            "title_similarity": "0.5022232"
        },
        {
            "id": "i2v8b4d",
            "score": 1228,
            "text": "Yep, in hindsight we dropped the ball. There's gonna be books written about it.\n\nJust like in the late 1930s, plenty of signs but we ignored them and hoped for the best, trusting the word of a psychopath.",
            "title_similarity": "0.5326722"
        },
        {
            "id": "i2vzd4n",
            "score": 15,
            "text": "We did.  We armed the fuck out of Ukraine and tried to get them to join NATO.",
            "title_similarity": "0.6055994"
        },
        {
            "id": "i2v7oap",
            "score": -7,
            "text": "Who was in charge of US in 2014 again? Who was weak on Russia again at that time? 🤫",
            "title_similarity": "0.6304785"
        },
        {
            "id": "i2vi52r",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.17211807"
        },
        {
            "id": "i2v6q7k",
            "score": 666,
            "text": "Yes and instead Europeans allowed themselves to be dependent on Russian energy.",
            "title_similarity": "0.5674306"
        },
        {
            "id": "i2vf8ir",
            "score": 2,
            "text": "Why do we need brackets for the horrors? Is that not thw perfect descriptions of what the Russians did?",
            "title_similarity": "0.67350185"
        },
        {
            "id": "i2vh7sa",
            "score": 2,
            "text": "I see no lies",
            "title_similarity": "0.06459132"
        },
        {
            "id": "i2vi22h",
            "score": 2,
            "text": "He has a solid point.",
            "title_similarity": "-0.017353768"
        },
        {
            "id": "i2vi4v2",
            "score": 2,
            "text": "And whatever Russia does next could be avoided if we unite to defend Ukraine now. Putin will not stop unless we stop him.",
            "title_similarity": "0.83225393"
        },
        {
            "id": "i2viwll",
            "score": 2,
            "text": "This is true, weak sanctions from 2014 and then continuously weakening sanctions until they just went away in 2021 and that pipeline got approved. I still cannot believe that happened.",
            "title_similarity": "0.5650097"
        },
        {
            "id": "i2vj1ei",
            "score": 2,
            "text": "And he's correct. However, as we've all came to see, time and again; nobody cares about human lives. \n\nAll hail our true God; money. /s",
            "title_similarity": "0.41427296"
        },
        {
            "id": "i2vjhut",
            "score": 2,
            "text": "Agreed. Appeasement is usually a bad idea",
            "title_similarity": "0.36901298"
        },
        {
            "id": "i2vjtai",
            "score": 2,
            "text": "The only reason the world is paying any attention this time is because of Zelenskyy.",
            "title_similarity": "0.38073966"
        },
        {
            "id": "i2vk9c1",
            "score": 2,
            "text": "Taking over Crimea was a trigger point for Russia. Germany was blinded by NS2, entire west was blinded by money. This war was avoidable.",
            "title_similarity": "0.7734786"
        },
        {
            "id": "i2vkv46",
            "score": 2,
            "text": "We should ask Obama about that one.  Or the former president of Ukraine.",
            "title_similarity": "0.5516414"
        },
        {
            "id": "i2vliwx",
            "score": 2,
            "text": "Ooooo he called out Obama and Biden",
            "title_similarity": "0.280086"
        },
        {
            "id": "i2vnce5",
            "score": 2,
            "text": "Who was president in 2014? I can't seem to recall...",
            "title_similarity": "0.38359976"
        },
        {
            "id": "i2vokvp",
            "score": -2,
            "text": "Israel’s horrors could have been avoided also if people like Zalensky would stop supporting them",
            "title_similarity": "0.70519507"
        },
        {
            "id": "i2vqkek",
            "score": -2,
            "text": "Zelenskyy is a fucking bitch",
            "title_similarity": "0.2922706"
        },
        {
            "id": "i2vrmvr",
            "score": 2,
            "text": "I think everyone really overestimated Russia when crimea happened.  \n\nBut the rest of the world did do something, we sanctioned the shit out of Russia and armed the rest of Ukraine to the teeth and trained their army up from 1965 to 2020 in capability. Imagine how bad this conflict would go if the EU and NATO nations had not done that. Russia would have captured the whole country by now. \n\nI like Zelensky, but I don’t think he should be shitting on the west like he is. Ukraine bears responsibility here too. Their politicians were corrupt and actively undermining involvement with the EU and NATO. They relinquished their status as the worlds third largest nuclear power in exchange for a promise of  sovereignty  from Russia (this was a REALLY stupid deal.  Even at the time).\n\nYeah it’s a shitty situation for Ukraine right now. But the reality is that they have a huge responsibility for getting into this situation and the actions of “the rest of the world” prevented this from becoming a landslide victory for Russia. It’s not the rest of the worlds responsibility to protect Ukraine.",
            "title_similarity": "0.7187741"
        },
        {
            "id": "i2vtz7n",
            "score": 2,
            "text": "I feel for the Ukrainian people. However, why does the Ukrainian leadership feel its other counties duty to defend their borders?\n\nIt's horrible that Ukrainians are dying, but the answer is not other countries people dying.",
            "title_similarity": "0.66020083"
        },
        {
            "id": "i2vvp0b",
            "score": 2,
            "text": "Well, if we're doing \"what ifs\", we could have not instigated the creation of the KGB during the Cold War which created Putin and his rise to power. We could have not gone against every expert, including the advice of the mastermind behind the policy of containment used against the USSR, and started a new Cold War by expanding NATO after the collapse of the USSR. The West could have prevented this at every opportunity and chose not to, and if you look at the rising profits of the military industry, that'll reveal why.",
            "title_similarity": "0.8003564"
        },
        {
            "id": "i2vwaj1",
            "score": 2,
            "text": "the destruction of Ukraine might have been avoided if Z had agreed with putin that Ukraine was not going to join Nato",
            "title_similarity": "0.84798455"
        },
        {
            "id": "i2vyl36",
            "score": 2,
            "text": "I remember listening the NPR when the Crimea invasion was happening. The reporter plainly thought it was no big deal and kept conducting phone interviews with alleged residents who welcomed Russian rule.  I tuned out of NPR this cycle when their reporter on the ground smirkily hinted in an interview that she thought the Ukrainians would run from the Russians \"like the Afghan army did from the Taliban\" (not an exact quote but her point of comparison).  Man, did history prove her wrong.",
            "title_similarity": "0.6804787"
        },
        {
            "id": "i2vyw85",
            "score": 2,
            "text": "Don't get me wrong, I think Putin is psychotic, but I can't really blame him for Crimea. Russian navy was in the balance, hard to see any world leader doing anything else.",
            "title_similarity": "0.7335273"
        },
        {
            "id": "i2w0yom",
            "score": 2,
            "text": "They had to stop him maybe back in chechniya and georgia and crimea would not happen, ever thought about it ?",
            "title_similarity": "0.7136255"
        },
        {
            "id": "i2w2vv4",
            "score": 2,
            "text": "This guy is starting to sound like a reaaaaaal bitch",
            "title_similarity": "0.27647442"
        },
        {
            "id": "i2w4all",
            "score": 2,
            "text": "He is right. I remember leaders talking noise and then when Russia did it, they just sat there and said, well don’t do it again!",
            "title_similarity": "0.62359416"
        },
        {
            "id": "i2wbhox",
            "score": -2,
            "text": "Ask Ze if he tried to follow Minsk-2 agreements Signed by Ukraine) instead of preparing to war with Donbas and Crimea",
            "title_similarity": "0.7399693"
        },
        {
            "id": "i2wdiqz",
            "score": 2,
            "text": "I mean... he's probably not wrong.  \nIf the west had had as strong a reaction in 2014 as they have over the last 30 days, then yeah, a lot of this may have been avoided.\n\nAs for you ding dongs in this thread trying to blame Obama/Biden - you booger-eaters may recall that the Obama Administration *HAD* imposed sanctions on Russia. Sanctions that remained in place until Putin's Cock Holster, Donald Trump, got into office and promptly removed said sanctions.  This was *before* Donnie Dip-Shit tried to extort Ukraine with congressionally approved funds in exchange for dirt on a political rival.\n\nBut please, do tell me again how this wouldn't have happened on Trump's watch. I could use the chuckle.",
            "title_similarity": "0.80363923"
        },
        {
            "id": "i2wdw00",
            "score": 2,
            "text": "Obama sanctioned the fuck out of russia back then, economy took a shit (then trump lifted them)...what else? we ain't launching nukes bro",
            "title_similarity": "0.7203623"
        },
        {
            "id": "i2we7cs",
            "score": 2,
            "text": "The only person this \"It's all somehow the wests fault\" narrative helps, is Putin.\n\nEveryone can talk smart with hindsight.",
            "title_similarity": "0.49611717"
        },
        {
            "id": "i2wfywz",
            "score": -2,
            "text": "Don't worry Zelenskyy, the ineffective sanctions and NATO's reluctance to directly intervene will teach Russia and Putin that this time he's gone too far! And if not this time then next time, we'll even sanction a few more banks!",
            "title_similarity": "0.7612471"
        },
        {
            "id": "i2whc7u",
            "score": 2,
            "text": "He has a point - Obama and ole Joe were useless at the time. As was the rest of Europe.",
            "title_similarity": "0.5204764"
        },
        {
            "id": "i2whfiv",
            "score": 2,
            "text": "Really shame Obama and Biden didn't do more.",
            "title_similarity": "0.4924311"
        },
        {
            "id": "i2wj3eu",
            "score": -2,
            "text": "Clownenskyy.",
            "title_similarity": "0.18676439"
        },
        {
            "id": "i2wlev5",
            "score": -2,
            "text": "I don't think it was possible back then.\n\nThe amount of global communication, information gathering, and general world-community cooperation of normal people that we have today just straight up wasn't a thing back then. \n\nCovid was a really big part of it for sure. 2 years of everyone generally doing nothing but talking to each other online and getting mad at (and learning more about) those who denied reality and fought for division. It makes for a bunch of people who are just tired of the bullshit.",
            "title_similarity": "0.42159945"
        },
        {
            "id": "i2wpzfj",
            "score": -2,
            "text": "Came across this. A vote to secede from Ukraine by Crimea was around 95% in favour. Perhaps that's why the west said nothing.\n\nhttps://www.theguardian.com/world/2014/mar/16/ukraine-russia-truce-crimea-referendum",
            "title_similarity": "0.6585828"
        },
        {
            "id": "i2wzl9n",
            "score": 2,
            "text": "I agree but...what did Ukraine really do since 2014?",
            "title_similarity": "0.42841387"
        },
        {
            "id": "i2xgrg1",
            "score": 2,
            "text": "Hol up.....you want all the other countries to help but you also want to talk that shit?",
            "title_similarity": "0.44287682"
        },
        {
            "id": "i2xpl6s",
            "score": -2,
            "text": "Why is Zelenskyy is bend on seemingly blaming everyone else for the invasion?  He himself was sayin Russia wasnt going to invade when US was giving intel of Russia building up forces along the border, yet he did nothing to blockade or try to deter the invasion...nobody did.  \n\nJust feel like this shit could have been mostly avoided if UA and even other countries built up their own forces in UA along the border to prevent RU from being able to enter in the first place...But here we are.",
            "title_similarity": "0.7497597"
        },
        {
            "id": "i2yyqye",
            "score": -2,
            "text": "If Ukraine would seize fire and obey Minsk Treaty. If Zelensky would outlaw Nazi national guard like he outlawed his opposition parties. Anyways lil fucker Zelensky got all his accounts hidden offshore prepared to flee Ukraine.",
            "title_similarity": "0.6556156"
        },
        {
            "id": "i2vbdgn",
            "score": 66,
            "text": "or Georgian occupation in 2008.",
            "title_similarity": "0.28679276"
        },
        {
            "id": "i2vnrlk",
            "score": -23,
            "text": "Of course. But trump would never speak ill of his boss, Putin. He was under Putin's thumb the whole time.",
            "title_similarity": "0.47814533"
        },
        {
            "id": "i2vt7nb",
            "score": 126,
            "text": "He is correct. \n\nBut since he is in the mood for pointing fingers:\n\nReminder that that Ukraine was on track to becoming a NATO member in 2008 with US support. Wich was even before 2014 and would have stopped Russian invasion even better. But then the Ukrainian people elected a pro Russian president in 2010... [Also popular support for an Ukrainian NATO membership was below 25% between April 2009 and October 2013.](https://en.wikipedia.org/wiki/Ukraine%E2%80%93NATO_relations#Popular_opinion_in_Ukraine)",
            "title_similarity": "0.70746773"
        },
        {
            "id": "i2v65ah",
            "score": -3,
            "text": "who are these worldleaders  and what actions in the past or present makes them allegeable to be a worldleaders ?\n\nI am just courius !",
            "title_similarity": "0.42257285"
        },
        {
            "id": "i2vgcbs",
            "score": 2,
            "text": "I mean, he's not wrong. Not doing anything over crimea showed Putin he could do what he wanted and no one would punish him for it. Except hubris, as it hilariously turns out.",
            "title_similarity": "0.5777905"
        },
        {
            "id": "i2vi3qd",
            "score": 2,
            "text": "I mean if we are talking what if’s then the horrors could have also been avoided if Ukraine acquiesced to Russia’s demands.",
            "title_similarity": "0.8573401"
        },
        {
            "id": "i2vivt8",
            "score": 2,
            "text": "Yeah Obama’s presidency looks worse as time goes on.",
            "title_similarity": "0.44957"
        },
        {
            "id": "i2vj1nd",
            "score": 4,
            "text": "Cant argue that logic at all.  Zelenskyy is right.",
            "title_similarity": "0.32242334"
        },
        {
            "id": "i2vj4d7",
            "score": 3,
            "text": "Ukraine should never have given up their nuclear weapons to Russia in exchange for a useless promise.",
            "title_similarity": "0.7587059"
        },
        {
            "id": "i2vkg7r",
            "score": 3,
            "text": "Russia didn’t get punished for the 2008 invasion of Georgia either. Both Bush and Obama dropped the ball.",
            "title_similarity": "0.60022134"
        },
        {
            "id": "i2vmp2h",
            "score": -4,
            "text": "No ..it was because Monsanto, Cargill, Bayer, DuPont stole the rich agricultural lands from Ukrainians in 2014 via the IMF and World Bank using debt based diplomacy tactics. This caused a separatist movement in Ukraine (which then asked Russia for help) which the greedy U.S. Megacorps tried to quell by trying to get Ukraine to join NATO. \n\n\nAnd now here we are...everyone at war, while American Megacorps quietly stir the pot for profit.",
            "title_similarity": "0.6435964"
        },
        {
            "id": "i2vve4d",
            "score": 4,
            "text": "2014 when US replaced the sitting president with a new one you mean?",
            "title_similarity": "0.52199525"
        },
        {
            "id": "i2vvjro",
            "score": 2,
            "text": "Annexation of crimea could have been avoided if us didnt lead a coup to overthrow gov in ukraine.",
            "title_similarity": "0.8643424"
        },
        {
            "id": "i2vvvn7",
            "score": 3,
            "text": "Ukraine does not need more weapons, they need economic development. The GDP/capita of Ukraine is $3500. Ukrainians need better wages, living standards, educational opportunities for their children. I lament the fact people care more about giving the middle finger to Russia than doing what’s in the best interest for Ukraine’s future. Does it matter if you join NATO if you cannot even give your children a better future? Once you get more economic development, then you have more bargaining power. Ukraine could have done this by playing along with neutrality like Finland did.\n\nLooking at all the Ukrainian children killed by this invasion, I think most parents would much rather live in a neutral Ukraine (like Finland) where their child is still alive, than live in a Ukraine that endured an invasion, only to give up on its dreams of joining NATO. Unfortunately, it is easier for leaders to stir up war fervor than it is to actually run an economy.",
            "title_similarity": "0.6792637"
        },
        {
            "id": "i2vw82n",
            "score": 4,
            "text": "And the annexation of crimea could have been avoided if zelensky's government simply honored the lease of the black sea base to Russia.",
            "title_similarity": "0.8815831"
        },
        {
            "id": "i2vyb1z",
            "score": -3,
            "text": "Sanctions don't do shit except hurt the civilians of the country you're targeting. More sanctions wouldn't have changed anything except made poverty in Russia higher and create more suffering. Only a psychopath thinks like this. Fuck Zelenskyy",
            "title_similarity": "0.7390899"
        },
        {
            "id": "i2vycdv",
            "score": -3,
            "text": "Why didnt he better prepare for an attack weeks before when there was a known army surrounding  Ukraine?  I think he started planning a defense once putin invaded. Also why didnt he prepare an army to get their land back in 2014?.  Why is the world responsible for what Russia does on your country?",
            "title_similarity": "0.74534476"
        },
        {
            "id": "i2vzw9z",
            "score": 4,
            "text": "Yeah he's not wrong at all.",
            "title_similarity": "-0.011977256"
        },
        {
            "id": "i2w13dx",
            "score": 3,
            "text": "Absolutely correct",
            "title_similarity": "-0.067592464"
        },
        {
            "id": "i2w3gna",
            "score": 2,
            "text": "also could have been avoided if they never gave up their nukes",
            "title_similarity": "0.6023835"
        },
        {
            "id": "i2w4ha5",
            "score": 3,
            "text": "That sweet sweet cheap Russian oil...",
            "title_similarity": "0.34043825"
        },
        {
            "id": "i2w4hdn",
            "score": 4,
            "text": "He’s absolutely correct.",
            "title_similarity": "-0.017265905"
        },
        {
            "id": "i2w6n1g",
            "score": 2,
            "text": "Pretty much.  I recall Biden also thought so back then, but he was ultimately overruled by Obama.",
            "title_similarity": "0.55308604"
        },
        {
            "id": "i2w7am7",
            "score": 3,
            "text": "Painful truth. Obama’s foreign policy was toothless. Then Trump was basically Putins biggest fanboy. He reversed the weak sanctions against Russia, tried to get him admitted to the G7, openly talked about leaving NATO, wanted to stop providing military aid to Ukraine. Putins excursion is the direct result of 12 years of pathetic foreign policy leadership.",
            "title_similarity": "0.69216573"
        },
        {
            "id": "i2w8sw1",
            "score": 3,
            "text": "Remember Hitler got away with way too much before the world really decided enough was enough too.  Putin is just doing it slower and trying harder to justify it.\n\nEDIT: Also his blitzkrieg failed.",
            "title_similarity": "0.6483232"
        },
        {
            "id": "i2wjmaf",
            "score": -3,
            "text": "Yep. He invaded under VP Joe Biden and we didn't do anything. Now he invaded under President Joe Biden and again are getting away with it. \n\nThe US President is weak. Putin knows this.",
            "title_similarity": "0.6462212"
        },
        {
            "id": "i2ylks2",
            "score": -3,
            "text": "Or .. if you agreed not to join NATO and saved your country.",
            "title_similarity": "0.6283488"
        },
        {
            "id": "i2v9ufq",
            "score": 267,
            "text": "Or Donetsk, Or Chechnya, or Moldova, Or Georgia.\n\nRussia has been doing this ever since Putin came into power.",
            "title_similarity": "0.45214897"
        },
        {
            "id": "i2vcnvf",
            "score": -4,
            "text": "Horrors of Russian invasion could have been avoided if Zelenskyy and Ukrainians grew some balls and learnt to defend their territory,after all crimea already happened.",
            "title_similarity": "0.8369812"
        },
        {
            "id": "i2vmhtp",
            "score": -4,
            "text": "Trumps good friend Putin?",
            "title_similarity": "0.44815877"
        },
        {
            "id": "i2wp62s",
            "score": -4,
            "text": "Zelensky is an idiot. He doesn't understand international politics.  He is the main cause of this war. He should have kept his mouth shut about nuclear arms and joining Nato. \n\nHe should have stayed a comedian. Correction; he is still a comedian, but he isn't funny anymore.",
            "title_similarity": "0.6647067"
        },
        {
            "id": "i2xh8o8",
            "score": 4,
            "text": "I'm sorry but this is nonsense.\n\nRussian aggression is deplorable but Ukraine is a horribly corrupt country with ineffectual leadership. They were denied EU membership bc of this.\n\nZelensky's biggest asset at this point is he's still alive making him a hero somehow even tho people are being slaughtered.\n\nThere's no justifying the Russian invasion then and now and Russia is also horribly corrupt but Ukraine has been both ends against the middle for decades and Russia being the autocratic monster that it is finally pulled their card.",
            "title_similarity": "0.6752827"
        },
        {
            "id": "i2vbsr7",
            "score": -4,
            "text": "Crimea 2014 = Sudetenland 1938\n\nUkraine 2021 = Poland 1939\n\nThe world had to wake up at some point.",
            "title_similarity": "0.45549905"
        },
        {
            "id": "i2veyra",
            "score": 5,
            "text": "Or the time he shot down a plane with most of the Ukrainian government on it about 10 years ago",
            "title_similarity": "0.335951"
        },
        {
            "id": "i2vz8v4",
            "score": 5,
            "text": "I mean what the fuck are we going to do? Declare war on Russia?",
            "title_similarity": "0.5902164"
        },
        {
            "id": "i2wfgjv",
            "score": 4,
            "text": "Or if you would have joined nato",
            "title_similarity": "0.4174569"
        },
        {
            "id": "i2v9vi4",
            "score": 7,
            "text": "Not an expert whatsoever but it seems like if that had happened, the invasion and potential WW3 would’ve just happened sooner. Again, what do I know?",
            "title_similarity": "0.60616577"
        },
        {
            "id": "i2vlzqt",
            "score": -7,
            "text": "I hate to say it, but this can all honestly be linked back to Trump. If him and his despicable Republican allies hadn't spent so much of 2014 trying to hamper the Obama administration's attempts to curtail the atrocities being committed abroad (or even domestically) then this whole situation may not have happened. Not surprised though seeing as how the GOP stands only for trying to make Democrats look bad while bowing down to their rich donors.",
            "title_similarity": "0.7456462"
        },
        {
            "id": "i2vmsac",
            "score": -6,
            "text": "Trump was too busy giving Putin handjobs under the table to do anything.",
            "title_similarity": "0.5032173"
        },
        {
            "id": "i2vnlvb",
            "score": 5,
            "text": "I mean.... Ukraine didn't exactly stand up to Russia either.  There wasn't any country to really support in 2014 because of all the chaos of the unrest.  If Ukraine's government stayed in tact and went to war with Russia over Ukraine the western response would have been different.  But after the coup those that gained power were more concerned about holding on to this new position and preventing pro-Russian politicians from ever getting power again.",
            "title_similarity": "0.76960766"
        },
        {
            "id": "i2vus1h",
            "score": 6,
            "text": "Imagine worrying about the borders of a country 5,000 miles away that we have no alliance with. \n\nIs this going to be the new 20 year long war-not-actually-a-war that milks tax payers for sums so vast it can't be audited?",
            "title_similarity": "0.5167653"
        },
        {
            "id": "i2v4bf1",
            "score": -19,
            "text": "Usa needs strong intellect leader. Every time usa has weak leaders the rest of the work suffers even more than America. So sad Americans vote in such weak minded leaders",
            "title_similarity": "0.45077497"
        },
        {
            "id": "i2vngln",
            "score": 7,
            "text": "Well the '80s called, it wants it's foreign policy back.\n\n-barak obama",
            "title_similarity": "0.4592135"
        },
        {
            "id": "i2vo2ki",
            "score": 32,
            "text": "The annexation of Crimea would have been avoided had we stood up for Georgia. This is just a natural evolution of things, you let the bully get away with something he’s going to keep going till you have to fight him.",
            "title_similarity": "0.77449644"
        },
        {
            "id": "i2vrssi",
            "score": 27,
            "text": "Everyone forgetting the sanctions and booting from the G8? You can argue it should have been punished more, but to suggest there was none is pretty misleading",
            "title_similarity": "0.7150464"
        },
        {
            "id": "i2wjrfx",
            "score": 92,
            "text": "US put some fairly strong sanctions in place. Half of Europe seemed to just keeping chugging along and using up their gas which seemed pretty batshit crazy to me.",
            "title_similarity": "0.46168086"
        },
        {
            "id": "i2v2y7f",
            "score": 2395,
            "text": "At the same time, things would’ve been much worse without the 2014 sanctions.\n\nThose sanctions made it difficult for Russia to modernize their forces by shutting off access to technology and components for military hardware.",
            "title_similarity": "0.7834675"
        },
        {
            "id": "i2v72bo",
            "score": 8922,
            "text": "Yeah that was weird time. As I remember Putin literally denied invading and it threw everyone for such a loop he denied reality\n\n\nEdit: wow this blew up thanks for liking my post",
            "title_similarity": "0.6192346"
        },
        {
            "id": "i2v2eri",
            "score": 10486,
            "text": "Yep, not much more to say.",
            "title_similarity": "0.07996977"
        },
        {
            "id": "i2v76ts",
            "score": 4798,
            "text": "And Georgia before that. And Chechenya before that.",
            "title_similarity": "0.36378783"
        },
        {
            "id": "i2vz2yv",
            "score": 108,
            "text": "Then Georgia in 2008 too - [No \"Olympics War\" Between Russia and Georgia](https://www.dw.com/en/no-olympics-war-between-russia-and-georgia/a-3551779)\n\nThere is a theme with using the Olympics as a distraction in the invasion of all three; Georgia, Crimea and now Ukraine.",
            "title_similarity": "0.6788309"
        },
        {
            "id": "i2v8fdt",
            "score": 1,
            "text": "Syria and georgia meanwhile...",
            "title_similarity": "0.25605127"
        },
        {
            "id": "i2v8trk",
            "score": 1,
            "text": "Ya probably but we cant do anything about that now.",
            "title_similarity": "0.35080037"
        },
        {
            "id": "i2v90bq",
            "score": 1,
            "text": "Yeah, pretty much. We didn't know. We slapped him on the wrist, but we should've punched him in the face.",
            "title_similarity": "0.6270383"
        },
        {
            "id": "i2v9g4s",
            "score": 1,
            "text": "beyond sanctions, i dont think russia will be punished for its war crimes at all",
            "title_similarity": "0.62827563"
        },
        {
            "id": "i2v9xaq",
            "score": 1,
            "text": "Yep. Big blunder.",
            "title_similarity": "0.1546561"
        },
        {
            "id": "i2v9zav",
            "score": 1,
            "text": "Agreed.",
            "title_similarity": "-0.071089834"
        },
        {
            "id": "i2vaa35",
            "score": 1,
            "text": "Russia is the world's Missing Step.",
            "title_similarity": "0.53361845"
        },
        {
            "id": "i2vbbma",
            "score": 1,
            "text": "Which is why he was so emboldened to invade this time around.... Crimea was an ego boost for him",
            "title_similarity": "0.43618006"
        },
        {
            "id": "i2vbc5a",
            "score": 1,
            "text": "Just like we will learn for not punishing Trump…",
            "title_similarity": "0.48811156"
        },
        {
            "id": "i2vbd8s",
            "score": 1,
            "text": "100% agreed.",
            "title_similarity": "-0.023656804"
        },
        {
            "id": "i2vbrfg",
            "score": 1,
            "text": "Yep.  The leadership in the west needs to be held accountable for getting us here.",
            "title_similarity": "0.3758173"
        },
        {
            "id": "i2vckfm",
            "score": 1,
            "text": "Yes but many western leaders like the UK are too busy taking dirty Russian money and stealing from the electorate to do anything useful like that.",
            "title_similarity": "0.57999194"
        },
        {
            "id": "i2vcx0g",
            "score": 1,
            "text": "so is zelensky going to buy russian gas in roubles?",
            "title_similarity": "0.58570915"
        },
        {
            "id": "i2vcy8i",
            "score": 1,
            "text": "He ain't lying",
            "title_similarity": "0.044602253"
        },
        {
            "id": "i2vd19m",
            "score": 1,
            "text": "Yeah probably",
            "title_similarity": "-0.011961898"
        },
        {
            "id": "i2vd7j2",
            "score": 1,
            "text": "This also wouldn't have happened if NATO let Ukraine join when they asked to.",
            "title_similarity": "0.71341354"
        },
        {
            "id": "i2vd8je",
            "score": 1,
            "text": "Western leaders are weak and Putin knows this  we should of rolled the tanks in by now.",
            "title_similarity": "0.7210835"
        },
        {
            "id": "i2vdfg0",
            "score": 1,
            "text": "Nothing to add really. Absolutely agree.",
            "title_similarity": "0.11842038"
        },
        {
            "id": "i2vdj0z",
            "score": 1,
            "text": "He isn't wrong",
            "title_similarity": "0.0329199"
        },
        {
            "id": "i2vdjqh",
            "score": 1,
            "text": "appeasement is one hella of a thing",
            "title_similarity": "0.2743131"
        },
        {
            "id": "i2vds5z",
            "score": 1,
            "text": "Hey man we’re doin our best too Maybe Ukraine couldve responded stronger as well? Not sure why everything is always the West’s fault yet these same people are calling for a no fly zone…",
            "title_similarity": "0.69852495"
        },
        {
            "id": "i2vdubz",
            "score": 1,
            "text": "See that now as a huge failure by western leaders. Seeing the work that biden is doing now in mobilizing a unifying message to NATO and the EU really shows how inept Pres Obama's response was. Fickle sanctions and meaningless response. That was a failure.",
            "title_similarity": "0.59757996"
        },
        {
            "id": "i2vdvdm",
            "score": 1,
            "text": "I agree",
            "title_similarity": "-0.07709621"
        },
        {
            "id": "i2ve05v",
            "score": 1,
            "text": "He certainly isn't wrong.",
            "title_similarity": "0.013039833"
        },
        {
            "id": "i2ve0g5",
            "score": 1,
            "text": "Quite possibly.",
            "title_similarity": "0.03406715"
        },
        {
            "id": "i2ve5el",
            "score": 1,
            "text": "I suppose so, yet again NATO is not world police, contrary to popular opinion.",
            "title_similarity": "0.53613245"
        },
        {
            "id": "i2ve5jp",
            "score": 1,
            "text": "Meanwhile, he provided material support to continue the Tigray genocide...",
            "title_similarity": "0.4252599"
        },
        {
            "id": "i2ve72l",
            "score": 1,
            "text": "Aye, that’s fair.",
            "title_similarity": "-0.021028716"
        },
        {
            "id": "i2ve7jo",
            "score": 1,
            "text": "Nobody expects the Spanish Inquisition!",
            "title_similarity": "0.45833638"
        },
        {
            "id": "i2ve911",
            "score": 1,
            "text": "Well, it was the Ukrainian military who allowed Russian troops to march there.\nDo you want other militaries to defend your country?",
            "title_similarity": "0.638325"
        },
        {
            "id": "i2ve93n",
            "score": 1,
            "text": "Well maybe they want rus to do this shit so they can use their own toys.",
            "title_similarity": "0.4532057"
        },
        {
            "id": "i2veico",
            "score": 1,
            "text": "Hindsight is almost always 20/20",
            "title_similarity": "0.20268711"
        },
        {
            "id": "i2vekvn",
            "score": 1,
            "text": "He’s not wrong. Putin thinks he’s gonna walk away with another chunk of land bc everyone let him do it last time.",
            "title_similarity": "0.6015986"
        },
        {
            "id": "i2vemye",
            "score": 1,
            "text": "Or if Ukraine hadn’t elected a pro-Russian leader into presidency around that time. \n\nI understand he is under pressure, but now is not the time to be passing blame onto everybody else. 2014 was a Ukraine issue and a warning to the world. 2022 is as it is now because country leaders took note of 2014.",
            "title_similarity": "0.7591711"
        },
        {
            "id": "i2ven2t",
            "score": 1,
            "text": "Or Chechnya or any of the other times he did similar things",
            "title_similarity": "0.2303683"
        },
        {
            "id": "i2vepgu",
            "score": 1,
            "text": "I keep saying this and it’s like people forgot. Putin invaded Ukraine 8 years ago and no one did a thing. They kept pretending Putin was still a sane leader",
            "title_similarity": "0.57348"
        },
        {
            "id": "i2verlg",
            "score": 1,
            "text": "I keep agreeing with Zelenskyy on most things he says",
            "title_similarity": "0.03632194"
        },
        {
            "id": "i2vet1e",
            "score": 1,
            "text": "Or the nerve agent attack in the UK. Or messing with US elections.",
            "title_similarity": "0.50293535"
        },
        {
            "id": "i2vet70",
            "score": 1,
            "text": "It’s sad that This statement can be applied to almost every modern international conflict, if the war criminals in charge had been prosecuted instead of hero worship.",
            "title_similarity": "0.63466805"
        },
        {
            "id": "i2vf26c",
            "score": 1,
            "text": "Well, he ain't wrong.",
            "title_similarity": "0.011062276"
        },
        {
            "id": "i2vfgpo",
            "score": 1,
            "text": "Totally this.",
            "title_similarity": "-0.06553289"
        },
        {
            "id": "i2vfkoo",
            "score": 1,
            "text": "And that’s just fact 🤷🏻‍♀️",
            "title_similarity": "0.013050986"
        },
        {
            "id": "i2vfnol",
            "score": 1,
            "text": "Possibly.  But fighting about past wars may not help you win the next one.",
            "title_similarity": "0.5845617"
        },
        {
            "id": "i2vg20r",
            "score": 2,
            "text": "Ok but why is horrors in quotes",
            "title_similarity": "0.35692242"
        },
        {
            "id": "i2vg26q",
            "score": 1,
            "text": "Could also have been avoided if Ukraine had put up any kind of opposition instead of rolling over. Main reason they look so good now is the western weapons and aid they’ve received from the west in the ensuing time. Maybe don’t talk trash about the only people in the world who care enough to save your ass",
            "title_similarity": "0.6948905"
        },
        {
            "id": "i2vg2dh",
            "score": 1,
            "text": "Maybe thwy if you would have fought as much as you fight now.",
            "title_similarity": "0.46668774"
        },
        {
            "id": "i2vghcd",
            "score": 1,
            "text": "Trumps fault…oh wait that other guy was in charge",
            "title_similarity": "0.40501222"
        },
        {
            "id": "i2vgia0",
            "score": 1,
            "text": "I agree.",
            "title_similarity": "-0.065033115"
        },
        {
            "id": "i2vgkgc",
            "score": 2,
            "text": "Horrors shouldn't be in quotes.",
            "title_similarity": "0.461054"
        },
        {
            "id": "i2vgs8e",
            "score": 1,
            "text": "Lol, he is always talking about how bad russians are but back a few years he didnt bat an eye for them",
            "title_similarity": "0.5514314"
        },
        {
            "id": "i2vh0cp",
            "score": 1,
            "text": "True.",
            "title_similarity": "-0.07547066"
        },
        {
            "id": "i2vh4y2",
            "score": 1,
            "text": "lol. really no one will bring up that Obama literally told Putin via Menendev to wait till after the election ?",
            "title_similarity": "0.6608875"
        },
        {
            "id": "i2vhajn",
            "score": 1,
            "text": "true",
            "title_similarity": "-0.064598516"
        },
        {
            "id": "i2vhev7",
            "score": 2,
            "text": "Well we're not really learning from this either are we.",
            "title_similarity": "0.25586364"
        },
        {
            "id": "i2vhr6l",
            "score": 1,
            "text": "Correct.",
            "title_similarity": "-0.07532634"
        },
        {
            "id": "i2vhxbd",
            "score": 1,
            "text": "So punish him now and the rest of the world wont have to worry about him again?",
            "title_similarity": "0.59425163"
        },
        {
            "id": "i2vi5yn",
            "score": 1,
            "text": "He’s not wrong. Too bad we can’t go back and change the past.",
            "title_similarity": "0.4856827"
        },
        {
            "id": "i2vi6i8",
            "score": 1,
            "text": "Thanks, Obama",
            "title_similarity": "0.14091624"
        },
        {
            "id": "i2vi6nt",
            "score": 1,
            "text": "Most commentators I am following say that this is a true statement. Since European armies are so weak there was/is no fear of anyone stopping them!",
            "title_similarity": "0.44662642"
        },
        {
            "id": "i2vi7yg",
            "score": 1,
            "text": "100%",
            "title_similarity": "-0.038953442"
        },
        {
            "id": "i2vibfz",
            "score": 1,
            "text": "Or you could not have U.S. bio labs in your country.",
            "title_similarity": "0.5177417"
        },
        {
            "id": "i2vicui",
            "score": 1,
            "text": "YOU FUCKING THINK SO!? Now we’re gonna pretend like we didn’t know this.",
            "title_similarity": "0.45073223"
        },
        {
            "id": "i2vidyl",
            "score": 1,
            "text": "There’s always a “this could have been prevented if” when something happens no matter what it is people need to realize that",
            "title_similarity": "0.46379656"
        },
        {
            "id": "i2vif61",
            "score": 1,
            "text": "Who said Germany is to blame!?",
            "title_similarity": "0.42459047"
        },
        {
            "id": "i2vigli",
            "score": 1,
            "text": "Fair.",
            "title_similarity": "-0.002037339"
        },
        {
            "id": "i2vigww",
            "score": 1,
            "text": "Big facts",
            "title_similarity": "0.057187423"
        },
        {
            "id": "i2vijfg",
            "score": 1,
            "text": "Yep, Obama fucked up big time.",
            "title_similarity": "0.3456034"
        },
        {
            "id": "i2vim1k",
            "score": 1,
            "text": "The \"energy security is national security\" crowd folks have been barking up this tree for a while. Same as how climate change is a national defense issue as well.",
            "title_similarity": "0.3731905"
        },
        {
            "id": "i2vimth",
            "score": 1,
            "text": "I do not disagree.",
            "title_similarity": "0.024000429"
        },
        {
            "id": "i2viw9l",
            "score": 1,
            "text": "Everything is easy in hindsight",
            "title_similarity": "0.0028662388"
        },
        {
            "id": "i2viwj2",
            "score": 1,
            "text": "That seems a pretty goddamn reasonable statement.",
            "title_similarity": "0.07335168"
        },
        {
            "id": "i2vizgy",
            "score": 1,
            "text": "yep.  and if aunt betty had balls, she'd be uncle bill",
            "title_similarity": "0.4516953"
        },
        {
            "id": "i2vj22q",
            "score": 1,
            "text": "“I will have more flexibility after the election.”",
            "title_similarity": "0.33874908"
        },
        {
            "id": "i2vj5s1",
            "score": 1,
            "text": "This man is more media trained then trump, all i see is him make big useless statements. Shoulda changed the past man",
            "title_similarity": "0.58067346"
        },
        {
            "id": "i2vj9j9",
            "score": 1,
            "text": "Yes right right.  Yes. Nailed it.",
            "title_similarity": "0.07006304"
        },
        {
            "id": "i2vje8w",
            "score": 1,
            "text": "This is Fact. But, just like in Syria the American administration at the time lacked foresight and spine to do anything. Getting quagmired in stupid wars didn't help either.",
            "title_similarity": "0.57396984"
        },
        {
            "id": "i2vjli4",
            "score": 1,
            "text": "\nHey /u/mryoends,\n\n\nThis is now the top post on reddit. It will be recorded at /r/topofreddit with all the other top posts.",
            "title_similarity": "0.2524157"
        },
        {
            "id": "i2vjqcs",
            "score": 1,
            "text": "Control - F trump 41 \n\nControl - F obama 25",
            "title_similarity": "0.34849244"
        },
        {
            "id": "i2vju10",
            "score": 2,
            "text": "Many times something should have been done. When the Russians were moving border fences in the middle of the night, something should have been done. If sanctions don't bite hard enough, or are circumvented, then again we fail to do anything.",
            "title_similarity": "0.71442723"
        },
        {
            "id": "i2vjulo",
            "score": 1,
            "text": "the the EU & NATO didn’t have their shit together then. and who says they didn’t want this scenario……",
            "title_similarity": "0.5734571"
        },
        {
            "id": "i2vjx9a",
            "score": 2,
            "text": "He’s not wrong, but he seems to be announcing a fairly simplistic or obvious view of things. “The world” is made up of humans making decisions based on past and present. Even to this day, “the world” can’t physically prevent Russia from doing what it’s doing. Humans are dealing with a country with nukes. Nukes being the thing that ends humans. Treading carefully seems logical to me… even if it means not getting up and physically slapping a country for committing war crimes.",
            "title_similarity": "0.7220516"
        },
        {
            "id": "i2vk636",
            "score": 1,
            "text": "You can’t invade what you believe is yours! DUH",
            "title_similarity": "0.41163802"
        },
        {
            "id": "i2vkcjn",
            "score": 2,
            "text": "We weren’t prepared to do that. Between 2014 and now we prepared for the rest of it.",
            "title_similarity": "0.51395226"
        },
        {
            "id": "i2vkjcd",
            "score": 1,
            "text": "Yup. \n\nThe precedence was set.",
            "title_similarity": "0.0769307"
        },
        {
            "id": "i2vkrcr",
            "score": 1,
            "text": "The sad truth is nobody cares about Ukraine",
            "title_similarity": "0.4374314"
        },
        {
            "id": "i2vkwe4",
            "score": 1,
            "text": "Lesson learnt: a stitch in time saves nine",
            "title_similarity": "0.25726742"
        },
        {
            "id": "i2vkx7a",
            "score": 1,
            "text": "And Syria before that.",
            "title_similarity": "0.21680517"
        },
        {
            "id": "i2vl1l1",
            "score": 1,
            "text": "He ain't wrong",
            "title_similarity": "0.02073806"
        },
        {
            "id": "i2vl3sv",
            "score": 1,
            "text": "Hindsight is a gift and a curse. Hard to disagree with him but the world was and still is hopelessly divided. If people can’t figure out this is good versus evil by now then they just don’t want to see for reasons I wish I could explain. Good will win, we have to, but it’s going to get worse before it gets better I’m afraid",
            "title_similarity": "0.6115044"
        },
        {
            "id": "i2vl4e6",
            "score": 1,
            "text": "This could be avoided if NATO let Ukraine join after 2015 and Minsk Agreement or if U.S. sent the military to Ukraine last year to prevent Russian invasion.",
            "title_similarity": "0.7893952"
        },
        {
            "id": "i2vl4ym",
            "score": 1,
            "text": "Mr. Zelensky, I think you are a hero. But no one likes Captain Hindsight. \n\nIn 2014, the Maidan revolution was a borderline coup. The President who ran away - Yanukovich (who was advised by Paul Manafort) and his successor (after Maidan) were both really corrupt on their face; there was no way the USA was going to get into a conflict there with these partners.\n\nOn top of that, at home, Obama was a lame duck, with a raging racist conspiracy floating around that he was not even American. Congress was held by the Republicans, who would not authorize any action against Russia (and McConnel walked back Obama's sanctions 3 years later).",
            "title_similarity": "0.69372874"
        },
        {
            "id": "i2vl61e",
            "score": 1,
            "text": "And he not wrong. We know how bullies act when everyone turns a blind eye.",
            "title_similarity": "0.3880273"
        },
        {
            "id": "i2vl631",
            "score": 1,
            "text": "No shit?\n\nI think even little kids understand what happens when you give a mouse a cookie.",
            "title_similarity": "0.19324899"
        },
        {
            "id": "i2vl7g3",
            "score": 1,
            "text": "It gets them NOTHING politically to do that. \n\nWars cost money. Wars cost lives. Unless they can find a way to steal money from the war machine, they won't do it.",
            "title_similarity": "0.5802814"
        },
        {
            "id": "i2vlae6",
            "score": 1,
            "text": "We weren’t aware it was a total takeover, at the time it seemed like a legit splinter off of a region. Now it’s super obvious the votes were faked and the people likely were forced to accept Russian rule in Crimea. It was a legit mistake of the USA to have been so lenient, though never again. And to the Ukrainians we’re sorry we weren’t as forceful back then.",
            "title_similarity": "0.79772794"
        },
        {
            "id": "i2vlb73",
            "score": 1,
            "text": "Truth",
            "title_similarity": "-0.00066937413"
        },
        {
            "id": "i2vldwq",
            "score": 1,
            "text": "It is a miracle that they do something now!",
            "title_similarity": "0.13452911"
        },
        {
            "id": "i2vlemd",
            "score": 1,
            "text": "Yes. Fucking waffle leaders.",
            "title_similarity": "0.15490034"
        },
        {
            "id": "i2vlg3f",
            "score": 1,
            "text": "I agree that they should have done a lot more. But after seeing how Putin is still hell bent on sending another wave into the meat grinder even now, I can't see how this would have stopped him. \n\nPutin is one of those people who once he gets an idea in his head he just keeps going and is incapable of adapting to the situation.",
            "title_similarity": "0.6279177"
        },
        {
            "id": "i2vlgtb",
            "score": 1,
            "text": "He’s not wrong on that one.",
            "title_similarity": "0.043384872"
        },
        {
            "id": "i2vliat",
            "score": 1,
            "text": "Pretty much this.",
            "title_similarity": "-0.06189688"
        },
        {
            "id": "i2vljhe",
            "score": 1,
            "text": "Too bad we have such failed leadership.",
            "title_similarity": "0.3585487"
        },
        {
            "id": "i2vlmaq",
            "score": 1,
            "text": "Hindsight's always 20/20",
            "title_similarity": "0.23510079"
        },
        {
            "id": "i2vlogm",
            "score": 1,
            "text": "It seems pretty dumb to say \"Screw you for helping me out now instead of earlier\" while someone is helping you.\n\nSeems like a great way to risk having them stop helping you right now too since you're being obnoxious to them, not grateful or even neutral.\n\nWorld leaders didn't OWE you anything and stll don't.",
            "title_similarity": "0.6288679"
        },
        {
            "id": "i2vlp00",
            "score": 1,
            "text": "That for sure makes sense",
            "title_similarity": "-0.030395463"
        },
        {
            "id": "i2vlr2l",
            "score": 1,
            "text": "Hindsight is always 20/20",
            "title_similarity": "0.23473582"
        },
        {
            "id": "i2vlvwv",
            "score": 1,
            "text": "True story.",
            "title_similarity": "0.036842424"
        },
        {
            "id": "i2vlvyj",
            "score": 1,
            "text": "Totally agree. I always thought it odd that Russia was not punished even though so many rely on their energy.\n\nLesson learned. I guess.",
            "title_similarity": "0.54592586"
        },
        {
            "id": "i2vlyam",
            "score": 1,
            "text": "Well, that’s probably true.  But they didn’t, and would they have done ?\n\nNibbling away at Ukraine, somehow was less of an issue than a full assault.  But I don’t really know what the political and military calculations were at the time.\n\nYou can even make a similar argument this time about other countries not having greater direct involvement, but again it’s a calculated decision.\n\nIn both cases maybe they got those calculations wrong ?  But in the first case the present extent of sanctions should not have been so widely agreed to.\n\nAt least that’s my thought on this.   \nWhat do others think ?",
            "title_similarity": "0.76186264"
        },
        {
            "id": "i2vm4ch",
            "score": 1,
            "text": "Fax.",
            "title_similarity": "0.10763992"
        },
        {
            "id": "i2vmjxq",
            "score": 1,
            "text": "It’s easy to say this now but what if it just lead to something like this happening sooner rather than later.",
            "title_similarity": "0.27300793"
        },
        {
            "id": "i2vmkkx",
            "score": 2,
            "text": "Cannot argue with that..",
            "title_similarity": "0.19560935"
        },
        {
            "id": "i2vmru8",
            "score": 1,
            "text": "To be a sovereign country it means to stand on your own.",
            "title_similarity": "0.33028984"
        },
        {
            "id": "i2vmtvb",
            "score": 1,
            "text": "I’ve heard China and their people are buying the ruble",
            "title_similarity": "0.30603492"
        },
        {
            "id": "i2vmygx",
            "score": 1,
            "text": "If this man's balls get any bigger they're going to blot out the sun.",
            "title_similarity": "0.37405166"
        },
        {
            "id": "i2vn00n",
            "score": 1,
            "text": "Let's go back to 2008 and Georgia",
            "title_similarity": "0.29588893"
        },
        {
            "id": "i2vn1an",
            "score": 2,
            "text": "Is nobody going to mention what Russia did in Syria? Russia has been getting away with large  scale slaughter for a long time now.",
            "title_similarity": "0.57341146"
        },
        {
            "id": "i2vn2ev",
            "score": 1,
            "text": "Russia gets a Dem elected and Russia gets a chuck of another country. Obama promised flexibility, Putin got it. It was supposed to happen in 2016, but Trump threw a wrench in the plan. Biden will give Russia as much land as they need and soon we'll be back to BAU like we did under Obama.",
            "title_similarity": "0.6350912"
        },
        {
            "id": "i2vn9e1",
            "score": 1,
            "text": "No it couldn’t have. It could’ve without the 2014 coup though.",
            "title_similarity": "0.58771145"
        },
        {
            "id": "i2vnc8r",
            "score": 1,
            "text": "He ain’t wrong",
            "title_similarity": "0.031300418"
        },
        {
            "id": "i2vne0i",
            "score": 1,
            "text": ":( he's not exactly wrong that things could have possibly been different. I liked Obama's domestic policies but I will always think that he was weak when it came to global politics (Afghanistan, Iraq, Syria, Ukraine)",
            "title_similarity": "0.6073054"
        },
        {
            "id": "i2vnqzr",
            "score": 1,
            "text": "Hot take: Western banks/corporations/lobbyists would not have allowed their governments to impose harsher sanctions in 2014. I doubt Crimeria  alone justified closing off a market of 140 million people.",
            "title_similarity": "0.72126174"
        },
        {
            "id": "i2vnxt7",
            "score": 1,
            "text": "Hey it’s Monday morning QB time!",
            "title_similarity": "0.15888797"
        },
        {
            "id": "i2vnzd9",
            "score": 1,
            "text": "Well….he’s not entirely wrong.",
            "title_similarity": "0.001785594"
        },
        {
            "id": "i2vo56y",
            "score": 1,
            "text": "The thing that bothers me the most about this dude is that he doesn’t seem to understand that we’ve been trying to avoid nuclear escalation since the Cold War. \n\nThere’s so much at stake when it comes to the US vs Russia. Their army might be absolute shit and out of date but I won’t underestimate the collateral damage an ICBM could do. \n\nIf they press the button, NATO does too and and a lot of people will die the first day and years to come after that.",
            "title_similarity": "0.6941164"
        },
        {
            "id": "i2vocs0",
            "score": 1,
            "text": "I agree",
            "title_similarity": "-0.07709621"
        },
        {
            "id": "i2voebz",
            "score": 1,
            "text": "This is why Russia was caught by surprise. After previously being allowed to take Crimea, and China taking back Hong Kong, Russia truly expected minimal consequences.",
            "title_similarity": "0.6724316"
        },
        {
            "id": "i2vof4y",
            "score": 1,
            "text": "It's true, but think of the economical profit we've made from Russia in the meantime! 8 years of happy shareholders!\n\n(/s)",
            "title_similarity": "0.41362545"
        },
        {
            "id": "i2vofbz",
            "score": 1,
            "text": "I think that sometimes, especially when one doesn’t want to be seen as an imperialistic pig, there’s not much they can do to stop an invasion of another country. On the other hand, does it really matter what other people think when THIER OWN (Russia) intentions aren’t honest? #noflyzone",
            "title_similarity": "0.6991797"
        },
        {
            "id": "i2vofog",
            "score": 1,
            "text": "You mean it wasn’t because Trump didn’t get re-elected? /s",
            "title_similarity": "0.5543395"
        },
        {
            "id": "i2voi9d",
            "score": 1,
            "text": "Russia was and remains a wildcard. We didn’t really know their capabilities. Now we do: they have stupidly been bluffing while their kleptocrats stole all the military budget.  Their military couldn’t fight its way out of a paper bag when a real opposition shows itself. \n\nThere is even very good reason to wonder if the Russian nuclear arsenal is even war ready. Apparently nuclear arsenals are VERY expensive to maintain and keep in working order. Considering the state of the rest of their military why should anybody believe they can get warheads to their intended targets?  \n\nThe problem is that if only 1% of their arsenal is able to be fired successfully, (760 estimated ICBMs with 12 warheads each, 7-8 being 1%) the total area of destruction would be massive.  One of those ICBMs can take out an area the size of France. 7-8 could destroy France, Germany, England, the US northeast’s major cities (inc. DC), California 2 major pop centers  and still have 1-2 to spare for other targets.",
            "title_similarity": "0.639158"
        },
        {
            "id": "i2voje1",
            "score": 1,
            "text": "it also could have been avoided if putin wasnt in power. Hypotheticals are fun aren't they!",
            "title_similarity": "0.6967424"
        },
        {
            "id": "i2vokys",
            "score": 1,
            "text": "Or you know if the US had not helped with coup to the government of Ukraine",
            "title_similarity": "0.70954275"
        },
        {
            "id": "i2voq3u",
            "score": 1,
            "text": "Obama was pretty weak in this area, and the Trump was his paid lackey.",
            "title_similarity": "0.44866556"
        },
        {
            "id": "i2vouqt",
            "score": 1,
            "text": "Also coulda been avoided by not flirting so much with NATO. js",
            "title_similarity": "0.62354445"
        },
        {
            "id": "i2vouv1",
            "score": 1,
            "text": "Yup. World leaders were completely on this Idiot's side back then. Why cause they were equal idiots",
            "title_similarity": "0.52364206"
        },
        {
            "id": "i2voy25",
            "score": 1,
            "text": "It's true. That's a lesson to learn for future generations, I hope...",
            "title_similarity": "0.1821787"
        },
        {
            "id": "i2voy5j",
            "score": 1,
            "text": "True I’ll give him that",
            "title_similarity": "0.017517142"
        },
        {
            "id": "i2voyqp",
            "score": 1,
            "text": "Punish him how? The guy has nukes. Sanctions don't work. What did he want?",
            "title_similarity": "0.49923146"
        },
        {
            "id": "i2vp0ab",
            "score": 1,
            "text": "Time to correct some wrongs.",
            "title_similarity": "0.3233527"
        },
        {
            "id": "i2vp2x8",
            "score": 2,
            "text": "If he won't be punished and removed from his position as the president of Russia then there is no guarantee that he will stop now",
            "title_similarity": "0.74932945"
        },
        {
            "id": "i2vp5to",
            "score": 1,
            "text": "I mean... yeah.",
            "title_similarity": "-0.06462507"
        },
        {
            "id": "i2vp9uu",
            "score": 2,
            "text": "Why is horrors in quotes?",
            "title_similarity": "0.36710075"
        },
        {
            "id": "i2vpaqa",
            "score": 1,
            "text": "Who was in office during that time ?",
            "title_similarity": "0.07140478"
        },
        {
            "id": "i2vpcj0",
            "score": 1,
            "text": "I remember 44 imposed sanctions with some congressional support and expected it too continue.\n\nExcept we got the 5th column which ended up sucking Putins nuts for a few years, still ongoing it seems.  That gap did not help. But yes the \"response\" was nowhere near what it shouldve been.",
            "title_similarity": "0.56126285"
        },
        {
            "id": "i2vpdd1",
            "score": 1,
            "text": "Ehh, I'd go further back to the invasion of Georgia in 2008. 2014 was too late.",
            "title_similarity": "0.5870858"
        },
        {
            "id": "i2vpf4f",
            "score": 1,
            "text": "yeah no shit or if the world leaders would have decided to make Ukraine a neutral country and develop it financially and not ideologically and militarily \n\nback in 2008 in bucarest putin basically said that if ukraine or Georgia joined EU or NATO that they will wreck and destroy both countries and in the west we still tried to do so, \n\nin the west people clearly don't care a bout ukraine or Georgia, why is it not a nato state already? why is it not part of the European union yet? we are just causing troubles for 3rd world countries like always",
            "title_similarity": "0.7873815"
        },
        {
            "id": "i2vpgq4",
            "score": 1,
            "text": "Try 1992, when they invaded Georgia and committed ethnic cleansing.",
            "title_similarity": "0.479423"
        },
        {
            "id": "i2vpk13",
            "score": 1,
            "text": "Is there anyway i can block all this boring Russian shit?",
            "title_similarity": "0.64087117"
        },
        {
            "id": "i2vpki1",
            "score": 1,
            "text": "Is he slowly realizing that the West is using Ukraine as cannon fodder in a proxy war against Russia? The sooner he wakes up to that the sooner he can save Ukrainian lives.",
            "title_similarity": "0.7280664"
        },
        {
            "id": "i2vplov",
            "score": 1,
            "text": "Give them an inch, they try to take a mile. Time to stop letting Russia take inches.",
            "title_similarity": "0.588693"
        },
        {
            "id": "i2vpmhg",
            "score": 1,
            "text": "He is not wrong about that!! Fuck all these leaders!!",
            "title_similarity": "0.27191892"
        },
        {
            "id": "i2vpqdf",
            "score": 1,
            "text": "He's absolutely right, what we did back then was basically appeasement and that has never once worked.",
            "title_similarity": "0.43174842"
        },
        {
            "id": "i2vpqls",
            "score": 1,
            "text": "Agreed. But the annexation was done so covertly it was like it didn’t happen. I remember watching Caspian Report and finding out about it. The mainstream media reported but didn’t really state the implications of what was happening. And of course Putin was like, whatcha talking’ about?",
            "title_similarity": "0.6294902"
        },
        {
            "id": "i2vpwtx",
            "score": 1,
            "text": "Yeah, people says Putins terrible decision making is because he's cracked or an idiot or something, but considering he just strolled into another country and took part of it and nothing came of it, it's really not that surprising that he thought this plan might work out no matter how dumb it might seem in hindsight.",
            "title_similarity": "0.6585542"
        },
        {
            "id": "i2vq1ev",
            "score": 1,
            "text": "hindsight 20/20 a lot of shit coulda been done to prevent this. :(",
            "title_similarity": "0.55874705"
        },
        {
            "id": "i2vq3a7",
            "score": 1,
            "text": "He’s right.  And we are continuing to make the same mistakes now.  Being too cowardly to make people face the consequences of their actions will just embolden them to push the envelope farther.  Its fucking embarrassing.",
            "title_similarity": "0.5797706"
        },
        {
            "id": "i2vq4iq",
            "score": 1,
            "text": "Truth.",
            "title_similarity": "0.0006099632"
        },
        {
            "id": "i2vq8oh",
            "score": 1,
            "text": "Hind sight is 20/20.  No one knew Putin was gonna get here.  Putin is the new Hitler - killing the elderly, killing babies, bombing hospitals.  Watched a video of a tank crushing two old folks driving a tiny sedan.  If that was my grandparents I’d want their whole country to pay in blood.  It’s kinda great for Germans tho, WWII and those atrocities won’t be the only ones used in text books.",
            "title_similarity": "0.58208275"
        },
        {
            "id": "i2vqb5g",
            "score": 1,
            "text": "I agree!",
            "title_similarity": "-0.059046913"
        },
        {
            "id": "i2vqfz4",
            "score": 1,
            "text": "100% agree. I mean we could of even tried it back with South Ossetia as well.",
            "title_similarity": "0.36164337"
        },
        {
            "id": "i2vqg8h",
            "score": 1,
            "text": "If only.",
            "title_similarity": "0.079707205"
        },
        {
            "id": "i2vqhf9",
            "score": 1,
            "text": "Honest question - What would/could/should we have done differently? What is he suggesting we pragmatically could have done with hindsight being 20/20?\n\nWe (US) sanctioned Russia then in some key ways to cripple their military development. Given the less-than-strategic importance of Crimea, it didn’t make much sense to do more than that at the time given our intelligence…\n\nInterested to hear about realistic solutions or courses of action considering what we knew at that time or is this Zelensky grand standing and a bit frustrated?",
            "title_similarity": "0.82065463"
        },
        {
            "id": "i2vqix3",
            "score": 1,
            "text": "Reminds me of Munich 1936....",
            "title_similarity": "0.23221414"
        },
        {
            "id": "i2vqj01",
            "score": 1,
            "text": "I’ve been wondering when that would come up. Literally, give an inch and they’ll take a mile.",
            "title_similarity": "0.2879222"
        },
        {
            "id": "i2vqmbh",
            "score": 1,
            "text": "It’s almost like the world leaders know what’s going on and are actively choosing to let it happen.",
            "title_similarity": "0.33299768"
        },
        {
            "id": "i2vquaq",
            "score": 1,
            "text": "Appeasement 101",
            "title_similarity": "0.12385462"
        },
        {
            "id": "i2vquq4",
            "score": 2,
            "text": "The only ones who care are the poor. so it doesnt really matter. The rich will get richer",
            "title_similarity": "0.31543267"
        },
        {
            "id": "i2vqv0c",
            "score": 1,
            "text": "Would of, could of, should of.....",
            "title_similarity": "0.13861138"
        },
        {
            "id": "i2vqxkw",
            "score": 2,
            "text": "That's exactly why Russia had unmarked soldiers, and only after a year (once everything was secured) Putin acknowledged it was them.",
            "title_similarity": "0.49135482"
        },
        {
            "id": "i2vqxsf",
            "score": 1,
            "text": "You should be happy that the world even got involved with your country",
            "title_similarity": "0.2726999"
        },
        {
            "id": "i2vqynw",
            "score": 1,
            "text": "It’s not the world’s responsibility 🤦🏻‍♂️",
            "title_similarity": "0.2600658"
        },
        {
            "id": "i2vr0rh",
            "score": 2,
            "text": "\"Thanks, Obama\" - Zelenskyy",
            "title_similarity": "0.25996327"
        },
        {
            "id": "i2vr15f",
            "score": 1,
            "text": "Straight facts. He warned them then. And now, sadly, has been justified in his claims",
            "title_similarity": "0.34279054"
        },
        {
            "id": "i2vr1c2",
            "score": 1,
            "text": "He is correct",
            "title_similarity": "0.004919216"
        },
        {
            "id": "i2vr3nq",
            "score": 1,
            "text": "1000% correct.",
            "title_similarity": "0.050523188"
        },
        {
            "id": "i2vr5tz",
            "score": 1,
            "text": "On the plus side, Crimea is literally the reason why Putin fucked up SO badly with the current invasion. Ukrainian troops surrendered immediately in Crimea and Putin thought they would do the same now.",
            "title_similarity": "0.73686534"
        },
        {
            "id": "i2vr7em",
            "score": 1,
            "text": "https://share.socialdm.co/aerogz",
            "title_similarity": "0.15851864"
        },
        {
            "id": "i2vr8eh",
            "score": 1,
            "text": "100% right.\nUkraine have so many rooting for them but there are still many who  look at Ukraine and think why should I care? failing to realize that these folks are laying down their lives to fight not only for their own sovereignty but for democracy in general which benefits us all. \n\nThis planet will be a hellscape for us all if dictators like Putin get their way. It's no secret that putin's desire is to force  other countries to be just like Russia. He is making a global effort to export fascism any and everywhere. It still boggles my mind that one maniac can literally hold us all hostage in this way in some form or another.",
            "title_similarity": "0.6291139"
        },
        {
            "id": "i2vraf3",
            "score": 1,
            "text": "Especially if Europe didn't make themselves further captive to Russian energy after the fact.  A huge blunder.",
            "title_similarity": "0.67442"
        },
        {
            "id": "i2vrdm3",
            "score": 1,
            "text": "Or Germany hadn't vetoed it's NATO membership in 2008",
            "title_similarity": "0.5120348"
        },
        {
            "id": "i2vrfms",
            "score": 1,
            "text": "Yeah, but that would have been *hard*.  \n\nPoliticians don't like doing the right thing, if doing the right thing is difficult and simply *ignoring* the problem is an option.",
            "title_similarity": "0.51523256"
        },
        {
            "id": "i2vrha9",
            "score": 1,
            "text": "Sure and then we can punish Ukraine for murdering 14,000 people during that annexation, since we’re all for punishment these days.",
            "title_similarity": "0.5771228"
        },
        {
            "id": "i2vrigv",
            "score": 1,
            "text": "Curious on suggestions to punish Putin in 2014. Even more and harsher sanctions? I'm also not familiar with what kind of punishment Putin got (if any) for invading Georgia in 2008.",
            "title_similarity": "0.7299506"
        },
        {
            "id": "i2vrj5e",
            "score": 1,
            "text": "There were sanctions put in place. Maybe they could have gone harder, though.",
            "title_similarity": "0.49564517"
        },
        {
            "id": "i2vrlez",
            "score": 1,
            "text": "Well you see they were busy bombing civilians themselves and they didn't wanna look like hypocrites",
            "title_similarity": "0.5098359"
        },
        {
            "id": "i2vrq3z",
            "score": 1,
            "text": "Putin was at the pinnacle of global control due to his financial “donations” to politicians (and not just in the US) - but especially within the US. \n\nThere was zero stomach for any real response.",
            "title_similarity": "0.5590507"
        },
        {
            "id": "i2vrv2i",
            "score": 1,
            "text": "100% True. Some of the blood of Ukrainians is on world leaders at the time hands.",
            "title_similarity": "0.34093356"
        },
        {
            "id": "i2vs2cx",
            "score": 1,
            "text": "In 2014 the Ukraine was a Russian puppet state.",
            "title_similarity": "0.63417214"
        },
        {
            "id": "i2vsf2k",
            "score": 1,
            "text": "Damn seems like Joe screwed up twice then.",
            "title_similarity": "0.24502867"
        },
        {
            "id": "i2vsfo6",
            "score": 1,
            "text": "Nodding aggressively",
            "title_similarity": "0.0095022805"
        },
        {
            "id": "i2vsi5m",
            "score": 1,
            "text": "Blame the Donaldz",
            "title_similarity": "0.42267883"
        },
        {
            "id": "i2vslcc",
            "score": 1,
            "text": "In Germany we say \"Hätte, hätte, Fahrradkette.\"",
            "title_similarity": "0.29234642"
        },
        {
            "id": "i2vsrkp",
            "score": 1,
            "text": "interesting",
            "title_similarity": "0.02229343"
        },
        {
            "id": "i2vsuc7",
            "score": 1,
            "text": "Why is this upvoted or even needing to be said the whole world no. And some world leaders have said it.",
            "title_similarity": "0.50303507"
        },
        {
            "id": "i2vswtg",
            "score": 1,
            "text": "America was deeply involved fighting ISIS in Iraq and Syria as well as the Taliban/AQ in Afghanistan. Also in 2014 Ukraine was in the middle of the Maidan Revolution during that time.",
            "title_similarity": "0.4867944"
        },
        {
            "id": "i2vswv1",
            "score": 1,
            "text": "Also if the US didn't back a coup in 2014. Just saying",
            "title_similarity": "0.6265193"
        },
        {
            "id": "i2vt4hd",
            "score": 1,
            "text": "Zelensky is correct.  Unfortunately, it often takes several steps beyond the pale for the Free World to take notice.",
            "title_similarity": "0.28232828"
        },
        {
            "id": "i2vt62n",
            "score": 1,
            "text": "President Obama the 2020’s foreign policy is calling your name…",
            "title_similarity": "0.42371446"
        },
        {
            "id": "i2vt9j5",
            "score": 1,
            "text": "In 2014 there were only %15 of ethnic Ukrainians. Crimea was part of Ukraine SSR (1954–1991). and part of Ukraine as a sovereign country from (1991 - 2014). Crimea would still be part of Ukraine if U.S. didn't help stage the coup and install a puppet government (see comments from Victoria \"f\\*ck the EU\" Nuland\"",
            "title_similarity": "0.723734"
        },
        {
            "id": "i2vtahd",
            "score": 1,
            "text": "I graduated from High School in 2014, so that era is vividly time stampped in my memory. It's very strange to be a young adult, seeing what was is going on in the world, and realize you are going to spend the rest of your adulthood cleaning up this mess. Specifically growing up as an American, approaching the age which I was old enough to vote, and observing the Tea Party hate President Obama up close and personal in the deep south. If \"we\" were not focused on scoring domestic political points, America could have stood up more forcefully, but we didn't so, here we are.",
            "title_similarity": "0.61540943"
        },
        {
            "id": "i2vti0c",
            "score": 2,
            "text": "I was thinking this for the past 8 years. That if you let countries be stolen like that then why not keep doing it.",
            "title_similarity": "0.5554456"
        },
        {
            "id": "i2vtqbn",
            "score": 1,
            "text": "hes no wrong",
            "title_similarity": "0.038805224"
        },
        {
            "id": "i2vtrje",
            "score": 1,
            "text": "He's not wrong. I chalk it up as one of Obama's greatest failures. Though it wasn't just him, the Republican controlled congress also had no interest in lifting a finger. Of course now we know why they weren't, all those sweet NRA laundered rubles being funneled into their campaigns by people like Manafort. And they probably had similar operations going on in Europe.",
            "title_similarity": "0.6373638"
        },
        {
            "id": "i2vtvie",
            "score": 1,
            "text": "And bombed childeren in Syria.",
            "title_similarity": "0.3571548"
        },
        {
            "id": "i2vtzwi",
            "score": 1,
            "text": "Ukraine ought to liberate Crimea today as well.",
            "title_similarity": "0.60468066"
        },
        {
            "id": "i2vu04a",
            "score": 1,
            "text": "If ifs and buts...",
            "title_similarity": "0.121335775"
        },
        {
            "id": "i2vu5gy",
            "score": 1,
            "text": "He’s right. It’s almost like we had countless warnings of Putins rise to tyranny. Just like Trump in America, if only someone did something before it was too late.",
            "title_similarity": "0.7314426"
        },
        {
            "id": "i2vu773",
            "score": 1,
            "text": "I mean yeah but nuclear weapons. Same problem.",
            "title_similarity": "0.35322586"
        },
        {
            "id": "i2vu9c1",
            "score": 2,
            "text": "Why is the word “horrors” in quotes?",
            "title_similarity": "0.375503"
        },
        {
            "id": "i2vudnc",
            "score": 1,
            "text": "Georgians - \"guess we're chopped liver...\"",
            "title_similarity": "0.37294698"
        },
        {
            "id": "i2vue25",
            "score": 1,
            "text": "100% agree. I was appalled when the world did nothing when GWBush/Cheney did shock and awe and felt the same when Russia invaded the first time.",
            "title_similarity": "0.5160491"
        },
        {
            "id": "i2vufod",
            "score": 1,
            "text": "VZ is right, but Putin timed it perfect for Donny coming in. He just read from a script he wrote.  \nBut Putin totally read the tea-leaves wrong this time - especially his own worth in military & bully-boy terms & he also read the room wrong on the international community being cohesive & decisive in their condemnation with sanctions etc..  \nWe all know if this dog gets off the leash, we're all getting rabies.",
            "title_similarity": "0.5962162"
        },
        {
            "id": "i2vuhv0",
            "score": 1,
            "text": "And he right, but ofc the situation is complex",
            "title_similarity": "0.18531501"
        },
        {
            "id": "i2vujei",
            "score": 1,
            "text": "Is this the same guy who told the US they were being hysterical and paranoid when we repeatedly warned russia was going to invade",
            "title_similarity": "0.57603514"
        },
        {
            "id": "i2vujz5",
            "score": 1,
            "text": "Most likely",
            "title_similarity": "0.010342248"
        },
        {
            "id": "i2vun1v",
            "score": 1,
            "text": "he’s not wrong but then everybody would’ve shit a brick because Obama started WWIII",
            "title_similarity": "0.5086972"
        },
        {
            "id": "i2vuo4x",
            "score": 1,
            "text": "Absolutely! Now Ukraine is paying the price for their cowardice. Any settlement they make should include the return of all “appropriated” land, including Crimea.",
            "title_similarity": "0.6466901"
        },
        {
            "id": "i2vuq0b",
            "score": 1,
            "text": "I can’t disagree with him, but I think the fact that Trump came along and did everything he could to grant Putin total impunity at least didn’t help…",
            "title_similarity": "0.67258"
        },
        {
            "id": "i2vuv6v",
            "score": 1,
            "text": "And then stick with Turkey to defeat Russia in Syria in 2015.\n\nAfter the US did nothing in 2014 Putin entered Syria in 2015. Funny how that works.",
            "title_similarity": "0.7566471"
        },
        {
            "id": "i2vv1o5",
            "score": 1,
            "text": "Pretty basic objectively true statement. Doesn't change anything for anyone now, though.",
            "title_similarity": "0.2187866"
        },
        {
            "id": "i2vv8f6",
            "score": 1,
            "text": "I can’t remember it very well but why did sanctions or any response not amount to anything after crimea. Was it simple incompetence?",
            "title_similarity": "0.57940733"
        },
        {
            "id": "i2vv8hv",
            "score": 1,
            "text": "It’s important to remember what is going on. Right now the west is supporting the military of a democratically elected government to fight an invading enemy. They are also applying sanctions to the invading country. \n\nIn 2014, as I understand it, the Ukrainians military was not what it is today. It was not in a position to fight the Russians the way it is today, even with support from western countries. The sanctions would probably not have made a difference to whether Putin kept Crimea. The fighting would have prevented Ukraine from developing the military it has today. What the world did at the time made sense and was consistent with international order. \n\nFor a western alliance to go in and protect Crimea would have meant war and it would have set a dangerous precedent. The western alliance would be declaring that they are the arbiters of regime change and international police. They would be opened up to challengers from around the world. It would likely have lead to a world war. \n\nThe current rules based system is meant to keep peace as much as possible. Create a path of negotiation to settle disputes and avoid war. I don’t see how Ukraine could have been protected and Russia kept out of Crimea without a war. It was avoided for 8 years. Hopefully it can be contained to Ukraine. Nobody likes that solution but the alternative is more chaos than there is right now. \n\nIt reminds me of Syria. The west should probably have gone in to push out Assad in Syria and push along regime change. But it wasn’t clear who would take over and whether it would be democratic. And western boots on the ground in Syria would have meant a serious escalation of the conflict. In some ways Ukraine in 2014 was closer to Syria. It was not clear who to support and whether they could win without actual foreign military involvement and that is a paradigm shift in the international order that people are not willing to make.\n\nI don’t like it but I think the west is behaving consistently and in a way that avoids and puts off war as much as possible.",
            "title_similarity": "0.8110074"
        },
        {
            "id": "i2vvcsh",
            "score": 1,
            "text": "Agree 100%. This is what happens when the world just watches. As long as the wealthy keep getting more wealthy, everyone gladly turns a blind eye.",
            "title_similarity": "0.31986907"
        },
        {
            "id": "i2vveli",
            "score": 1,
            "text": "Not punishing the annexation of Crimea was a green light for further incursion.",
            "title_similarity": "0.69228715"
        },
        {
            "id": "i2vvfua",
            "score": 1,
            "text": "Sounds like another Rhineland situation.   It's almost like we've seen this before huh?",
            "title_similarity": "0.32368025"
        },
        {
            "id": "i2vvg0i",
            "score": 1,
            "text": "EU countries that saw the horrors of communism will never be able to finish their drink of “I told you so”.",
            "title_similarity": "0.59322536"
        },
        {
            "id": "i2vvje4",
            "score": 1,
            "text": "Zelenskyy should be careful, too much honesty will ruffle some feathers.",
            "title_similarity": "0.44415835"
        },
        {
            "id": "i2vvl8r",
            "score": 1,
            "text": "He is not wrong.  Much like we could have avoided 1/6 in this country if we had prosecuted Nixon.",
            "title_similarity": "0.6487914"
        },
        {
            "id": "i2vvpy2",
            "score": 1,
            "text": "Well there you have it. It’s everyone else’s fault.\n\nThat’s not how leadership works.",
            "title_similarity": "0.4501662"
        },
        {
            "id": "i2vvq5p",
            "score": 1,
            "text": "Wasn't there a vote in Crimea back then  to secede from Ukraine. Does anyone know the result?",
            "title_similarity": "0.6373236"
        },
        {
            "id": "i2vvqhk",
            "score": 1,
            "text": "Fair point but it is slightly different though. Crimea is largely made of ethnic Russians, and it has a much greater historical connection to Russia.\n\nFar more people agree with 'Crimea is part of Russia' than 'Ukraine us part of Russia'\n\nThe first statement is arguable, the second pretty much isn't.",
            "title_similarity": "0.6359568"
        },
        {
            "id": "i2vvrig",
            "score": 1,
            "text": "Change it to Taiwan, China... You now can see the future.",
            "title_similarity": "0.32103443"
        },
        {
            "id": "i2vvsyv",
            "score": 2,
            "text": "\r  \nWell, or the world community would pay attention to what the Ukrainian authorities are doing in the South East. And everyone paid no attention to the OSCE reports. The United States will fight Russia until the last Ukrainian, as they say.",
            "title_similarity": "0.6775811"
        },
        {
            "id": "i2vvtf8",
            "score": 1,
            "text": "He’s right.  They wanted to keep stroken Putin for their own gain probably.  War is so fucken stupid.  It need me to be taboo.",
            "title_similarity": "0.7215135"
        },
        {
            "id": "i2vw1qb",
            "score": 1,
            "text": "He's right. Hitler annexed territories prior to his invasions of Poland and France. Learn history and take appropriate actions or your doomed to repeat it",
            "title_similarity": "0.5871556"
        },
        {
            "id": "i2vw4vt",
            "score": 1,
            "text": "When comedy meets truth.",
            "title_similarity": "0.20831236"
        },
        {
            "id": "i2vw5ye",
            "score": 1,
            "text": "This is all about one man, and we all know who it is.  If someone in the Kremlin has the balls to feed this guy a polonium sandwich, the world will be a better place for it.",
            "title_similarity": "0.49940413"
        },
        {
            "id": "i2vwate",
            "score": 1,
            "text": "Hindsight is a wonderful thing.",
            "title_similarity": "0.2236056"
        },
        {
            "id": "i2vwg6r",
            "score": 1,
            "text": "*nods, yes, and...?  \n\nWhat's more, we taught Putin/Russian leaders they'd effectively be rewarded for such behavior, hence they were so shocked that this time the West engaged such harsh sanctions.",
            "title_similarity": "0.6035366"
        },
        {
            "id": "i2vwhnx",
            "score": 1,
            "text": "He has a point. Russia got away with far too much until Ukraine said ENOUGH!, War. Murder, theft, election tinkering, human trafficking. they did pretty much whatever they wanted with no consequences",
            "title_similarity": "0.64813447"
        },
        {
            "id": "i2vwjuk",
            "score": 2,
            "text": "Crimea it's much different than what is currently happening, shame he should even mention them considering the humanitarian atrocity Ukraine themselves committed by cutting off their water supply",
            "title_similarity": "0.6960459"
        },
        {
            "id": "i2vwkjv",
            "score": 1,
            "text": "Joseph Goebbels is supposed to have said \"If you tell a lie big enough and keep repeating it, people will eventually come to believe it. The lie can be maintained only for such time as the State can shield the people from the political, economic and/or military consequences of the lie. It thus becomes vitally important for the State to use all of its powers to repress dissent, for the truth is the mortal enemy of the lie, and thus by extension, the truth is the greatest enemy of the State.\"\n\nI believe the concept to be something that repressive governments follow although there is disagreement as to whether **[Goebbels actually said it.](https://www.jewishvirtuallibrary.org/joseph-goebbels-on-the-quot-big-lie-quot)** Other sources do claim it is a quote by Goebbels.",
            "title_similarity": "0.62821215"
        },
        {
            "id": "i2vwkv4",
            "score": 1,
            "text": "Could have also been avoided if the Ukraine had an army and their own supplies. Beggars can’t be choosers",
            "title_similarity": "0.7089584"
        },
        {
            "id": "i2vwn2b",
            "score": 1,
            "text": "Hard to roll that in 1 yr for obama. Then ya know the next 4 years didn't have a chance.",
            "title_similarity": "0.41496825"
        },
        {
            "id": "i2vwsps",
            "score": 1,
            "text": "The title perfectly encapsulates the reality. I couldn’t believe the West would go all Neville Chamberlain. Again.",
            "title_similarity": "0.47937346"
        },
        {
            "id": "i2vwusy",
            "score": 1,
            "text": "100% just like the 1930s. And we're still sorta doing nothing. Really just prolonging it by handing guns over, promoting more bloodshed on both sides. Nato and UN should have stepped in a month ago and squashed the crew as soon as the russian soldiers stepped onto the border.\nIf we do something now it will take a whole bunch more effort. China probably won't be happy if we do and that will complicate trade on a global scale for so many. But if we do nothing there'll be just more bloodshed and the corrupt will spread, bringing more of the same along their path. Difficult adult decisions need to be made to mitigate more loss of life.",
            "title_similarity": "0.69610345"
        },
        {
            "id": "i2vx65v",
            "score": 2,
            "text": "Yup. Instead, we (UK) laundered their stolen money.",
            "title_similarity": "0.42904848"
        },
        {
            "id": "i2vxcb4",
            "score": 1,
            "text": "True.",
            "title_similarity": "-0.07547066"
        },
        {
            "id": "i2vxd7c",
            "score": 1,
            "text": "I was working with a Serbian guy at the time and he equated the situation to the Serbian war. Serbia still hasn't recovered from that, like who benefits?",
            "title_similarity": "0.5328845"
        },
        {
            "id": "i2vxhis",
            "score": 1,
            "text": "Totally correct!",
            "title_similarity": "-0.059252158"
        },
        {
            "id": "i2vxhmj",
            "score": 1,
            "text": "Wonder how not punishing Trump and his enablers for his crimes is going to work out for the US?\n\n(Sarcasm level 100%)",
            "title_similarity": "0.6573689"
        },
        {
            "id": "i2vxib7",
            "score": 1,
            "text": "What was the reasoning for not doing it then that don't apply here?",
            "title_similarity": "0.37641287"
        },
        {
            "id": "i2vxjhe",
            "score": 1,
            "text": "Negative consequences for starting a war deters future wars. \n\nLogic checks out.",
            "title_similarity": "0.64601654"
        },
        {
            "id": "i2vxo7t",
            "score": 2,
            "text": "My guess is Putin tries to pull back and lie in wait until the 2024 election results and then he can go all in with the US out of NATO if republicans win",
            "title_similarity": "0.67716485"
        },
        {
            "id": "i2vxsey",
            "score": 2,
            "text": "They could have also been heavily reduced if Ukraine heeded the calls of the UK and the US that Russia were piling troops on the border, instead of laughing at us.\n\nThey're doing a brilliant job at resisting now and I take my hat off to those who were brave enough to leave and those who were brace enough to stay, but it is quite surprising considering the utter contempt they held for the thought of a Russian invasion six weeks ago.\n\nBoth Russia and Ukraine were united in mocking us for suggesting that troops were gathering",
            "title_similarity": "0.76047313"
        },
        {
            "id": "i2vxsgx",
            "score": 1,
            "text": "Putin's oil is running low anyways. Russia has a very high level of production but low proven reserves. Natural gas will last many decades but oil production annually is about 5% of proven reserves. Russia is on a huge decline and Putin's regime is screwed without military and economic expansion. Very dangerous situation.",
            "title_similarity": "0.44644868"
        },
        {
            "id": "i2vxvoy",
            "score": 1,
            "text": "If you watch the show he co-created and starred in, which aired from 2015 to 2019, there’s a clear emphasis on responding to the issues and fallout of that annexation. It seems to distribute blame on Ukrainian domestic corruption and dysfunction as well as on the apathy of Western powers to the situation in Ukraine.\n\nServant of the People on Netflix in the U.S.— it’s worth a watch, if only to grasp the rhetoric that propelled Zelensky into the highest office in the land.",
            "title_similarity": "0.627322"
        },
        {
            "id": "i2vy0ps",
            "score": 2,
            "text": "Just in case anyone didn’t remember. https://www.washingtonpost.com/opinions/global-opinions/trump-campaign-guts-gops-anti-russia-stance-on-ukraine/2016/07/18/98adb3b0-4cf3-11e6-a7d8-13d06b37f256_story.html",
            "title_similarity": "0.713289"
        },
        {
            "id": "i2vy1b3",
            "score": 2,
            "text": "This is just a long line of horrible shit the world has allowed Putin to do.",
            "title_similarity": "0.55865157"
        },
        {
            "id": "i2vybfw",
            "score": 1,
            "text": "hindsight is always 20/20",
            "title_similarity": "0.23473582"
        },
        {
            "id": "i2vyjto",
            "score": 1,
            "text": "He's got a point.",
            "title_similarity": "0.08961332"
        },
        {
            "id": "i2vytqf",
            "score": 1,
            "text": "He is correct.",
            "title_similarity": "-0.0011615613"
        },
        {
            "id": "i2vyuay",
            "score": 1,
            "text": "Can't say he's wrong about this.",
            "title_similarity": "0.31649995"
        },
        {
            "id": "i2vyuko",
            "score": 1,
            "text": "He's got a point!",
            "title_similarity": "0.10179522"
        },
        {
            "id": "i2vyxoo",
            "score": 1,
            "text": "Not a repeat from 1938 and the Sudetenland. \n\nSeriously everyone with a slight bit of historical knowledge was saying it.",
            "title_similarity": "0.4207726"
        },
        {
            "id": "i2vz0o1",
            "score": 1,
            "text": "You can thank Obama for that.",
            "title_similarity": "0.22454534"
        },
        {
            "id": "i2vz57z",
            "score": 1,
            "text": "Yes. This is an accurate assertion.",
            "title_similarity": "-0.010181557"
        },
        {
            "id": "i2vzqep",
            "score": 1,
            "text": "I am of the opinion that the best thing the internet did for history was make it harder to forget or muddy. Didnt make it impossible, and new ways of being a lil bastard are coming out every decade.\n\nBut this is an improvement",
            "title_similarity": "0.4886171"
        },
        {
            "id": "i2vzsn2",
            "score": 1,
            "text": "I mean, yeah, that “referendum” was questionable at best, a forced coup at worst. Crimea needs a supervised referendum by international neutral entities. I did not trust the numbers that came out of that 2014 one. If they decide to be Russian, fine, but they and Ukraine deserve a fair and strongly supervised election.",
            "title_similarity": "0.80401087"
        },
        {
            "id": "i2vzyoh",
            "score": 1,
            "text": "Captain hindsight to the rescue.\nOh wait, the world wanted cheap gas.",
            "title_similarity": "0.46765682"
        },
        {
            "id": "i2w01z0",
            "score": 1,
            "text": "I agree 100%",
            "title_similarity": "-0.05245381"
        },
        {
            "id": "i2w097b",
            "score": 1,
            "text": "There was this message in the Eragon books about why you go to war, and cause so many thousands of people to die. And the author's answer was that if they didn't go to war with the evil king, then more people would get hurt over time than would get hurt during the war.\n\nWhat I'm saying is that politicians don't seem to grasp the concept of short-term costs versus neverending costs. Something that a college-aged(?) Fantasy author does understand.",
            "title_similarity": "0.60231674"
        },
        {
            "id": "i2w0ify",
            "score": 1,
            "text": "May America find the balls to punish Trump for his ongoing crimes.",
            "title_similarity": "0.5995779"
        },
        {
            "id": "i2w0jhq",
            "score": 1,
            "text": "Honestly all signs are pointing to Putin thinking that this invasion was gonna be 2014 all over again. He thought it was gonna be quick painless victory that would get a weak response from the West (which Russia was prepared for with their foreign reserves), and be popular back at home. He underestimated his enemies badly and now he's caught in a lose-lose situation.",
            "title_similarity": "0.7036333"
        },
        {
            "id": "i2w0lye",
            "score": 2,
            "text": "Yep, taking Crimea in 2014 and electing Trump in 2016 are two big factors that led to this invasion.",
            "title_similarity": "0.6410684"
        },
        {
            "id": "i2w0xjr",
            "score": 1,
            "text": "heh",
            "title_similarity": "-0.031871125"
        },
        {
            "id": "i2w0z61",
            "score": 1,
            "text": "He isn’t wrong",
            "title_similarity": "0.04009439"
        },
        {
            "id": "i2w1cu3",
            "score": 2,
            "text": "Or for using chemical weapons in a NATO country. \nOr for blowing up a munitions depot in a NATO country.\nOr for Syria.\nOr for Georgia.\nOr for occupying Donbas for 8 years.",
            "title_similarity": "0.41793668"
        },
        {
            "id": "i2w1iw3",
            "score": 1,
            "text": "And, of course, he is right.",
            "title_similarity": "0.019975826"
        },
        {
            "id": "i2w1kd4",
            "score": 1,
            "text": "He does make a good point there.",
            "title_similarity": "0.09056407"
        },
        {
            "id": "i2w1klv",
            "score": 1,
            "text": "He’s 100% right these leaders are sleeping at the wheel",
            "title_similarity": "0.16979128"
        },
        {
            "id": "i2w1ku0",
            "score": 1,
            "text": "Fair. It also could have been avoided if his predecessors hadn’t given up their nukes or had fought back the way he is.  Live and learn.",
            "title_similarity": "0.6276941"
        },
        {
            "id": "i2w1txt",
            "score": 1,
            "text": "Hard to argue with his logic",
            "title_similarity": "0.2866904"
        },
        {
            "id": "i2w1wc2",
            "score": 2,
            "text": "Remember Malaysian 17? Russia shot down a civilian airline and ….blamed Ukraine.",
            "title_similarity": "0.589424"
        },
        {
            "id": "i2w20s2",
            "score": 1,
            "text": "Remember when the former president of the US lifted the sanctions put in place after that, and his rabid following still thinks hed make a better president during this war?",
            "title_similarity": "0.6422389"
        },
        {
            "id": "i2w20xn",
            "score": 1,
            "text": "He's right. Too bad no one had the will to do anything about it at the time.",
            "title_similarity": "0.40241632"
        },
        {
            "id": "i2w223d",
            "score": 1,
            "text": "Let’s be fair though, Ukraine wasn’t the same place in terms of government or military, that government and the government of the other nations at that time could not have come together like they did this time around over a non NATO country, nor would they have over just Crimea.",
            "title_similarity": "0.68076706"
        },
        {
            "id": "i2w22a8",
            "score": 1,
            "text": "He’s hilarious",
            "title_similarity": "0.096263275"
        },
        {
            "id": "i2w2503",
            "score": 1,
            "text": "ya where were all the slava ukraine and ukraine twitter profile pics back then too",
            "title_similarity": "0.35379916"
        },
        {
            "id": "i2w28qo",
            "score": 2,
            "text": "Everyone must have a self-cririticism here. %100 agreed with Zelenskyy. Since then no one cared about Ukraine until shit happened. Heck, even the NATO itself sanctuined its own ally Turkey for arming Ukraine.",
            "title_similarity": "0.6132184"
        },
        {
            "id": "i2w29eh",
            "score": 1,
            "text": "The usual stupid tidbit of \"If it's not affecting me, it's not my problem\"\nCommon courtesy is fucking dead. I don't like the idea of being shot. So why would I let it happen to someone else if I could prevent it??",
            "title_similarity": "0.59160566"
        },
        {
            "id": "i2w29lh",
            "score": 1,
            "text": "What did Ukraine do about Crimea? They didn't even put up a fight.",
            "title_similarity": "0.48873448"
        },
        {
            "id": "i2w2bgv",
            "score": 1,
            "text": "Putin dared anyone to forcefully punish Russia for stealing Crimea. \n\nFunny how Russia took Crimea after the 2014 Sochi Olympic Games. Then four years later we get this.",
            "title_similarity": "0.7870935"
        },
        {
            "id": "i2w2fo5",
            "score": 1,
            "text": "Yeah no shit, think everyone with a brain saw this shit coming back before he invaded. Apathy will be our collective doom.",
            "title_similarity": "0.52261007"
        },
        {
            "id": "i2w2goj",
            "score": 1,
            "text": "I feel like it would have sped it up...",
            "title_similarity": "0.24026799"
        },
        {
            "id": "i2w2v6g",
            "score": 1,
            "text": "Reddit is not gonna like that take…",
            "title_similarity": "0.42059952"
        },
        {
            "id": "i2w3325",
            "score": 1,
            "text": "This is a look at if Jon Stewart would have been president of the US in the early 00’s. It is pure, honesty and it needs to be recognized!!",
            "title_similarity": "0.43288386"
        },
        {
            "id": "i2w37k1",
            "score": 1,
            "text": "I like this guy. We’re here to help him so he needs to back off the criticism",
            "title_similarity": "0.37535912"
        },
        {
            "id": "i2w3fu9",
            "score": 1,
            "text": "No. Maybe if you developed your oil infrastructure quickly and make a deeper connection to Europe then Russia wouldn't have attacked. But no, you dicked around and was a still a nobody when Putin became old and senile. Look at Taiwan, they are also a nobody on world stage and was fending off communist fishing boat invasion until they could develop the silicon shield. Now they are still useful to Daddy U.S. and China is afraid to invade even it had better than fishing boats now.\n\n\nIn short, you fucked up. This is all on you.",
            "title_similarity": "0.67766684"
        },
        {
            "id": "i2w3q9h",
            "score": 2,
            "text": "Yep. If the sanctions policy had been fully implemented by the EU by stopping trading and partnership with Russia we would now be in a completely different situation. Unfortunately, politicians decided to push business relations with Russia assuming psychopath considers money is more valuable than ideas. Probably, they judged him by ourselves.",
            "title_similarity": "0.815292"
        },
        {
            "id": "i2w3x24",
            "score": 1,
            "text": "well yeah.\nand quite frankly we're responsible for letting shitholes like NK continue.  \nwe'll be judged for it one day, and I don't mean in a religious context",
            "title_similarity": "0.5964241"
        },
        {
            "id": "i2w3y4i",
            "score": 1,
            "text": "It seems like this is the case with the past few Dictators.",
            "title_similarity": "0.18631354"
        },
        {
            "id": "i2w40l9",
            "score": 1,
            "text": "Cool, now everyone start handing out your rubles, otherwise you're not getting your oil and gas.",
            "title_similarity": "0.43814057"
        },
        {
            "id": "i2w41b4",
            "score": 1,
            "text": "He's right. The whole world sat with their thumbs up their butts because we're all so goddamn dependent on their fossil fuels. They probably encouraged it off the record on the off chance the pipeline they planned would have benefited them.",
            "title_similarity": "0.5202286"
        },
        {
            "id": "i2w46yi",
            "score": 1,
            "text": "Every year we learn more about how awful the Obama admin was",
            "title_similarity": "0.4519151"
        },
        {
            "id": "i2w4ae0",
            "score": 1,
            "text": "Lol",
            "title_similarity": "-0.048792027"
        },
        {
            "id": "i2w4gfi",
            "score": 1,
            "text": "Facts",
            "title_similarity": "0.0060031693"
        },
        {
            "id": "i2w4yf9",
            "score": 1,
            "text": "Judgement Day is inevitable- Cyberdyne Systems T1000",
            "title_similarity": "0.31654355"
        },
        {
            "id": "i2w580l",
            "score": 2,
            "text": "Putin taking Crimea proved so much creepy shit about our world... \nPeople like to think that just because some nations fought off the Nazis in WW2 that they're the \"good guys\", shit, we act like Italy wasn't one of the bloodiest parts of the war, and them supporting Ukraine is like \"hey, great job\". The only thing any world leader as a majority care about is of their little lives being destabilized, not the people composing the nation that they represent.\n\n\nThis whole world has become so fucking twisted...",
            "title_similarity": "0.72009385"
        },
        {
            "id": "i2w5cqy",
            "score": 1,
            "text": "Easy to say with the benefit of hind legs.",
            "title_similarity": "0.04867498"
        },
        {
            "id": "i2w5g54",
            "score": 2,
            "text": "Sounds cold, but geopolitics demand nuance when total nuclear annihilation is at stake.\n\nZelenskyy is looking out for his people just like every other world leader is doing. Especially those wishing to not escalate an already volatile situation.",
            "title_similarity": "0.5770203"
        },
        {
            "id": "i2w5kvt",
            "score": 2,
            "text": "Just as the second world war could have possibly been avoided when Hitler took the Sudetenland, but nobody wanted to start a war... If we forget our history, we are doomed to repeat it.",
            "title_similarity": "0.7310846"
        },
        {
            "id": "i2w5ndo",
            "score": 2,
            "text": "Too bad they were all sucking putins teet for resources and money",
            "title_similarity": "0.5036062"
        },
        {
            "id": "i2w5sbr",
            "score": 1,
            "text": "https://share.socialdm.co/Freeworld18",
            "title_similarity": "0.17771614"
        },
        {
            "id": "i2w5yvb",
            "score": 2,
            "text": "Half of the people in the US who are so upset about Ukraine didn't even know about 2014. I'm finding that out as I discuss the news with those who usually don't follow it.",
            "title_similarity": "0.45616132"
        },
        {
            "id": "i2w65ir",
            "score": 2,
            "text": "Here we go with the if statements. If this, then that.",
            "title_similarity": "0.13925965"
        },
        {
            "id": "i2w698b",
            "score": 1,
            "text": "Basically yeah",
            "title_similarity": "-0.071864545"
        },
        {
            "id": "i2w6da5",
            "score": 1,
            "text": "Yep!!",
            "title_similarity": "-0.05636903"
        },
        {
            "id": "i2w6rjf",
            "score": 5,
            "text": "And it is for this attack on Ukraine and the attack on Iraq that I highlight as the failings of the UN. The UN and/or the ICC should ideally be the body that steps in when nations break international law. But we all know or realize that fixing the UN or the ICC to maintain international peace will not happen today.",
            "title_similarity": "0.7918587"
        },
        {
            "id": "i2w6tcx",
            "score": 1,
            "text": "Where's the Mossad when you need them",
            "title_similarity": "0.2100579"
        },
        {
            "id": "i2w72ht",
            "score": 6,
            "text": "In hindsight...\n\nIf we had stopped Hitler... \n\nIf we had stopped Stalin...",
            "title_similarity": "0.60707664"
        },
        {
            "id": "i2w768z",
            "score": 1,
            "text": "We had a lady in office then",
            "title_similarity": "0.039949346"
        },
        {
            "id": "i2w78wg",
            "score": 4,
            "text": "I guess you could also say that if the assassination attempt on Putin in February 2000 at Anatoly Sobchak's funeral was successful then the whole thing could have likely been avoided but we can never know for sure.",
            "title_similarity": "0.7551562"
        },
        {
            "id": "i2w7q9i",
            "score": 1,
            "text": "Who was in office at that time? Oh right..",
            "title_similarity": "0.060204368"
        },
        {
            "id": "i2w7sdh",
            "score": 1,
            "text": "the world needed time to grow some balls",
            "title_similarity": "0.32265782"
        },
        {
            "id": "i2w7t7f",
            "score": 1,
            "text": "Yeah & maybe when Russia poisoned Litvinenko & then The Skripals in the UK, but the conservatives don’t have a backbone & are in the pocket of Putin & co",
            "title_similarity": "0.71924657"
        },
        {
            "id": "i2w7vct",
            "score": 1,
            "text": "AGREED!!!",
            "title_similarity": "-0.035623886"
        },
        {
            "id": "i2w7zfo",
            "score": 1,
            "text": "Barack Obama got some explaining to do",
            "title_similarity": "0.33267218"
        },
        {
            "id": "i2w803b",
            "score": 1,
            "text": "Crimea had a referendum and the result was Cristal clear. It was not anexed, they choose their future",
            "title_similarity": "0.50428975"
        },
        {
            "id": "i2w85hc",
            "score": 1,
            "text": "Er, not really IMO.  Ukraine was not ready to resist Russia in 2014 the way it is now, and so without a partner on the ground to do the actual fighting, world leaders were likely not going to stick out their necks and suffer domestic damage for a lost cause.\n\nEven *this* time nothing much would have happened without the heroic Ukrainian resistance in the early days, which emboldened world leaders to step up their pushback against Putin.",
            "title_similarity": "0.755357"
        },
        {
            "id": "i2w88op",
            "score": 2,
            "text": "The western powers have apparently learned nothing from WW2 and appeasement still continues. This evil (russia and putins regime) should have been uprooted way before such invasion could even happen.",
            "title_similarity": "0.76365995"
        },
        {
            "id": "i2w88vt",
            "score": 1,
            "text": "We’re well past that Volo",
            "title_similarity": "0.12548997"
        },
        {
            "id": "i2w8ek8",
            "score": 1,
            "text": "He was punished. Get sober please",
            "title_similarity": "0.38236696"
        },
        {
            "id": "i2w8g1j",
            "score": 1,
            "text": "Hindsight is 20/20.",
            "title_similarity": "0.25514913"
        },
        {
            "id": "i2w8inh",
            "score": 1,
            "text": "The response to any of these criticisms is always - what if nukes.",
            "title_similarity": "0.2619481"
        },
        {
            "id": "i2w8peu",
            "score": 2,
            "text": "You are always smarter in retrospective, they Tried to avoid that by just letting putin and hoping he will be satisfied with it...",
            "title_similarity": "0.59536004"
        },
        {
            "id": "i2w9asi",
            "score": 1,
            "text": "yup, if you dont punish him, they think they can get away with anything.",
            "title_similarity": "0.44621116"
        },
        {
            "id": "i2w9e34",
            "score": 1,
            "text": "Just a little bit of history repeating",
            "title_similarity": "0.16616221"
        },
        {
            "id": "i2w9fu6",
            "score": 1,
            "text": "I guess after two US backed coups in his country in the last 18 years he figured they actually cared about Ukraine and it's people. That's a mistake on his part. That is, if this is an actual good faith comment by him and not just more targeted propaganda.",
            "title_similarity": "0.6349814"
        },
        {
            "id": "i2w9lba",
            "score": 1,
            "text": "Want Usa in Afganistan? Nobody cared back then",
            "title_similarity": "0.39886656"
        },
        {
            "id": "i2w9n5t",
            "score": 1,
            "text": "I don't subscribe to that notion. Ukraine made no effort to take it back, what were we supposed to do? Then we could have no recourse for when it really matters like right now. It's a moronic take, frankly.",
            "title_similarity": "0.61475855"
        },
        {
            "id": "i2w9qhd",
            "score": 2,
            "text": "If only we hadn't been up to our ass in Afghanistan and wearied by the Iraq debacle at the time.",
            "title_similarity": "0.60115486"
        },
        {
            "id": "i2w9ren",
            "score": 1,
            "text": "83% of Crimeans voted at a 97% rate to be integrated into Russia. Crimea should have never been Ukraine's to begin with.",
            "title_similarity": "0.62041"
        },
        {
            "id": "i2wa22b",
            "score": 1,
            "text": "Thanks, Obama!",
            "title_similarity": "0.16835122"
        },
        {
            "id": "i2wa23q",
            "score": 2,
            "text": "When I remembered it. Crimea didn't even resist. There were already some pro-Russian groups in there before Russia even started rolling in troops.",
            "title_similarity": "0.5787585"
        },
        {
            "id": "i2wa5ty",
            "score": 1,
            "text": "He's not wrong tbf. If the West had a response as strong as the past 30 days back when they invaded Crimea then Russia would not have had the economical strength to carry out a full scale invasion in the first place. \n\nStill, better late than never. Still cannot see any scenario in which Russia actually completes their objective of taking over Ukraine. They will only \"\"\"\"win\"\"\"\" this war by burning the country to the ground at this point. But then they will have literally invaded for nothing.",
            "title_similarity": "0.76955205"
        },
        {
            "id": "i2waaij",
            "score": 1,
            "text": "Mhh yeah, from todays point of view that’s true.\nBut tbh, for most of us in the western hemisphere 2014 was just a another small regional conflict in the first place, although the way Putin performed this ‘referendum’ and military invasion together with his interpretation of Russian history and the implications should have made us more concerned about his ambitions.\nBut between 2014 and the invasion in 2022 there was still an opportunity to stop it. E.g., the US could have send 2-3 submarines (crew and nuclear codes included) with nuclear missiles and reflag them as ukrainian forces, so Ukraine would have become a nuclear power overnight ( reflagging is not uncommon in the history of human warfare).  This would have changed the way Putin sees their role and either would have stopped an possible invasion or result in a real disaster.",
            "title_similarity": "0.79247236"
        },
        {
            "id": "i2wajib",
            "score": 1,
            "text": "There was a reaction. The US started sending significant aid there starting in 2014, and Russia was sanctioned.\n\nOnly a few years earlier Americans balked at any kind of intervention in Syria, it was still in Afghanistan, and had only recently pulled out significantly from Iraq. There was no appetite for much more than was done.",
            "title_similarity": "0.71124196"
        },
        {
            "id": "i2wan1d",
            "score": 1,
            "text": "What our savior Obama made a mistake???  No way",
            "title_similarity": "0.48282242"
        },
        {
            "id": "i2wbbb1",
            "score": 1,
            "text": "As an American, I 100% agree.",
            "title_similarity": "0.08534973"
        },
        {
            "id": "i2wbn7i",
            "score": 1,
            "text": "It would have been a lot worse if he weren't vaccinated.",
            "title_similarity": "0.6295383"
        },
        {
            "id": "i2wc1ay",
            "score": 1,
            "text": "Yep",
            "title_similarity": "-0.0766543"
        },
        {
            "id": "i2wc5wx",
            "score": 1,
            "text": "Just another example of what happens when you let things slide. It's not like Crimea was the first objectional thing Putin did.",
            "title_similarity": "0.7390393"
        },
        {
            "id": "i2wcbqf",
            "score": 1,
            "text": "true",
            "title_similarity": "-0.064598516"
        },
        {
            "id": "i2wcda3",
            "score": 1,
            "text": "I agree. That never should have happened and it emboldened Putin and other dictators. Crimea isn’t just the land - a lot of natural resources there . Why Obama and EU did not get more involved I couldn’t say but now here we are, and even if we all stand around and ignore it- ww3 has begun. Think of who is still supporting Russia to allow this war to continue. Would you not say there is already a world wide separation on support of Ukraine or Russia?",
            "title_similarity": "0.83281183"
        },
        {
            "id": "i2wcnmx",
            "score": 1,
            "text": "So true, the EU leaders are a bunch of self interested cowards",
            "title_similarity": "0.46669054"
        },
        {
            "id": "i2wd8bq",
            "score": 1,
            "text": "The older I get , the more I realize that NO ONE knows wtf they’re doing in their jobs and that makes me feel completely vulnerable and I hate it.",
            "title_similarity": "0.36719757"
        },
        {
            "id": "i2wdnet",
            "score": 1,
            "text": "The difference is that this time he's doing it to a democratic anti Putin country.",
            "title_similarity": "0.6764294"
        },
        {
            "id": "i2wdz9p",
            "score": 1,
            "text": "Fuck",
            "title_similarity": "0.10458976"
        },
        {
            "id": "i2wdzeo",
            "score": 1,
            "text": "And he’s totally right. I remember the little green men comments at the time and Russians telling on themselves by posting on Instagram.",
            "title_similarity": "0.38873816"
        },
        {
            "id": "i2we62d",
            "score": 1,
            "text": "Then we would hav eWorld war sooner",
            "title_similarity": "0.48133677"
        },
        {
            "id": "i2we8is",
            "score": 1,
            "text": "This is what I’ve been fucking saying",
            "title_similarity": "0.13187213"
        },
        {
            "id": "i2weqnr",
            "score": 1,
            "text": "This is true. \n\nIt could also have been avoided if we had not relied on threats of “sanctions” and instead put some fucking people and things there to protect that border and keep the Russians from crossing. Nobody was willing to do that for a non-NATO country. \n\nWhich leads us to point three. It could also have been avoided by fast-tracking Ukraine‘a NATO membership and squeaking them in at the first sign of aggression, when they were building things up near the border. Woulda royally pissed off Putin by doing that, too bad so sad. \n\nPoint four: NATO would do well to offer protectorate status for countries that aren’t able to become full members just yet. That way our hands aren’t tied when shit like this happens.",
            "title_similarity": "0.834069"
        },
        {
            "id": "i2wf56f",
            "score": 1,
            "text": "Give an inch, take a mile, etc etc etc",
            "title_similarity": "0.061904468"
        },
        {
            "id": "i2wf5na",
            "score": 1,
            "text": "Putin has gambled that the West will not commit troops against his and so far he is right.",
            "title_similarity": "0.6680896"
        },
        {
            "id": "i2wfa6w",
            "score": 1,
            "text": "He ain’t wrong.",
            "title_similarity": "0.029267415"
        },
        {
            "id": "i2wfhcp",
            "score": 1,
            "text": "He isn't wrong about it though.",
            "title_similarity": "0.10818569"
        },
        {
            "id": "i2wfpev",
            "score": 2,
            "text": "Or even if they had clearly said what they will do instead of staying so vague that most people assumed they'd do nothing but strongly worded letters again.",
            "title_similarity": "0.40168905"
        },
        {
            "id": "i2wg0r2",
            "score": 2,
            "text": "Question: why TF didnt he do anything about it? (God) helps those who help themselves.",
            "title_similarity": "0.38943744"
        },
        {
            "id": "i2wg320",
            "score": 2,
            "text": "I do not mean to be contrary but joining NATO also would have prevented this. Countries that joined NATO after previous invasions and war crimes have been untouched.",
            "title_similarity": "0.6666972"
        },
        {
            "id": "i2wg32w",
            "score": 1,
            "text": "Big Z 100% correct as usual.",
            "title_similarity": "0.052094247"
        },
        {
            "id": "i2wg5ei",
            "score": 1,
            "text": "Well, what the world didn't know at the time was how piss poor the Russian military had become.  Now it has been laid bare.",
            "title_similarity": "0.5762333"
        },
        {
            "id": "i2wgsuj",
            "score": 1,
            "text": "I mean yeah",
            "title_similarity": "-0.052835163"
        },
        {
            "id": "i2whta6",
            "score": 3,
            "text": "Absolutely.",
            "title_similarity": "-0.07761311"
        },
        {
            "id": "i2whtj1",
            "score": 3,
            "text": "Yup.",
            "title_similarity": "-0.018947015"
        },
        {
            "id": "i2wi7xz",
            "score": 2,
            "text": "He’s right.  Putin was emboldened by no repercussions.  Same as the beginning of ww2.",
            "title_similarity": "0.4439095"
        },
        {
            "id": "i2wic1q",
            "score": 3,
            "text": "Also could have been avoided if NATO kept their end of the bargain. Hindsight is 20/20",
            "title_similarity": "0.70189047"
        },
        {
            "id": "i2wilvb",
            "score": 1,
            "text": "He's correct.",
            "title_similarity": "-0.019562352"
        },
        {
            "id": "i2wimk9",
            "score": 1,
            "text": "Oh uh you remembered that huh?",
            "title_similarity": "0.009197285"
        },
        {
            "id": "i2wio2n",
            "score": 1,
            "text": "I mean, the Academy said they asked him to leave!",
            "title_similarity": "0.42410654"
        },
        {
            "id": "i2wiode",
            "score": 1,
            "text": "Luckily Russia invaded Ukraine when most cable news outlets were getting absolutely destroyed in ratings.",
            "title_similarity": "0.5612558"
        },
        {
            "id": "i2wipow",
            "score": 2,
            "text": "Yes let's put the word horror in quotes as though we don't agree war creates horror and are surprised he would say so and mistrust his motivation",
            "title_similarity": "0.62193114"
        },
        {
            "id": "i2wiv8k",
            "score": 1,
            "text": "I mean, he's pretty much right. We've given Russia, and also China, lots of reasons to think we won't interfere their military interests. I wouldn't be surprised if the world reaction to the annexation of Crimea was how Putin expected things would go this time too.",
            "title_similarity": "0.76315117"
        },
        {
            "id": "i2wixlh",
            "score": 1,
            "text": "If you let a mouse steal a cookie with no consequence….",
            "title_similarity": "0.36428836"
        },
        {
            "id": "i2wj5nn",
            "score": 2,
            "text": "True. EU and NATO leaders are still pretending that, if they don't prevoke Putin, Putin will leave them alone. Stupid people. Stop Putin now. Kick Putin.",
            "title_similarity": "0.7272854"
        },
        {
            "id": "i2wjchj",
            "score": 1,
            "text": "Damn straight!",
            "title_similarity": "0.039399672"
        },
        {
            "id": "i2wjfqb",
            "score": 1,
            "text": "True story",
            "title_similarity": "0.034942858"
        },
        {
            "id": "i2wjhk0",
            "score": 1,
            "text": "Crimeans themsemves chose Russia",
            "title_similarity": "0.57126594"
        },
        {
            "id": "i2wjww2",
            "score": 1,
            "text": "He's acting like Hitler before WW2. And the west just watched just like what the Allies did all those years ago. Coincidence?",
            "title_similarity": "0.47642547"
        },
        {
            "id": "i2wjx1p",
            "score": 1,
            "text": "Looks like Master Chief without his helmet",
            "title_similarity": "0.3062519"
        },
        {
            "id": "i2wjzg3",
            "score": 1,
            "text": "That is true",
            "title_similarity": "-0.06039378"
        },
        {
            "id": "i2wk9po",
            "score": 1,
            "text": "I mean well duh.",
            "title_similarity": "0.010901909"
        },
        {
            "id": "i2wksvz",
            "score": 1,
            "text": "This is true.",
            "title_similarity": "-0.059257038"
        },
        {
            "id": "i2wl2oi",
            "score": 1,
            "text": "True",
            "title_similarity": "-0.064598516"
        },
        {
            "id": "i2wl4h4",
            "score": 1,
            "text": "Hoping for the best when dealing with undercover tyrants never works. Reset buttons neither.",
            "title_similarity": "0.51228607"
        },
        {
            "id": "i2wl6ac",
            "score": 1,
            "text": "Yep",
            "title_similarity": "-0.0766543"
        },
        {
            "id": "i2wl998",
            "score": 2,
            "text": "I remember people at 4chan were so hyped about the female general attorney assigned to Crimea. What a fucked up thing but hey, some are unironically nazi and others are ironically nihilist.",
            "title_similarity": "0.47839922"
        },
        {
            "id": "i2wld5z",
            "score": 2,
            "text": "ABSOLUTELY!\nUkraine brings hope to the region",
            "title_similarity": "0.22952119"
        },
        {
            "id": "i2wlxhm",
            "score": 1,
            "text": "We've been learning how to correctly avoid escalation. This time around we are learning how to correctly escalate. Crimea was an incorrect avoidance.",
            "title_similarity": "0.65647894"
        },
        {
            "id": "i2wm8so",
            "score": 2,
            "text": "I think he's absolutely right.",
            "title_similarity": "0.009795166"
        },
        {
            "id": "i2wne7f",
            "score": 2,
            "text": "Or any of the other things that were world wide news and very clear. \n\nHe's been allowed to do whatever he wants wherever he wants for decades because of nukes. \n\nWeird how WMDs are both an excuse to invade and also to not invade a nation....",
            "title_similarity": "0.34497684"
        },
        {
            "id": "i2wnnws",
            "score": 1,
            "text": "Could’ve been avoided if you joined nato.",
            "title_similarity": "0.6859608"
        },
        {
            "id": "i2wnwda",
            "score": 1,
            "text": "Zel has a way of reminding us of what is obvious, but often repressed.",
            "title_similarity": "0.26965722"
        },
        {
            "id": "i2wnx9d",
            "score": 1,
            "text": "Obama was an ineffectual president. I’m further to the left than Obama. He was reluctant to rock the boat on any number of issues and the result was the election of a president that convinced a large part of the electorate that he could walk on water and then sank the ship of state.",
            "title_similarity": "0.58576363"
        },
        {
            "id": "i2wnxg3",
            "score": 1,
            "text": "Ah yes the red line that wasn’t a red line",
            "title_similarity": "0.2837153"
        },
        {
            "id": "i2wo68o",
            "score": 1,
            "text": "I have to agree.\n\nI accept Ukraine is not NATO, but god damn ‘the West’ showed themselves for absolute pushovers with China and Russia for my entire fucking lifetime (30something) until a month ago, and even now they’re not quite out of that mindset. We bought their resources, we did nothing about their human rights violations, we did nothing when they just annexed shit for no other reason than medieval style hegemony. Economically they gave us jack shit in return, it’s not like anyone in the west had fair access to Russian and Chinese markets, but we let their money poison our way of life.",
            "title_similarity": "0.6360457"
        },
        {
            "id": "i2wohu6",
            "score": 2,
            "text": "We as the democratic world have to finally stand up and defend freedom wherever it is attacked. If we’re not willing to do that, democracy is already lost",
            "title_similarity": "0.6159843"
        },
        {
            "id": "i2wp0ck",
            "score": 1,
            "text": "...",
            "title_similarity": "-0.049318254"
        },
        {
            "id": "i2wpc0q",
            "score": 1,
            "text": "Probably true. Losing the Crimea really a downer, Ukraine a fave country and Crimea the most interesting area in Ukraine, at least to me. Now need a Russian visa, which is expensive and very time consuming to obtain, having done it twice before.",
            "title_similarity": "0.57831585"
        },
        {
            "id": "i2wpd6a",
            "score": 1,
            "text": "Hätte, hätte, Fahrradkette!",
            "title_similarity": "0.12661086"
        },
        {
            "id": "i2wpf3i",
            "score": 1,
            "text": "It would be without the $2T in aid from the US alone",
            "title_similarity": "0.4110307"
        },
        {
            "id": "i2wphsg",
            "score": 2,
            "text": "If I recall correctly Obama placed sanctions on Russia, and that’s when the whole Russia collusion started, cause it ended up coming out that president-elect trump peoples told Russians not to worry about the sanctions, since Trump could/would remove them. \n\nThe rest, as they say, is history.",
            "title_similarity": "0.79938114"
        },
        {
            "id": "i2wpkiw",
            "score": 1,
            "text": "I agree & also if the Budapest Agreement had been much better written!!! 🇺🇦",
            "title_similarity": "0.45267877"
        },
        {
            "id": "i2wpsra",
            "score": 1,
            "text": "Let’s pay rubles for GAS. Shall we?",
            "title_similarity": "0.33399138"
        },
        {
            "id": "i2wq1z5",
            "score": 1,
            "text": "🤭 who could’ve guessed",
            "title_similarity": "0.2441669"
        },
        {
            "id": "i2wqvwr",
            "score": 1,
            "text": "Shoulda, coulda, woulda",
            "title_similarity": "0.19342017"
        },
        {
            "id": "i2wrh3h",
            "score": 1,
            "text": "Dat part!",
            "title_similarity": "0.081301495"
        },
        {
            "id": "i2wrnz4",
            "score": 2,
            "text": "Sad but true, western democracies didn’t learn the hard lessons of 1939 - especially how the appeasement of a dangerous autocrat does not save the lives of millions nor guarantee the safety of sovereign states",
            "title_similarity": "0.61455536"
        },
        {
            "id": "i2wrv8a",
            "score": 1,
            "text": "Georgia enters the chat.",
            "title_similarity": "0.14288953"
        },
        {
            "id": "i2ws13b",
            "score": 2,
            "text": "💯",
            "title_similarity": "-0.04726916"
        },
        {
            "id": "i2wsnqr",
            "score": 2,
            "text": "Congress told Obama no. Europe leaders wanted cheap gas.",
            "title_similarity": "0.5691508"
        },
        {
            "id": "i2wsvnu",
            "score": 1,
            "text": "I mean, probably.",
            "title_similarity": "0.034559734"
        },
        {
            "id": "i2wt0sr",
            "score": 1,
            "text": "I'm waiting to see who get the Anthony Edan Award this time around. So far it's a toss up between NATO and Biden.",
            "title_similarity": "0.50703406"
        },
        {
            "id": "i2wt6t1",
            "score": 1,
            "text": "i remember thinking this back then. so sad.",
            "title_similarity": "0.24222647"
        },
        {
            "id": "i2wt9dt",
            "score": 1,
            "text": "That’s true. And the difference between 2014 and now is Zelenskyy.",
            "title_similarity": "0.36673358"
        },
        {
            "id": "i2wtycn",
            "score": 3,
            "text": "Which is why so many are keen to join the UN now.\n\nThey know if Ukraine is left to Russia's feral dogs once again, they are next.\n\nRussia must pay, and Putin must be held personally responsible.",
            "title_similarity": "0.6101125"
        },
        {
            "id": "i2wuacb",
            "score": 3,
            "text": "And yet both Germany and France continue to allow their businesses to trade with Russia rather than take an economic hit.  Macron and the German Chancellor are both scared of Russia and are trying to protect their economies whilst women and children die at Putin’s hands. When will they show some fight.",
            "title_similarity": "0.6851059"
        },
        {
            "id": "i2wual0",
            "score": 1,
            "text": "Considering how well it's going, Putin has to be re-assessing his timeline for world domination.",
            "title_similarity": "0.6127591"
        },
        {
            "id": "i2wuiah",
            "score": 2,
            "text": "Invade. Do nothing. Shoot down civilian plane. Nothing. No bloody wonder",
            "title_similarity": "0.3669897"
        },
        {
            "id": "i2wuzqf",
            "score": 2,
            "text": "Everyone knows this. Putin has been allowed to be a bully. The world stood by but without world support, it can’t always be the US, nothing will change. It has to be many countries being willing to sacrifice and stand up. The way the world community has come together in support of Ukraine needs to continue and more countries need to get on board: China and India, for example.",
            "title_similarity": "0.61863124"
        },
        {
            "id": "i2wvexb",
            "score": 1,
            "text": "Shoulda, woulda, coulda. That was a long time ago now in geopolitics. Easy for me to say right now sitting in safety, out of harms way. I was going to write a massive post but it comes down to a lack of pinnacle leadership failing to understand the culture and climate of internal political forces. Then invading a country that has turned the world against you.",
            "title_similarity": "0.58351237"
        },
        {
            "id": "i2wwgkt",
            "score": 1,
            "text": "Annnnnd now republicans like ukraine",
            "title_similarity": "0.37267825"
        },
        {
            "id": "i2wwj01",
            "score": 3,
            "text": "If you don't smack down the bully the first time, he'll come back a second time and then a third and fourth time until you finally put him in his place.",
            "title_similarity": "0.51856834"
        },
        {
            "id": "i2wwz12",
            "score": 2,
            "text": "nobody did anything bc Crimea has Muslim Tatars. Muslims dont matter to the media. we've seen this recently with the refugee comments.\n\nhe's right, and its sad how people constantly say 'never again' despite letting it happen again and again.",
            "title_similarity": "0.5816393"
        },
        {
            "id": "i2wwzwl",
            "score": 2,
            "text": " America was too busy illegally invading the Middle East and bombing villages with innocent civilians. No different than what Putins doing.",
            "title_similarity": "0.5870534"
        },
        {
            "id": "i2wx5ch",
            "score": 3,
            "text": "He is right you know, the world gave this aggressor a pass.  Big mistake, you have to make bullies pay a price.",
            "title_similarity": "0.53108865"
        },
        {
            "id": "i2wxi41",
            "score": 3,
            "text": "Yeah, I cant believe how cowardly the world is acting towards Russia to this day. The Connecticut National Guard could kick Russias ass for chrissakes.",
            "title_similarity": "0.6974952"
        },
        {
            "id": "i2x1ssy",
            "score": 2,
            "text": "Dude is going to get himself assassinated if he keeps speaking so much truth.",
            "title_similarity": "0.5045546"
        },
        {
            "id": "i2x37ye",
            "score": 3,
            "text": "I am disappointed by the scare quotes in the title of this Business Insider article. Russia's invasion of Ukraine is not disputed. Russia's destruction of Ukrainian property is not disputed. Russia's murder of Ukrainian civilians is not disputed. How can one \\*not\\* find these things legitimately horrifying?",
            "title_similarity": "0.73578244"
        },
        {
            "id": "i2x3eta",
            "score": 1,
            "text": "Russia has  frequently invaded and taken over Moldava, Poland, the Baltic states, Georgia, and warred with Sweden ever Finland many times. Also warred with the Ottomans aka Turkey, also France and England, Austria and Germany, Hungary and Japan. It’s been in an expansionist imperialist mode for centuries and is still there after this mode was given up on in modern times. \nBeen reading/listening to a history of the Romanovs, since the 1600s, this is mostly all the tsars ever did. \nSoviet Russia occupied Eastern Europe in WW2 so stayed after it was over, there was no getting them out after. \nSurprising really, that it took so long for them to strike again after the break up,  though it was likely a breather to build up the military resources and acquire the necessary weapons. \nThey always justified it by a belief in traditional extremely conservative Russian Slavic autocracy as the only true Christian society, and now notice how Putin has brought the Orthodox Church back into the political fore. Srsly he acts like he’s the a tsar. \nThey used repressions of minorities and political opponents and the press whenever they felt like it too. \nDemanded blind loyalty and obedience of the population too. \nIt’s a philosophy and belief system in a domineering destiny. \nSoviets the same in that regard too. \nPutin’s fallen right back into the groove of the way Russia has always been. \nBeen defeated and reversed many times, but they keep trying over and over again. What a waste.",
            "title_similarity": "0.49018812"
        },
        {
            "id": "i2x3i6g",
            "score": 2,
            "text": "Well Ukraine didn't have an army back in 2014 sooo.",
            "title_similarity": "0.5184722"
        },
        {
            "id": "i2x5v8e",
            "score": 1,
            "text": "How do you punish a country that could kill the planet twice over if they wanted?",
            "title_similarity": "0.56070423"
        },
        {
            "id": "i2x5vhv",
            "score": 1,
            "text": "Ukraine should be made while again. Take Crimea back.",
            "title_similarity": "0.5221275"
        },
        {
            "id": "i2x68pi",
            "score": 1,
            "text": "I'm not likely to judge Zelensky because he's under immense pressure but the context was Obama was not going to be able to unite the country to confront Putin, because of underlying racism, and Putin was going to exploit Obama's race to unite his people. This is a more straightforward context that should be obvious to all Americans, Putin is insatiable for infamy with hard on for the west.",
            "title_similarity": "0.7237716"
        },
        {
            "id": "i2x6jpx",
            "score": 1,
            "text": "I really dislike Zelenskyy's constant pushy comments, even if I understand why he makes them, but this one I do agree with.\n\nI don't think there were many people who weren't disappointed the EU didn't immediately dump a ton of sanctions on them then.\n\nBetter late than never, but man, what a waste of life. It should be made very clear that wars of conquest have no place in this world anymore. \n\nWith exceptions. Not exceptions I agree with or respect in any capacity, but nonetheless, they are there.",
            "title_similarity": "0.60305434"
        },
        {
            "id": "i2x6riv",
            "score": 1,
            "text": "Another Munich, western countries always have passive attitude to deal with diplomacy stuff.\n\nlots of Chamberlain.",
            "title_similarity": "0.40548792"
        },
        {
            "id": "i2x7f9u",
            "score": 1,
            "text": "He had all this time to train his military and prepare for this too. Quit pointing the finger and blaming someone else. It's a dire situation and it's shitty.",
            "title_similarity": "0.4970785"
        },
        {
            "id": "i2x8dy8",
            "score": 3,
            "text": "He's absolutely correct. It felt like appeasement to me and just made the monster bolder.",
            "title_similarity": "0.47297978"
        },
        {
            "id": "i2x916k",
            "score": 1,
            "text": "When is Ukraine going to attack Rusia? just one kamikaze plane on the Kremlin is what’s needed",
            "title_similarity": "0.55956966"
        },
        {
            "id": "i2x97zy",
            "score": 2,
            "text": "We really did drop the fucking ball there",
            "title_similarity": "0.30044085"
        },
        {
            "id": "i2x99rh",
            "score": 2,
            "text": "Sorry bud. We were too busy focusing on that Malaysian Airlines flight that went down.",
            "title_similarity": "0.4261396"
        },
        {
            "id": "i2x9wzh",
            "score": 3,
            "text": "Yet again we have real world evidence that \"Appeasement\" strategy does not work against dictators",
            "title_similarity": "0.57170355"
        },
        {
            "id": "i2xaf8c",
            "score": 1,
            "text": "It could of actually also been avoided if he gave up and left Ukraine go back to being a russian state. /s",
            "title_similarity": "0.80494773"
        },
        {
            "id": "i2xarah",
            "score": 2,
            "text": "#FuckingRight #Preach",
            "title_similarity": "0.21916263"
        },
        {
            "id": "i2xb3do",
            "score": 1,
            "text": "This is happening now because Putin isn't going to let the Ukraine become part of NATO.",
            "title_similarity": "0.721637"
        },
        {
            "id": "i2xcbmf",
            "score": 1,
            "text": "Yeah… but then we’d have high gas and crude prices starting from 2014. \n\n*Price at the PuMp!*",
            "title_similarity": "0.44664222"
        },
        {
            "id": "i2xckpk",
            "score": 1,
            "text": "Watch out for the wheels not Z.",
            "title_similarity": "0.17314422"
        },
        {
            "id": "i2xdasw",
            "score": 2,
            "text": "And he's right. That's it.",
            "title_similarity": "0.014618686"
        },
        {
            "id": "i2xdg6q",
            "score": 1,
            "text": "Trump really fucked that one up for them didn’t he.",
            "title_similarity": "0.5286049"
        },
        {
            "id": "i2xdj2h",
            "score": 1,
            "text": "Or… even maybe… the whole invasion of Georgia",
            "title_similarity": "0.42685127"
        },
        {
            "id": "i2xeg8y",
            "score": 1,
            "text": "You mean President Obama actually doing something with his red line? Lol",
            "title_similarity": "0.50591207"
        },
        {
            "id": "i2xemuk",
            "score": 1,
            "text": "Waters wet",
            "title_similarity": "0.04594204"
        },
        {
            "id": "i2xf808",
            "score": 1,
            "text": "Who was in office at that time?",
            "title_similarity": "0.0753295"
        },
        {
            "id": "i2xfh70",
            "score": 1,
            "text": "BINGO!!!",
            "title_similarity": "0.052295208"
        },
        {
            "id": "i2xfoea",
            "score": 1,
            "text": "The world was caught with its pants down for Crimea but it started to wake at least some people up a bit. The other missing element in 2014 was the level of Ukrainian resistance.",
            "title_similarity": "0.6271528"
        },
        {
            "id": "i2xfpjb",
            "score": 1,
            "text": "But they did, Russian got sanctioned heavily after crimea war",
            "title_similarity": "0.5057924"
        },
        {
            "id": "i2xfubk",
            "score": 1,
            "text": "There are some mindbogglingly shit takes in this thread lol",
            "title_similarity": "0.25196648"
        },
        {
            "id": "i2xghta",
            "score": 1,
            "text": "Preventative maintenance and care are unrewarded and may even seem like a waste of time and money. The world wanted/needed this to happen, so there would be political support for what's happening now.",
            "title_similarity": "0.59393793"
        },
        {
            "id": "i2xgimn",
            "score": 1,
            "text": "It's almost as if appeasement doesn't work. I feel like someone, somewhere tried this out before but I'm a little foggy..",
            "title_similarity": "0.4075358"
        },
        {
            "id": "i2xgkff",
            "score": 1,
            "text": "It's almost as if appeasement by letting militaristic dictators take small parts of other countries doesn't stop them wanting more.  If only we had a precedent to learn that from.  If only.",
            "title_similarity": "0.6395614"
        },
        {
            "id": "i2xgsg8",
            "score": 1,
            "text": "True story",
            "title_similarity": "0.034942858"
        },
        {
            "id": "i2xh72n",
            "score": 1,
            "text": "Could have been avoided in about 3 hours with 2 squadrons of A-10s.  \n\n\nChrist I wish we had balls.",
            "title_similarity": "0.48538217"
        },
        {
            "id": "i2xjtci",
            "score": 1,
            "text": "Goes without saying the same goes for them if THEY HAD FOUGHT FOR THEIR COUNTRY THEN. He has a point though what is the point of the UN and yes even NATO ( this is a European problem) if they can't solve or stop a problem like this. Veto power should be removed from the UN security council members as well as Russia losing its UN security council seat until all troops are withdrawn and all munitions and devices cleared from pre-2014 Ukraine territory. If a country withdraws from the UN they should be unable to access IMF funds and programs same for WHO or any other international body. They should also be unable to give ANY testimony at the Hague in the Netherlands at the ICC for war crimes. The really need to get creative with the sanctions and make sure they work.",
            "title_similarity": "0.7888799"
        },
        {
            "id": "i2xnob9",
            "score": 1,
            "text": "Voldemort putin",
            "title_similarity": "0.43208474"
        },
        {
            "id": "i2xoxsr",
            "score": 1,
            "text": "I still think social media and poking the bear one too many times is what ruined Putin’s plans. He bit off more than he could chew.",
            "title_similarity": "0.6123605"
        },
        {
            "id": "i2xp470",
            "score": 2,
            "text": "You mean let your nationalist forces brutalize a ppl that voted to join Russia ?",
            "title_similarity": "0.6531578"
        },
        {
            "id": "i2xpahb",
            "score": 1,
            "text": "Why is horrors in “”",
            "title_similarity": "0.34100983"
        },
        {
            "id": "i2xqa7k",
            "score": 1,
            "text": "Hindsight is 20/20. Yes, harsher sanctions back then might have helped,  more wariness of Putin's denying of reality. Ukraine gaining a pro-Russian president in 2010 and having little interest in joining NATO for years didn't help, either.\n\nAt the moment, it's less about 'what if', and more about 'what now'.",
            "title_similarity": "0.76683545"
        },
        {
            "id": "i2xqxig",
            "score": 1,
            "text": "Shoulda woulda coulda",
            "title_similarity": "0.26595008"
        },
        {
            "id": "i2xu1qu",
            "score": 3,
            "text": "Don’t bite the hand that feeds",
            "title_similarity": "0.2908576"
        },
        {
            "id": "i2xu5zj",
            "score": 1,
            "text": "Finland would be a ocean and air war just because it’s a small population is along the coastline.",
            "title_similarity": "0.5106474"
        },
        {
            "id": "i2xvc4r",
            "score": 3,
            "text": "So it’s our job to stop you from losing your land?",
            "title_similarity": "0.5577987"
        },
        {
            "id": "i2xxrc8",
            "score": 1,
            "text": "Zelensky for President",
            "title_similarity": "0.2855617"
        },
        {
            "id": "i2xywse",
            "score": 1,
            "text": "Now that sure seems familiar, doesn't it? Maybe to Germany invading Sudetenland, Japan Manchuria and Italy Ethiopia, and the world appeasing them? Wonder if that could have stopped a little war they caused",
            "title_similarity": "0.6295082"
        },
        {
            "id": "i2xyyn2",
            "score": 1,
            "text": "Yeah. Absolutely.\n\nRussia's just a big bully.",
            "title_similarity": "0.49057767"
        },
        {
            "id": "i2y1jkm",
            "score": 1,
            "text": "He's not wrong, however they should have fought this hard the first time",
            "title_similarity": "0.45289958"
        },
        {
            "id": "i2y1v1c",
            "score": 1,
            "text": "True",
            "title_similarity": "-0.064598516"
        },
        {
            "id": "i2y3ub4",
            "score": 2,
            "text": "Dude needs to stop being right. They'll start meme ing him with miss attributed quotes instead of Einstein",
            "title_similarity": "0.5589983"
        },
        {
            "id": "i2y42xa",
            "score": 1,
            "text": "Could have avoided WW2 if someone killed Hitler.... Should've would've could've I guess....",
            "title_similarity": "0.7100232"
        },
        {
            "id": "i2y5t50",
            "score": 2,
            "text": "I could never figure out why no one did a damned thing when that happened. I mean, WTF?!",
            "title_similarity": "0.32326072"
        },
        {
            "id": "i2y6sxd",
            "score": 2,
            "text": "It’s almost like he’s totally right",
            "title_similarity": "0.071752265"
        },
        {
            "id": "i2y6xi1",
            "score": 1,
            "text": "if if if then then then\n\nif the world had reacted to the annexation of the sudetes in 1938 would it change the course of ww2?",
            "title_similarity": "0.61576486"
        },
        {
            "id": "i2ydk37",
            "score": 1,
            "text": "Gutless fucks",
            "title_similarity": "0.21329235"
        },
        {
            "id": "i2ydpup",
            "score": 1,
            "text": "Could, would, maybe, nobody knows….",
            "title_similarity": "0.2677549"
        },
        {
            "id": "i2yhrkm",
            "score": 1,
            "text": "He's not wrong.  Putin was given a long leash and he abused it at every opportunity with few repercussions.",
            "title_similarity": "0.29636112"
        },
        {
            "id": "i2yl7f2",
            "score": 1,
            "text": "Sounds like the policy of appeasement didn’t work then. Didn’t work with Germany in WWII. And doesn’t work at all.",
            "title_similarity": "0.51595825"
        },
        {
            "id": "i2yln5c",
            "score": 1,
            "text": "Does he have a crystal ball?\n\nFor all he know this might've cornered Russia even more and provoked it to launch the invasion in 2014 instead.",
            "title_similarity": "0.7432234"
        },
        {
            "id": "i2yrbca",
            "score": 1,
            "text": "The first warning sign might have been in ‘99 when then Prime Minister Putin had the FSB detonate bombs in Russia killing hundreds of Russian citizens then blamed Chechens to justify a second war with Chechnya and solidify his soon to be new role as Russian President",
            "title_similarity": "0.64826953"
        },
        {
            "id": "i2yrife",
            "score": 2,
            "text": "The only ones who got punished were the people of Crimea who were just minding their own business. For the longest time, we had no water, electricity, obv no Internet or anything either. Lived like literal cavemen",
            "title_similarity": "0.37405643"
        },
        {
            "id": "i2yspfj",
            "score": 1,
            "text": "Yes 100% I have been saying this since 2014.",
            "title_similarity": "0.12154803"
        },
        {
            "id": "i2yunhr",
            "score": 3,
            "text": "Even if Russia loses Ukraine and concedes, how long would it be until Putin tries again? Granted, this is Putin's death rattle - if he loses (or even if he wins) he has absolutely made his regime a global persona non grata. \n\nWhile Russia still holds nuclear weapons in their roster, they will see this as guaranteed immunity to bully and invade Europe. If Russia isn't forcibly denuclearized by the global community at the end of all this, it's just going to inevitably happen again.",
            "title_similarity": "0.75341886"
        },
        {
            "id": "i2yxy7a",
            "score": 3,
            "text": "Yep it's called appeasement my friends. Anyone with a year 10 high school textbook shoulda seen it coming",
            "title_similarity": "0.3832029"
        },
        {
            "id": "i2yzlh9",
            "score": 1,
            "text": "Absolutely true. All they did was embolden him.",
            "title_similarity": "0.18662278"
        },
        {
            "id": "i2z05zr",
            "score": 1,
            "text": "Yes, he's right. We've kicked the can of Russia down the road too long.",
            "title_similarity": "0.5070703"
        },
        {
            "id": "i2z270o",
            "score": 1,
            "text": "Where is the lie?! Obama pussied out",
            "title_similarity": "0.4185617"
        },
        {
            "id": "i2z2b7u",
            "score": 2,
            "text": "404: lies not found",
            "title_similarity": "0.29468834"
        },
        {
            "id": "i2z3kbm",
            "score": 1,
            "text": "I’m no expert here but smell is one of the biggest senses connected to memory. Olfactory signals reach the limbic system fairly quickly considering the anatomy of the nose and brain.",
            "title_similarity": "0.3859933"
        },
        {
            "id": "i2z3ubq",
            "score": 1,
            "text": "The West is scarred to press russia too hard though. Those Nukes they have are insane. That's only the ones that are public knowledge.",
            "title_similarity": "0.6510843"
        },
        {
            "id": "i2z4bj4",
            "score": 2,
            "text": "What can we say, all the world organization is just for show against real power. Think about it, wdf is UN good for? Wdf have they done in the last 20 years???",
            "title_similarity": "0.5137681"
        },
        {
            "id": "i2z8g3k",
            "score": 1,
            "text": "World leaders are greedy garbage people.",
            "title_similarity": "0.3800184"
        },
        {
            "id": "i2zbjj8",
            "score": 1,
            "text": "It’s OK though Obama said stern words and shook his finger at Putin.",
            "title_similarity": "0.60614806"
        },
        {
            "id": "i2zbz1z",
            "score": 1,
            "text": "Now would be a great time for satellite countries to announce start pulling away from Russia.",
            "title_similarity": "0.65086687"
        },
        {
            "id": "i2ze6q2",
            "score": 1,
            "text": "This is the way",
            "title_similarity": "0.009832218"
        },
        {
            "id": "i2zej5w",
            "score": 1,
            "text": "Its true. Just like with gays getting married. That was the first step now look where we are. /s \nIts a joke people",
            "title_similarity": "0.35635352"
        },
        {
            "id": "i2zerpl",
            "score": 1,
            "text": "here comes a new strain of covid",
            "title_similarity": "0.1894055"
        },
        {
            "id": "i2zki8i",
            "score": 5,
            "text": "\"Hey so after this second world war, i think we need to make a powerful international organisation that would try and keep the world as peaceful as can be\"\n\n\"Sounds good\"\n\n\"Every member of the union will be able to vote wether or not it should intervene in a country in which war is waging\"\n\n\"Sounds great actually\"\n\n\"Also give 5 of them the power to overrule literally every other vote lmao\"\n\n\"Perfect.\"",
            "title_similarity": "0.5915928"
        },
        {
            "id": "i2ztflw",
            "score": 1,
            "text": "And he is 199% correct, only forgot to mention that world's greed made him very reach and powerful as well.",
            "title_similarity": "0.359166"
        },
        {
            "id": "i2zx55b",
            "score": 1,
            "text": "Why the quotes?",
            "title_similarity": "0.21713637"
        },
        {
            "id": "i2zxbak",
            "score": 2,
            "text": "There's nothing stronger than fighting for your home and lives of your families and fellow country man and women!So much respect to Ukrainians!God be with you all!",
            "title_similarity": "0.4338353"
        },
        {
            "id": "i30u9n7",
            "score": 1,
            "text": "Or they could have been avoided if he gave independence to the 2 regions…",
            "title_similarity": "0.6316536"
        },
        {
            "id": "i314akx",
            "score": 2,
            "text": "Instead of all these countries doing this and doing that .....the real problem the present russian regime ...GET RID OF THEM ... TGE WORLD WILL BE A SAFER PLACE",
            "title_similarity": "0.7572479"
        },
        {
            "id": "i31g342",
            "score": 1,
            "text": "The Russian invasion could have been avoided if he had not blabbed about joining NATO and aquiring nuclear weapons. It could have been avoided of NATO had not held exercises with Ukraine in Russia's frontstep. It could have been avoided if the regime change in 1914 had been a democratic one instead of a coup. It could have been avoided if he had declared that Ukraine would never join NATO or the EU.\n\nThe invasion could have been avoided if NATO had kept its promise to Russia not to expand to the EAST.",
            "title_similarity": "0.8424891"
        },
        {
            "id": "i32cyg1",
            "score": 1,
            "text": "You shouldn’t have challenged putin at this hour. What putin did wasn’t nice but you should have thought about your people and the consequence. You too turned your back on your people. All these could have been avoided too if you hadn’t been and made a fool decision. Point your finger at someone and the other four points right back at your own face",
            "title_similarity": "0.77651894"
        },
        {
            "id": "i341gu6",
            "score": 2,
            "text": "Horrors of Russian invaders could’ve also been avoided if he surrendered",
            "title_similarity": "0.7979936"
        },
        {
            "id": "i375vke",
            "score": 2,
            "text": "For some reason my dyslexic ass though the title said that \"Zelenskt says 'hottors' of Russian invasion could have been prevented if Cyberpunk 2077 wasn't a dissapointment\"",
            "title_similarity": "0.8329"
        },
        {
            "id": "i37vm1b",
            "score": 1,
            "text": "Yup probably.",
            "title_similarity": "0.04629812"
        },
        {
            "id": "i3bl5ah",
            "score": 1,
            "text": "To be fair... Russias modernization issue isnt really a problem of being able to or not... Its clear corruption has destroyed the military of russia.",
            "title_similarity": "0.667225"
        },
        {
            "id": "i3lqgys",
            "score": 1,
            "text": "Neither did the sanctions.",
            "title_similarity": "0.25289744"
        },
        {
            "id": "i3s8dt0",
            "score": 1,
            "text": "US and European lack of direct action has ncreased the likelyhood of expanding conflict. Janet Yellen recently told Chins: Attack Taiwan, and expect sanctions, not bullets or bombs. That so encouraged Japan that it now seeks alliance with India, and South Korea, asking for more US forces on the ground, so the US cannot dither.",
            "title_similarity": "0.6545418"
        },
        {
            "id": "i3sbaid",
            "score": 2,
            "text": "Truth",
            "title_similarity": "-0.00066937413"
        },
        {
            "id": "i4316v4",
            "score": 1,
            "text": "Unfortunate that piece of land was given to Ukraine by Russia they simply took it back",
            "title_similarity": "0.7015121"
        }
    ]
}