{
    "NATO will deploy a permanent full-scale military force on its border with Russia to combat a future invasion, alliance's chief says\n": [
        {
            "id": "i468n0f",
            "score": 2,
            "text": "Why hello WWIII, how are you this morning?\n\nFeeling nuclear you say?",
            "title_similarity": "0.32114178"
        },
        {
            "id": "i46l38n",
            "score": -37,
            "text": "All it takes is a single nuclear strike to snap everyone back into reality.  NATO should be about de-escalation not provocation.",
            "title_similarity": "0.6341121"
        },
        {
            "id": "i46213e",
            "score": 7,
            "text": "This could be the end of Putin. I'd bet money that internal plots are already being whispered in the corner. He is losing the faith of his own military, generals are being killed on the field, people are protesting in the streets. It's a glass castle.",
            "title_similarity": "0.4856221"
        },
        {
            "id": "i4686r6",
            "score": 19,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i46bnl1",
            "score": -32,
            "text": "That is how war starts",
            "title_similarity": "0.45312232"
        },
        {
            "id": "i46mnq7",
            "score": -3,
            "text": "like if nato surrounding russia wasnt already causing trouble",
            "title_similarity": "0.57009894"
        },
        {
            "id": "i46a58c",
            "score": 36,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i46717w",
            "score": -7,
            "text": "I think that’s an unnecessary waste of resources and a cheap provocation. Even if Russia invades it won’t be able to win when the rest of NATO shows up.",
            "title_similarity": "0.47310513"
        },
        {
            "id": "i45u8fs",
            "score": -14,
            "text": "A little late, but good nonetheless.",
            "title_similarity": "-0.06933388"
        },
        {
            "id": "i4697gn",
            "score": -8,
            "text": "Now they’ll def be more brutal to make sure Ukraine can never be part of this permanent military force on its border",
            "title_similarity": "0.58242804"
        },
        {
            "id": "i4630ni",
            "score": 45,
            "text": "That's sure to de-escalate things.",
            "title_similarity": "0.23197187"
        },
        {
            "id": "i46es9c",
            "score": -8,
            "text": "How to provoke a dictator 101",
            "title_similarity": "0.39348227"
        },
        {
            "id": "i46g8so",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i46baek",
            "score": 3,
            "text": "Remember guys- answer to war is not more war, it's peace.",
            "title_similarity": "0.2899546"
        },
        {
            "id": "i46dhfr",
            "score": 3,
            "text": "Nuclear holocaust Pog",
            "title_similarity": "0.33798188"
        },
        {
            "id": "i46g4qf",
            "score": 0,
            "text": "We’re (regular everyday people) are getting setup for this hell of a major conflict they are engineering. \n\nThen Boom; they’ll say we need a world government to fix the problem they created.",
            "title_similarity": "0.62658113"
        },
        {
            "id": "i46arqd",
            "score": 8,
            "text": "That’s quite an escalation. Everyone is escalating heavily.",
            "title_similarity": "0.2116127"
        },
        {
            "id": "i46fqvu",
            "score": 8,
            "text": "Jesus. A new Cold War and a new iron curtain. Now that’s a great way to deescalate tensions!",
            "title_similarity": "0.62626696"
        },
        {
            "id": "i46127f",
            "score": 50,
            "text": "[deleted]",
            "title_similarity": "-0.023929574"
        },
        {
            "id": "i46rrk2",
            "score": 2,
            "text": "Do you want a cuban missile crisis? 'cos that is how you get a cuban missile crisis?",
            "title_similarity": "0.4543808"
        },
        {
            "id": "i464kae",
            "score": -8,
            "text": "NATO could destroy Russia 100x over without nukes",
            "title_similarity": "0.5958813"
        },
        {
            "id": "i46mtpi",
            "score": 6,
            "text": "Cold War 2.0. Thanks NATO you fucking dumbasses",
            "title_similarity": "0.4617228"
        },
        {
            "id": "i46mft1",
            "score": 0,
            "text": "Man, Putin really will go down as the dumbest tyrant. And that bar was already pretty low. Way to overplay your hand after spending 20 years stacking the deck lmao.\n\nEdit: I seem to have offended the Russian bots. Oh, how sad 😥",
            "title_similarity": "0.36182815"
        },
        {
            "id": "i469iqr",
            "score": 26,
            "text": "Nothing could possibly go wrong with this brilliant plan.",
            "title_similarity": "0.17162004"
        },
        {
            "id": "i46j5th",
            "score": 8,
            "text": "I'd love to hear from US government and \"coalition\" spokespeople how they think this is a \"good idea\", putting hostile forces in such close proximity.\n\nIts the October Crisis, but in reverse.",
            "title_similarity": "0.5968344"
        },
        {
            "id": "i469a3w",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.023929574"
        },
        {
            "id": "i479i28",
            "score": -2,
            "text": "There are obvious double standards. What am I talking about!? Before the conflict, the United States supplied and is supplying weapons to Ukraine, just like the countries of Europe, just before the start of the conflict, bases were created there and NATO instructors were present. During the operation in Mariupol, one of the NATO colonels (\"retired\") died. Until 2022, Ukraine was being pumped with weapons and instructors. Was it all done for a peaceful settlement of the conflict? Since 2014, there has been a civil war in Ukraine, civilians in the South-East have been shelled by the Ukrainian military (there are thousands of confirmations of this, up to OSCE reports). European countries and all US satellites have imposed sanctions against Russia. They seize the property of private individuals without court decisions (hello, justice and democracy). Was something similar applied to the US when it invaded other countries? Mb one of these countries deployed its military contingent near the borders of the United States? Did he send weapons and instructors? Israel staged the genocide of the Arabs, recently there was a post in the Socialism community. Who imposed sanctions against Israel? There is a World War 3 where the US and Europe are at war with Russia, Ukraine supplies infantry, and weapons, instructors, intelligence, logistics, supplies all come from the US and Europe. To understand the 3 world is already underway, Russia can already use nuclear weapons on countries supplying weapons to Ukraine, as they pose a threat. There is no longer a question about a sleepy Putin. If the top military leadership of Russia decides that in a conventional war they will lose to the United States and Europe, then this will all end in the world.",
            "title_similarity": "0.6993779"
        },
        {
            "id": "i46bt5n",
            "score": 5,
            "text": "So expanding the war huh",
            "title_similarity": "0.44235474"
        },
        {
            "id": "i46n6ne",
            "score": 3,
            "text": "This will only anger the Russian Federation and escalate tensions between the West. Bad move.",
            "title_similarity": "0.47044075"
        },
        {
            "id": "i468f9m",
            "score": 9,
            "text": "This still indicates a possibility of nuclear war.\n\nOne wrong move and missiles are in the air.",
            "title_similarity": "0.53659815"
        },
        {
            "id": "i46cibl",
            "score": -9,
            "text": "Good bye guys.\n\nlive life to the fullest.\n\nworld war 3 is coming.",
            "title_similarity": "0.47629225"
        },
        {
            "id": "i48ujzg",
            "score": 1,
            "text": "Seriously, what the fuck are we doing? This isn’t our war. It’s like we learned jackshit from Vietnam. This isn’t going to deescalate anything.",
            "title_similarity": "0.2679962"
        },
        {
            "id": "i4613ng",
            "score": 29,
            "text": "Can't wait to see all the Russian shills foam at the mouth to call this Western aggression towards Russia.",
            "title_similarity": "0.65568185"
        },
        {
            "id": "i47mkjy",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i47raja",
            "score": -2,
            "text": "NATO expansion really needs to fuck off. Waste of time and money trying to bully a dying country like russia. We’re putting them in a corner that’ll only increase their trading with china",
            "title_similarity": "0.57955754"
        },
        {
            "id": "i46d9yx",
            "score": -3,
            "text": "Comment test",
            "title_similarity": "0.031990528"
        },
        {
            "id": "i46eq4t",
            "score": 1,
            "text": "Ah yes, world war 3.",
            "title_similarity": "0.27877104"
        },
        {
            "id": "i46i85w",
            "score": 2,
            "text": "Gotta spend that taxpayer money 💰",
            "title_similarity": "0.22857508"
        },
        {
            "id": "i467h4u",
            "score": 8,
            "text": "Lol the Russians paranoia going to go through the roof",
            "title_similarity": "0.48540077"
        },
        {
            "id": "i46wv67",
            "score": 8,
            "text": "Wild how so many people can swing freely between self described anti war liberal and military escalation advocate based on media narrative.",
            "title_similarity": "0.49454093"
        },
        {
            "id": "i46zz67",
            "score": 6,
            "text": "This is ridiculous. Just provoking an already hostile Russia into starting all out Armageddon. \n\nI absolutely hate the world leaders we are forced to endure",
            "title_similarity": "0.49524125"
        },
        {
            "id": "i46a9gs",
            "score": 4,
            "text": "That’s actually kind of insane",
            "title_similarity": "-0.033288047"
        },
        {
            "id": "i46fnn4",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i46mjsl",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i46vtya",
            "score": 3,
            "text": "Imagine not knowing that this is just more of the same western imperialism.",
            "title_similarity": "0.3102941"
        },
        {
            "id": "i46r6ot",
            "score": 0,
            "text": "This is such a weird headline. NATO is not a country, it doesn't have a single border. The headline should have stated that Estonia and Lativa will increase NATO backed forces on their borders with Russia.",
            "title_similarity": "0.66240644"
        },
        {
            "id": "i47b4he",
            "score": 0,
            "text": "And there it is. Our grandkids will get some sort of Israel 2.0 out there I’m sure. Fuck the UN.",
            "title_similarity": "0.45082328"
        },
        {
            "id": "i464k1b",
            "score": -2,
            "text": "Good idea short term. Mid term, probably unnecessary. Why? Putin is a old man. Retirement is near. Every young Russian and Ukrainian l know are pro-Europe. Let’s not forget the ones in power lived during Cold War. Anyone under 40 doesn’t give a crap!",
            "title_similarity": "0.47274452"
        },
        {
            "id": "i45v7by",
            "score": 38,
            "text": "Humans never learn, WWI, WWII, Korean War, Vietnam, numerous military issues all over the world, not getting better, it seems to be getting worse. Now, a permanent NATO contingency of troops along the Russian Border, as Russian aggression has gotten worse, not better,  Putin seems to be going in full bore, at his age it may be his last hurrah.  Go to Wikipedia, and see the astonishing and scary list of military conflicts and casualties through the years, it's a loooong ugly list of mankind's hate of each other.  https://en.wikipedia.org/wiki/List\\_of\\_armed\\_conflicts\\_in\\_2020",
            "title_similarity": "0.5471106"
        },
        {
            "id": "i466yy9",
            "score": 36,
            "text": "Putin believed Trump’s bullshit about NATO being weak, and was counting on the treasonous🍊 to pull the US out of the alliance. Thank you to the Dem voters for electing Biden.",
            "title_similarity": "0.5764884"
        },
        {
            "id": "i46fp2s",
            "score": -3,
            "text": "The French did this once. Didn’t work.",
            "title_similarity": "0.019596653"
        },
        {
            "id": "i47016c",
            "score": 1,
            "text": "I think it is time the West takes out Putin.  He is slaughtering civilians and destroying property.",
            "title_similarity": "0.5010719"
        },
        {
            "id": "i45ocao",
            "score": 10,
            "text": "They should already start planning where exactly to place these forces on Ukraine's eastern border.",
            "title_similarity": "0.638452"
        },
        {
            "id": "i46d5is",
            "score": 6,
            "text": "It's a shame the Russian population is too stupid to see this information and realize it's their own fault. \n\nThose monkeys will just think the NATO is getting ready to invade or whatever their government media says.",
            "title_similarity": "0.5036167"
        },
        {
            "id": "i46i9dl",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i466lpc",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i46b1nh",
            "score": -5,
            "text": "…And it begins.",
            "title_similarity": "0.08390168"
        },
        {
            "id": "i45ogd5",
            "score": -50,
            "text": "So, just about what they've been doing.  Cool I suppose?  Seems like a non story masquerading as a story.",
            "title_similarity": "0.10433818"
        },
        {
            "id": "i469k64",
            "score": 2,
            "text": "Every action has an equal and opposite reaction.",
            "title_similarity": "0.14428249"
        },
        {
            "id": "i47d5w8",
            "score": 2,
            "text": "Putin is tyrant, but American warmongers will not be happy until some WW3 happen.",
            "title_similarity": "0.5603435"
        },
        {
            "id": "i46b1rm",
            "score": 8,
            "text": "Damn, new U.S. deployments are going to be awesome for young 20 something’s. A drinking and guard duty schedule with meeting your new Eastern European wife in between that somewhere.",
            "title_similarity": "0.50363874"
        },
        {
            "id": "i46fn6k",
            "score": -3,
            "text": "Bombs 💣 go BOOm 🤯",
            "title_similarity": "0.20990652"
        },
        {
            "id": "i46wr7h",
            "score": 1,
            "text": "Putin should be publicly executed.",
            "title_similarity": "0.5746875"
        },
        {
            "id": "i478sdx",
            "score": 1,
            "text": "That’ll de escalate things, not",
            "title_similarity": "0.18049581"
        },
        {
            "id": "i479mre",
            "score": 1,
            "text": "So it appears we're going to ignore the collapse of the environment, the spread of pathogens, access to fresh water, and dismal quality of life so we can finance a bunch of grown adults playing G.I. Joe with each other.",
            "title_similarity": "0.4191061"
        },
        {
            "id": "i47ogrn",
            "score": 1,
            "text": "I think they mean to say the US will deploy a full scale military force slightly backed by other euro nations that are using US equipment.",
            "title_similarity": "0.67489433"
        },
        {
            "id": "i48undc",
            "score": 2,
            "text": "Canada is ready to contribute to its fullest capabilities. To that end they’re sending 4 guys with sling shots. A tactical wheelbarrow, and a 3 man military kite crew. The resupply canoe rows out of Halifax in 2 weeks.",
            "title_similarity": "0.4660247"
        },
        {
            "id": "i46d0cs",
            "score": -14,
            "text": "Ah so NATO is the belligerent.",
            "title_similarity": "0.4252432"
        },
        {
            "id": "i46db5f",
            "score": 8,
            "text": "The military industrial complex needs another check",
            "title_similarity": "0.52158844"
        },
        {
            "id": "i46izmv",
            "score": 0,
            "text": "We should build a wall or something. Just saying...",
            "title_similarity": "0.35806972"
        },
        {
            "id": "i46yiup",
            "score": 0,
            "text": "WW3 imminent?!",
            "title_similarity": "0.21500622"
        },
        {
            "id": "i47e336",
            "score": 0,
            "text": "Nuclear war is the best result. Lets go.",
            "title_similarity": "0.4929404"
        },
        {
            "id": "i47fpx9",
            "score": 0,
            "text": "Trump was very, very wrong about NATO but that doesn't mean NAO nations were right. They had become a bit too complacent about Russia and hopefuply thia is a wake up call.",
            "title_similarity": "0.5360141"
        },
        {
            "id": "i487wrk",
            "score": 0,
            "text": "Oh yeah this definitely won’t start ww3",
            "title_similarity": "0.199473"
        },
        {
            "id": "i4891ok",
            "score": 0,
            "text": "This was the only Outcome. Russia Attacks = NATO at the border. Russia doesnt Attack = Nato at the Border. This is just another step towards an all out war. This war is disgusting and in the beging i was hoping that Russia would \"only\" Annex the Separatist regions to create Buffer zone between Russia and NATO...",
            "title_similarity": "0.7452111"
        },
        {
            "id": "i48e0sy",
            "score": 0,
            "text": "Putin will not like.",
            "title_similarity": "0.17220439"
        },
        {
            "id": "i48l0py",
            "score": 0,
            "text": "This isnt a good thing guys. This is a waste of time and resources particularly concerning america and the distance. Current events aside.",
            "title_similarity": "0.1780026"
        },
        {
            "id": "i48ln90",
            "score": 0,
            "text": "I am sure this promise will do miracles to calm the current hostilities.",
            "title_similarity": "0.31707412"
        },
        {
            "id": "i48nkys",
            "score": 0,
            "text": "That is not a good idea.",
            "title_similarity": "-0.050226323"
        },
        {
            "id": "i48o0rb",
            "score": 0,
            "text": "Can you please clarify here? NATO is not a nation, so I would not expect it to have borders. Do you mean that nations who are signators to the NATO alliance are considering doing this?",
            "title_similarity": "0.52167773"
        },
        {
            "id": "i49872q",
            "score": 0,
            "text": "I don’t get why this is America’s problem. I also don’t get why we’ve given the most money but are still being criticized. Can anyone explain that to me?",
            "title_similarity": "0.29103458"
        },
        {
            "id": "i49uvmp",
            "score": 0,
            "text": "I’m no specialist but my two cents on this is they’d be better off playing the whole thing down and trying to not look aggressive, then if Russia invades a Baltic state or any NATO member they’ll fight it back. I’m afraid such actions will flip the public opinion in Russia that could otherwise become more and more anti Putin which would be a blessing.",
            "title_similarity": "0.60265213"
        },
        {
            "id": "i4a571c",
            "score": 0,
            "text": "Isnt that exactly what putin wants tho? So that it looks like nato isnt defensive. Youd be doing the same as he did before he attacked ukraine so he can say it is a military tactic to prepare for attack?",
            "title_similarity": "0.74879456"
        },
        {
            "id": "i460nia",
            "score": 5,
            "text": "This is going to turnout great",
            "title_similarity": "0.12739554"
        },
        {
            "id": "i4683cj",
            "score": 10,
            "text": "This is the beginning of the end…\n\nOld rich men with fallout bunkers are gambling with our lives.",
            "title_similarity": "0.3405726"
        },
        {
            "id": "i465naa",
            "score": -13,
            "text": "After sacrificing the people of Ukraine? Not impressed.",
            "title_similarity": "0.25755647"
        },
        {
            "id": "i47dc6f",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i47ex61",
            "score": 2,
            "text": "What would happen if Russia would deploy a full scale military force at the Mexican border.?",
            "title_similarity": "0.7806681"
        },
        {
            "id": "i467srd",
            "score": 3,
            "text": "\"Talk softly and carry a big stick\" I remember someone saying this during the cold War in regards  to Russia.",
            "title_similarity": "0.56880397"
        },
        {
            "id": "i462749",
            "score": 7,
            "text": "Gee there’s zero chance of an escalation now.",
            "title_similarity": "0.13266787"
        },
        {
            "id": "i46ny6g",
            "score": -6,
            "text": "Sounds like NATO is going out of its way to piss off Russia more and more. And now Finland is joining NATO.\n\nTo any intelligent person, this is clearly a powderkeg waiting to explode. \n\nLuckily, Russia’s military probably has 0 chance of defeating a US led NATO. But Russians are very prideful and patriotic - so they will still fight if they feel they need to. \n\nIf Russia had military alliances, I highly doubt the actions would be the same.",
            "title_similarity": "0.6814065"
        },
        {
            "id": "i45nl3x",
            "score": -48,
            "text": "~~Uh oh, is this the road to WW3?~~\n  \nI now see the errors of my ways",
            "title_similarity": "0.19630387"
        },
        {
            "id": "i466g5k",
            "score": 5,
            "text": "NATO borders Russia?",
            "title_similarity": "0.6013924"
        },
        {
            "id": "i474qwc",
            "score": -6,
            "text": "Yes,,,, because escalating WHY the Russians started the invasion in the first place,  is the best option. Can’t wait for fat armchair redditors to explain why nuclear war is great for the environment.",
            "title_similarity": "0.7291239"
        },
        {
            "id": "i46ensz",
            "score": -2,
            "text": "We’re doomed. Let’s keep sending weapons somewhere and get mad when there is violence",
            "title_similarity": "0.39835316"
        },
        {
            "id": "i46hs17",
            "score": 2,
            "text": "NATO is a country now?",
            "title_similarity": "0.40705752"
        },
        {
            "id": "i46n7oo",
            "score": 3,
            "text": "Can't wait to pay for this instead of universal healthcare",
            "title_similarity": "0.41846228"
        },
        {
            "id": "i47498c",
            "score": -2,
            "text": "Man, talk about escalation",
            "title_similarity": "0.26614952"
        },
        {
            "id": "i474wvl",
            "score": -2,
            "text": "We’re all praising this like this is a good thing. This is just another step towards us going extinct. \n\nWhat a complete clusterfuck.",
            "title_similarity": "0.33563548"
        },
        {
            "id": "i498tqf",
            "score": -3,
            "text": "then what about the oppression invasion of Israel on Palestine..?\n\nAggression, Killing of Palestinian people,\n\npalestine dont have military.\n\nNato ?????????..why silence",
            "title_similarity": "0.38020545"
        },
        {
            "id": "i46sq1k",
            "score": 1,
            "text": "Sounds like Europe has discovered the profits of the military industrial complex. Idk seems like a wasteful and unnecessary priming of a powder keg to have a full scale force permanently on standby.",
            "title_similarity": "0.534147"
        },
        {
            "id": "i46wdqe",
            "score": 1,
            "text": "Good. He's obviously not attacking for any real reason. He wants to rebuild the USSR. Fuuuuuck no. Glad nato is finally stepping up.",
            "title_similarity": "0.55221057"
        },
        {
            "id": "i46yfqt",
            "score": 1,
            "text": "Putin's big brain plan to thwart the NATO expansion is working perfectly. He definitely showed NATO.",
            "title_similarity": "0.714306"
        },
        {
            "id": "i46z0kg",
            "score": -1,
            "text": "Im all for the NATO buildup. Hell, Im ready to bomb Russia into the stone ages....BUT...They cant even capture anything in Ukraine. Why would they move to another country....",
            "title_similarity": "0.69248354"
        },
        {
            "id": "i471478",
            "score": 1,
            "text": "descalate",
            "title_similarity": "0.13861018"
        },
        {
            "id": "i476132",
            "score": 1,
            "text": "Why is everyone in this thread so excited about saber rattling. \n\nPutin needs the Russian people to see the world in black and white - and believe Putin is the only thing stopping NATO from destroying Russia. While this might be a necessary step for defense of NATO countries it plays *directly* into Putin's propaganda effort and will only make him more popular in Russia.\n\nIf NATO's foreign policy experts weren't keenly aware of this tradeoff it wouldn't have been put off so long.",
            "title_similarity": "0.71796453"
        },
        {
            "id": "i478m5w",
            "score": 1,
            "text": "Ofc Russia is bad. That goes without saying. But stil, the last thing the global human population needs is full scale nuclear war. It must be avoided at all costs. Megadeaths are measured in the millions. In the event of full scale nuclear exchange, it is not known how much of civilization in this planet, if any, will survive.",
            "title_similarity": "0.63590974"
        },
        {
            "id": "i479rd6",
            "score": 1,
            "text": "Straight up gonna provoke another war",
            "title_similarity": "0.5369811"
        },
        {
            "id": "i47cnsx",
            "score": 1,
            "text": "Not justifying the invasion in the slightest but a huge part of Russia peacefully letting Germany reunify and join NATO is that US/NATO would not advance an inch further into the Russian sphere of influence.  Once again, not justifying or pro Russia in the slightest, but it’s kind of reminiscent of Russia trying to arm Cuba so many years ago and how that was a redline for the US.",
            "title_similarity": "0.654557"
        },
        {
            "id": "i47cp7n",
            "score": 1,
            "text": "It's just a matter of time before we see WWIII. One mistake that Russia can call aggression. Boom.",
            "title_similarity": "0.582321"
        },
        {
            "id": "i47d3vv",
            "score": 1,
            "text": "And so it begins… the destruction of the earth",
            "title_similarity": "0.31377476"
        },
        {
            "id": "i47g4b6",
            "score": 1,
            "text": "No better way to work our way out of what would eventually be a recession/depression with an orchestrated war by the world elite.  Kind of sad innocent people are dying in order to stimulate the economy because of covid.",
            "title_similarity": "0.4673169"
        },
        {
            "id": "i47l2ev",
            "score": 1,
            "text": "NATO is itching for a fight … jump in and do something before it is too late for all of us. People are going hungry in other parts of the world because of this war and Ukraine is suffering. It was  good Putin gave it go and now can we end it.",
            "title_similarity": "0.57454634"
        },
        {
            "id": "i484odp",
            "score": -1,
            "text": "I don’t really like when we talk about “nato borders” to be honest. \nGives me big 1984 vibes.",
            "title_similarity": "0.38452807"
        },
        {
            "id": "i486kw2",
            "score": 1,
            "text": "This won't end well",
            "title_similarity": "0.0112438975"
        },
        {
            "id": "i488qc5",
            "score": 1,
            "text": "I’m pretty sure this is what led to escalations in the first place.",
            "title_similarity": "0.29480845"
        },
        {
            "id": "i48eya2",
            "score": 1,
            "text": "Oh good, cold war in full effect",
            "title_similarity": "0.5776957"
        },
        {
            "id": "i48j44r",
            "score": 1,
            "text": "this isn’t provocative at all…..",
            "title_similarity": "-0.05471666"
        },
        {
            "id": "i49u8ta",
            "score": -1,
            "text": "I mean…the west is kinda luring a Third World War at this point.",
            "title_similarity": "0.43333885"
        },
        {
            "id": "i4a9xrx",
            "score": -1,
            "text": "And attack it anytime wink wink.\n\nThis is why russia went to war.",
            "title_similarity": "0.6922956"
        },
        {
            "id": "i4651bg",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "-0.023929574"
        },
        {
            "id": "i467jy6",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "-0.023929574"
        },
        {
            "id": "i46yhq9",
            "score": -7,
            "text": "Yeah, let's trigger a nuclear mass destruction of the planet. That will teach those pesky Russians!\n\nNato dumber every day",
            "title_similarity": "0.5968667"
        },
        {
            "id": "i462gba",
            "score": 8,
            "text": "Next news will be about Putin threatening nuclear war.",
            "title_similarity": "0.68697274"
        },
        {
            "id": "i46iol7",
            "score": 10,
            "text": "Honestly this is just pointless posturing. There is a 0% chance of an invasion of NATO countries, show of force or not. Putin is many things, but he's not stupid, he knows full well that invading a NATO country is a declaration of war with most of the northern hemisphere, a lot of which has nukes.",
            "title_similarity": "0.6455961"
        },
        {
            "id": "i45x2ub",
            "score": -18,
            "text": "Why bother? if war occurs betweens Russia and NATO, its not like itll start/end with troops.",
            "title_similarity": "0.63941133"
        },
        {
            "id": "i45ywqj",
            "score": 5,
            "text": "[https://www.flightradar24.com/PSYCHO61/2b714e60](https://www.flightradar24.com/PSYCHO61/2b714e60)\n\nWorld has changed. We are now heavily securing East Europe.",
            "title_similarity": "0.4706235"
        },
        {
            "id": "i46e4xl",
            "score": 4,
            "text": "this is a war mongering article… NATO statement was only 40,000 troops and not “full scale”",
            "title_similarity": "0.30547157"
        },
        {
            "id": "i46m05g",
            "score": -4,
            "text": "Yes let’s back Russia even further into a corner, what could possibly go wrong?",
            "title_similarity": "0.5255074"
        },
        {
            "id": "i476gpg",
            "score": -4,
            "text": "Yay. More conflict. Hooray for Boeing and Lockheed Martin. Three cheers for warmongering.",
            "title_similarity": "0.44823468"
        },
        {
            "id": "i478x8f",
            "score": -5,
            "text": "That’s how to start an actual war",
            "title_similarity": "0.6009239"
        },
        {
            "id": "i4808vp",
            "score": -4,
            "text": "Why in hell this damn people are so committed into pushing us into this WW3 debacle?",
            "title_similarity": "0.43859047"
        },
        {
            "id": "i475oon",
            "score": -5,
            "text": "Kinda seems like a shit idea.\n\nWhen you're dealing with a teenager on a bully streak, calling him out and squaring up with him is the quickest way to get punched.  If the idea is to avoid confrontation, then NATO members should be pursuing the only options that have ever actually worked - developing communications, finding common ground, signing effective treaties (especially regarding nuclear disarmament), and leveraging an interconnected economy to allow for social and cultural interactions that make future conflict deleterious for everyone.\n\nThe only country that we've ever given the long-term global cold shoulder with a nice fat DMZ and perma-sanctions to is North Korea, that sure hasn't helped inspire them to change their behavior and become a member of the global community.  Why would we try the same with Russia?",
            "title_similarity": "0.5929133"
        },
        {
            "id": "i476ild",
            "score": -5,
            "text": "This isn’t going to end well for nato",
            "title_similarity": "0.25519374"
        },
        {
            "id": "i465trw",
            "score": 2,
            "text": "Good job, Putin!",
            "title_similarity": "0.2680105"
        },
        {
            "id": "i469k8k",
            "score": 3,
            "text": "All I hear are the war drums.. they are getting louder.",
            "title_similarity": "0.2670781"
        },
        {
            "id": "i46a3cg",
            "score": -4,
            "text": "This article is not great. It was mostly cribbed from other sources and the headline is super unclear: what border are they talking about? NATO is not a country, so it doesn’t have a border. Nothing in the piece clarifies",
            "title_similarity": "0.30173606"
        },
        {
            "id": "i46arlq",
            "score": 3,
            "text": "I foresee exactly zero negative consequences of this move. Nobody anywhere whose name starts with \"P\" will see this as an act of war.",
            "title_similarity": "0.41722974"
        },
        {
            "id": "i46mlce",
            "score": -2,
            "text": "Why don't the headline read, \"World giving Russia Ukraine.\"",
            "title_similarity": "0.5927324"
        },
        {
            "id": "i470r0j",
            "score": -3,
            "text": "To help with that effort Canada will send 4 guys with sling shots. 2 tactical wheel barrows and the navy resupply canoe rows out of Halifax harbor next week.",
            "title_similarity": "0.43672115"
        },
        {
            "id": "i474trf",
            "score": -2,
            "text": "NATO will invade Russia to prevent a future invasion.",
            "title_similarity": "0.83275414"
        },
        {
            "id": "i4777tq",
            "score": -2,
            "text": "TIL NATO has a border apparently?",
            "title_similarity": "0.51618844"
        },
        {
            "id": "i478g9r",
            "score": -2,
            "text": "Isn’t that why Russia invaded Ukraine? To avoid that? Can’t imagine that will go well. \n\nI’m not sure what the solution is to all of this, but I know for a fact that pushing Russia and China closer together is the worst thing we can do.",
            "title_similarity": "0.5598924"
        },
        {
            "id": "i47hm8e",
            "score": 2,
            "text": "Russia: Invades a non NATO country and loses.\n\nNato: you invaded a neutral country for WAR... piss off you are not allowed in the world stage Russia.\n\nRussia: SHOCKED PIKACHU FACE... \n\nThis is not surprising unless you are a USA conservative who watches FAUX news.\n\n\nFull stop.",
            "title_similarity": "0.65609497"
        },
        {
            "id": "i47kfcc",
            "score": -3,
            "text": "NATO isn’t a country so how does it have a border?",
            "title_similarity": "0.35227317"
        },
        {
            "id": "i48ct3b",
            "score": -2,
            "text": "Complete bs\n\nPeople are down voting but they sayd 40k to defend the entire border? We need to spend more\n\n\nThe russian border with Europe is huge",
            "title_similarity": "0.6016787"
        },
        {
            "id": "i48p9xw",
            "score": 1,
            "text": "A nuclear arsenal on standby is a deterrent. Committing a full scale military force is so incredibly expensive that it's not a deterrent, it's an act of war. Any escalation will be bad for everyone. An entire military being mobilized is not a step in the right direction.",
            "title_similarity": "0.5070938"
        },
        {
            "id": "i48q6rn",
            "score": 1,
            "text": "Well looks like American soldiers will be bringing home all kinds of border wife’s.",
            "title_similarity": "0.5694469"
        },
        {
            "id": "i472891",
            "score": -10,
            "text": "After seeing what the US and some NATO members did to Iraq and Afghanistan, I don't blame Putin for not wanting Ukraine to be part of NATO.",
            "title_similarity": "0.60267884"
        },
        {
            "id": "i46cgkx",
            "score": -6,
            "text": "That sounds like a massive waste of money.  Putin is not insane enough to invade a NATO country.  Gotta love how the American progressive is now full of pro-military buildup war mongers as long as you show them a cartoon bad guy to hate.",
            "title_similarity": "0.5512669"
        },
        {
            "id": "i4749jc",
            "score": -5,
            "text": "NATO really wants to start WWIII.",
            "title_similarity": "0.5826082"
        },
        {
            "id": "i47h5jt",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i46btyi",
            "score": 4,
            "text": "Well this isn’t going to turn out well",
            "title_similarity": "0.0022639055"
        },
        {
            "id": "i46xxdb",
            "score": 3,
            "text": "NATO invokes article 69.420 which states any country who shall have been determined to have fucked around will then be required to find out",
            "title_similarity": "0.5623693"
        },
        {
            "id": "i47by3c",
            "score": -3,
            "text": "Don't forget that this only benefits Russian and American oligarchs, they want so bad to go to war so  Putin can tighten his hold and american stocks go up. This is not a win for anyone. It's the public failure of politicians as diplomats. May God help us all if this leads to more conflict",
            "title_similarity": "0.5828546"
        },
        {
            "id": "i47fget",
            "score": 3,
            "text": "How awful. This fight between NATO expansion and Russia has used the Ukrainians in-between as disposable pawns.",
            "title_similarity": "0.49997184"
        },
        {
            "id": "i47hr04",
            "score": -3,
            "text": "That sounds expensive.\nWhat's the point, we see their army is shit.",
            "title_similarity": "0.21568081"
        },
        {
            "id": "i48cs2l",
            "score": 3,
            "text": "That's awesome! I was worried they were going to waste my taxes on crap like health care for all and relieving student debt. Glad to know I'll be able to support the military industrial complex more instead. Thank you Jesus.",
            "title_similarity": "0.508806"
        },
        {
            "id": "i49eaqg",
            "score": -3,
            "text": "This is exactly what the west and American want; to overwhelm Russia with perpetual conflicts and weaken itself. Putin, In my estimation, is already aware of it, therefore, kept the Ukraine conflict to a limited military operation, reserving its full-fledged war potential for such provocative maneuverings by the West.\n\nRead/listen. Dwindling Rascality! Food for Thought. Shakir Mumtaz - YouTube",
            "title_similarity": "0.71251506"
        },
        {
            "id": "i46ib10",
            "score": 8,
            "text": "I’m wondering what Reddit comments would look like if redditors believed that they themselves would have to fight in any of the potential conflicts being discussed.",
            "title_similarity": "0.4573592"
        },
        {
            "id": "i464hgv",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.023929574"
        },
        {
            "id": "i465caj",
            "score": -4,
            "text": "Now, odds ~~ukraine~~ russia lobs a missile into nato hands and we start the party before it gets late?",
            "title_similarity": "0.71100116"
        },
        {
            "id": "i466j38",
            "score": 4,
            "text": "This will be seen as further escalation by the Russian government. This is eerily similar foreign policy from the great powers as what happened in the prelude to world war 1.",
            "title_similarity": "0.7176623"
        },
        {
            "id": "i46ap4a",
            "score": -6,
            "text": "This is unfortunate... that it's necessary",
            "title_similarity": "0.037739486"
        },
        {
            "id": "i46c42r",
            "score": 0,
            "text": "This seems like a bad omen.",
            "title_similarity": "0.001001474"
        },
        {
            "id": "i46cn67",
            "score": 0,
            "text": "This is reading just like an election year is coming up... what absolute bullshit, the entire western world is about to be dragged into an unneeded war.   What a terrible time line",
            "title_similarity": "0.5314789"
        },
        {
            "id": "i46cnl4",
            "score": 0,
            "text": "Fuck",
            "title_similarity": "-0.0014825701"
        },
        {
            "id": "i46e84r",
            "score": 0,
            "text": "I like this. Big move",
            "title_similarity": "0.12461453"
        },
        {
            "id": "i46fwye",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i46j8dp",
            "score": 0,
            "text": "Daggers go boom boom",
            "title_similarity": "0.19914445"
        },
        {
            "id": "i46lofg",
            "score": 0,
            "text": "Why would they announce this now, it's only going to make Putin want to increase the amount of land he ends up with, prolonging the war...",
            "title_similarity": "0.67297864"
        },
        {
            "id": "i46nas0",
            "score": 0,
            "text": "We're back in the USSR. You don't know how lucky you are... conscripts. Back in the USSR.\n\n(Ukraine girls really knock me out, they shoot me from behind, la la la)",
            "title_similarity": "0.4703596"
        },
        {
            "id": "i46nen3",
            "score": 0,
            "text": "Well that’s a waste of money. Should fix the problem and spend the money on the citizens. Not the defense contractors",
            "title_similarity": "0.29230326"
        },
        {
            "id": "i46oldp",
            "score": 0,
            "text": "Someone who knows what their talking about tell me this. How close are we realistically to WW3 given the current circumstances? It’s been the greatest fear on my mind since this whole conflict started. Maybe I’m thinking too much but idk. I’d just hate for the world the end and I’m only 23 lol I at least wanna live a full life before it all goes to shit, even if we’re the last generation (even tho I feel like our sons and daughter would be).",
            "title_similarity": "0.5315267"
        },
        {
            "id": "i46r3e9",
            "score": 0,
            "text": "Putin is going to interpret this as a threat and it will launch WWIII",
            "title_similarity": "0.6448767"
        },
        {
            "id": "i46rf0p",
            "score": 0,
            "text": "Full time war machine. \n\nPutin putting on his big boy pants now.",
            "title_similarity": "0.5394815"
        },
        {
            "id": "i46sg81",
            "score": 0,
            "text": "NATO doesn't have any borders, it's member states do. This title is being purposefully misleading.",
            "title_similarity": "0.33026236"
        },
        {
            "id": "i46uefu",
            "score": 0,
            "text": "Let's go baby, manmade horrors beyond my comprehension are materializing!",
            "title_similarity": "0.35110438"
        },
        {
            "id": "i46w3t2",
            "score": 0,
            "text": "Whatever helps stops Russia from using nuclear weapons",
            "title_similarity": "0.6123113"
        },
        {
            "id": "i46wji4",
            "score": -5,
            "text": "China is the main problem",
            "title_similarity": "0.28461683"
        },
        {
            "id": "i46xux8",
            "score": 0,
            "text": "Good to hear, putin has a bigger plan",
            "title_similarity": "0.4430117"
        },
        {
            "id": "i472rqn",
            "score": 0,
            "text": "NATO is a country now? Terrible title.",
            "title_similarity": "0.3723454"
        },
        {
            "id": "i4734oj",
            "score": 0,
            "text": "But... Ukraine's not part of NATO...",
            "title_similarity": "0.23226812"
        },
        {
            "id": "i4748wd",
            "score": 0,
            "text": "Location: Crimea",
            "title_similarity": "0.1838978"
        },
        {
            "id": "i4749u0",
            "score": 0,
            "text": "Didn't they already do that before?",
            "title_similarity": "0.09818634"
        },
        {
            "id": "i476199",
            "score": 0,
            "text": "Where have I heard this before…hmmmm",
            "title_similarity": "0.06092217"
        },
        {
            "id": "i476t1s",
            "score": 0,
            "text": "Just build a wall!",
            "title_similarity": "0.31020135"
        },
        {
            "id": "i476vxt",
            "score": 0,
            "text": "What border",
            "title_similarity": "0.087183595"
        },
        {
            "id": "i477ivq",
            "score": 0,
            "text": "We have to be like Russia and say we’re doing military drills at the borders. And then bam sneak attack. 😂",
            "title_similarity": "0.83255804"
        },
        {
            "id": "i477lli",
            "score": 0,
            "text": "Should’ve been done in the first place, right away. would’ve stopped everything.",
            "title_similarity": "0.36873898"
        },
        {
            "id": "i477nnq",
            "score": 0,
            "text": "How about stopping this one?",
            "title_similarity": "0.14219964"
        },
        {
            "id": "i478zzb",
            "score": 0,
            "text": "So… Belarus is next Ukraine? Seems like Eastern Russian border is falling",
            "title_similarity": "0.44901037"
        },
        {
            "id": "i479j36",
            "score": 0,
            "text": "So why? This has been kept in nations outside of NATO",
            "title_similarity": "0.22846283"
        },
        {
            "id": "i479kfq",
            "score": 0,
            "text": "What could go wrong??",
            "title_similarity": "0.03192165"
        },
        {
            "id": "i479s6i",
            "score": 0,
            "text": "Have these guys started to use the term World War yet ?",
            "title_similarity": "0.42795485"
        },
        {
            "id": "i47a3pt",
            "score": 0,
            "text": "As they should",
            "title_similarity": "0.018819047"
        },
        {
            "id": "i47agzh",
            "score": 0,
            "text": "That's exactly the pretext Russia used to invade Ukraine. Let's see how this one plays out.",
            "title_similarity": "0.7203939"
        },
        {
            "id": "i47buwr",
            "score": 0,
            "text": "oops...just exactly what putin didn't want to happen and has been bitching about for years. can things get any worse for him with all of this?",
            "title_similarity": "0.38980424"
        },
        {
            "id": "i47g4sn",
            "score": 0,
            "text": "Room Temperature War",
            "title_similarity": "0.2907936"
        },
        {
            "id": "i47g7ph",
            "score": 0,
            "text": "Future invasions, like after this one. Just to be clear not this one.",
            "title_similarity": "0.37301093"
        },
        {
            "id": "i47gtdp",
            "score": 0,
            "text": "Just send TROOPS",
            "title_similarity": "0.286986"
        },
        {
            "id": "i47hszh",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i47japt",
            "score": 0,
            "text": "NATO has a border?",
            "title_similarity": "0.45705095"
        },
        {
            "id": "i47k0kg",
            "score": 0,
            "text": "At this rate just bomb America and Russia already",
            "title_similarity": "0.60708493"
        },
        {
            "id": "i47lu32",
            "score": 0,
            "text": "LOOOOOOLLL warmongers got their wishes",
            "title_similarity": "0.13284919"
        },
        {
            "id": "i47luqs",
            "score": 0,
            "text": "imperialist in shadow of democrazy",
            "title_similarity": "0.26046428"
        },
        {
            "id": "i47mzvl",
            "score": 0,
            "text": "NATO needs to get involved!",
            "title_similarity": "0.47727454"
        },
        {
            "id": "i47n1am",
            "score": 0,
            "text": "What a great idea! Hopefully, this will help prevent a NATO country from being invaded... Twice.",
            "title_similarity": "0.6357209"
        },
        {
            "id": "i47o3yu",
            "score": 0,
            "text": "Not as if nato isn’t policing the world and putting troops where ever they see fit already.",
            "title_similarity": "0.6354153"
        },
        {
            "id": "i47sroi",
            "score": 0,
            "text": "Ahhh shiet",
            "title_similarity": "-0.06322802"
        },
        {
            "id": "i47svze",
            "score": 0,
            "text": "Better late than never?",
            "title_similarity": "0.07349989"
        },
        {
            "id": "i47t6bz",
            "score": 0,
            "text": "Putin is skating on thin ice. Makes me wet.",
            "title_similarity": "0.30602866"
        },
        {
            "id": "i47t8g5",
            "score": 0,
            "text": "*Tanc a Lelek plays in the background*",
            "title_similarity": "0.12608942"
        },
        {
            "id": "i47tkw1",
            "score": 0,
            "text": "I say, NATO should push to take Crimia back and give it back to Ukrain",
            "title_similarity": "0.62069756"
        },
        {
            "id": "i47u5pf",
            "score": 0,
            "text": "You dont move your forces to a border if your not getting ready to push a fullscale war",
            "title_similarity": "0.4450269"
        },
        {
            "id": "i47ukky",
            "score": 0,
            "text": "And so the Cold War has officially begun",
            "title_similarity": "0.57643497"
        },
        {
            "id": "i47usj4",
            "score": 0,
            "text": "Well I guess it’s really going from bad to worse for Vlad with Finland due to formally discuss membership at the next NATO meeting.",
            "title_similarity": "0.5540532"
        },
        {
            "id": "i47vhjy",
            "score": 0,
            "text": "...yay",
            "title_similarity": "-0.04651492"
        },
        {
            "id": "i47w1ew",
            "score": 0,
            "text": "Okay but what are we gonna do about Moldova? Cause remember when Lukashitko did that whole map presentation thing? They had plans on putting their hands in Moldova's sphagetti too.",
            "title_similarity": "0.5787449"
        },
        {
            "id": "i47w4s7",
            "score": 0,
            "text": "Does that include Alaska?",
            "title_similarity": "0.25563058"
        },
        {
            "id": "i47xsxf",
            "score": 0,
            "text": "Just build a wall out of stacked destroyed Russian tanks and armored vehicles.",
            "title_similarity": "0.5468118"
        },
        {
            "id": "i47yd33",
            "score": 0,
            "text": "Everybody wants to rule the world",
            "title_similarity": "0.47989964"
        },
        {
            "id": "i47zj7p",
            "score": 0,
            "text": "He will be like: oh you're closing in? I attack",
            "title_similarity": "0.41532195"
        },
        {
            "id": "i4807a7",
            "score": 0,
            "text": "As a Pole, all I can say is [this](https://youtu.be/GxgoOMaEowU)",
            "title_similarity": "0.22033918"
        },
        {
            "id": "i480l7s",
            "score": 0,
            "text": "Berlin wall pt2 baybaaay",
            "title_similarity": "0.28817916"
        },
        {
            "id": "i481f55",
            "score": 0,
            "text": "Why what’s the purpose of nato if Russia has such a weak military?",
            "title_similarity": "0.4955163"
        },
        {
            "id": "i481gld",
            "score": 0,
            "text": "Does this include the 🇺🇦?",
            "title_similarity": "0.04199359"
        },
        {
            "id": "i482urf",
            "score": 0,
            "text": "Done ✅",
            "title_similarity": "-0.040590625"
        },
        {
            "id": "i482xl5",
            "score": 0,
            "text": "Yay!!!",
            "title_similarity": "-0.008343492"
        },
        {
            "id": "i48304y",
            "score": 0,
            "text": "So did they stop sending troops?",
            "title_similarity": "0.24200532"
        },
        {
            "id": "i483bbg",
            "score": 0,
            "text": "Who is paying for this adventure 😁",
            "title_similarity": "0.08922248"
        },
        {
            "id": "i483blg",
            "score": 0,
            "text": "🎶I don’t want to set the world… on … fire🎶",
            "title_similarity": "0.216903"
        },
        {
            "id": "i483pna",
            "score": 0,
            "text": "Great headline. Where exactly is NATO’s border again??",
            "title_similarity": "0.5614686"
        },
        {
            "id": "i483x7b",
            "score": 0,
            "text": "I wonder what will happen in the future.",
            "title_similarity": "0.14835246"
        },
        {
            "id": "i484n16",
            "score": 0,
            "text": "President Putin is a murderous psychopath.\n\nWestern Europe is waking up to this realization after the invasion of Ukraine has cost the lives of at least 7,000 Russian soldiers with no end in sight for this war.\n\nIn fact, an eight mile long convoy is already making its way into Ukraine sans air cover, ripe for multiple ambushes.\n\nThere is no doubt President Putin has plans for future invasions of non-NATO countries post-Ukraine.\n\nAnd NATO realizes this.",
            "title_similarity": "0.6359837"
        },
        {
            "id": "i4855y8",
            "score": 0,
            "text": "Might delay my trip to Europe for a year",
            "title_similarity": "0.34570977"
        },
        {
            "id": "i486b7l",
            "score": 0,
            "text": "What does this mean? Impending world war still?",
            "title_similarity": "0.48725992"
        },
        {
            "id": "i4877d3",
            "score": 0,
            "text": "And to think Russia could've been part of NATO of they continued being in the Partnership for Peace",
            "title_similarity": "0.6131513"
        },
        {
            "id": "i487cxp",
            "score": 0,
            "text": "Ireland, Sweden, Finland and Switzerland should join NATO.",
            "title_similarity": "0.6130593"
        },
        {
            "id": "i487gvh",
            "score": 0,
            "text": "There seems to be the same odd disconnect of the upcoming climate catastrophe and the World on the brink of Nuclear Armageddon. It seems that many are not entirely grasping what the consequences will be for them and their friends and family. Namely for the lucky, instant incineration. For the unlucky, the horrific death of dying from burns, injuries, and radiation poisoning… These are the stakes people, that and the destruction of everything else on this planet..We probably deserve our fate, they don’t!",
            "title_similarity": "0.48609152"
        },
        {
            "id": "i487yg0",
            "score": 0,
            "text": "yo its finally happening everyone\n\n###HEY YOU STALKING MY COMMENT HISTORY CHECK THIS SHIT OUT",
            "title_similarity": "0.37591988"
        },
        {
            "id": "i488ycz",
            "score": 0,
            "text": "I thought the cold war was over bruvs",
            "title_similarity": "0.5122229"
        },
        {
            "id": "i4897zf",
            "score": 0,
            "text": " I feel like this is gonna set him off even worse now. Shoulda waited to announce this for Ukraines sake lol.",
            "title_similarity": "0.44310737"
        },
        {
            "id": "i489g0r",
            "score": -4,
            "text": "Libs out to condemn warfare, except all modern ones which they support.",
            "title_similarity": "0.50180095"
        },
        {
            "id": "i489wy5",
            "score": 0,
            "text": "Uh how bout yes",
            "title_similarity": "-0.035004944"
        },
        {
            "id": "i48awho",
            "score": 0,
            "text": "You want NATO on your border? Because that’s how you get NATO on your border. \n\n   -Sterling Archer",
            "title_similarity": "0.67592704"
        },
        {
            "id": "i48b67l",
            "score": 0,
            "text": "Putin was sick of having proxy wars on the borders of its proxy states (I e. Uzbekistan, Kyrgyzstan etc). He rolled the dice and forced NATO's hand to spend it's (greedy) military budget closer to its own borders. \nThe aggression in the middle East has been glossed over by the western public. Long forgotten and easily dismissed as general terrorism. And a necessary evil. The reality of Christian blue eyed and light complexion will be a good eye opener to the western world. \nWar is wrong, no matter where it is. No matter what the colour of your skin. Humanities lust for natural resources and an inability to share and battle corruption has lamed our ability for productive collective action. Each week that goes by the world gets closer to environmental doom. Please head the message of science and end the terror so we can work together to save our planet.",
            "title_similarity": "0.54104054"
        },
        {
            "id": "i48bpoz",
            "score": 0,
            "text": "By the time this war ends Russia won't have any Army to speak of. It also shows the bs nature of the pretext of his invasion. He knows for a fact NATO will never attack first.",
            "title_similarity": "0.67311144"
        },
        {
            "id": "i48dlz9",
            "score": 0,
            "text": "Someone's about to get really pissed.",
            "title_similarity": "0.13590151"
        },
        {
            "id": "i48n5vz",
            "score": 0,
            "text": "And the military industrial complex all nutted with delight.\n\nWhile I'm not saying it might not be a necessary move right now, I worry about us normalizing all these standing armies and further enshrining the war machine into our societies.\n\nIt's definitely been a big part of the US' own implosion in on itself.",
            "title_similarity": "0.62245953"
        },
        {
            "id": "i48s02a",
            "score": 3,
            "text": "Keep that military industrial hummin’",
            "title_similarity": "0.33161238"
        },
        {
            "id": "i490w6w",
            "score": 0,
            "text": "Ueaand watch Putin threaten to use nukes… wait didn't he say that over 9000 times and still not one nuke was fired.",
            "title_similarity": "0.45694822"
        },
        {
            "id": "i492fr0",
            "score": 0,
            "text": "The next Kuwait",
            "title_similarity": "0.06874695"
        },
        {
            "id": "i493of7",
            "score": 0,
            "text": "so that in 10 years taxpayers will ask why the hell we even need them /s",
            "title_similarity": "0.32606393"
        },
        {
            "id": "i49b5cq",
            "score": 0,
            "text": "Really? That sounds great, so can we have Ukraine join and have NATO deploy there now?",
            "title_similarity": "0.6620954"
        },
        {
            "id": "i49fjh3",
            "score": 0,
            "text": "*Begun, the Heartlands War has.*",
            "title_similarity": "0.3797431"
        },
        {
            "id": "i49n5x5",
            "score": 0,
            "text": "That should cause things to get interesting. Good thing I have 7.62 rifles and have deep shelter.",
            "title_similarity": "0.34146494"
        },
        {
            "id": "i49nm1e",
            "score": 0,
            "text": "The Bear has awoken the sleeping giant",
            "title_similarity": "0.29274547"
        },
        {
            "id": "i469qmz",
            "score": -10,
            "text": "Ok then, welcome everyone to the third world war. Fucking hell this is gonna be bloody\n\nEDIT : I think people are downvoting me because they must think I'm pro-russia or something. I am not. I am anti-war. But what y'all don't understand in all of this is that if a full on war starts between NATO and the other side, then it's over. If China wasn't helping Russia they now will. This war will be extremely devastating, worst for humanity than WW2, y'all are gonna be drafted once the troops of the first world nations, then the troops of the third world nations start depleting. What y'all seem to forget is that there is no honor nor glory in fighting or dying for a government. You are standing proud defending a small group of people who sit in their ivory towers telling you why you really really have to fight for them. Y'all, this war in Ukraine is like the one in Georgia, it's like the one in Syria, it's like any other stupid fucking war. It's financed invasion VS a country that's essentially a hired mercenary. And the time to pay will come someday. There is only loss in war, stop glorifying the fight! There is no honor, no nobility, no glory in war. There is only barbarism and suffering.",
            "title_similarity": "0.6609236"
        },
        {
            "id": "i46giuj",
            "score": -10,
            "text": "Sounds like antagonism. Isn't everything Putin is spouting off about saying the west is coming to get him? Idiots",
            "title_similarity": "0.4731893"
        },
        {
            "id": "i47127z",
            "score": -8,
            "text": "It's really amazing how people comment here as if they haven't been listening to war propaganda for the last month. All the things people think about Russia, it's military and it's state-tv propaganda can be applied to every other country. Russia is the new Iraq, the new Afghanistan, the next Syria... your pick.   \n\n\n**All the wars we were pulled into by people like yourselves, only to have people like yourselves slag off the same military industrial complex you've unleashed on the planet.**   \n\n\nI was wondering what would occupy your head spaces after COVID, turns out it's the **re-ignition of the cold war with Russia.** Lovely. How about stop watching one-sided TV? Stop watching all state television. Stop watching ALL broadcasts that are influenced by your countries secret services. This goes for Russians as well as Americans, and everyone in-between.",
            "title_similarity": "0.6789205"
        },
        {
            "id": "i4676uy",
            "score": 10,
            "text": "A lot of people still think we are dealing with a rational actor ( Putin) \n\nHe is a despotic mass murderer on nearly every continent! \n\nThis story only has two endings:\n1. A civil conflict within Russia takes him out \n2. NATO and international allies take him out \n\nCurrently Russian forces are building up in the east for the biggest offensive since WWII battles. Ukraine is building up it's own forces and we are going to see an apocalyptic level of violence. If Ukraine wins Putin will nuke them. If they lose he will split the nation in two and nuke us later \n\nNATO needs to mobilize more and get everything ready for total war in the coming months or years",
            "title_similarity": "0.6689489"
        },
        {
            "id": "i469oia",
            "score": 39,
            "text": "Why was the cold war so much cooler in movies? This sucks.",
            "title_similarity": "0.32393557"
        },
        {
            "id": "i46jmb9",
            "score": -6,
            "text": "hey maybe escalations that could easily lead us to global nuclear war is bad actually",
            "title_similarity": "0.4937175"
        },
        {
            "id": "i46pw71",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i47x34m",
            "score": -6,
            "text": "Russia will attack Poland and NATO won't do a thing.",
            "title_similarity": "0.5883734"
        },
        {
            "id": "i4809fh",
            "score": -5,
            "text": "Fuck NATO",
            "title_similarity": "0.29341567"
        },
        {
            "id": "i48dyq2",
            "score": -6,
            "text": "And Zelensky is talking about Russia ‘threatening’ to invade other European countries, and I see ‘Russian historians’ and other experts peddling outright lies on American TV (not that anyone watches MSNBC). I say lies because they know better. I don’t see Russia attacking Finland even without NATO membership, but there is no way in hell Russia would or ever would go that far. Yes Putin would LIKE to reclaim his ‘orphans’, but he knows he can’t.\n\nRemember Americans, this war shouldn’t concern you. We did help antagonize Russia into a situation where they were willing to do this, but ultimately the US wanted to use Ukraine as a peaceful wedge against Putin, and force his to compromise for partial control of Donbas and Crimea, while forcing him to concede influence in the pro-EU West. The Minsk agreement was pretty much that, but even for an American puppet, he’s been overzealous and manipulative towards his Western allies, and his ‘everything I want, nothing Russia wants’ approach to effectively guarantee war while building up his military in the East (well before Putin started his buildup) is what led to war. I mean this took EIGHT YEARS, Putin was willing to settle with very strong control over Donbas, as well as reaching for Crimea, which is both the most pro-Russian areas and the regions of greatest importance to Russia. I will tell you, that all but those most cowardly leaders would have done the same. The Black Sea has always been mostly under Russian access or control, and they have CONSISTENTLY over HUNDREDS OF YEARS shown they will do whatever it takes to take, maintain, or retake access to the Black Sea. It’s a fucking borderline meme about Russia, and existed WELL before the modern incarnation of these events starting in 2014.\n\nNow, before you make the same stupid rubble comment, did anything I say was was pro-Russia. No, I don’t like Putin and would prefer a United post-Cold War Europe. At one point, when Russia was in shambles and their government was weak, there was a period of weakening Russian influence, and I believe a clear goal to bring the former superpower into the fold of their former enemies to escape their rags. Then Putin did what was likely a false flag terrorist attack, blamed it on Chechnya (pretty easy, since it was the kind of things they would do) then invaded them and now Chechnya is an oddly uber-loyal Russian vassal. After that, Putin organized the chaos and purged the dissidents and vultures who wouldn’t bend the knee, and became wildly popular as a strongman who was bringing peace, prosperity, and glory back to the disgraced Russia. Russia still sucks, especially with the sanctions, but its A LOT better than the 90s. If there was a super pro-Russia president, it wasn’t Trump, but Bush. Once the 2010s came, we went back to the same policies of the 90s, trying to coerce Russia with the stick and carrot, and why we did that when we knew it wasn’t possible is beyond me.\n\nRemember, ALL WARS are not fought for their people, but instead the people are the pawns of their leaders and the wealthy. Afghanistan, Iraq, Vietnam, the Gulf War, all for the rich and powerful, at the expense of OUR money, OUR sons, and that is only a FRACTION of what the countries we ‘liberated’ lost. The Pentagon Papers exposed this, it should be common knowledge, but it’s not. The average Russian might not give a shit about the Black Sea, and support this war based on lies, but it is the same for them. The Ukrainians to are fighting for the pro-EU oligarchs and Western interests as well, whether they know it or not. When the leaders have nothing to lose and everything to gain, if they can sit in their bunkers and always flee to the EU or America, along with billions given to them to finance this war, why wouldn’t they? That is what this is about.",
            "title_similarity": "0.6660481"
        },
        {
            "id": "i48fo1y",
            "score": 5,
            "text": ".",
            "title_similarity": "-0.0964511"
        },
        {
            "id": "i48frb1",
            "score": 5,
            "text": ".",
            "title_similarity": "-0.0964511"
        },
        {
            "id": "i48ftp7",
            "score": 5,
            "text": ".",
            "title_similarity": "-0.0964511"
        },
        {
            "id": "i48m3ix",
            "score": -6,
            "text": "Nato need to be dismantle they want war nato is us4less and run by neo nazy globaliat",
            "title_similarity": "0.6406138"
        },
        {
            "id": "i49joza",
            "score": -5,
            "text": "These fucks have been doing this years. Whats new about it.\nNato fucks have agressivly building shit in baltic. No shit russia is pissed off.\n\nI know whats been happening my country for years...",
            "title_similarity": "0.618839"
        },
        {
            "id": "i46dnj7",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i466sl1",
            "score": 6,
            "text": "Time to load up on Lockheed Martin and Boeing stonk",
            "title_similarity": "0.4566878"
        },
        {
            "id": "i46kcus",
            "score": -5,
            "text": "Or let’s just disband NATO and do the planet a favor",
            "title_similarity": "0.43396723"
        },
        {
            "id": "i47k7t6",
            "score": -6,
            "text": "Russia, please nuke us all because society is already horrible enough with these unconstitutional mask and vax mandates, the fact that we have to respect someones GOD DAMN pronouns or have our public reputation in society tarnished equivalent to a slave back in the 1800s, the fact that you also have to respect someones GOD DAMN sexuality or you will also be degraded by society, and also the fact that if you are apparently right-wing according to the Leftists, you are apparently a second class citizen equivalent to that of a Caste System.",
            "title_similarity": "0.45943046"
        },
        {
            "id": "i491538",
            "score": -7,
            "text": "Nato, wich was formed as an antagonist to the soviet union, will break its promise, yet again, to Russia and put military bases on Russias boarder...\nSome oligarchs are just pushing for WW3.",
            "title_similarity": "0.7751262"
        },
        {
            "id": "i49tw7e",
            "score": -6,
            "text": "NATO and the US the cause of all evil",
            "title_similarity": "0.4876052"
        },
        {
            "id": "i49v1qe",
            "score": -5,
            "text": "Nice, nato doing the exact same thing that started this war. NATO sucks.",
            "title_similarity": "0.55332935"
        },
        {
            "id": "i4a2e76",
            "score": -6,
            "text": "NATO escalating as usual",
            "title_similarity": "0.36549646"
        },
        {
            "id": "i4675jp",
            "score": 1,
            "text": "Putin will love this.",
            "title_similarity": "0.30821198"
        },
        {
            "id": "i46bfsx",
            "score": 1,
            "text": "I don't think this is a good idea at all, Russia is 0.0 a conventional threat to NATO already, this just raises tensions and the possibility of nuclear escalation.",
            "title_similarity": "0.53341484"
        },
        {
            "id": "i46cvdo",
            "score": -1,
            "text": "As it should",
            "title_similarity": "-0.0062607084"
        },
        {
            "id": "i46d9uw",
            "score": 1,
            "text": "“Mr. Putin, Put. Up. That. Wall!”",
            "title_similarity": "0.48259968"
        },
        {
            "id": "i46dvsi",
            "score": 1,
            "text": "Okay but the problem was that Ukraine didn’t fill out the gym membership application until it was too late. So that doesn’t solve todays problem.",
            "title_similarity": "0.3913921"
        },
        {
            "id": "i46g4kd",
            "score": 1,
            "text": "Spy movies go brrrrr. 😂",
            "title_similarity": "0.26739416"
        },
        {
            "id": "i46i6dk",
            "score": -1,
            "text": "European NATO countries don’t have the personal to do that on a constant bases. Stop dreaming.",
            "title_similarity": "0.4089996"
        },
        {
            "id": "i46ih0d",
            "score": -1,
            "text": "The fate of the Scandinavian countries is now sealed. By hook, crook, or bullet they will never be allowed to join NATO.",
            "title_similarity": "0.49440286"
        },
        {
            "id": "i46io2g",
            "score": 1,
            "text": "Firstly There are 300.000 troops as of today in the eastern europe border members of NATO , not to mention a part of the US and UK navy in the meditaranean sea \nthere were already permanent basese in eastern europe just not as manny  as there will be \nSecondly NATO troops were faceing USSR troops since the whole Cold war (not directly but just face to face ) nothing here is different maybe the NATO border \nThis is just the cold war 2 , ww3 is still out of the question because both sides know how it will end . Bolstering defenses is nothing new \nThis is just cold war part 2 nothing more",
            "title_similarity": "0.63648653"
        },
        {
            "id": "i46j502",
            "score": 1,
            "text": "Military industrial complex goes brrrr",
            "title_similarity": "0.40820396"
        },
        {
            "id": "i46ji2k",
            "score": 1,
            "text": "Ok so Russia’s gonna send nukes then now, right?",
            "title_similarity": "0.6784972"
        },
        {
            "id": "i46jo1z",
            "score": 1,
            "text": ">NATO will deploy a permanent full-scale military force on its border with Russia\n\nIsn’t this what NATO has always done? I mean the bases and missiles in Turkey was the major event that lead to the Cuban missile crisis (but also its resolution, by withdrawing them).\n\nIf we also include Warsaw Pact (whose whole existence was as a countermeasure to NATO), NATO had full scale permanent forces across the border of pretty much all Warsaw Pact countries: in West Germany, Denmark, Greece, Turkey.",
            "title_similarity": "0.79837394"
        },
        {
            "id": "i46mo2m",
            "score": 1,
            "text": "Love the idea of security, hate the escalation in tension.  This may not end well.",
            "title_similarity": "0.27001837"
        },
        {
            "id": "i46mtsl",
            "score": -1,
            "text": "Who pays for this protection?",
            "title_similarity": "0.1639884"
        },
        {
            "id": "i46n0q6",
            "score": 1,
            "text": "Cool, gotta support the Industrial Military Complex",
            "title_similarity": "0.48056585"
        },
        {
            "id": "i46n0tt",
            "score": 1,
            "text": "LETS FKN GO!!!! Current thing time!",
            "title_similarity": "0.27010024"
        },
        {
            "id": "i46n3sq",
            "score": 1,
            "text": "This sounds both expensive and dangerous.",
            "title_similarity": "0.09899843"
        },
        {
            "id": "i46nait",
            "score": -1,
            "text": "Hope everyone is ready for WWIII!",
            "title_similarity": "0.42736435"
        },
        {
            "id": "i46nb7i",
            "score": 1,
            "text": "Lol great job vlad you played yourself",
            "title_similarity": "0.25625703"
        },
        {
            "id": "i46nou9",
            "score": 1,
            "text": "Do people still think Russia is a big threat to NATO?  They’re getting their butts kicked in Ukraine and getting pushed back from Kiev.  Also their economy is toast from these sanctions.  They’re on the way out at this point. The events of the last few months really shows they are not a super power like they’ve always been portrayed.  They can’t sustain this aggression with the West for very long with all of these sanctions.",
            "title_similarity": "0.5945184"
        },
        {
            "id": "i46nt7w",
            "score": -1,
            "text": "Sheer wasteful stupidity.\n\nNATO has nukes. Russia is not suicidal. Even if they are, a border army won't change the outcome of a nuclear war. \n\nThis is a boon to military contractors and literally nothing else.",
            "title_similarity": "0.594845"
        },
        {
            "id": "i46pbvb",
            "score": 1,
            "text": "French president: \"nato ded\"\n\nRussian ~~president~~ dictator: \"hold my vodka manu\"\n\nFrench president: \"non\"\n\n\\*Putin single handedly resurrects Nato while holding his vodka\\*",
            "title_similarity": "0.54065955"
        },
        {
            "id": "i46pknr",
            "score": 1,
            "text": "Putin doesn't want to invade NATO, he wants to take Ukraine to secure his route to supply oil/gas to the west, and to secure the gas off the shore in Crimea, and the water supply to Crimea that's currently coming from Ukraine.  This also pushes Russian frontline to an easier to defend area, NATO doesn't need to fortify, they need to PUSH and hold Ukraine",
            "title_similarity": "0.6405489"
        },
        {
            "id": "i46qfdw",
            "score": -1,
            "text": "We really need to surround the whole country and create an iron dome to protect us from them.",
            "title_similarity": "0.6809533"
        },
        {
            "id": "i46rujx",
            "score": 1,
            "text": "Kill Putin.",
            "title_similarity": "0.3596399"
        },
        {
            "id": "i46ss8l",
            "score": 1,
            "text": "Remember when Putin convinced Trump that that the US should withdraw from NATO and he almost did?",
            "title_similarity": "0.64338243"
        },
        {
            "id": "i46tqek",
            "score": -1,
            "text": "NATO wants more cannon fodder btw Europe and Moscow….",
            "title_similarity": "0.65566194"
        },
        {
            "id": "i46tz84",
            "score": 1,
            "text": "I don't see how that makes a whole lot of sense now. We witnessed russia's military prowess in ukraine; they can't even sustain an advance directly beyond russia's border. That 80km logistic traffic jam to Kiev being the height of their incompetence.\n\nThere's no need for a border force. All the cold war calculus that there would be a war of attrition in Europe to halt the russian advance is now proven BS. They'll grind to a standstill on their own after a 100km.",
            "title_similarity": "0.62917376"
        },
        {
            "id": "i46uikh",
            "score": 1,
            "text": "I’m sure this will de-escalate the situation.",
            "title_similarity": "0.32628787"
        },
        {
            "id": "i46vvzf",
            "score": 1,
            "text": "It would be nice if Putin just decided to chew on one of those cyanide capsules he has tucked away in a fake molar. Do it!",
            "title_similarity": "0.38903502"
        },
        {
            "id": "i46wbdv",
            "score": 1,
            "text": "LMAO Putin's so fucking stupid.",
            "title_similarity": "0.23702092"
        },
        {
            "id": "i46wepg",
            "score": 1,
            "text": "Paid for by the US",
            "title_similarity": "0.15550509"
        },
        {
            "id": "i46wtck",
            "score": 1,
            "text": "How long until Putin drops those \"tactical\" nukes?",
            "title_similarity": "0.45014703"
        },
        {
            "id": "i46x33a",
            "score": 1,
            "text": "I hate it",
            "title_similarity": "0.021184128"
        },
        {
            "id": "i46yyat",
            "score": 1,
            "text": "Oceania had always been at war with Eastasia.",
            "title_similarity": "0.38235193"
        },
        {
            "id": "i472073",
            "score": -1,
            "text": "So does that include the Arctic in Canada?",
            "title_similarity": "0.38654694"
        },
        {
            "id": "i472ovo",
            "score": 1,
            "text": "Great, more chest pounding, just what we need. *eyeroll*",
            "title_similarity": "0.29975325"
        },
        {
            "id": "i474it3",
            "score": 1,
            "text": "Haha \n\nFuck",
            "title_similarity": "-0.035746716"
        },
        {
            "id": "i475qer",
            "score": 1,
            "text": "Just imagine if russia where to to do that in mexico or canada.",
            "title_similarity": "0.5063542"
        },
        {
            "id": "i475zsa",
            "score": 1,
            "text": "Here comes WWIII",
            "title_similarity": "0.15467754"
        },
        {
            "id": "i476aps",
            "score": 1,
            "text": "Good on us. It’s time to realize neither the fragile construct of the EU nor our transatlantic partnerships will save us forever. Sooner or later the US will pull out and go back to the dreaded „America first“ doctrine.",
            "title_similarity": "0.54052275"
        },
        {
            "id": "i47736o",
            "score": 1,
            "text": "With military might that Russia has shown, wouldn't the Boy Scouts be enough?",
            "title_similarity": "0.5796688"
        },
        {
            "id": "i4776we",
            "score": 1,
            "text": "Didn’t Putin also send men to the border only to them send them into Ukraine? Is there a possibility this might be a pretense only to send forces into Ukraine?",
            "title_similarity": "0.5612371"
        },
        {
            "id": "i479dc2",
            "score": -1,
            "text": "Cannot NATO countries cut military spending now that they see how weak Russia is?",
            "title_similarity": "0.560779"
        },
        {
            "id": "i479iiv",
            "score": 1,
            "text": "Geeze, took long enough.",
            "title_similarity": "-0.038053036"
        },
        {
            "id": "i47akd2",
            "score": -1,
            "text": "Putin: All. According. To. Plan.",
            "title_similarity": "0.47093263"
        },
        {
            "id": "i47bsze",
            "score": 1,
            "text": "Make sure to station some Ukrainian's there.",
            "title_similarity": "0.37738127"
        },
        {
            "id": "i47bz0y",
            "score": 1,
            "text": "NATO should do fly overs of Kaliningrad.",
            "title_similarity": "0.60447574"
        },
        {
            "id": "i47c0qr",
            "score": -1,
            "text": "I really wonder why I should be happy about that. I really wonder why I should be happy that Germany, or UK, or Europe in general send weapons. Ok, they will help Ukrainians, lol, but who knows where all these will lead us. Who knows what will happen? Who knows if we will have more or less deaths? And I do not really understand why I should be happy about a war. For me sending weapons, is just another one sign that this war did not end, and probably this is something that should be worry about a bit.",
            "title_similarity": "0.5970079"
        },
        {
            "id": "i47c9kj",
            "score": 1,
            "text": "Lol good job, Putin.",
            "title_similarity": "0.20853929"
        },
        {
            "id": "i47ckr5",
            "score": 1,
            "text": "This isnt checkers, its chess.",
            "title_similarity": "0.15495187"
        },
        {
            "id": "i47d3re",
            "score": 1,
            "text": "NATO can do whatever it wants, Russia is incompetent and would have no chance.",
            "title_similarity": "0.5226505"
        },
        {
            "id": "i47f0cb",
            "score": 1,
            "text": "As much as we don't like it. It seems like a necessity now, Putin is too undecipherable.",
            "title_similarity": "0.2993966"
        },
        {
            "id": "i47if99",
            "score": 1,
            "text": "So are we in WW3 or is the title just really misleading",
            "title_similarity": "0.19282138"
        },
        {
            "id": "i47jts0",
            "score": -1,
            "text": "To Russia: GG. You dun played yourself.",
            "title_similarity": "0.4392956"
        },
        {
            "id": "i47km8v",
            "score": 1,
            "text": "This is epically stupid. To what end? Ukrainians have proven just how impotent the Russian threat to Europe is. An incursion into a NATO state would be an even bigger ass whipping.",
            "title_similarity": "0.5592422"
        },
        {
            "id": "i47lj83",
            "score": 1,
            "text": "What and where is \"the NATO border\".. it's not a country",
            "title_similarity": "0.2957911"
        },
        {
            "id": "i47mo9m",
            "score": 1,
            "text": "satan works hard but the military industrial complex works harder",
            "title_similarity": "0.40723765"
        },
        {
            "id": "i47ndp8",
            "score": 1,
            "text": "Why are they saying NATO has a border as if it’s a country",
            "title_similarity": "0.5610782"
        },
        {
            "id": "i47og5q",
            "score": 1,
            "text": "Well that just raised my chances of having my medical waivers approved for the army.",
            "title_similarity": "0.5483162"
        },
        {
            "id": "i47q8f4",
            "score": 1,
            "text": "“NATO does not want a full scale war with Russia. We will deescalate the situation by escalating it 10-fold.”",
            "title_similarity": "0.6387716"
        },
        {
            "id": "i47tn29",
            "score": 1,
            "text": "/slow hand clap Putin lol",
            "title_similarity": "0.048775047"
        },
        {
            "id": "i47tomh",
            "score": 1,
            "text": "And then he'll say they're preparing for a full scale invasion so he has to make a preemptive strike on NATO for retaliation before it's too late. \n\nAm I the only one seeing this now ?",
            "title_similarity": "0.75192773"
        },
        {
            "id": "i47ur3v",
            "score": 1,
            "text": "This can be stopped quickly. Ban all Russian Oil untill he quits. It would hurt everyone for about 1 month or so...but eventually it would strangle hold Russia and they would have to give up.",
            "title_similarity": "0.5462363"
        },
        {
            "id": "i47v0av",
            "score": 1,
            "text": "So no ww3 or Cuban missle crisis a 2nd time...oh wait.",
            "title_similarity": "0.27553877"
        },
        {
            "id": "i47v6dt",
            "score": 1,
            "text": "Generals gathered in their masses?",
            "title_similarity": "0.2530089"
        },
        {
            "id": "i47vacy",
            "score": 1,
            "text": "The rich has to find ways to keep their coffers filled all the time.  Wars are the easiest of the ways.",
            "title_similarity": "0.3804254"
        },
        {
            "id": "i47wan7",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i47yshd",
            "score": -1,
            "text": "Cool cool cool, I can’t see how this would escalate things.",
            "title_similarity": "0.10022377"
        },
        {
            "id": "i47ztyg",
            "score": 1,
            "text": "I wonder if they will deploy forces to Finland to the Russian border too when we join. It's only a matter of time and bureaucracy now.",
            "title_similarity": "0.6203422"
        },
        {
            "id": "i47zufu",
            "score": 1,
            "text": "Obviously this was going to be the outcome of their meetings. Cold War is back on the menu, y'all.",
            "title_similarity": "0.6068059"
        },
        {
            "id": "i48121x",
            "score": 1,
            "text": "\"full scale\" will probably mean 10.000 troops lmao.....",
            "title_similarity": "0.34840477"
        },
        {
            "id": "i48165k",
            "score": 1,
            "text": "Put bullet in Putins head",
            "title_similarity": "0.42330164"
        },
        {
            "id": "i482u8t",
            "score": -1,
            "text": "Cool. We're a false start away from nuclear war.",
            "title_similarity": "0.4023099"
        },
        {
            "id": "i483gl0",
            "score": 1,
            "text": "Russia sucks",
            "title_similarity": "0.27494377"
        },
        {
            "id": "i484o1w",
            "score": 1,
            "text": "I like how Russia wants countries like Ukraine as a \"buffer\" zone between them and nato. there was already an independent country as a buffer zone that they keep attacking the past 100 years. if they would have left Ukraine alone there would have been the buffer zone.  \n(btw I hardly know what I'm actually talking about)",
            "title_similarity": "0.76178366"
        },
        {
            "id": "i484x5o",
            "score": 1,
            "text": "The powers that be will not stop until they have their war with Russia. They only know brinksmanship.  And the Western financial system is nearing a cliff due to decades of corruption.\n\nMeanwhile, the question of where is General Cloutier is gaining a lot of steam on Twitter and telegram. The longer it festers, the more we should be greatly concerned. \n\nForget improving American social services, healthcare, infrastructure, Wall Street corruption or ending our growing oligarchies. \n\nThe next generational war is coming. It’s already here actually…just in its infancy.",
            "title_similarity": "0.6512569"
        },
        {
            "id": "i484x5w",
            "score": 1,
            "text": "Lol Russia gambled and got fucked.",
            "title_similarity": "0.3304477"
        },
        {
            "id": "i485bpu",
            "score": 1,
            "text": "Berlin Brigade 2: The Return.",
            "title_similarity": "0.32846415"
        },
        {
            "id": "i485f6c",
            "score": 1,
            "text": "So back before this current Russia vs Ukraine issue\n\nUS intelligence saw the buildup of troops coming\n\nBiden , instead of withdrawing the national guard trainers we had in Ukraine could of easily moved our German based US troops to Ukraine \n\nThen announced deployment of troops before the invasion.\n\nWould of made Putin rethink",
            "title_similarity": "0.75706774"
        },
        {
            "id": "i486ecm",
            "score": 1,
            "text": "NATO isn’t a country. Dumb title.",
            "title_similarity": "0.21535458"
        },
        {
            "id": "i486i5i",
            "score": -1,
            "text": "Gagging salivating foaming at the mouth for a full on confrontation with Russia. They will all be 200ft underground while you watch your friends and family melt and die horrific deaths in a Nuclear fireball..They are utterly insane!",
            "title_similarity": "0.4825766"
        },
        {
            "id": "i487mbe",
            "score": 1,
            "text": "Cold war 2.0",
            "title_similarity": "0.37698355"
        },
        {
            "id": "i4890f3",
            "score": -1,
            "text": "Have you heard about the ongoing donation from NBT for our newly members, we are helping in donating to the community both young and old around Pennsylvania, New York, Massachusetts\nDm if you’re interested",
            "title_similarity": "0.34518796"
        },
        {
            "id": "i48asw6",
            "score": 1,
            "text": "Rare picture of vladimyr putin https://imgflip.com/i/6c4mtk",
            "title_similarity": "0.31613618"
        },
        {
            "id": "i48bsm4",
            "score": 1,
            "text": "This, done in response to Russia’s actions, gives Russia a way to excuse their actions. Cold war 2.0, here we go, pick your side and stick with it, and let’s wait for Nuclear Holocaust together.",
            "title_similarity": "0.7136424"
        },
        {
            "id": "i48buhd",
            "score": 1,
            "text": "They’re not going to invade a NATO country. They’re absolutely bastards for what they are doing in Ukraine, but that’s not a NATO country.",
            "title_similarity": "0.44597942"
        },
        {
            "id": "i48gbm3",
            "score": 1,
            "text": "A new iron curtain descends on Europe.......",
            "title_similarity": "0.49109158"
        },
        {
            "id": "i48gmxy",
            "score": 1,
            "text": "Sabre rattling at best.\nRussia has dirt on every last potential enemy since they are just as disgustingly corrupt.  Can't let that slip out, though when it does the gullible unwashed are told \"it's just Russian disinfo!\"\n\nYes, everything that makes you uncomfortable is disinfo.  Everything else is truth.  Consume, vote, pay taxes, and die penniless like good cattle.\n\nInnocent people are dying every day because elites are too afraid their dirt will come to light.  That's the truth.  And you people worship them.",
            "title_similarity": "0.4674866"
        },
        {
            "id": "i48h3xp",
            "score": -1,
            "text": "Game on",
            "title_similarity": "0.10524036"
        },
        {
            "id": "i48jez8",
            "score": 1,
            "text": "Well let's just say that backfired. Gloriously.",
            "title_similarity": "0.055609345"
        },
        {
            "id": "i48k271",
            "score": 1,
            "text": "This should end well. /s\n\nEdit: should probably put in the \"/s\"",
            "title_similarity": "0.21037604"
        },
        {
            "id": "i48k6b7",
            "score": -1,
            "text": "Cold War incoming…",
            "title_similarity": "0.46013552"
        },
        {
            "id": "i48o3m1",
            "score": 1,
            "text": "So more money from pocket is going to military; here’s goes \nInto of my hard earned money going into military spending.",
            "title_similarity": "0.452874"
        },
        {
            "id": "i48pvp5",
            "score": 1,
            "text": "i could have made that call, i earn 60k a year. i would easily say the same for 130k per year",
            "title_similarity": "0.3138637"
        },
        {
            "id": "i48qfxo",
            "score": 1,
            "text": "When will they push the button?",
            "title_similarity": "0.2861526"
        },
        {
            "id": "i48rdp4",
            "score": -1,
            "text": "Masks are off!",
            "title_similarity": "0.07994078"
        },
        {
            "id": "i49jdc7",
            "score": -1,
            "text": "If an all-out war were to happen, would Russia not have an easier time using tactical nukes to get rid of these forces if he knows they’re concentrated on the border?",
            "title_similarity": "0.7041327"
        },
        {
            "id": "i49kr6j",
            "score": 1,
            "text": "Baltic countries will be lost anyway in case of full scale military operations. Suwałki gap is the only way there...",
            "title_similarity": "0.51767236"
        },
        {
            "id": "i49lbs0",
            "score": -1,
            "text": "NATO has a border? What?",
            "title_similarity": "0.48836893"
        },
        {
            "id": "i49mnyg",
            "score": 1,
            "text": "How about the American boarder?",
            "title_similarity": "0.2785348"
        },
        {
            "id": "i49vavi",
            "score": 1,
            "text": "I think this is preemptive. Need to have your ducks in a row NATO.",
            "title_similarity": "0.5102561"
        },
        {
            "id": "i49vyax",
            "score": 1,
            "text": "If NATO choose to do this, we will have no choice but to arm our nukes to the highest level and then double it. Putin probably.",
            "title_similarity": "0.7053208"
        },
        {
            "id": "i4as9bk",
            "score": 1,
            "text": "NATO is fishy",
            "title_similarity": "0.08516732"
        },
        {
            "id": "i46ciob",
            "score": 77,
            "text": "And that last American president wanted to defund NATO. I wonder why he would do that?\n\nAnd that current cringey French woman would like to assist Russia. I wonder why she would do that?",
            "title_similarity": "0.58913493"
        },
        {
            "id": "i466hus",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "-0.023929574"
        },
        {
            "id": "i469m0g",
            "score": -5,
            "text": "NATO isn't a country. NATO doesn't have borders.",
            "title_similarity": "0.25770748"
        },
        {
            "id": "i46o43d",
            "score": -7,
            "text": "NATO will start WW3 as predicted",
            "title_similarity": "0.5189657"
        },
        {
            "id": "i46zuyx",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i467cq6",
            "score": 34,
            "text": "“Oh see! NATO is building up its forces to invade! I was right all along!” - Putin the Bitch",
            "title_similarity": "0.7255853"
        },
        {
            "id": "i45y0za",
            "score": -8,
            "text": "I mean,  that was always the policy anyway, so yeah.",
            "title_similarity": "0.26603022"
        },
        {
            "id": "i466j5a",
            "score": 9,
            "text": "The dominos keep on going.",
            "title_similarity": "0.07894948"
        },
        {
            "id": "i468eie",
            "score": -9,
            "text": "But won’t do anything to help Ukrainian forces and civilians during the current invasion. Fuck off, NATO",
            "title_similarity": "0.4471611"
        },
        {
            "id": "i49efmi",
            "score": -8,
            "text": "Why when the West has been the ‘invader” for over 100 years…NATO’s generals are all grandsons of NAZI GENERALS, trying to get the pride they lost when they lost to all of us. Now it’s the Wests turn at total defeat and they’re not fighting goat herders anymore but real SOLDIERS. Good luck stupids",
            "title_similarity": "0.52512264"
        },
        {
            "id": "i469iad",
            "score": 2,
            "text": "didnt Ukrain give back Russia like 900 plus nuclear war heads that were stored in Ukraine in the cold war days in exchange of there Independence back in the 90's?",
            "title_similarity": "0.6673287"
        },
        {
            "id": "i46c7eq",
            "score": 2,
            "text": "Russia has proven the need for a strong and unified NATO.",
            "title_similarity": "0.67929655"
        },
        {
            "id": "i46f2kk",
            "score": 2,
            "text": "Why is this title phrased like NATO is it’s own country? Whose border? Whose military?",
            "title_similarity": "0.51882136"
        },
        {
            "id": "i46f3aa",
            "score": 2,
            "text": "In before: \"Russia complains about X\" news since all they know how to do is murder, rape, fail horribly at invasion and complain.",
            "title_similarity": "0.5489106"
        },
        {
            "id": "i46gd0v",
            "score": -2,
            "text": "Stupid. Aren’t they doing for years now?",
            "title_similarity": "0.12841465"
        },
        {
            "id": "i46h70k",
            "score": -2,
            "text": "Looks like NATO got exactly what they wanted out of this.",
            "title_similarity": "0.42593157"
        },
        {
            "id": "i46hiz7",
            "score": -2,
            "text": "Russia smart.",
            "title_similarity": "0.31362316"
        },
        {
            "id": "i46m0mp",
            "score": 2,
            "text": "Nato has a border?",
            "title_similarity": "0.45705095"
        },
        {
            "id": "i46nc7p",
            "score": 2,
            "text": "“Well you see Baldrick, the idea was to have two large conventional forces, each acting as each other‘s deterrent. That way, there could never be a war. “\n\nB: “but this is sort of a war, isn’t it sir?”\n\n“Yes.  You see, there was a tiny flaw in the plan. “\n\n“What was that, sir?”\n\n“It was bollocks. “",
            "title_similarity": "0.61334383"
        },
        {
            "id": "i46nynv",
            "score": 2,
            "text": "Such uncalled for interventionism from the West. Why can't they just let Russia wage war in peace?",
            "title_similarity": "0.59702307"
        },
        {
            "id": "i46o2t3",
            "score": 2,
            "text": "Great job putin, you fucking cunt.",
            "title_similarity": "0.31434646"
        },
        {
            "id": "i46ooxm",
            "score": -2,
            "text": "Another wall. Just what the world needs",
            "title_similarity": "0.30348986"
        },
        {
            "id": "i46ouhd",
            "score": -2,
            "text": "Does that officially make this a world war?",
            "title_similarity": "0.5170059"
        },
        {
            "id": "i46pf09",
            "score": -2,
            "text": "This is the beginning of the end. Eventually, a skirmish or incident of some sort will occur and it will escalate the situation, ultimately resulting in the use of nuclear arms. It's just a matter of time. Humanity made it 80ish years without pushing the button, but, it's coming to a head.\n\nSpend time with your loved ones. Hate your job? Quit, life is far far too short. Make memories with your friends and family. Hug your kids and tell them how much you love them.\n\nThe world is going to burn in the very near future, and all bets are off.",
            "title_similarity": "0.54682076"
        },
        {
            "id": "i46pjaq",
            "score": -2,
            "text": "What if, instead of another Cold War arms race, we had a peace conference, demanded our governments to invest in a green, just recovery, and agreed to strike and organize until we won.",
            "title_similarity": "0.6009524"
        },
        {
            "id": "i46pny2",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "-0.023929574"
        },
        {
            "id": "i46puxc",
            "score": -2,
            "text": "Lame",
            "title_similarity": "-0.15911958"
        },
        {
            "id": "i46q96n",
            "score": 2,
            "text": "The military industrial complex wins again!",
            "title_similarity": "0.44631022"
        },
        {
            "id": "i46qr2t",
            "score": 2,
            "text": "Are we all watching the “grown ups” start world war 3",
            "title_similarity": "0.48576298"
        },
        {
            "id": "i46r5kh",
            "score": -2,
            "text": "Something tells me they know something we don’t…",
            "title_similarity": "0.07425888"
        },
        {
            "id": "i46r747",
            "score": -2,
            "text": "TIL NATO is a country",
            "title_similarity": "0.45199364"
        },
        {
            "id": "i46r7j2",
            "score": -2,
            "text": "What a useless gesture and waste of resources.\n\nIf Russia touches NATO, they get deleted from the map anyway, so defending the borders doesn't matter at all.\n\nThe whole western world should just total embargo them and exclude from everything possible while supporting Ukraine as much as it can.",
            "title_similarity": "0.5071436"
        },
        {
            "id": "i46sd4x",
            "score": -2,
            "text": "Good. I hope they deploy permanent full scale military force against US too for destroying multiple countries with full scale war. No need for hypocrisy here.",
            "title_similarity": "0.7063451"
        },
        {
            "id": "i46ugkg",
            "score": 2,
            "text": "Relax Russia, NATO is just performing a military exercise..",
            "title_similarity": "0.68505365"
        },
        {
            "id": "i46w6zs",
            "score": 2,
            "text": "Isn't this exactly what Putin was \"afraid\" of happening?  Now he can just use it as political fuel to rally his people behind his bullshit cause.",
            "title_similarity": "0.5756093"
        },
        {
            "id": "i470z74",
            "score": 2,
            "text": "It's about time. Putin wants to act like a cunt and bitch about NATO? Here you go bro, enjoy. \n\nIf you actually acted like a civil human being, embraced cooperation, and openness the world wouldn't have financially and economically destroyed your country. \n\nHopefully someday Russia can be welcomed back into the fold instead of becoming the next North Korea. Until then you reap what you sow.",
            "title_similarity": "0.63100266"
        },
        {
            "id": "i476gag",
            "score": 2,
            "text": "Here we go",
            "title_similarity": "0.028274473"
        },
        {
            "id": "i477g36",
            "score": -2,
            "text": "can you not",
            "title_similarity": "-0.05695751"
        },
        {
            "id": "i47b6fi",
            "score": 2,
            "text": "Funny how Putin invaded Ukraine to avoid having NATO on his border only to end up with NATO on his border as a result of the invasion...",
            "title_similarity": "0.693356"
        },
        {
            "id": "i47c1zq",
            "score": 2,
            "text": "False flag incoming",
            "title_similarity": "0.044178173"
        },
        {
            "id": "i47cid4",
            "score": -2,
            "text": "There you go Putin you fucking pussy",
            "title_similarity": "0.22354856"
        },
        {
            "id": "i47cr5w",
            "score": 2,
            "text": "How many members of congress bought defense stocks in the past week?",
            "title_similarity": "0.35438418"
        },
        {
            "id": "i47cuek",
            "score": 2,
            "text": "Holy fucking shit this bad.",
            "title_similarity": "0.059650376"
        },
        {
            "id": "i47gbxz",
            "score": 2,
            "text": "Well it took 40 something days. Were so fucked.",
            "title_similarity": "0.06752393"
        },
        {
            "id": "i47pb8h",
            "score": 2,
            "text": "Lol this is how World War 3 will start..",
            "title_similarity": "0.4913611"
        },
        {
            "id": "i47rir8",
            "score": -2,
            "text": "The truth is that China 🇨🇳 is providing war air fighting planes to Russia 🇷🇺 making American and EU war equipment incompetent. Chinese and Russians are tied in love nuts like Trump was with Putin, which China  and Trump were enamore in love some time ago.",
            "title_similarity": "0.58007807"
        },
        {
            "id": "i47ujog",
            "score": 2,
            "text": "It's almost like Putin created the enemy on his borders that he was worried about.",
            "title_similarity": "0.5431951"
        },
        {
            "id": "i47wue9",
            "score": 2,
            "text": "Roaring 20s, alright",
            "title_similarity": "0.112414636"
        },
        {
            "id": "i47wupt",
            "score": 2,
            "text": "This is good! Should make Russia think twice about their next planned invasion.",
            "title_similarity": "0.6565683"
        },
        {
            "id": "i4840f7",
            "score": 2,
            "text": "Putin made NATO GREAT AGAIN. Amazing how outcome of some decisions in life unfold.",
            "title_similarity": "0.5229927"
        },
        {
            "id": "i4844l7",
            "score": 2,
            "text": "What if we go ahead with an all out war? I know it’s bad and it’s the last thing we want but has anybody ever threatened Russia with something like that before? Because I feel like they’ve always gotten what they wanted. Kinda like a bully doing what he pleases until one day he gets checked in the mouth.",
            "title_similarity": "0.5828609"
        },
        {
            "id": "i4846t5",
            "score": 2,
            "text": "This also has to make joining NATO that much more appealing for all the countries who were already considering and leaning towards it.",
            "title_similarity": "0.57110274"
        },
        {
            "id": "i488xnr",
            "score": 2,
            "text": "I’m a socialist and I support this.✊🏼🌹✊🏾",
            "title_similarity": "0.25055295"
        },
        {
            "id": "i489ed1",
            "score": 2,
            "text": "and the paranoia of Vladimir becomes real\n\nHe only has himself to blame\n\nIt will be sweet if finland joins NATO",
            "title_similarity": "0.5556667"
        },
        {
            "id": "i489pju",
            "score": 2,
            "text": "Well then, I say that this 30 years of history should here by be called “the short Thaw”, because the Cold War apparently is back on…..",
            "title_similarity": "0.39916503"
        },
        {
            "id": "i48bs4e",
            "score": 2,
            "text": "This will end well",
            "title_similarity": "0.05669206"
        },
        {
            "id": "i48ifxp",
            "score": 2,
            "text": "Is no one else concerned about the bigger picture? Hate to be a pessimist/ hopefully not realist but Putin invaded, has face much more resistance than anticipated, is 110% a pariah internationally now and forever. He’s cornered and everyone is applauding bc he pulled troops from Kyiv. I don’t like the potential here. Pull troops to give up, reorganize or protect them from the next move. I hope I’m wrong but strategically it would make sense what his horrible next move could be here",
            "title_similarity": "0.583284"
        },
        {
            "id": "i48jpjl",
            "score": 2,
            "text": "So we can do that but not send planes. So fucking stupid man 😂",
            "title_similarity": "0.25725317"
        },
        {
            "id": "i48pir8",
            "score": 2,
            "text": "I don’t see this escalating anything at all",
            "title_similarity": "0.031954713"
        },
        {
            "id": "i48vefq",
            "score": 2,
            "text": "This will not end well.",
            "title_similarity": "0.014053862"
        },
        {
            "id": "i49c1y5",
            "score": -2,
            "text": "I can’t wait to pay for that. \n\n/s",
            "title_similarity": "0.2347736"
        },
        {
            "id": "i46bs2w",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "-0.023929574"
        },
        {
            "id": "i46e5sy",
            "score": -22,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i45uvx5",
            "score": 41,
            "text": "I hope the sentiment shifts to let's roll Russia back to the ~1993 borders.",
            "title_similarity": "0.5608824"
        },
        {
            "id": "i46b7hu",
            "score": -11,
            "text": "So they are admitting they are just trying to further provoke Russia.",
            "title_similarity": "0.53759205"
        },
        {
            "id": "i45pmaq",
            "score": 812,
            "text": "nice work russia \n\nthis was about oil and controlling the supply of oil to europe\n\nthis isn’t about land or military presence\n\nUkraine can easily supply europe with energy - competing with Russia and that’s why theyre trying to take it",
            "title_similarity": "0.6431585"
        },
        {
            "id": "i4683v9",
            "score": 3,
            "text": "Great. Who’s gonna trip over their gun and “fire “ The first shot.",
            "title_similarity": "0.32980275"
        },
        {
            "id": "i46a0ki",
            "score": -2,
            "text": "Cool way to waste money.",
            "title_similarity": "0.02489058"
        },
        {
            "id": "i46cnv1",
            "score": -3,
            "text": "hopefully this will be mostly European funded.  The US already spends too much $$$$ on the military and I would rather that money go into other things like tax cuts or social programs. if we cover 1/30th of this id be ok with it but i am worried this is going to be expected to be 80% us military.",
            "title_similarity": "0.50102454"
        },
        {
            "id": "i46ef0r",
            "score": -2,
            "text": "Hahaha exactly why Russia invaded Ukraine… Putin will love this 😂",
            "title_similarity": "0.6659175"
        },
        {
            "id": "i46eflf",
            "score": -3,
            "text": "fair but russia isn't invading nato countries, thats why they invaded ukraine lol",
            "title_similarity": "0.6032268"
        },
        {
            "id": "i46ejj0",
            "score": 3,
            "text": "Permanent justification for perpetually massive military spending. The military industrial complex will be overjoyed at this news.",
            "title_similarity": "0.55440426"
        },
        {
            "id": "i46f339",
            "score": -3,
            "text": "Surprise, the elites are milking us again!",
            "title_similarity": "0.2996847"
        },
        {
            "id": "i46fla0",
            "score": 3,
            "text": "I like it. Putin says if NATO responds to his aggression than he’ll consider it an attack from NATO. Now it’s very clear that if Putin attacks a NATO country he’s automatically attacking NATO forces directly, not just a member country.",
            "title_similarity": "0.7687106"
        },
        {
            "id": "i46gt00",
            "score": -3,
            "text": "Russia just keeps winning.",
            "title_similarity": "0.41635028"
        },
        {
            "id": "i46hkon",
            "score": -3,
            "text": "This is escalating things",
            "title_similarity": "0.12492495"
        },
        {
            "id": "i46j9xe",
            "score": 2,
            "text": "Well you guys should’ve helped 🇺🇦",
            "title_similarity": "0.09887856"
        },
        {
            "id": "i46jr8p",
            "score": 3,
            "text": "Putin is a bully. You don't concede to a bully, you slap them in the face and tell them to fuck off. I don't see how Putin survives this whole debacle. He built his political base on being the Don of the Russian mafia and when the Don gets humiliated in public, his power base leaves. \n\nIt may take a year or so, but I would be shocked if he was still in power at this time next year. Of course, I could be wrong.",
            "title_similarity": "0.5600973"
        },
        {
            "id": "i46jx4r",
            "score": 4,
            "text": "My husband said, when I read him the headline, “Oh look, it’s the 80s again.”",
            "title_similarity": "0.30722237"
        },
        {
            "id": "i46kykl",
            "score": 3,
            "text": "Ok so next time Russia wants to do whatever it wants they'll be punished... But not THIS time they're commiting war crimes and displacing entire countries with millions of people.\n\nOnly next time...\n\nWhat a fucking joke.",
            "title_similarity": "0.6145983"
        },
        {
            "id": "i46nnkb",
            "score": -2,
            "text": "NATO is spineless",
            "title_similarity": "0.16279207"
        },
        {
            "id": "i46ona6",
            "score": -2,
            "text": "Unnecessary",
            "title_similarity": "-0.10526314"
        },
        {
            "id": "i46q5lz",
            "score": 2,
            "text": "Good thing Trump didn’t take us out of NATO like the moron he is",
            "title_similarity": "0.37955368"
        },
        {
            "id": "i46scbd",
            "score": 3,
            "text": "This feels like February 2020 all over again. Two months ago if you said there's a real possibility of a world war you'd be laughed at. One month ago if you said it everyone would insist sure it's a possibility but it probably won't happen. This month it probably still won't happen but we're gonna get ready for it *just in case.* Next month it's gonna be yeah well there's gonna be a world war but it won't be as bad as you expect. Am I completely wrong or is history repeating itself in a shockingly obvious way here?",
            "title_similarity": "0.59634924"
        },
        {
            "id": "i46yuxo",
            "score": 3,
            "text": "I never thought I’d see the day where Reddit agrees with what neocons have wanted for the past 60 years and have been attacked relentlessly for.  But hey, better late than never I suppose.  It’s a bummer we had to wait for another invasion with thousands dead to make it happen.",
            "title_similarity": "0.53485316"
        },
        {
            "id": "i4738td",
            "score": 4,
            "text": "Lmao Russian troll-net back trying desperately to get back in control sorting by controversial. Anyone else notice the attempt to shift away from Ukraine and onto China and covid again? From a unifying issue to divisive and pointless ones? From Putin the authoritarian gaslighting shitbag to evil Winnie The Pooh? \n\nThe large amount who keep pushing the \"China bad\" narrative instead of blanket saying \"Authoritarianism bad\" is the most telling. Not to mention acting as if our bloated-ass military isn't watching China anymore, or has changed policy in the slightest to soften their stance (we've done the opposite back here in reality), because what you see on the front page of Reddit has changed is dumb as hell.",
            "title_similarity": "0.53162134"
        },
        {
            "id": "i475tln",
            "score": -2,
            "text": "Human wall, weapon wall, physical wall; didn't some world leader recently try to make wall building a comical feature of their elected tenure?",
            "title_similarity": "0.50577897"
        },
        {
            "id": "i47eocb",
            "score": -4,
            "text": "Build a wall and make Europe great again? No thanks.",
            "title_similarity": "0.476597"
        },
        {
            "id": "i47gdsa",
            "score": 3,
            "text": "I bet China is pissed. The West has woken up and going to be wiser to their games, be it spying, cyber, etc.",
            "title_similarity": "0.44744915"
        },
        {
            "id": "i47io2j",
            "score": -3,
            "text": "All of you who think this is great have no idea how bad this is.",
            "title_similarity": "0.19501121"
        },
        {
            "id": "i47l40s",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i47otp6",
            "score": 3,
            "text": "While still purchasing fossil fuels from Russia.",
            "title_similarity": "0.5475764"
        },
        {
            "id": "i47qpxj",
            "score": 2,
            "text": "Bruh, there is no such thing as a permanent full scale military force on the border for defense, its INSANELY expensive. \n\nThey are totally gonna invade Russia, calling it now.",
            "title_similarity": "0.70001954"
        },
        {
            "id": "i47xawu",
            "score": 3,
            "text": "For all the talk of Putin's war in Ukraine backfiring, this is the largest backfire of them all. Not only will Russia need to defend against a likely Finnish/NATO border, the NATO eastern flank in the baltics will now be heavily militarized, a position NATO had avoided taking for many years to avoid triggering the Russians.\n\nExpectation is still no NATO bases in Finland to ease the country's accession into NATO and to appease domestic opposition, regardless, Russia have to spend much more $$$ defending against NATO than it otherwise would have to, with a crumbling economy no less.\n\nBig brained Putin with his 4D chess again.  I think he accidentally toggled to the 3rd dimension.",
            "title_similarity": "0.6503643"
        },
        {
            "id": "i47xkrl",
            "score": 2,
            "text": "Good, can’t trust them. “We’re not going to invade Ukraine.” All lies. Fuck their bullshit.",
            "title_similarity": "0.37986094"
        },
        {
            "id": "i47y0iv",
            "score": 4,
            "text": "Good job Putin. You absolute dumb bitch motherfucker.",
            "title_similarity": "0.2524171"
        },
        {
            "id": "i480l8j",
            "score": 3,
            "text": "Well Russia got what they wanted right? No NATO expansion? Imagine if they left Ukraine alone? No military escalation! No deaths! No terrible economy. It's almost like Putin did the dumbest thing any leader has done in recent history.",
            "title_similarity": "0.5403371"
        },
        {
            "id": "i48czu5",
            "score": 3,
            "text": "So a security spiral is now possible if russia invades?",
            "title_similarity": "0.65211904"
        },
        {
            "id": "i48dw39",
            "score": 3,
            "text": "The world is moving to the new heaviest war.",
            "title_similarity": "0.5113495"
        },
        {
            "id": "i48e46f",
            "score": 5,
            "text": "Well Vlad now we're ready to crawl right up your ass.",
            "title_similarity": "0.4546241"
        },
        {
            "id": "i48loyt",
            "score": 3,
            "text": "If Vlad's insider in the WH had won the election, he would have defunded NATO, making the EU and the free world even more vulnerable to Russia.",
            "title_similarity": "0.6203165"
        },
        {
            "id": "i49985f",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "-0.023929574"
        },
        {
            "id": "i468bql",
            "score": 13,
            "text": "Wish for world peace.",
            "title_similarity": "0.16008517"
        },
        {
            "id": "i464a5b",
            "score": 96,
            "text": "Putin will call this an escalation lol",
            "title_similarity": "0.50170434"
        },
        {
            "id": "i4689gs",
            "score": 14,
            "text": "Thanks Putin, if the world needed anything it was more militarized area -_-",
            "title_similarity": "0.54349583"
        },
        {
            "id": "i46feuz",
            "score": 4,
            "text": "well I hope this doesn't make shit worse",
            "title_similarity": "0.08397715"
        },
        {
            "id": "i46fk4c",
            "score": -5,
            "text": "see, this is the reason russia was so pissy about ukraine joining NATO. Russia is never going to invade a NATO ally, this seems more like a threat to Russia than anything else.",
            "title_similarity": "0.65716755"
        },
        {
            "id": "i46fow9",
            "score": 4,
            "text": "Putin: I'm going to invade this country and start killing people to stop NATO expanding eastwards.\n\nNATO: Cool thanks for giving us a reason to expand our influence eastwards.\n\nPutin: ^wait ^no",
            "title_similarity": "0.70606226"
        },
        {
            "id": "i46kmyq",
            "score": -5,
            "text": "More war mongering. Russia won't invade any NATO country, so why all the fuss?",
            "title_similarity": "0.63704467"
        },
        {
            "id": "i470rfi",
            "score": -4,
            "text": "Balkanize Russia and America back to the 3rd world",
            "title_similarity": "0.4915166"
        },
        {
            "id": "i47i7y8",
            "score": -3,
            "text": "What? NATO has a country now? What is this? If anyone should be allowed to expand it should be Canada but of course Trud'oh would never allow this. \n\nNow I do not give two craps about NATO and communism but you would see me on the frontlines if anyone attacked CANADA. I would not do it to defend Trud'oh but for my culture and history and hopes that one day our Prime Minister will get some sense knocked into him.",
            "title_similarity": "0.6072537"
        },
        {
            "id": "i47poju",
            "score": 4,
            "text": "Gotta keep feeding the Military-Industrial Complex",
            "title_similarity": "0.43425906"
        },
        {
            "id": "i48570x",
            "score": -5,
            "text": "I mean I’m just as happy as anyone else that Russia is getting their asses handed to them but deescalation should be the focus right now. I mean the dude is old, crazy as shit and has a ton of nuclear weapons. Im not saying cower in fear but antagonizing the dude is just a bad decision.",
            "title_similarity": "0.60102904"
        },
        {
            "id": "i48ctli",
            "score": 3,
            "text": "So it begins…..",
            "title_similarity": "0.0243209"
        },
        {
            "id": "i49e2oh",
            "score": -3,
            "text": "This is the dumbest policy I’ve heard in a while. So Europe is going to spend trillions of dollars for this permanent deployment to de-incentivize a Russian invasion when article 5 already accomplished this goal?",
            "title_similarity": "0.60672605"
        },
        {
            "id": "i466dnl",
            "score": 87,
            "text": "The only thing keeping us from renewable energy is the lack of will to implement it.  Hopefully with Russia foolishly tipping their hand like this, it can encourage Europe to finally go green.",
            "title_similarity": "0.45853317"
        },
        {
            "id": "i46970a",
            "score": 44,
            "text": "can yall not read the article 💀 they have a small number of troops there anyway, and adding more will be discussed at the summit in june.. not this week LMFAO",
            "title_similarity": "0.40119457"
        },
        {
            "id": "i46a21n",
            "score": 33,
            "text": "Fuck Russia. Deserves to be treated like the hostile rogue nation it is.",
            "title_similarity": "0.5291625"
        },
        {
            "id": "i465ifd",
            "score": 6,
            "text": "Awwwwwww shit here we go",
            "title_similarity": "0.04128784"
        },
        {
            "id": "i46726d",
            "score": 5,
            "text": "Feels good to be a small NATO country right about now...",
            "title_similarity": "0.1978191"
        },
        {
            "id": "i4687u6",
            "score": 5,
            "text": "Good, diplomacy clearly doesn't work with those idiots so it's the only way.",
            "title_similarity": "0.22052068"
        },
        {
            "id": "i469m5c",
            "score": 5,
            "text": "Don’t forget Alaska, make Putin get defensive in the East of Russia as well, making logistics way harder",
            "title_similarity": "0.6098319"
        },
        {
            "id": "i46e1s5",
            "score": -6,
            "text": "Is this not an escalation?",
            "title_similarity": "0.091793045"
        },
        {
            "id": "i46t6ac",
            "score": -6,
            "text": "Of course, NATO wants to feel relevant even though it’s clearly not.",
            "title_similarity": "0.29375225"
        },
        {
            "id": "i47vxno",
            "score": -5,
            "text": "Fuck that shit. Need to be on the US , Mexico border,  wtf , insane f,ing Democrats",
            "title_similarity": "0.5167483"
        },
        {
            "id": "i4855ns",
            "score": 4,
            "text": "Headline is a bit misleading. NATO already has some troops there, and though the amount has increased throughout the conflict, the possibility of a permanent force has yet to be discussed at the summit in June, and hasn’t been actually decided yet…",
            "title_similarity": "0.48804116"
        },
        {
            "id": "i46eu4b",
            "score": -6,
            "text": "So, that way, Russia can just wipe them all out at once.",
            "title_similarity": "0.5206865"
        },
        {
            "id": "i46pl1l",
            "score": -7,
            "text": "Provoking nuclear war",
            "title_similarity": "0.4859435"
        },
        {
            "id": "i46ugl7",
            "score": 6,
            "text": "Putin, a guy who has a history of amassing troops along borders and saying they aren't actually going to invade, is probably going to react really well to this. God we're going to end up going to war with Russia, aren't we?",
            "title_similarity": "0.8008934"
        },
        {
            "id": "i471s8a",
            "score": 6,
            "text": "And the way it's looking Finland and Sweden are more than likely to join NATO as well. Putin thought that NATO was broken LOL all he has done is strengthen NATO 100 fold. Now the US needs to put the same amount of troops they had during the height of the cold war in Europe, something like 300K American troops in Europe should be enough..",
            "title_similarity": "0.64985186"
        },
        {
            "id": "i469pm4",
            "score": 117,
            "text": "Here's the official statement from NATO.  Business Insider is rubbish.\n\nhttps://www.nato.int/cps/en/natohq/official_texts_193719.htm",
            "title_similarity": "0.4852701"
        },
        {
            "id": "i47e42p",
            "score": -8,
            "text": "In the US. We were mighty pissed off when trump said he was building a wall. Now nato is going to station a wall of people at its Russia borders? \n\nSince the US makes a large percentage of natos fighting force and equipment. Who is paying for this mr nato? \n\nI’m not a fan of communism or of Russia for that matter. But this idea is as stupid as trumps wall.\n\nMr nato please stop making permanent bases in other countries that the us has to police. Since world wide people hate when we police the world",
            "title_similarity": "0.6384816"
        },
        {
            "id": "i483lg0",
            "score": -7,
            "text": "NATO can suck a dick, they provoked putin and then dipped, Russia should bomb nato army bases instead of poor innocent Ukrainian civilians",
            "title_similarity": "0.65070355"
        },
        {
            "id": "i49o36u",
            "score": -8,
            "text": "Germany and France throughout history have invaded Russia but failed,  they've found away  to do so now through NATO! 👏👏",
            "title_similarity": "0.57083833"
        },
        {
            "id": "i45pap6",
            "score": -58,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i4629xy",
            "score": 306,
            "text": "The only way Russians might have a chance is if Putin is removed period there is no other way",
            "title_similarity": "0.5125688"
        },
        {
            "id": "i45okam",
            "score": 458,
            "text": "The NATO Russia border is comically small if you look at a map, and totally allows for invasion of Georgia and Finland, the next most at risk countries",
            "title_similarity": "0.58671594"
        },
        {
            "id": "i46adt4",
            "score": -8,
            "text": "RUSSIA RUSSIA RUSSIA RUSSIA!!!!!!",
            "title_similarity": "0.47833082"
        },
        {
            "id": "i46prj4",
            "score": -8,
            "text": "Is it just me or it looks like NATO is just asking for war and nuclear bombs?",
            "title_similarity": "0.57421845"
        },
        {
            "id": "i461h5r",
            "score": 478,
            "text": "Thanks for uniting the west Putin! We didn't know you cared and were so thoughtful!",
            "title_similarity": "0.3497492"
        },
        {
            "id": "i45z3px",
            "score": 188,
            "text": "And this is how Putin fucked up the world. Nice move, Putin.",
            "title_similarity": "0.43545702"
        },
        {
            "id": "i46755e",
            "score": 27,
            "text": "\"But NATO made Russia invade Ukraine!\"\n\nIf we even assume that excuse is true, it would mean that NATO successfully tricked Putin into making the situation worse for himself, after publicly condemning his actions, telling everyone he was going to invade, and pressuring him not to invade. \n\nIt would be quite a high level of 4D chess.",
            "title_similarity": "0.66223073"
        },
        {
            "id": "i46deak",
            "score": -9,
            "text": "\"INDEPENDENT WOMAN\" IS NOT A COMPLIMENT??🤔| REACTION\nBe sure to like and sub 💪🏽\nhttps://youtu.be/dZJ19S0cDko",
            "title_similarity": "0.18672915"
        },
        {
            "id": "i46m025",
            "score": 9,
            "text": "Congrats Pootin you played yourself",
            "title_similarity": "0.1432126"
        },
        {
            "id": "i46bqta",
            "score": 251,
            "text": "This whole problem is that Russia still thinks of themselves in their former glory, they still define themselves as an equal party in  opposition to the west. But their economic power in the world no longer matches that as a dominant super-power in the world. They are delusional and the cognitive dissonance is painful as reality is not what they want it to be.\n\nIf Russia just ate some humble pie and joined the west as a good faith ally then they would be welcomed and could rebuild their economy and both Russia and NATO countries could stop this military madness.\n\nBut Russia is like that sad pot-bellied old man who started a bar fight thinking he could relive his younger glory days and has now pulled out a gun because he got his ass whooped. Like you cannot have any respect for a madman like that, who so insists on a delusional worldview and will resort to violence if that worldview becomes threatened. And now he has cops outside the door and all the bar patrons have no idea if he is gonna give himself up or try to go down in a blaze of glory, taking them with him.",
            "title_similarity": "0.49549973"
        },
        {
            "id": "i468mlq",
            "score": 86,
            "text": "Ahhhh Cold War….I missed you so much. That new iron curtain is gonna be tight.",
            "title_similarity": "0.4964592"
        },
        {
            "id": "i461vyg",
            "score": 61,
            "text": "I come back with more guns, and ships, and so the balance shifts.",
            "title_similarity": "0.3592002"
        },
        {
            "id": "i45zgjg",
            "score": 1236,
            "text": "You gotta do it, but Putin is gonna tell his zombies NATO is preparing to invade Russia.",
            "title_similarity": "0.7742841"
        },
        {
            "id": "i468ujs",
            "score": 13,
            "text": "So, in an attempt to make NATO fuck off, Putin actually just made them stronger and closer to their borders. \n\nMan, it’s just painful how stupid this shit is.",
            "title_similarity": "0.5320133"
        },
        {
            "id": "i46ap19",
            "score": 12,
            "text": "Putin messed up on several axis.  1) destroying the myth of the mighty Russian land army.  If NATO were concerned about a conventional war with Russia, it definitely ain’t now.  2). Solidifying NATO.  Finland and Sweden would be huge additions to the alliance, and provide advantageous geography for the alliance to protect the baltics, which is Putins longer term goal.   3). Exposing what an idiot Donald trump is.",
            "title_similarity": "0.72654057"
        },
        {
            "id": "i46abcd",
            "score": -14,
            "text": "Putin is truly a strategic genius. This once again demonstrates that dictatorships are superior to democracy. Democracies are merely popularity contests by the foolish masses while dictatorships are led by only the most wise and educated among us.",
            "title_similarity": "0.42777866"
        },
        {
            "id": "i46ltou",
            "score": 247,
            "text": "Russia: We dont want Nato military near our border. \n\n*invades border country*\n\nNATO: Puts permanent military force on border\n\nRussia: ....",
            "title_similarity": "0.77588665"
        },
        {
            "id": "i46ou9o",
            "score": 801,
            "text": "So we're still not reading the articles, huh? Outside of Business Insider's predictably exaggerated headline, the truth of what was said is \"We will discuss the possibility of perhaps reinforcing our current assets already stationed on the border with Russia at our meeting in June.\" But don't let me interrupt the WW3 circle jerk.",
            "title_similarity": "0.6110699"
        },
        {
            "id": "i4671kq",
            "score": 174,
            "text": "So now there will be even more NATO troops, and even more countries joining NATO? Hey Putin, played that pretty well!",
            "title_similarity": "0.7220793"
        },
        {
            "id": "i46c8lj",
            "score": 57,
            "text": "Putin's \"eurasianist\" invasion  of Ukraine  has resulted in Russia losing on every single geopolitical security  concern they have. \nExpanded nato membership, more forces on their borders, permanent non-alignment of Ukraine with Russia.",
            "title_similarity": "0.64807093"
        },
        {
            "id": "i46fdpx",
            "score": 107,
            "text": "After seeing all of the horrible videos of what the russians did to ukrainians, I have lost every ounce of respect and dignity to those who support the pro russian narrative. I think that this is not only needed, but encouraged as we need to come together and stop this from happening again.",
            "title_similarity": "0.5161108"
        },
        {
            "id": "i46au8j",
            "score": 66,
            "text": "The west is only as strong as the unity of its governments internally. With the likes of Orban, Le Pen running so closely to Macro, and Trump running again, this presence could be rescinded easily. We need to deal with internal Putinistas if we want this collective defense thing to work.",
            "title_similarity": "0.57590014"
        },
        {
            "id": "i45vqdr",
            "score": 1758,
            "text": "Welp here's a return to the Cold War.",
            "title_similarity": "0.47701305"
        },
        {
            "id": "i45ztdm",
            "score": 1253,
            "text": "Christ sakes, I was really hoping this 1980s nostalgia wave bullshit was over.",
            "title_similarity": "0.334688"
        },
        {
            "id": "i45ve4o",
            "score": 2758,
            "text": "Like mr Mikhail Borisovich Khodorkovsky said: power and brute force is the only language Putin understand. So, on this basis, NATO’s move makes a lot of sense.\nAt this point diplomacy doesn’t work anymore. And it’s fricking scary.",
            "title_similarity": "0.60365343"
        },
        {
            "id": "i45pbrt",
            "score": 6714,
            "text": "I doubt Putin is suicidal enough to invade a NATO member but I guess it sends a nice message that we ain't fucking about anymore.",
            "title_similarity": "0.42355028"
        },
        {
            "id": "i45py2j",
            "score": 19801,
            "text": "Funny how Putin invaded Ukraine to avoid having NATO on his border only to end up with NATO on his border as a result of the invasion...",
            "title_similarity": "0.693356"
        },
        {
            "id": "i45vw9q",
            "score": 13012,
            "text": "Not only on the border with Russia, but also on the border with Belarus.",
            "title_similarity": "0.5015512"
        },
        {
            "id": "i45z4a1",
            "score": 5,
            "text": "The saying - self fullfilling prophecy comes  to mind.",
            "title_similarity": "0.35043404"
        },
        {
            "id": "i464aah",
            "score": 2,
            "text": "Now Russia needs to have a new person and group in charge and attempt the start anew rename Russia",
            "title_similarity": "0.62803364"
        },
        {
            "id": "i464ctt",
            "score": 1,
            "text": "Hey Vlad, is it still going according to the plan?",
            "title_similarity": "0.3141256"
        },
        {
            "id": "i464js1",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i464m8d",
            "score": 2,
            "text": "What about Ukraine?",
            "title_similarity": "0.2514847"
        },
        {
            "id": "i464wj3",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.023929574"
        },
        {
            "id": "i464xt0",
            "score": 7,
            "text": "Putin will lose his shit.",
            "title_similarity": "0.31627133"
        },
        {
            "id": "i4650qh",
            "score": 2,
            "text": "Good about time",
            "title_similarity": "0.029776601"
        },
        {
            "id": "i4654yl",
            "score": 1,
            "text": "I don't think there will be a next time russians attack anyone. But if they do, they will bring out WW2 era equipment I bet.",
            "title_similarity": "0.638494"
        },
        {
            "id": "i465jfx",
            "score": 3,
            "text": "[Resist Russian Aggression // Defend NATO at any cost // Keep the West open and free](https://youtu.be/-YJy6r-ZKlE?t=102)",
            "title_similarity": "0.6046061"
        },
        {
            "id": "i467bpb",
            "score": 4,
            "text": "Wow that's really embarrassing for Putin. I feel like this is gonna set him off even worse now. Shoulda waited to announce this for Ukraines sake lol.",
            "title_similarity": "0.43269002"
        },
        {
            "id": "i4680jx",
            "score": 1,
            "text": "So, ancient rome tactics?",
            "title_similarity": "0.245341"
        },
        {
            "id": "i468rwa",
            "score": 3,
            "text": "Russia: this is the one thing we didn't want to happen",
            "title_similarity": "0.39078563"
        },
        {
            "id": "i4690f0",
            "score": 1,
            "text": "Haha nice",
            "title_similarity": "-0.108996496"
        },
        {
            "id": "i46915s",
            "score": 4,
            "text": "Well, they really don’t have any other choice now do they ?\n\nPutin’s actions have forced this policy..",
            "title_similarity": "0.4144032"
        },
        {
            "id": "i469i2w",
            "score": 1,
            "text": "NATO: You're dun goof'd Russia!",
            "title_similarity": "0.5735275"
        },
        {
            "id": "i469l18",
            "score": 2,
            "text": "I really hope we get a Maginot Line 2: Electric Bugaloo, but like, futuristic Red Alert type shit.",
            "title_similarity": "0.52076864"
        },
        {
            "id": "i469n99",
            "score": 1,
            "text": "Does Russia have a path out of this anymore? Even if Putin is taken off the throne somehow, I can't imagine a path forward for Russia in the next few decades (unless they get the Germany/Japan 1945 Special)",
            "title_similarity": "0.6026866"
        },
        {
            "id": "i469o8c",
            "score": 1,
            "text": "If Russia sees this as a threat they only have themselves to blame",
            "title_similarity": "0.44877452"
        },
        {
            "id": "i46a3q6",
            "score": 1,
            "text": "On my to the Russian border to throw rocks at Nato if they attack and kill Putin it’s a win win!",
            "title_similarity": "0.69824684"
        },
        {
            "id": "i46ab00",
            "score": 1,
            "text": "Great time for a career in the military",
            "title_similarity": "0.38905412"
        },
        {
            "id": "i46ag1s",
            "score": 2,
            "text": "Lol, with the way things are going, will Russia even HAVE a military force in the future. Looks like they are just throwing away equipment and troops at the moment.",
            "title_similarity": "0.6846776"
        },
        {
            "id": "i46aoo6",
            "score": 1,
            "text": "More than likely a small but capable Force meant to hold off Invaders until the main force can fall in. Much like what the US has deployed to places like Korea or even in Europe.",
            "title_similarity": "0.49604183"
        },
        {
            "id": "i46aq42",
            "score": 1,
            "text": "Hopefully this will lead to the relocation of Russian forces and tie them up from being allocated to the front lines in Ukraine.",
            "title_similarity": "0.65654653"
        },
        {
            "id": "i46awvt",
            "score": 2,
            "text": "while i understand the motivations driving this, all i can think about is the enormous ongoing cost on members (but likely defaulting to $$) of permanent troop deployment for something that is more posturing that tactical. \n\nsurely investing a fraction of that cost into early warning and surveillance systems would be better?",
            "title_similarity": "0.51111656"
        },
        {
            "id": "i46bd7t",
            "score": 1,
            "text": "Now Ukraine should form its own ISAF and drive the Russians out then place its own unified forces on its borders.",
            "title_similarity": "0.7441007"
        },
        {
            "id": "i46be7m",
            "score": 1,
            "text": "\nHey /u/yurient,\n\n\nThis is now the top post on reddit. It will be recorded at /r/topofreddit with all the other top posts.",
            "title_similarity": "0.42563096"
        },
        {
            "id": "i46bemk",
            "score": 2,
            "text": "This was announced nearly three weeks ago wtf. March 24, 2022.",
            "title_similarity": "0.2894292"
        },
        {
            "id": "i46bgag",
            "score": 2,
            "text": "In going to rage quit",
            "title_similarity": "0.20324254"
        },
        {
            "id": "i46btk0",
            "score": 2,
            "text": "Man putin did just a great job of securing his border against NATO. Just brilliant strategy.",
            "title_similarity": "0.58711237"
        },
        {
            "id": "i46btk2",
            "score": 2,
            "text": "Hahaha, looks like Ukraine didn’t have to join NATO",
            "title_similarity": "0.38525656"
        },
        {
            "id": "i46by3g",
            "score": 1,
            "text": "Enjoy that May 9th parade Mr. Putler.",
            "title_similarity": "0.21665743"
        },
        {
            "id": "i46c078",
            "score": 3,
            "text": "Prob time to start airlifting those yachts being seized around the world and dropping them onto the Kremlin.",
            "title_similarity": "0.5348518"
        },
        {
            "id": "i46c0ok",
            "score": 2,
            "text": "Peace please!",
            "title_similarity": "-0.046505965"
        },
        {
            "id": "i46c3by",
            "score": 1,
            "text": "How many tanks would it be if they were lined up side by side on the Russian boarder, anyone did the calculation?",
            "title_similarity": "0.5656947"
        },
        {
            "id": "i46c3p7",
            "score": 1,
            "text": "Wag the Dog.",
            "title_similarity": "0.123262905"
        },
        {
            "id": "i46c4b1",
            "score": 2,
            "text": "The mistake was to believe that rusia has common sense. If Europe and the world would have started to build the strong army earlier there would be no horrors that we see now in Ukraine...",
            "title_similarity": "0.56979793"
        },
        {
            "id": "i46c5sh",
            "score": 1,
            "text": "\"Paper Please!\"",
            "title_similarity": "0.024007773"
        },
        {
            "id": "i46cf42",
            "score": 1,
            "text": "They better put it across the entire eastern border of nato. You don’t want Russia going through a neutral country",
            "title_similarity": "0.70182574"
        },
        {
            "id": "i46cf9z",
            "score": 1,
            "text": "Believe it when you see it.",
            "title_similarity": "0.14056063"
        },
        {
            "id": "i46cg0s",
            "score": 1,
            "text": "Stationed in Finland*",
            "title_similarity": "0.36151534"
        },
        {
            "id": "i46cr2q",
            "score": 6,
            "text": "Good Job Pooti. The thing you said was an existential crisis and the reason you told the world you invaded Ukraine over is now the actual reality you will need to live with. Real 4D chess you're playing.",
            "title_similarity": "0.5925318"
        },
        {
            "id": "i46cx38",
            "score": 2,
            "text": "Time for a tax hike : (",
            "title_similarity": "0.28584722"
        },
        {
            "id": "i46dcb3",
            "score": 1,
            "text": "We've had one cold war yes, but what about second cold war.",
            "title_similarity": "0.45284367"
        },
        {
            "id": "i46dekx",
            "score": 2,
            "text": "Arm them with fresh bread and Nutella, and the Russian military will defect.",
            "title_similarity": "0.51496834"
        },
        {
            "id": "i46dhku",
            "score": 1,
            "text": "They should call it The Avengers",
            "title_similarity": "0.37682194"
        },
        {
            "id": "i46dkhx",
            "score": 2,
            "text": "Ok rueski I better not catch you on my side of the border.\nFine comrades I better nyet see you on my side of the border. \nFine\nFine\nThen Russia notices the microwave is on NATO side of the border.\n\nAnd scene",
            "title_similarity": "0.67638004"
        },
        {
            "id": "i46dlr9",
            "score": 2,
            "text": "Party like it's 1959!",
            "title_similarity": "0.21368402"
        },
        {
            "id": "i46dr8g",
            "score": 1,
            "text": "They should call it Chekhov's Army",
            "title_similarity": "0.5253897"
        },
        {
            "id": "i46du5n",
            "score": 1,
            "text": "THERE IT IS BOIIIII",
            "title_similarity": "0.01124073"
        },
        {
            "id": "i46dx4l",
            "score": 2,
            "text": "oMg wW3",
            "title_similarity": "0.047052067"
        },
        {
            "id": "i46ec4f",
            "score": 3,
            "text": "If Russia and its people don’t change, they’ll be treated the same as North Korea. Like a dog in a kennel.",
            "title_similarity": "0.5610617"
        },
        {
            "id": "i46ecia",
            "score": 1,
            "text": "Good they have no Business being in Ukraine",
            "title_similarity": "0.19295928"
        },
        {
            "id": "i46ecws",
            "score": 3,
            "text": "Guys also don’t forget nukes now are everywhere, does anyone have a nuclear bunker?",
            "title_similarity": "0.47024024"
        },
        {
            "id": "i46ehdj",
            "score": 1,
            "text": "Hahaha…good job, Putin",
            "title_similarity": "0.184901"
        },
        {
            "id": "i46eyte",
            "score": 1,
            "text": "A respond from a reaction…",
            "title_similarity": "0.10760875"
        },
        {
            "id": "i46fs6j",
            "score": 1,
            "text": "спасибо, вова\nдоигрались блять",
            "title_similarity": "0.27010846"
        },
        {
            "id": "i46fty0",
            "score": 1,
            "text": "What about current invasion?",
            "title_similarity": "0.34721297"
        },
        {
            "id": "i46fw4d",
            "score": 1,
            "text": "Dem sounds like potential fightin' words!",
            "title_similarity": "0.31834763"
        },
        {
            "id": "i46g3m8",
            "score": 2,
            "text": "We are going to see a really developed war in a few years, may be 1 may 5 maybe 20 but its not gonna be peace.",
            "title_similarity": "0.49860063"
        },
        {
            "id": "i46g59e",
            "score": 1,
            "text": "I don't think Russia will be invading anyone, anytime soon",
            "title_similarity": "0.39744335"
        },
        {
            "id": "i46g935",
            "score": 3,
            "text": "So basically Putin has accomplished the thing he was most afraid of in addition to destroying Russias economy and turning it into a pariah nation. Well done!",
            "title_similarity": "0.5669097"
        },
        {
            "id": "i46ghlw",
            "score": 2,
            "text": "I dunno, maybe install some in Ukraine. That is the border with Russia.",
            "title_similarity": "0.5718601"
        },
        {
            "id": "i46gvni",
            "score": 2,
            "text": "So Russia flew off the rails because of NATO expansion. Their old shitty military has been exposed to the world, their economy is in ruins, and they get a full time NATO force on their border. Bravo Russia, I am not sure how but you have managed to royally fuck yourself.",
            "title_similarity": "0.68770313"
        },
        {
            "id": "i46hl08",
            "score": 1,
            "text": "Counting Russian threats and passive aggressive remarks... Go!",
            "title_similarity": "0.51343256"
        },
        {
            "id": "i46ho3c",
            "score": 2,
            "text": "So no luck for Ukraine\n\nIt is only for future wars",
            "title_similarity": "0.51135147"
        },
        {
            "id": "i46hoy3",
            "score": 1,
            "text": "So, doing the exact same thing Putin did before invading Ukraine? Ironic",
            "title_similarity": "0.587438"
        },
        {
            "id": "i46hpnl",
            "score": 1,
            "text": "Norway is also a NATO country bordering Russia. Not only Estonia and Latvia as stated in the article.",
            "title_similarity": "0.5641501"
        },
        {
            "id": "i46hrgi",
            "score": 1,
            "text": "Seeing how Russia operates a military incursion, is this really necessary?  I get that we’re experiencing a Third Red Scare, but even a delayed response from NATO is more than enough to push back any Russian gains.  \nMaybe it’s because Russian troops are known to rape and kill.  If that’s the reason, I get it.   Not one step back!  Oh, wait, that was Stalin.",
            "title_similarity": "0.64725244"
        },
        {
            "id": "i46hujt",
            "score": 1,
            "text": "I hope they get close enough to piss onto their side of the border. Fuck Putin and his army of pathetic cowards.",
            "title_similarity": "0.52591944"
        },
        {
            "id": "i46hwxm",
            "score": 1,
            "text": "Stop hitting yourself russia baaahaha!",
            "title_similarity": "0.4254207"
        },
        {
            "id": "i46iac7",
            "score": 3,
            "text": "So the very thing Putin was apparently seeking to prevent - NATO on his doorstep en masse - has been all but assured by his actions. One of the greatest miscalculations in history.",
            "title_similarity": "0.6017047"
        },
        {
            "id": "i46iccc",
            "score": 2,
            "text": "I have a bad feeling about this. \n\nHelp me Obi-Wan Kenobi, you’re my only hope.",
            "title_similarity": "0.19429828"
        },
        {
            "id": "i46idr7",
            "score": 3,
            "text": "Putin wanted NATO to back off its borders, the opposite happened lmao",
            "title_similarity": "0.5498148"
        },
        {
            "id": "i46iiue",
            "score": 2,
            "text": "*”Hey NATO, don’t make me invade you guys because of borders like I did to Ukraine. Seriously, don’t make me come over there so I can get my ass kicked again!”*\n-Putin",
            "title_similarity": "0.570295"
        },
        {
            "id": "i46ikmm",
            "score": 2,
            "text": "\"Why would we want a world without Russia?\" - Putin",
            "title_similarity": "0.51030505"
        },
        {
            "id": "i46ilds",
            "score": 4,
            "text": "Russia really are the kings of Self Fulfilling Prophecy.\n\nBuncha dummies couldn't see that NATO was dissolving, so they reinvigorated them lol.",
            "title_similarity": "0.5961043"
        },
        {
            "id": "i46in5a",
            "score": 4,
            "text": "Kinda funny. Putin wanted this to never happen yet he ends up being the catalyst that makes it happen.",
            "title_similarity": "0.48700905"
        },
        {
            "id": "i46iofc",
            "score": 3,
            "text": "This is a power move by NATO and I like it. Hopefully it doesn't cause this to be a excuse to retaliate on NATO.",
            "title_similarity": "0.44895363"
        },
        {
            "id": "i46jivr",
            "score": 1,
            "text": "Nothing like stationary targets ripe for the pickings.",
            "title_similarity": "0.052126538"
        },
        {
            "id": "i46jrci",
            "score": 1,
            "text": "Russias reply:azom bombs!",
            "title_similarity": "0.5549122"
        },
        {
            "id": "i46jrfc",
            "score": 1,
            "text": "Lol, pretty much the opposite of what Russia wanted",
            "title_similarity": "0.20827281"
        },
        {
            "id": "i46jvwj",
            "score": 1,
            "text": "Ww3 nice",
            "title_similarity": "-0.042988025"
        },
        {
            "id": "i46k2jh",
            "score": 2,
            "text": "I realize this is a good thing, but couldn’t Russia propaganda use this to aid their own agenda by pushing it as NATO is making moves against them? Everything is on such a slippery slope these days, I don’t like it lol",
            "title_similarity": "0.5799126"
        },
        {
            "id": "i46k8m7",
            "score": 2,
            "text": "Ahhhhhhhhh that's what has been brewing... Idk how to feel about this.",
            "title_similarity": "0.23241141"
        },
        {
            "id": "i46ki1r",
            "score": 1,
            "text": "Putin punching the air right now.",
            "title_similarity": "0.38061088"
        },
        {
            "id": "i46knhp",
            "score": 1,
            "text": "WW3 inc",
            "title_similarity": "0.051777415"
        },
        {
            "id": "i46koe8",
            "score": 1,
            "text": "At this point, it seems more and more like the rest of the world is yelling, \"fuck around and find out\" at Putin.",
            "title_similarity": "0.52659976"
        },
        {
            "id": "i46kq3f",
            "score": 1,
            "text": "how high is the probability that military service in europe will be brought back?",
            "title_similarity": "0.49736303"
        },
        {
            "id": "i46kqy1",
            "score": 1,
            "text": "We will call them the Nights Watch",
            "title_similarity": "0.30543637"
        },
        {
            "id": "i46kwuy",
            "score": 2,
            "text": "So sad that we have to divert human resources, energy, life and potential to this instead of improving our lives. We need a gamma ray to just end this misery.",
            "title_similarity": "0.38458332"
        },
        {
            "id": "i46l85n",
            "score": 3,
            "text": "Putler done fucked up.",
            "title_similarity": "0.03128421"
        },
        {
            "id": "i46l9pd",
            "score": 1,
            "text": "Big brain move, Putin. Now we're ready to destroy your army",
            "title_similarity": "0.6090022"
        },
        {
            "id": "i46leop",
            "score": 1,
            "text": "How long until Putin's empty threat about this come out? Can he seriously be taken as the threat people thought he was after this so far failed Ukraine invasion?",
            "title_similarity": "0.5357082"
        },
        {
            "id": "i46lj2a",
            "score": 1,
            "text": "One step closer to ww3 yay 😒",
            "title_similarity": "0.20538276"
        },
        {
            "id": "i46lk51",
            "score": 2,
            "text": "This sounds like the bad kind of escalation",
            "title_similarity": "0.11615725"
        },
        {
            "id": "i46lsa6",
            "score": 1,
            "text": "I’m sure all of the green houses produced from these militaries will help us reach that goal that all those nations signed….",
            "title_similarity": "0.47588992"
        },
        {
            "id": "i46m4vk",
            "score": 1,
            "text": "Hopefully it will include the Arctic as well!",
            "title_similarity": "0.4421977"
        },
        {
            "id": "i46m7xk",
            "score": 2,
            "text": "Oh fuck iron curtain",
            "title_similarity": "0.18890196"
        },
        {
            "id": "i46m8h7",
            "score": 2,
            "text": "I thought it said peppermint. Watch out, boys. The candy kingdom is coming for that ass",
            "title_similarity": "0.26967323"
        },
        {
            "id": "i46mgrv",
            "score": 1,
            "text": "\"Lukewarm war\"",
            "title_similarity": "0.13358437"
        },
        {
            "id": "i46mior",
            "score": 2,
            "text": "What a waste of resources.   We will never get away from the military industrial complex.",
            "title_similarity": "0.48078537"
        },
        {
            "id": "i46mja0",
            "score": 1,
            "text": "Excellent",
            "title_similarity": "-0.051827468"
        },
        {
            "id": "i46mjq2",
            "score": 1,
            "text": "Hey , look, the next justification for extreme military spending. The oligarchs from both sides are laughing in their money piles. How much will weapon stocks go up now? This could go on for years! That equipment is obsolete now you see! Buy buy buy!!!",
            "title_similarity": "0.49040675"
        },
        {
            "id": "i46mn0s",
            "score": 3,
            "text": "Countries are learning the same lessons they did from Iraq and Libya: if you don't have nukes, or guarantees from a nuclear power to defend you written into *their* laws, you are always at risk of the US, Russia, UK or PRC kicking in the door like it's a swat raid.",
            "title_similarity": "0.6626841"
        },
        {
            "id": "i46mo0h",
            "score": 1,
            "text": "Wonder if they will deploy in Norway?",
            "title_similarity": "0.38501048"
        },
        {
            "id": "i46n2ee",
            "score": 2,
            "text": "Well it's very optimistic that NATO isn't expecting that kind of war to immediately turn nuclear",
            "title_similarity": "0.5529834"
        },
        {
            "id": "i46nfjv",
            "score": 2,
            "text": "I smell a World War coming.....",
            "title_similarity": "0.4987182"
        },
        {
            "id": "i46nj1z",
            "score": 1,
            "text": "How much does this cost? How does this compare to embargoing Russian oil and natural gas? Are these apples and oranges? It just seems to me that an energy embargo would be so much more effective in the short term, even if not sustainable past the short term with current infrastructure so reliant on fossil fuels",
            "title_similarity": "0.41901398"
        },
        {
            "id": "i46njj1",
            "score": 2,
            "text": "Isn’t this how WWI started?",
            "title_similarity": "0.14615962"
        },
        {
            "id": "i46nkff",
            "score": 2,
            "text": "oh fuck",
            "title_similarity": "-0.015565019"
        },
        {
            "id": "i46nl0c",
            "score": 2,
            "text": "Wish I bought defence stocks in 2021… this invasion has been a godsend to the global weapons industry.",
            "title_similarity": "0.65971005"
        },
        {
            "id": "i46nscd",
            "score": 2,
            "text": "A different type of wall….We’ve seen this before. How many years until this will fall?",
            "title_similarity": "0.27152884"
        },
        {
            "id": "i46nsev",
            "score": 3,
            "text": "Seems like the Ukraine thing is backfiring spectacularly for Putin.",
            "title_similarity": "0.5307359"
        },
        {
            "id": "i46o7mr",
            "score": 2,
            "text": "This has to be one of the biggest backfires in history.",
            "title_similarity": "0.27005577"
        },
        {
            "id": "i46o8xn",
            "score": 1,
            "text": "Combat the current one.",
            "title_similarity": "0.29153156"
        },
        {
            "id": "i46ob6w",
            "score": 1,
            "text": "Great success of pootin no doubt.",
            "title_similarity": "0.107758485"
        },
        {
            "id": "i46od3p",
            "score": 1,
            "text": "Consider this action as Phase One to a strong potential for NATO vs Russia and ITS allies.",
            "title_similarity": "0.7730953"
        },
        {
            "id": "i46ogsj",
            "score": 1,
            "text": "It'll be 25 years before Russia has the armaments/soldiers to invade anyone again.....",
            "title_similarity": "0.5255836"
        },
        {
            "id": "i46ok2d",
            "score": 1,
            "text": "OR...Putin dies and Russia becomes sane again....",
            "title_similarity": "0.4300343"
        },
        {
            "id": "i46om3u",
            "score": 1,
            "text": "Mission accomplished, Vlad, if you were hoping for actual militarization of your border with an enemy force.",
            "title_similarity": "0.66225684"
        },
        {
            "id": "i46on4p",
            "score": 1,
            "text": "Feel free to put it a 100 miles into Russia to show them how it feels",
            "title_similarity": "0.56986296"
        },
        {
            "id": "i46oo29",
            "score": 2,
            "text": "On what border?",
            "title_similarity": "0.13537066"
        },
        {
            "id": "i46osqv",
            "score": 1,
            "text": "That should deescalate the tensions.",
            "title_similarity": "0.13767974"
        },
        {
            "id": "i46ot8x",
            "score": 1,
            "text": "As part of this, he should have also stated that as long as long as Vladimir Putin is in power these forces will remain. Need to really point at Putin as the complete cause of this. Anything and everything to try to push others within the Russian government and/or people to try to get rid of Putin.",
            "title_similarity": "0.71849245"
        },
        {
            "id": "i46p8o0",
            "score": 1,
            "text": "Why why did you have to post that picture",
            "title_similarity": "0.21469201"
        },
        {
            "id": "i46paln",
            "score": 2,
            "text": "Good ol Russia,  not wanting NATO then getting a shit load more of NATO.",
            "title_similarity": "0.6384434"
        },
        {
            "id": "i46pfcl",
            "score": 1,
            "text": "IRL Civ 5. \n\nGonna download it and play US/Europe Vs Russia.",
            "title_similarity": "0.5614218"
        },
        {
            "id": "i46pjjd",
            "score": 1,
            "text": "I definitely think he got overconfident with respect to his military’s capabilities, but I still think there was a logic to his decision to invade.\n\nPutin faced huge protests in 2012 that unsettled him and I think caused him to seek to keep Russia in a war posture to generate swells of nationalism that could keep him in power. War, conflict and the narrative that Russia is under existential threat are his lifeline (and happen to be what propelled him to power in the first place).\n\nIt’s like the movie Speed; if the bus slows down under 50mph he dies. Invading Ukraine was reckless but he didn’t have a choice. He h",
            "title_similarity": "0.6578455"
        },
        {
            "id": "i46ppak",
            "score": 1,
            "text": "What does that look like? A how many 1000s of miles DMZ like we have between the Koreas?",
            "title_similarity": "0.28956044"
        },
        {
            "id": "i46pq8g",
            "score": 1,
            "text": "After seeing how poorly Russia performed in Ukraine NATO now feels confident in making moves like this.",
            "title_similarity": "0.5113447"
        },
        {
            "id": "i46psxj",
            "score": 3,
            "text": "so much money wasted on ONE small ego'd man",
            "title_similarity": "0.0066668782"
        },
        {
            "id": "i46puch",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.023929574"
        },
        {
            "id": "i46q0c0",
            "score": 1,
            "text": "Wait? Which border? In Poland or in Ukraine?",
            "title_similarity": "0.31636882"
        },
        {
            "id": "i46q8kl",
            "score": 3,
            "text": "Good job Putin. When Finland joins NATO St. Petersburg will be closer and attacked from two sides if war comes.",
            "title_similarity": "0.74276716"
        },
        {
            "id": "i46qkq9",
            "score": 3,
            "text": "Russia can't even organize their sizeable military to properly attack Ukraine, how the hell would they invade Europe?",
            "title_similarity": "0.5636836"
        },
        {
            "id": "i46qmn8",
            "score": 1,
            "text": "Everything Russia didn’t want to happen now has because of its actions.\n\nPutin asking for an F in chat right now.",
            "title_similarity": "0.61348987"
        },
        {
            "id": "i46qrfa",
            "score": 2,
            "text": "🤬",
            "title_similarity": "-0.09277895"
        },
        {
            "id": "i46qyqf",
            "score": 1,
            "text": "That’s what Russia would say if they were planning to invade!",
            "title_similarity": "0.7199169"
        },
        {
            "id": "i46qzp9",
            "score": 1,
            "text": "We’ve had a full size army in the Baltics for twenty years.",
            "title_similarity": "0.38743064"
        },
        {
            "id": "i46r08b",
            "score": 1,
            "text": "Until Trump comes back and fucks it all up royally. Putins next plan.",
            "title_similarity": "0.60857135"
        },
        {
            "id": "i46r204",
            "score": 1,
            "text": "NATO should save Russians from Putin, and bring them real democracy.",
            "title_similarity": "0.6560658"
        },
        {
            "id": "i46r2be",
            "score": 2,
            "text": "Defense contractors popping corks to that.",
            "title_similarity": "0.37213743"
        },
        {
            "id": "i46r6eq",
            "score": 1,
            "text": "Why can't we have a special military operation to stop them at the Ukraine border so that they can't come any farther this way",
            "title_similarity": "0.6749548"
        },
        {
            "id": "i46r7i0",
            "score": 1,
            "text": "But fuck helping Ukraine, which has hundreds of civilians getting killed every day. I hate bureaucracy.",
            "title_similarity": "0.3743877"
        },
        {
            "id": "i46rnn8",
            "score": 1,
            "text": "anyone else remember the 'pivot to asia' lmao",
            "title_similarity": "0.19692312"
        },
        {
            "id": "i46rt19",
            "score": 7,
            "text": "Russia: \"We are going to invade Ukraine in order to stop NATO from emassing troops along our borders!\"  \nNATO: \"You've shown we need to protect our NATO allies from reckless invasion and human rights violations, we are now placing permanent forces along your borders.\"  \nRussia: *Surprised Pikachu face*",
            "title_similarity": "0.8490498"
        },
        {
            "id": "i46rto1",
            "score": 1,
            "text": "Cuban Missile Crisis  2.0",
            "title_similarity": "0.2589702"
        },
        {
            "id": "i46rul7",
            "score": 1,
            "text": "Hey. Don't worry about these troops. It's just a military training...",
            "title_similarity": "0.39716262"
        },
        {
            "id": "i46s2nd",
            "score": 1,
            "text": "This feels quite WW1 like, where two massive military powers faced off, inevitably they had a war just for the sake of it",
            "title_similarity": "0.6032305"
        },
        {
            "id": "i46s6bn",
            "score": 3,
            "text": "Sad that this is necessary",
            "title_similarity": "0.020672195"
        },
        {
            "id": "i46sff5",
            "score": 1,
            "text": "Braking news!!!! Mongolia joins NATO",
            "title_similarity": "0.64486504"
        },
        {
            "id": "i46sfri",
            "score": 1,
            "text": "Gearing up for the next big war.",
            "title_similarity": "0.58767927"
        },
        {
            "id": "i46shwj",
            "score": 1,
            "text": "And awaaaayyyyy we go!",
            "title_similarity": "0.11357342"
        },
        {
            "id": "i46soow",
            "score": 1,
            "text": "I understand that the Maginot line exposed the doctrine of fixed bases as flawed.  And yet, there needs to be bases of operation near the borders of concern. They need mobile drone-support vehicles that can launch at a moments notice, and then remain mobile to avoid the expected retaliation by the invaders.",
            "title_similarity": "0.5881067"
        },
        {
            "id": "i46sqbe",
            "score": 1,
            "text": "On ADSB X you see the big C17 and the likes going back and forth between Poland, Romania, Germany and Britain non stop. Also Stratotankers, avacs, drones, the whole nine yards.",
            "title_similarity": "0.4530297"
        },
        {
            "id": "i46sr8v",
            "score": 1,
            "text": "Well the new cold war has started.",
            "title_similarity": "0.5424821"
        },
        {
            "id": "i46su47",
            "score": 1,
            "text": "We all know that was the plan all along.",
            "title_similarity": "0.24395931"
        },
        {
            "id": "i46swx3",
            "score": 1,
            "text": "Yes🤘",
            "title_similarity": "-0.09277895"
        },
        {
            "id": "i46t45l",
            "score": 1,
            "text": "I wonder if the Germans want us back now? My 2 cents would be to set up a SOFA with Poland and forward deploy there.",
            "title_similarity": "0.49357304"
        },
        {
            "id": "i46t6tv",
            "score": 1,
            "text": "Wonderful, more money for the defense sectors to absorb!",
            "title_similarity": "0.4144766"
        },
        {
            "id": "i46tek6",
            "score": 3,
            "text": "$50 says within a year and a half Putin will launch nukes at NATO borders saying NATO was about to invade Russia.",
            "title_similarity": "0.7229308"
        },
        {
            "id": "i46teu1",
            "score": 1,
            "text": "New Cold War era..",
            "title_similarity": "0.4470197"
        },
        {
            "id": "i46th4z",
            "score": 1,
            "text": "\" wTf nO wOnDeR pUtIn iS sO dEfEnSiVe usa eeevil\"",
            "title_similarity": "0.392299"
        },
        {
            "id": "i46tilb",
            "score": 1,
            "text": "Sweet. Cold War 2: Electric Boom-aloo",
            "title_similarity": "0.445263"
        },
        {
            "id": "i46u1b3",
            "score": 1,
            "text": "Maybe they should build a wall.",
            "title_similarity": "0.31037334"
        },
        {
            "id": "i46uh56",
            "score": 1,
            "text": "Iron Curtain 2.0",
            "title_similarity": "0.2056529"
        },
        {
            "id": "i46um2v",
            "score": 4,
            "text": "It's saber rattling; Russia's not going to invade a NATO member. Russia only felt comfortable invading Ukraine because it *wasn't* NATO... and because the West did nothing when they annexed Crimea.",
            "title_similarity": "0.6000794"
        },
        {
            "id": "i46unvr",
            "score": 1,
            "text": "Cold War redux",
            "title_similarity": "0.40296125"
        },
        {
            "id": "i46v8kc",
            "score": 1,
            "text": "So is this basically like a DMZ between North and South Korea but this one is between Russia and Nato?",
            "title_similarity": "0.60559416"
        },
        {
            "id": "i46vayf",
            "score": 1,
            "text": "The longer this war goes the worse it is for Putin. The more neutral states start chosing sides. More sanctions. More burnt up equipment. More unrest home and abroad. \n\nWhy doesn't he get the hint?",
            "title_similarity": "0.50644773"
        },
        {
            "id": "i46vn5e",
            "score": 1,
            "text": "a full-scale military force?\n\nwhat does that mean?\n\nall 3.5 million nato military personnel are on the job?",
            "title_similarity": "0.5171727"
        },
        {
            "id": "i46vwg1",
            "score": 2,
            "text": "Just what Russia wanted!",
            "title_similarity": "0.44229212"
        },
        {
            "id": "i46wfq7",
            "score": 1,
            "text": "Oh shit. Here we go!",
            "title_similarity": "0.05446457"
        },
        {
            "id": "i46whoh",
            "score": 2,
            "text": "Well NATO are definitely on your borders now, Russia",
            "title_similarity": "0.74252343"
        },
        {
            "id": "i46wmt3",
            "score": 3,
            "text": "We’ve returned to day one post-WWII. Love how world governments continue to do the same stupidity over and over again.",
            "title_similarity": "0.4680169"
        },
        {
            "id": "i46wn36",
            "score": 1,
            "text": "You are the Leader of a Country and aggressively take over parts of other Countrys. The Alliance of Countrys made up of the most Powerfull nations on Earth dont really Sanction you because of it but you fear that they will send a bigger Military presence to your Border with them. What could you do to prevent that? A)Give the parts of Land that you took back. B) Be less Agressive.\nC)Step down for the Good of you Country and People. D) Start an Imvasion and use Geneva Convention as a Check list.",
            "title_similarity": "0.5985413"
        },
        {
            "id": "i46wydb",
            "score": 3,
            "text": "Putin poked the sleeping dog.",
            "title_similarity": "0.16397959"
        },
        {
            "id": "i46xlxy",
            "score": 2,
            "text": "NATO doesn’t have borders and is a defence force only",
            "title_similarity": "0.33122292"
        },
        {
            "id": "i46xo8u",
            "score": 1,
            "text": "The iron curtain has descended upon Europe once again",
            "title_similarity": "0.45654404"
        },
        {
            "id": "i46xujh",
            "score": 3,
            "text": "Should do it as well on the belarus border",
            "title_similarity": "0.41539276"
        },
        {
            "id": "i46y0yq",
            "score": 1,
            "text": "Gib 2 heavy brigades to Poland 2 heavy brigades to baltics, 1 heavy brigade to Finland and 1 heavy brigade to Romania and we are set.",
            "title_similarity": "0.54235756"
        },
        {
            "id": "i46y9c6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.03449062"
        },
        {
            "id": "i46ybzl",
            "score": 1,
            "text": "Galaxy brain move.",
            "title_similarity": "0.103658974"
        },
        {
            "id": "i46yq81",
            "score": 2,
            "text": "A full scale military? For how long? I wonder how much that’ll cost… much needed, regardless",
            "title_similarity": "0.47171658"
        },
        {
            "id": "i46yqxz",
            "score": 1,
            "text": "Russias only hard core defense at this point is their arsenal of Nukes. Their military is a joke, and would get flatten like a pancake if they even tried to do something stupid with a NATO country. \n\nLike many have said Putin wanted NATO far away and he’s just giving us more reasons to be even closer. \n\nWhat’s frightening even with this great news, who knows who stable Putin really is, Kremlin had to report the losses of the war to its people for the first time. Putin is probably embarrassed and outraged at this point",
            "title_similarity": "0.63822377"
        },
        {
            "id": "i46z52d",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.023929574"
        },
        {
            "id": "i46z63v",
            "score": 3,
            "text": "This seems like the opposite of the outcome Putin would have hoped for.",
            "title_similarity": "0.23630214"
        },
        {
            "id": "i46zqzf",
            "score": 1,
            "text": "The future is nigh…",
            "title_similarity": "0.15146494"
        },
        {
            "id": "i46zzjr",
            "score": 2,
            "text": "What would happen; If the EU did deploy troops to Ukraine, to defend the civilian population and expel the invaders, to their own borders. But not to advanced to within say 50 miles (80km) of Russia’s border. Would it really go Nuclear? Or would it just become a stand off for the next x number of years until there is a regime change? Would Russia keep sending oil and gas because if they don’t their populace would start starving etc and that would likely bring about Putin’s demise anyway?",
            "title_similarity": "0.66595495"
        },
        {
            "id": "i47024w",
            "score": 2,
            "text": "Freedom!!!!!!",
            "title_similarity": "0.06002909"
        },
        {
            "id": "i470geh",
            "score": 5,
            "text": "Everything Putin didn’t want, he managed to accomplish as a result of this. Well done to him.",
            "title_similarity": "0.37600505"
        },
        {
            "id": "i470k1q",
            "score": 5,
            "text": "One of the biggest failures in modern history. For a country that prides itself in its military they are awful. Only going to get worse for Russia though",
            "title_similarity": "0.42187852"
        },
        {
            "id": "i471oym",
            "score": 1,
            "text": "It’s about time….",
            "title_similarity": "0.08122018"
        },
        {
            "id": "i471tlp",
            "score": 1,
            "text": "But what about the current one?",
            "title_similarity": "0.073955216"
        },
        {
            "id": "i4723js",
            "score": 3,
            "text": "Sounds expensive.",
            "title_similarity": "0.0018923543"
        },
        {
            "id": "i472a3c",
            "score": 2,
            "text": "Putin must feel pretty silly right now having invaded Ukraine so he wouldn't have NATO on his border.",
            "title_similarity": "0.573738"
        },
        {
            "id": "i472skf",
            "score": 6,
            "text": "As an Polish I have to admit it fills strange to be on the other side during cold War.",
            "title_similarity": "0.4098506"
        },
        {
            "id": "i472tm9",
            "score": 1,
            "text": "The pressure on Putin is mounting. What will he do?",
            "title_similarity": "0.50959593"
        },
        {
            "id": "i472wck",
            "score": 2,
            "text": "Great. The world turns into a powder keg just when my life gets started. Could we just not do this please?  Thanks.",
            "title_similarity": "0.34720647"
        },
        {
            "id": "i4738rh",
            "score": 1,
            "text": "ok lol",
            "title_similarity": "-0.08985986"
        },
        {
            "id": "i473i9b",
            "score": 2,
            "text": "Well done Russia.",
            "title_similarity": "0.39878637"
        },
        {
            "id": "i473u2v",
            "score": 1,
            "text": "Oceania, Eastasia, Eurasia.",
            "title_similarity": "0.22093624"
        },
        {
            "id": "i473vmm",
            "score": 2,
            "text": "Cold War 2.0?",
            "title_similarity": "0.36894482"
        },
        {
            "id": "i474hnt",
            "score": 2,
            "text": "permanent? oh fuck…",
            "title_similarity": "0.09081057"
        },
        {
            "id": "i474rbv",
            "score": 2,
            "text": "Happy new cold war day :)",
            "title_similarity": "0.44115978"
        },
        {
            "id": "i4755gn",
            "score": 3,
            "text": "This 80s nostalgia fad is getting out of hand.",
            "title_similarity": "0.10177016"
        },
        {
            "id": "i475nm7",
            "score": 3,
            "text": "RIP to my fellow brothers in arms who have to sit in the field on the border with no WiFi or bathrooms while the people who sent them there get to go home every night and sleep peacefully",
            "title_similarity": "0.35734922"
        },
        {
            "id": "i475of8",
            "score": 2,
            "text": "This is going to be fun",
            "title_similarity": "0.013663422"
        },
        {
            "id": "i475uzz",
            "score": 1,
            "text": "Putin isn’t going to like that.",
            "title_similarity": "0.21823049"
        },
        {
            "id": "i475zim",
            "score": 3,
            "text": "Russia: we don't want NATO any closer, so we will take Ukraine\nNato: comes close to Russia bcs of that...\n\nWell played Vladimir",
            "title_similarity": "0.66346896"
        },
        {
            "id": "i477ba2",
            "score": 1,
            "text": "Literally the only thing Putin understands.",
            "title_similarity": "0.23950168"
        },
        {
            "id": "i477t5q",
            "score": 1,
            "text": "All I can picture is the video of hitler screaming at people but it’s Putin instead",
            "title_similarity": "0.46053818"
        },
        {
            "id": "i4782z5",
            "score": 1,
            "text": " It's high time for a new James Bond movie involving a Russian oligarch I'd say.",
            "title_similarity": "0.67410266"
        },
        {
            "id": "i478ja5",
            "score": 1,
            "text": "Deploy NATO properties in areas where Russia is unable to checkmate.",
            "title_similarity": "0.6017786"
        },
        {
            "id": "i478qcp",
            "score": 4,
            "text": "Combat ready Europe is one of the scariest fucking this in this planet. Get ready for some wild times",
            "title_similarity": "0.45246333"
        },
        {
            "id": "i478xuy",
            "score": 2,
            "text": "Prime example of playing yourself.",
            "title_similarity": "0.15637621"
        },
        {
            "id": "i479dh2",
            "score": 3,
            "text": "Raytheon, General Dynamics, Boeing, and Lockheed Martin just creamed their pants.",
            "title_similarity": "0.46733183"
        },
        {
            "id": "i479qxt",
            "score": 2,
            "text": "Good. Tyrants only understand power.",
            "title_similarity": "0.21719247"
        },
        {
            "id": "i479va9",
            "score": 1,
            "text": "Oh.",
            "title_similarity": "-0.10379811"
        },
        {
            "id": "i47a0mi",
            "score": 2,
            "text": "Haha, this is just funny to me because this is probably the kind of thing that made Putin want to invade Ukraine in the first place, to put a bigger buffer between Russia and NATO. \n\nI guess he found his destiny on the road to avoid it.",
            "title_similarity": "0.66581273"
        },
        {
            "id": "i47afvj",
            "score": 1,
            "text": "Uh oh",
            "title_similarity": "-0.11159464"
        },
        {
            "id": "i47alsx",
            "score": 1,
            "text": "Isn’t that kinda the whole point of NATO",
            "title_similarity": "0.44897205"
        },
        {
            "id": "i47ardy",
            "score": 1,
            "text": "THAT IS DETERRENT!!!",
            "title_similarity": "0.20968726"
        },
        {
            "id": "i47b6zm",
            "score": 4,
            "text": "A horrible tragedy of war, loss of human lives, destroyed cities by a psychopath dictator. It does renew & heal my view of what my country has generally stood for from day one. We are not perfect but still stand against evil and aggression. The recent barrage of social media zeroing in on all of the U. S. negatives along with the cunning propaganda and disinformation about our country has negatively impacted the U. S. reputation for many. Our clear stand against Putin and his aggression is a breath of fresh air. Wonder where we would be if Trump had won re election?",
            "title_similarity": "0.519756"
        },
        {
            "id": "i47cxs0",
            "score": 4,
            "text": "Read - ww3 is coming. We’re positioning troops.",
            "title_similarity": "0.4642946"
        },
        {
            "id": "i47d8yf",
            "score": 1,
            "text": "Is this at all what Putin wanted? I fail to see any strategic “win” that resulted from invading Ukraine.",
            "title_similarity": "0.42779255"
        },
        {
            "id": "i47dckv",
            "score": 2,
            "text": "Russia will also have more worries if it defaults on its debt!  China will own them big time!  Putin's little war has created him more worries than he ever figured and made Ukraine the next most favoured country!",
            "title_similarity": "0.5776318"
        },
        {
            "id": "i47ddnd",
            "score": 2,
            "text": "Lmfao poor Russian poosies",
            "title_similarity": "0.21176243"
        },
        {
            "id": "i47dk14",
            "score": 4,
            "text": "Look what you made us do, Putin. Happy now with your anti-NATO paranoia?",
            "title_similarity": "0.48032352"
        },
        {
            "id": "i47drv8",
            "score": 1,
            "text": "Good idea",
            "title_similarity": "-0.024952626"
        },
        {
            "id": "i47dtlh",
            "score": 2,
            "text": "This is going to make history.",
            "title_similarity": "0.24737315"
        },
        {
            "id": "i47e7wn",
            "score": 2,
            "text": "Bout time",
            "title_similarity": "0.056550425"
        },
        {
            "id": "i47edfi",
            "score": 3,
            "text": "Putin is the equivalent of \"better to remain quiet and appear a fool, than speak and remove all doubt\". For years we had a massively overhyped opinion of the russian military which, let's be honest, was basically stalled within the first couple weeks of this invasion.",
            "title_similarity": "0.56481516"
        },
        {
            "id": "i47ezb7",
            "score": 3,
            "text": "Fucka the Russia and fucka the Belarus, you shithole countries can sucka my nuts.",
            "title_similarity": "0.40104988"
        },
        {
            "id": "i47fac4",
            "score": 1,
            "text": "Russia is bluffing. They aint gonna do shit…it’s suicide.",
            "title_similarity": "0.42148906"
        },
        {
            "id": "i47fcy1",
            "score": 5,
            "text": "Damn. That’s exactly what he didn’t want. Even worse than just NATO troops in Ukraine",
            "title_similarity": "0.3823957"
        },
        {
            "id": "i47frxv",
            "score": 1,
            "text": "Woah",
            "title_similarity": "-0.12520343"
        },
        {
            "id": "i47fu8q",
            "score": 2,
            "text": "This will tie up a significant amount of Russian troops and equipment, guarding the Russian side of the border.",
            "title_similarity": "0.72860485"
        },
        {
            "id": "i47g8hy",
            "score": 3,
            "text": "Just call it a “special military training operation”.",
            "title_similarity": "0.39248276"
        },
        {
            "id": "i47ghph",
            "score": 3,
            "text": "Bad signs",
            "title_similarity": "-0.045269296"
        },
        {
            "id": "i47hd6i",
            "score": 2,
            "text": "Invasion of Ukraine turned even relatively pro-Russian Ukrainians anti-Russia, will bring NATO bases to Russias borders, and may enlarge the alliance to Finland. This is an epic blunder by Putin",
            "title_similarity": "0.7013066"
        },
        {
            "id": "i47he57",
            "score": 3,
            "text": "Not much point of a military if the earth is turned into glass.....",
            "title_similarity": "0.15650336"
        },
        {
            "id": "i47hes2",
            "score": 1,
            "text": "Alright blue hats, do your duty to the school. Piertotum Locomotor...",
            "title_similarity": "0.36804557"
        },
        {
            "id": "i47hgbr",
            "score": 1,
            "text": "Military exercise...",
            "title_similarity": "0.33664042"
        },
        {
            "id": "i47hu9f",
            "score": 2,
            "text": "Raytheon is like Heck yeah! Constant stream of taxpayer money.",
            "title_similarity": "0.27849558"
        },
        {
            "id": "i47hvhr",
            "score": 1,
            "text": "Sounds expensive.",
            "title_similarity": "0.0018923543"
        },
        {
            "id": "i47hxwm",
            "score": 1,
            "text": "Fuck yeah.",
            "title_similarity": "-0.021594543"
        },
        {
            "id": "i47i2ke",
            "score": 1,
            "text": "Maginot line 2 just dropped",
            "title_similarity": "0.15218139"
        },
        {
            "id": "i47i4td",
            "score": 1,
            "text": "Damn these dudes want a war",
            "title_similarity": "0.42248935"
        },
        {
            "id": "i47ilax",
            "score": 1,
            "text": "Here come the chemical weapons",
            "title_similarity": "0.33416277"
        },
        {
            "id": "i47iueb",
            "score": 1,
            "text": "*slow clap* Bravo, Vladdy. Bravo. I'm impressed. Failing like that, it takes real talent.",
            "title_similarity": "0.15854849"
        },
        {
            "id": "i47ixqk",
            "score": 2,
            "text": "R/leopardsatemyface \"country that starts war to push NATO back gets NATO at doorstep in response\"",
            "title_similarity": "0.71113026"
        },
        {
            "id": "i47j3q8",
            "score": 1,
            "text": "Pretty sure they just need some ukrainian farmer. And with the incompetence of the Russian communication structure, putin will probably be told that it is a fully functional army.",
            "title_similarity": "0.66751826"
        },
        {
            "id": "i47j91x",
            "score": 1,
            "text": "I think this has been a long time goal of NATO. There was a war game run in 2014 that showed NATO would probably be caught with their pants down if Russia invaded. That was kind of the goal of the war game. It got leaked to the press in 2016. I don't know the politics of it but it seemed to me at the time that it was a play by NATO who was worried about Obama's shift in focus to China to keep themselves relevant. It had been leaked with the assumption that Clinton would win and the focus would continue to shift to China.\n\nBut after Trump won the fight wasn't about a focus being on one theater over the other, but the actual continued existence of NATO. \n\nSo, I think this was a goal of some NATO countries (more the Baltic states, Poland, and the UK than Germany) and it looks like it turned out to be somewhat correct. However, the Obama/Biden perspective that China is a significant emerging threat isn't wrong. \n\nI think NATO and the US lucked out somewhat that Russia is so inept. It also showed that there's going to be some tension between NATO policy towards Russia and US and it's various Pacific allies policy with China. India is the big example of that now. \n\nHere's a link to the war game synopsis if anyone wants it.  \nhttps://www.rand.org/content/dam/rand/pubs/research\\_reports/RR1200/RR1253/RAND\\_RR1253.pdf",
            "title_similarity": "0.64634967"
        },
        {
            "id": "i47jdqr",
            "score": 2,
            "text": "Does this include Armenia-Turkey border and Hatay? Both very close to major Russian bases.",
            "title_similarity": "0.6162283"
        },
        {
            "id": "i47jm0n",
            "score": 1,
            "text": "Anyone else play mgs4? This feels like a permanent military salary more than real protection. We're heading to a bad world",
            "title_similarity": "0.43113106"
        },
        {
            "id": "i47jmxy",
            "score": 1,
            "text": "This is just pointless and could result in an incident. If anything it’s an escalation. Why would Russia invade a Nato country? That’s suicide",
            "title_similarity": "0.55169237"
        },
        {
            "id": "i47jx22",
            "score": 1,
            "text": "If NATO pushes plenty of snarling well armed troops up along the border with the Soviet Un... I mean Russia. Then that will help Ukraine as then the Soviet Un ... DAMMIT! I mean Russia will be compelled to put more of their troops to counter them.",
            "title_similarity": "0.8311852"
        },
        {
            "id": "i47k0rr",
            "score": 1,
            "text": "😬",
            "title_similarity": "-0.09277895"
        },
        {
            "id": "i47k2h2",
            "score": 1,
            "text": "don't see how it's relevant since Russia isn't gunning for NATO members.  until otherwise: purely symbolic.",
            "title_similarity": "0.52174926"
        },
        {
            "id": "i47k42z",
            "score": 1,
            "text": "Who is paying for it?",
            "title_similarity": "0.0074415915"
        },
        {
            "id": "i47k4n5",
            "score": 2,
            "text": "Get ready for war baby! No but seriously, get ready for war baby!",
            "title_similarity": "0.59953415"
        },
        {
            "id": "i47k9ja",
            "score": 1,
            "text": "Putin: the boarder is too close to my boarder. We must expand.",
            "title_similarity": "0.6076441"
        },
        {
            "id": "i47kf1i",
            "score": 1,
            "text": "WW3 LETS GET IT so which company is going to start building the Vaults? also would like the one without all of the government experiments.",
            "title_similarity": "0.5052096"
        },
        {
            "id": "i47km7w",
            "score": 1,
            "text": "Very smart move, the function of deployment is most likely the placement of a high value bargaining chip on the table for Ukraine in the Russia negotiations.\n\nIt’s an expensive decision to move and maintain the military infrastructure at the border when NATO isn’t going to be attacked, but the ability to move the troops away from the Russian’s borders is priceless as a trade during the negotiations.",
            "title_similarity": "0.66681737"
        },
        {
            "id": "i47l7fl",
            "score": 2,
            "text": "we already have something like this, right?",
            "title_similarity": "0.14972913"
        },
        {
            "id": "i47l913",
            "score": 2,
            "text": "So which military stocks should I buy.",
            "title_similarity": "0.4290924"
        },
        {
            "id": "i47ljuh",
            "score": 2,
            "text": "(hope it’s really for Ukraine fly free zone)",
            "title_similarity": "0.39407104"
        },
        {
            "id": "i47m8xa",
            "score": 1,
            "text": "Damn anyone seen Threads from 1984?",
            "title_similarity": "0.1432722"
        },
        {
            "id": "i47melc",
            "score": 2,
            "text": "that's what's known as calling a bully's bluff.\n\nlooks like pooptin's not the \"genius\" he (and his flunky proteges like trump) thinks he is after all.",
            "title_similarity": "0.2898707"
        },
        {
            "id": "i47mijx",
            "score": 1,
            "text": "Better cover the baltics and Finland while your at it",
            "title_similarity": "0.45272297"
        },
        {
            "id": "i47mnp2",
            "score": 4,
            "text": "The very thing Putin was shitting his bed over happened because of his own bullshit actions.",
            "title_similarity": "0.3649953"
        },
        {
            "id": "i47mwt0",
            "score": 2,
            "text": "I wouldn’t doubt this being said early for the sake of the new nato members. Basically a threat directly to Russia and honestly I hope they stick to it. Shoot down any interference from Russia and I doubt they’ll try this shit more.",
            "title_similarity": "0.74385726"
        },
        {
            "id": "i47n24i",
            "score": 2,
            "text": "NATO rolling up their sleeves and being like \"Alright this is what's going to happen\"",
            "title_similarity": "0.5565162"
        },
        {
            "id": "i47omjw",
            "score": 2,
            "text": "So to border nations , right? Not the actual border? Because that would really piss pooty off.",
            "title_similarity": "0.3461101"
        },
        {
            "id": "i47ovj3",
            "score": 2,
            "text": "It’s about time",
            "title_similarity": "0.06198035"
        },
        {
            "id": "i47p3a5",
            "score": 2,
            "text": "This is exactly what Russia Didn’t want",
            "title_similarity": "0.37594154"
        },
        {
            "id": "i47pl9u",
            "score": 2,
            "text": "The only good to come out of this war is the revelation how shit the Russian forces are. My guess is a large portion of their nukes probably can’t even fly.",
            "title_similarity": "0.49022338"
        },
        {
            "id": "i47qnp1",
            "score": 2,
            "text": "Great…now we are going to have a “demilitarized zone” in Europe akin to Korea. Because you know Russia is going to have to make a permanent force in response.",
            "title_similarity": "0.7566413"
        },
        {
            "id": "i47qrfs",
            "score": 3,
            "text": "I didn’t know that NATO was a physical place that shared a border with Russia.",
            "title_similarity": "0.5432025"
        },
        {
            "id": "i47rc4p",
            "score": 1,
            "text": "Just kiss already",
            "title_similarity": "0.12385373"
        },
        {
            "id": "i47rf4q",
            "score": 2,
            "text": "Bc that worked so well in the us....",
            "title_similarity": "0.17762026"
        },
        {
            "id": "i47rfhd",
            "score": 1,
            "text": "Talk about Russian miscalculation.",
            "title_similarity": "0.35820818"
        },
        {
            "id": "i47rpau",
            "score": 1,
            "text": "Spicy",
            "title_similarity": "-0.06962904"
        },
        {
            "id": "i47rwmt",
            "score": 2,
            "text": "Oh how the turns have tabled",
            "title_similarity": "0.08152303"
        },
        {
            "id": "i47s158",
            "score": 2,
            "text": "Good job Russia, talk about a self fulfilling prophecy.",
            "title_similarity": "0.49402523"
        },
        {
            "id": "i47s7yw",
            "score": 2,
            "text": "Sad that they have to do this but it's the smart thing to do. Russia has proven it cannot be trusted as long as Putler lives.",
            "title_similarity": "0.55330145"
        },
        {
            "id": "i47saai",
            "score": 2,
            "text": "Feel like this is the military version of the Streisand Effect.",
            "title_similarity": "0.44020018"
        },
        {
            "id": "i47sn7l",
            "score": 1,
            "text": "And we should take Belarus too just because we can.",
            "title_similarity": "0.5208682"
        },
        {
            "id": "i4892s3",
            "score": 3,
            "text": "Excellent!",
            "title_similarity": "-0.008393891"
        },
        {
            "id": "i48czuv",
            "score": 3,
            "text": "Excellent!!!",
            "title_similarity": "0.0017606933"
        },
        {
            "id": "i48ekhc",
            "score": 4,
            "text": "Why do I hear boss music?",
            "title_similarity": "0.260493"
        },
        {
            "id": "i48f97v",
            "score": 2,
            "text": "Putin and his allies will only frame this as a provocation. This will only serve to further solidify the agenda of the east and push them deeper into their belief that NATO is out to bury them.",
            "title_similarity": "0.64686775"
        },
        {
            "id": "i48g9oa",
            "score": 3,
            "text": "Fuck Russia",
            "title_similarity": "0.37104183"
        },
        {
            "id": "i48gq2q",
            "score": 2,
            "text": "Putin for president of r/LeopardsAteMyFace",
            "title_similarity": "0.496261"
        },
        {
            "id": "i48gs0m",
            "score": 1,
            "text": "NATO, North Atlantic Treaty Organization’s borders are 8 1/2 x 11 in either Courier New or Times New Roman.",
            "title_similarity": "0.42811593"
        },
        {
            "id": "i48jbhl",
            "score": 1,
            "text": "Ha yeah right.\n\nAfter they pretty much leave Ukraine to fend for themselves, I doubt it.",
            "title_similarity": "0.3677917"
        },
        {
            "id": "i48k4qp",
            "score": 1,
            "text": "Does the warsaw pact still exist, is it active? I was thinking about possible ramifications of this but realized it may not be a thing.",
            "title_similarity": "0.31971195"
        },
        {
            "id": "i48k9pe",
            "score": 3,
            "text": "After seeing all of the horrible videos of what the russians did to ukrainians, I have lost every ounce of respect and dignity to those who support the pro russian narrative. I think that this is not only needed, but encouraged as we need to come together and stop this from happening again.",
            "title_similarity": "0.5161108"
        },
        {
            "id": "i48m4iy",
            "score": 1,
            "text": "Yo Putin, we heard you like NATO watching your borders.\n\nSo we put a NATO in your NATO, so they can watch your borders while they watch your borders.",
            "title_similarity": "0.65008235"
        },
        {
            "id": "i48mz8x",
            "score": 3,
            "text": "Something BIG happening they not telling us",
            "title_similarity": "0.12546839"
        },
        {
            "id": "i48ptuo",
            "score": 2,
            "text": "Putin made a dingdong move.",
            "title_similarity": "0.3158632"
        },
        {
            "id": "i48ults",
            "score": 2,
            "text": "This shit and more Templars bullsh@t being going for past thousands of years.  New puppets just barking.",
            "title_similarity": "0.37333357"
        },
        {
            "id": "i48win8",
            "score": 3,
            "text": "Congratulations, Russia. You played yourself.  \n\nYou dumb sons a bitches.",
            "title_similarity": "0.37580103"
        },
        {
            "id": "i48xphb",
            "score": 1,
            "text": "Wild",
            "title_similarity": "0.0019303933"
        },
        {
            "id": "i48ycf4",
            "score": 1,
            "text": "Too little too late! Stop the madness! Stop the genocide!",
            "title_similarity": "0.3568465"
        },
        {
            "id": "i48zicb",
            "score": 1,
            "text": "Sounds great and all but this means war for decades to come.",
            "title_similarity": "0.54209787"
        },
        {
            "id": "i48zyu3",
            "score": 1,
            "text": "Sounds expensive and you would think they would want to give themselves room to maneuver for counter offenses . Which would require you to stay back from the border. Just look at the French they invested all that money in border defenses and they lost the war in six weeks",
            "title_similarity": "0.49973297"
        },
        {
            "id": "i494f0x",
            "score": 1,
            "text": "Stealing kids letting his troops molest poor innocent children is a pedophile…. Putin the pig probably is.. The world should take to the streets in every town in every country around the world on a certain date and march in protest with his face on signs that say child killer molester PUTIN THE PEDOPHILE…then watch what happens………….",
            "title_similarity": "0.4643422"
        },
        {
            "id": "i495stv",
            "score": 1,
            "text": "I have a really bad feeling about this. Not that it's not necessary. It is totally necessary. But they're late to the conflict and it's only going to heat up.",
            "title_similarity": "0.33515042"
        },
        {
            "id": "i4966od",
            "score": 2,
            "text": "Putin has fucked around abs I feel like he’s about to find out sooner rather than later",
            "title_similarity": "0.42255664"
        },
        {
            "id": "i497a1n",
            "score": 2,
            "text": "So instead of ensuring NATO didn't encroach closer to Russia, their silly invasion brought them right to their border. Well played, Putin. Well played.",
            "title_similarity": "0.6544177"
        },
        {
            "id": "i4989wv",
            "score": 1,
            "text": "Upvote for upvote.",
            "title_similarity": "0.14989428"
        },
        {
            "id": "i4990vl",
            "score": 1,
            "text": "Sounds great",
            "title_similarity": "-0.054526776"
        },
        {
            "id": "i49cs0i",
            "score": 2,
            "text": "Oh, these unintended consequences, hey Valad?",
            "title_similarity": "0.13097996"
        },
        {
            "id": "i49dnos",
            "score": 3,
            "text": "If there’s one thing I’ve learned watching Russia lately, it’s that NATO might be overkill....,",
            "title_similarity": "0.56869113"
        },
        {
            "id": "i49fa6w",
            "score": 5,
            "text": "They should put some old washing machines at the border to keep potential Russian invaders busy.",
            "title_similarity": "0.62780595"
        },
        {
            "id": "i49p2ce",
            "score": 1,
            "text": "Russia would never invade or think about NATO country anyway",
            "title_similarity": "0.4733979"
        },
        {
            "id": "i49tjl2",
            "score": 1,
            "text": "What does full scale mean ?",
            "title_similarity": "0.22400941"
        },
        {
            "id": "i49vwdp",
            "score": 3,
            "text": "Everything it’s working according to the plan, right Putin? Right Lavrov? From low military spending in the EU and poor military activity nearby the borders, low awareness and no aggressiveness to increasing military budget, high alert and higher chances that military from EU or NATO become more aggressive and less permissive. THE PLAN 😃",
            "title_similarity": "0.51203823"
        },
        {
            "id": "i4a5o2i",
            "score": 1,
            "text": "A little late",
            "title_similarity": "-0.104104325"
        },
        {
            "id": "i4a5s8e",
            "score": 1,
            "text": "They should just put the base 75 miles in land , so once the invasion starts they will run out of fuel and you can just attack all the vehicles left on the road.",
            "title_similarity": "0.55360866"
        },
        {
            "id": "i4a91d8",
            "score": 1,
            "text": "Very good, Poland asked about it long time ago 😎",
            "title_similarity": "0.2535376"
        },
        {
            "id": "i4bbmlg",
            "score": 2,
            "text": "All these „wholesome“ awards for news that basically confirm a new cold war are just disgusting. As well as people celebrating a new age of remilitarization and war-thirsty rhetoric. This isn’t wholesome news.",
            "title_similarity": "0.5078537"
        },
        {
            "id": "i4bm1m7",
            "score": 2,
            "text": "Wow.\n\nSo you are going to further antagonize Russia?\n\nThis is absurd, our government needs to be cleaned out.",
            "title_similarity": "0.55004966"
        },
        {
            "id": "i4bszgl",
            "score": 1,
            "text": "Oh hi world War, long time no see",
            "title_similarity": "0.25544065"
        },
        {
            "id": "i4bv1wf",
            "score": 2,
            "text": "Oh hi World War, long time no see",
            "title_similarity": "0.25544065"
        },
        {
            "id": "i4d0jf1",
            "score": 1,
            "text": "Its actually really smart. The troop build up along nato borders represent a real threat to the Belarusian and Russian troops in the region and so they need to be treated as such. If they are completely ignored and they call our bluff then they leave themselves wide open for a decisive invasion. If they dont call our bluff and they treat the build up as cause for concern then they have to divert legitimately important troops away from their war effort in order to sure up their defenses. We can split Russian forces without even invading essentially.",
            "title_similarity": "0.7364189"
        },
        {
            "id": "i4dozqq",
            "score": 1,
            "text": "Wil there even be a Russian army if they stay in Ukraine much longer? Today I was looking at casualty numbers and unit strength and effectiveness ratings for the Russians and it's not good. One comment in the report is by time comparison the Russians are losing troops at an equivalent rate as the British did during the Battle of the Somme in WW I. If any of you know your history of that war that battle was one of the major meat grinders.",
            "title_similarity": "0.52952987"
        },
        {
            "id": "i4ezbg9",
            "score": 1,
            "text": "What it does protect you from is when you're within the shockwave radius, as the shockwave will smash the windowglass and put it right through you.",
            "title_similarity": "0.3996718"
        },
        {
            "id": "i4kkzc6",
            "score": 1,
            "text": "This whole problem is that Russia still thinks of themselves in their former glory, they still define themselves as an equal party in opposition to the west. But their economic power in the world no longer matches that as a dominant super-power in the world. They are delusional and the cognitive dissonance is painful as reality is not what they want it to be.\n\nIf Russia just ate some humble pie and joined the west as a good faith ally then they would be welcomed and could rebuild their economy and both Russia and NATO countries could stop this military madness.\n\nBut Russia is like that sad pot-bellied old man who started a bar fight thinking he could relive his younger glory days and has now pulled out a gun because he got his ass whooped. Like you cannot have any respect for a madman like that, who so insists on a delusional worldview and will resort to violence if that worldview becomes threatened. And now he has cops outside the door and all the bar patrons have no idea if he is gonna give himself up or try to go down in a blaze of glory, taking them with him.",
            "title_similarity": "0.49549973"
        },
        {
            "id": "i4ks8r3",
            "score": 1,
            "text": "I may have read somewhere that after the end of the Cold War (maybe we should call it the ‘first Cold War’ now) it emerged that the Fulda Gap wasn’t actually that key to the the Warsaw Pacts original invasion plans. Until the point that it ended up with so many tank divisions and other NATO strength parked on it the Soviets couldn’t afford to leave it out of their plans and more.\n\nTLDR: the anticipation of a massive tank battle at the Fulda Gap might have ended up as a self fulfilling prophecy.",
            "title_similarity": "0.6264427"
        },
        {
            "id": "i4mhj1n",
            "score": 1,
            "text": "The baltic nations, Finland, Sweden and Poland, southern Europe around the Black sea.  These are all target's of Russia. I do not believe he will give up that easily.",
            "title_similarity": "0.610109"
        },
        {
            "id": "i4qxi6c",
            "score": 2,
            "text": "About time",
            "title_similarity": "0.024445876"
        },
        {
            "id": "i4rtanc",
            "score": 1,
            "text": "Ooooooh Poland!",
            "title_similarity": "0.1405553"
        }
    ]
}